[
    "I have 662 hours in valheim and an still dont get why this game is so incredibly cheap and insanely entertaining. This game can fully nuke your sleeping schedule though, *You have been warned*",
    "Phenomenal potential of a game, ruined by what has to be the slowest dev team of all time. 1 new biome in three years, with almost no real content in between is shameful for how great a start the dev team had.",
    "Iron Gate made millions, bought a horse and really embraced that one day a week work ethic. I think I've seen more mention of merchandise in their update blogs than actual content.",
    "Made millions of dollars on release, still has barely released any updates. GG Iron Gate.\nGood game just still to this day seriously lacking content in my opinion.\n\nlol, wrote this and posted it and decided to see what the \"mostly positive\" reviews were, saw quite a few negatives dabbled in there with exactly what I wrote, glad I'm not alone in thinking this.",
    "This was a great game but its disappointing that the Developers haven't been able to keep up with demand. It was released 3 years ago and aside from a few updates, one of which added a 5th Biome, essentially a new level, not much has happened. You would think that with all the revenue that the game has generated there were would be a steady flow of updates or even DLC. I'd happily pay for more content as the game was quite cheap in the first place. Its now been consigned to my list of completed games that I'm unlikely to play again. Shame, as I really enjoyed it.",
    "Good but needs more lore. Not much of a story and no end game",
    "Game's only content is Development Blogs\n\n\n\n\n\n\n\n\n\n\n\n\nwe don't talk about Hildir's quest, its just a fake cosmetic update",
    "As someone with zero intention of ever building a giant base and only limited interest in crafting mechanics, I'm glad to report that Valheim works great as a solo RPG about learning to live off the land, exploring unknown territory, uncovering mysteries, gearing up and facing ever tougher enemies.\n\nI never played the game at the peak of its popularity as I wanted to wait for it to develop further. Since it doesn't look like Valheim is ever leaving early access I decided to give it a go, and to my delight it seems a lot of work has been put into it. The game in its current state does not feel unfinished or janky at all. Looks beautiful, runs well, and I haven't encountered any bugs.\n\nRuns and plays well on Deck too.",
    "absolutely one of the best survival games, got addicted and moreee fun if you play with your friends, very challenging and sometimes got me stressed",
    "I just haven't been able to get into the game for three main reasons.\r\n\r\n1) It feels too much like I'm on rails. Go to a biome, make what you're expected to make there, and then go to the next.\r\n\r\n2) It's easy to manipulate the mechanics. It's more effective to build unrealistic designs than realistic ones. I can keep things out with ditches and earthen ramparts which they can't climb or destroy, then build a platform extending out over the enemy, like an Olympic diving platform, rather than building realistic walls to defend.\r\n\r\n3) Here's the big one: I feel lonely when I play it. As far as I can tell there are no other humans in the game. No villagers. It feels like I'm doing everything for myself alone with no one to appreciate or benefit from it, even if they're just NPCs.\r\n\r\nIt's fun at first to build things, but very quickly it starts to feel a bit like there's no purpose to any of it. Moving to new bases all the time just adds to that feeling like I haven't really accomplished anything other than advancing to the next level. I would prefer to build a village with NPCs in it and watch it grow and become more interesting, prosperous, efficient, etc.\r\n\r\nMaybe just me, though. A lot of people love the game and it has interesting artwork (from a distance). I like designing buildings and then sitting and watching the sunset, but after a furious few hours of building I start to wonder what it all was for. I don't like having to repair every building piece. I don't like the unrealistic way things assault your base, nor the unrealistic strategies most effective for defending them. I don't like the long nights that seem to come too quickly. Maybe I'm just not getting it. Who knows? I just know I want to like it, but every time I try it feels a bit pointless and unfulfilling.",
    "Really good game",
    "I liked building and exploring",
    "2 years now ? Something like that... Thousands of kids in their room modding the game... We love the game but start working, we are fed up with new decorativ windows every 3 months !",
    "Hundreds of millions of dollars from sales. 3 years since release. And barely anything to show for it.",
    "I tried... I really did... I did every single damn thing you could do to make this shit of a game fun. Installed mods playd with friends. Tried rebalancing it. Nothing works. Game is unbalanced, unfun, try to run for more than 10 seconds in order to die since you can't run anymore nor fight back against enemeis that the game throws at you at random. It is a constant grind, for a massive map you can't teleport with key resources like ores. Thus you get like a stack of it and then run back home (have the stamina problem in mind). You constantly have to grind (not in a fun way like in Terraria) but in a chore-like manner you have to dig a bit, fight with the same copied and pasted enemies and then after like 15 minutes of suffering you have to run abck game (stamina again). Game itself is like Avatar The Last Airbender - Overrated. I've lost 40 hours for this game by constantly coping about how it may be fun like other people say if I only get to another progression point. All I got was armor that slowed me down even more...",
    "Unfinished for over 3 years, check back in 2026.",
    "Great game with a lot to do but since the release of the game there's been only one major update in like 3 years which from a game that sold 12 mil copies is crazy so its a good game just not no new content or anything fun because the dev's are just siting around doing nothing.",
    "Good foundation, but the lack of care for the player-base is becoming appalling.\n\nThat being said, the game still has its high points. Pretty much everything is simple, but hard. This makes things like combat and building annoying at first, but they slowly become the best parts of the game. In addition, exploring any location in this game for the first time is magical. Not to mention, the visual style is breathtaking at some points, and the soundtrack slaps.\n\nIf you like open world games, there is definitely something here for you. Now on to what sucks.\n\nThe game has never had much content, but the fun foundation and mods were enough to keep a lot of people coming back. We are well past the point of absurdity on waiting for a SINGLE biome, though. While biomes can take real life days of consistent playing to get through, the majority of it is just grinding materials. I personally don't find the issue to be with the time spent running around and exploring the massive world. The real issue is that there has been NOTHING released to freshen up this grind. The trend from the devs seems to be that once it's released, it's not thought about again unless it's buggy. This happened between the game's launch and Mistlands, and is happening now as we wait for Ashlands. This is fine in a game with lots of content. However, this is a bare bones open world survival game, and the pathetically small release of Hildir's Quest, and a couple new small, mostly empty structures are the ONLY \"content\" updates we've gotten since Mistlands. In my experience, this makes mods a necessary part of the game for any play-through after your first.\n\nNow to put this on a timeline. For those unfamiliar, Mistlands came out Dec 6, 2022. As of writing this on Apr 16, 2024, it's been about 16.5 MONTHS since the last major content update, and just over 10 months since Hildir (June 2023). While posting about progress and doing these bug fixes (of mostly tiny, many years old bugs) is great, dangling the real new content over our heads for months at a time WITHOUT giving a development timeline or even a release date is irritating. This would be fine from most devs, but it's been almost a year and a half since the gameplay has seen a noteworthy change or addition. That's insanity from a dev team that sold 5 million copies in the first month of their game's release, and over 12 million as of Sep 2023. Instead, the devs did a YouTube mini series that is just about as vague as the patch notes and made a brand deal with a plushie company. This game is approaching an all-time low player count for a reason.\n\nWhile I hate to see this incredible game stagnate, it's been made clear that these devs now care more about trying to stay relevant through media and white truths rather than taking community feedback and making meaningful change to their product. It's gotten to the point where everyone I know that has played Valheim since Mistlands, despite having fun, actively recommends against it, myself included. So while the devs are enjoying their time in Bora Bora, I encourage anyone that's considering buying this game to not do so now. At the very least wait till #ashlands2026\n\nTL;DR- good foundation, but lacks substantial content outside of the grind. devs are taking too long to add to it and neglecting their community in the process. either move on or wait for Ashlands, these people do NOT deserve your money as of right now.",
    "The game is vast and visually amazing. If we were to base the score just on the details and design of the game, then we are looking at a 9/10 game. However, there are so many tediously annoying and lacking elements that I cannot recommend this game to any average player. \n\nThere are 4 quarters of your time in this game:\n1 quarter is preparing food, cutting wood, and building your base.\n1 quarter is exploring, finding the mines, material, and bosses.\n1 quarter is mining metals constantly due to the large amount of material you need.\n1 quarter is continuously running back and forth from home to your grave because you just can't stay alive.\n\nThe game has a serious issue with purposely making your experience a drag and longer when it doesn't need to be that way.\n\nYou spend so much time trying to get to places because your stamina is so draining and slow to re-gen. You can level up to help with stamina, but when you die, you lose your progress in a negative way. Majority of the deaths you experience in this game is due to stamina being out. \n\nList of tedious things in the game that need fixing:\nStamina re-gen (possibly add stamina re-gen to armor and increase it as gear gets better)\nVertical attacking is not a thing so enemies can hit while you can't hit them if they are a little above or below you.\nMistlands is a terrible region which exemplifies all the bad things in the game.\nEating food doesn't immediately increase your health even when you are rested. This may be because the developers want you to utilize potions which are time consuming to make and cost a lot in material.\nMobs constantly attack your base wasting your time even more because now you have shift your focus.\nMany of the boss abilities are lackluster and horrible to which you usually only use a mix of three boss abilities.\nSkills basically mean little to nothing in this game because you don't feel them. They are there, but the level up reward is minimal and non-explanatory. \n... The list goes on.\n\nPlay this game if you want a long aggravating experience. \nI can see this game becoming amazing when it fully releases, but there are a lot of things that need to be fixed at the end of the day.",
    "Game took to long to do anything.",
    "Addicted to building wood houses.",
    "good fun with friends",
    "great game",
    "Best survival game in midgard. Odin is watching you.",
    "minecraft vikings. Good game would recommened if you have no life",
    "I love playing Valheim but god the actual new content updates are so slow you're lucky to get 1 per year. Mods make up for it to an extent but they're always breaking with nearly every minor bugfix patch. If you happen to be really into the building aspect of survival games though then you should definitely get a few hundred hours from that side alone (It's that good) but if you're on the I don't care how it looks I just want stuff done side like I am then you will only get a good play-through or two out of it. Thumbs up from me for sure and I played it without friends so if you have those then definitely pick Valheim up.",
    "hehe tree go BONK",
    "really good",
    "A great open world game. The graphics might seem bad or not detailed enough but it really brings a lot into the environment. Very cheap compared to most other games and has basically infinite replayability. The game is also amazing with friends (if you have any) and even with multiple people brings a decent challenge for a less experienced gamer.",
    "Rating: ⭐⭐⭐⭐⭐\r\n\r\nAfter investing over 250 hours into Valheim, sailing through its tumultuous seas and treading its mythical lands, I can confidently say this game is a masterpiece tailored for the true spirit of cooperation and adventure. As someone who's delved deep into its co-op gameplay, here’s why Valheim stands out as a beacon of gaming excellence.\r\n\r\nThe World of Valheim: Immense and Intimidating, Yet Inviting\r\nValheim's procedurally generated world is a sprawling Nordic-inspired realm filled with dense forests, daunting mountains, and mysterious swamps, all beautifully rendered and teeming with life. Each biome not only challenges your survival skills but also rewards exploration and resourcefulness. The environmental details are stunning, making every in-game sunrise and storm an event to behold.\r\n\r\nCo-op Gameplay: Where Teamwork Truly Shines\r\nThe co-op aspect of Valheim is where the game truly excels. Teaming up with friends to build, craft, and explore brings about a sense of camaraderie that many games aspire to but few achieve. Whether you're constructing a fortress together or strategizing to take down one of the formidable bosses, there’s a shared sense of achievement and joy that is amplified in the company of others.\r\n\r\nCrafting and Building: A Rewarding Endeavor\r\nValheim offers an intricate crafting and building system that encourages creativity and strategic planning. Constructing everything from simple shelters to complex longhouses with your fellow Vikings is incredibly rewarding. The physics-based building system adds a layer of complexity and realism that requires you to think like a true Norse builder.\r\n\r\nCombat: Thrilling and Tactical\r\nThe combat system in Valheim is straightforward yet deep, with a focus on stamina management and tactical positioning. Fighting alongside your friends against the various creatures and bosses requires teamwork and can lead to intense and thrilling moments. The sense of danger is ever-present, making each victory a moment of triumph.\r\n\r\nContinuous Updates and Engaged Developers\r\nOne of the most appealing aspects of Valheim is the active involvement of its developers. Regular updates not only introduce new content and features but also refine existing mechanics. This engagement keeps the game fresh and exciting, making each return to the world a new adventure.\r\n\r\nIn Conclusion: A Must-Play for Any Co-op Enthusiast\r\nValheim is not just a game; it's a journey. It's about building bonds with your fellow players as much as it’s about building your base. The satisfaction of surviving and thriving in a world teeming with challenges and beauty is unmatched. For anyone who revels in co-op gameplay and Norse mythology, Valheim offers an epic saga that only gets better with time.\r\n\r\nSo, to my fellow gamers, grab your shields and join the voyage across Valheim's vast realms. The gods await your prowess, and so do the friends who stand by your side in battle.",
    "Rate this 9/11. Good game.",
    "It took me three tries to get into this game - it felt unnatural to me at first, but after I sat down and put about two to three hours into the game it immediately hooked me like basically no other game ever has. \r\n\r\nI am writing this 383 hours later, and I haven't even dove into playing the game with my friends yet (The absolute best part of the game according to most). It takes no space on your drive, it costs less than all AAA games, and I find it absolutely delightful.\r\n\r\nExploration is amazing - I genuinely love this world.\r\nNatural difficulty makes me *actually care* about preparing, about cooking, so I don't lose stats (Can be adjusted)\r\n\r\nThis game is definitely within my top ten games of all time now.",
    "great for having family bonding time together",
    "Good amount of fun and challenge. I really enjoy this game! Skol!",
    "Fabulous game and a must for every survival enthusiast. Beware that since it's release many other survival games have popped up which are much faster. Base game, umodded, is very slow compared to newer games.",
    "I absolutely love everything about this survival game. Valheim keeps you on your toes, keeps you busy, or you can just relax in a home you have built and watch the world go by.",
    "Viking norse mythology minecraft version",
    "Valheim is an excellent game with lots of potential. As of right now the progression system and route is there to make it to end game. The game is a lot more complicated and complex than first glance would let on. I think you should maybe work on the taming system as building massive stone cages is a little extra just to tame loxes. There is lots of nice small details like buried ships in the meadows and viking burials. The naturally generated structures are great to. The lore is excellent but I cant help but wonder where the people went who built in the meadows and dark forest. I know the swamp was a land filled with civilization before they sunk into the swamps themselves. Make some sort of rock like the ones that show you the boss location to find the traders please. Also there needs to be a command to locate the traders on the map just their icon",
    "this might be my favourite game of all time.\r\nwhen i bought it i played it solo and completely blind, i learnt as i went and honestly this was the best way to play and get fully immersed in the game.\r\nthe meadows biome is where you will start. the meadows does an amazing job of teaching you the basics of the game without being overly handholdy. you will build a base, kill some basic level enemies and animals to make food and starting armour and you will kill the first boss, eikthyr. i won't spoil anything further on but as you venture through the very very large procedurally generated map you will wander through a variety of biomes, each vastly different to the last. they all introduce new gameplay mechanics and allow you to get better gear for both your character and your base. the way you gather resources differs too based on which biome you are in which keeps it interesting. cooking in this game is a surprisingly fun mechanic and is essential to do in order to survive later biomes as the food buffs are super important (same with meads and wines for various buffs) each boss fight is unique and engaging whilst also being frustratingly difficult at times. the base building in this game is also the best out of any of the survival games/RPGs/MMOS i have played and i have lost many hours in this game by just simply building more stuff. solo play is fun and your triumphs feel rewarding however i feel this game thrives when played in multiplayer. my group built up a small village to call home and worked on it together to build it up and fortify our home. sailing together on voyages to new lands on the map is fun. i have also played this game online in the jotunheim community server (if you join, i'm wilfre) the multiplayer community aspect in this game is more engaging than solo play to me personally. \r\nthe combat in this game can be punishing when you're new but rewarding when you win a fight with the odds against you. the combat mechanics uses the barebones of the souls-like genre in that you want to dodge roll for immunity and perform perfect parries to stagger your opponents, it is much much easier than actual souls games however.\r\n\r\nthe only drawback i really have with this game is how infrequently content updates seem to come around, luckily the game in its current state feels very replayable.\r\n\r\nthis game is 100% worth the price and i am surprised it doesn't cost more. buy this game.",
    "It's like being in a cool Norse story! You're in this wild place with big trees and scary monsters.",
    "!",
    "This game is so oddly satisfying to play. On paper it should be just like any other survival/base-building/exploration game, with not thaaaat much content or diveristy. However, it *feeeeeels* different, somehow, I can't really explain it. It's great, though, even better with friends.",
    "graphics are objectively bad we all should agree on this. the art design overall is very well though. there will be many a times that you will think this game looks very good. \n\nmusic and immersion didn't hit me don't have much more to go on there.\n\nthere is basically skyrim leveling and you lose some everytime you die. this combined with the exploration aspect of the game which is no small thing in lower numbers makes this game almost impossible to progress for a 20-30 year old person. there are many things that you do which is basic chores such as not being able to bring the ores that you mined with the portal. you have to bring them by ship from god knows where. If you ever thought minecraft was unfair at some points as any sane person would you should stay very far away from this game. luckily dev let us manage settings such as; material gain 1x 2x etc. ores portable via portals, to make it playable in low numbers and for people with shallow dopamine reserves. \n\nthe combat is very clunky and not fun to me. \n\nthe optimization is surprisingly bad...\n\nthere are bugs as expected but they were not many in my experience. It should still be pointed as the game is punishing, what small bugs there is, is a big problem.\n\nthe building mechanics are unintuitive and buggy at times. comfort levels are not enjoyable to me. the requirement to build most stuff adjacent to most others is also very annoying. the giants and what not that can ruin your home is not enjoyable. so there are many problems with this game and to be frank I am sure it outweighs the pros but I still think the game is not that bad. when I played the game my friends left the game soon after and I started to play solo for a while and then I left it till I started playing with another friend. when I finally started to mine iron I realized how much of a grind fest this game was and I asked myself how long it would take to play this game with 5 people and no portal ore teleport. we would probably spend 100 hours just to get full iron set. That was basically an epiphany that made me very much less into the game. grind is not even rewarding so why would you? Don't get me wrong you do get stronger and you do feel it. but the mechanics are not refined enough to let you enjoy it. so I started building and faced many problems I listed above. Then I quit...\n\nThe ogre design and the first encounter, the search for copper and what-not. there were many things in the game where it was enjoyable. building a fortress-like wall around my house especially adjacent to water was also  very enjoyable to me. to people with the taste for survival the game would NEED to be long and slow to be enjoyable. so I get that this is a me problem. for all the flaws that this game has I can't bring myself to give a no.\n\nAND BELIEVE ME I WANT IT. inventory organization in this game is the worst in most craft games and building base with a weight limit is INFURIATING.",
    "yes",
    "we suck at this game",
    "I want achievements!",
    "much shegma",
    "ok",
    "Viking Butt sex ooga booga ax go brrrrr",
    "Had some trouble getting into it and even refunded to think about it. Gave it a second chance and well... 20+ hours in 3 days was the result :D.\n\nI've been playing vanilla and really enjoy it. Although the grind can be tedious some times it's worth getting into.",
    "Don't be fooled by the 70 hours reporting on my account, I've spent well over 500 hours (by sailing the high seas, heh heh) and I still haven't had enough. The game is incredibly fun whether you play solo or with friends, and I've probably spent hundreds of hours just building stuff because the mechanics are just that good.\n\nWhen it comes to making you feel like a true fantasy viking dropped into a wild, wild world, the game has struck gold. It perfectly recreates the atmosphere and vibe of a lonely group of nords in a massive, sprawling world fending for themselves with nothing but sticks and stones. The sailing mechanic is just chef's kiss. The physics and item interaction mechanics are very detailed and fun to tinker around with.\n\nFor an early access game to be this polished and feature rich is a breath of fresh air, and bugs are rare too. The progression system is well structured and difficulty scaling is well balanced. The UI can be a little clunky at times, as is typical of early access games, but I think the primary focus on making an actually good game first is more important than making minute QoL improvements. \n\nI was also able to import my original save files from before I bought the game without issue, huge W.",
    "Grindy as hell but also crazy fun.\n\nThe dev is now rich, and it's well deserved, but we sure feel like updates are a little slow, especially with how much community support there is. Mods for this game are insane. Insanely awesome!\n\nAnyway, the game starts pretty casual and gets progressively harder and more challenging in both combat and inventory management. Great balance of fun and tedium, and I mean that. The game can be tedious at times, but the chores of the game add a special something to the game that make accomplishments feel like accomplishments... unless of course, you cheat or play with game-breaking mods or play in passive mode.\n\nGet this.",
    "Grab a few friends and you got a nice little survival sandbox to mess around, 9/10 (I hate dying in the middle of the ocean).",
    "I have no idea why this game is so popular. It certainly isn't the innovative gameplay, which is basically Minecraft but worse.\n\nEver played one of those \"realistic\" Minecraft survival modpacks where the creator just substitutes grinding and tedious micro-management for good design and imaginative gameplay? That's exactly what this game is (even including the stupidly over the top shader effects which are there to disguise 3D models and textures that look like World of Warcraft about 20 years ago. Why is everything blurry in the distance? Am I supposed to be a short-sighted Viking?).\n\nNearly every part of the game is designed with the primary aim of being a timesink, even if it makes no sense at all. Here's one example of many. At the start your extremely limited inventory (welcome to inventory management hell) can carry enough weight of wood to build A WHOLE FKN HOUSE. Then a bit later you discover and mine metal ores. One single copper ore weighs 10. Your total max carry weight is 300. You can't even carry one stack of 30 ores without being completely naked. When you eventually get it back to your base and smelt it (very slowly of course) it now suddenly weighs 12 as an ingot. And then it takes 8 of those and 2 wood (total weight 100) to make a copper knife that weighs 0.3.\n\nWhy this nonsense? Because the game wants to force you to use a cart (pulled manually by you) to transport your ore and ingots over any distance (you also can't take them through portals for the same reason). Just another excuse for a timesink. And talking about metals, only in the Big Book Of Grindy Game Design does 2 copper ingots + 1 tin ingot (weight 36) = 1 bronze ingot (weight 12).\n\nWell maybe the combat is more fun? Nope. It's lifted straight from Minecraft. Shield block + melee weapon or kite around with a bow. The enemies have no intelligence at all and are only a real danger in large groups.\n\nThe overall challenge of this game is equivalent to watching paint dry. Dying of boredom is the only real obstacle to progression.\n\nSo if you like that type of game (and obviously some people do) then this is for you. Otherwise stay well clear, there are many far better survival games (including Minecraft itself) which might not have Vikings but do have a lot more interesting gameplay and fun.\n",
    "Nah, if you're looking for a game where the intended experience is to grind away at gathering resources to craft/upgrade your gear while dodging and weaving death left and right just to have the capability to fight on equal ground with the enemies where the consequences could entail losing everything, this is it. Most deaths after the first two biomes entail you having to put on whatever sub-optimal gear you have and make your way back to your corpse, by building another boat and wasting 20 mins traveling or hopefully you had the forethought or chance to have put down portals beforehand.\n\n  Making your way back to your corpse with the sub-optimal gear could likely result in a chain of deaths, as you try avoiding every enemy long enough to get back your gear. Your gear and food is EVERYTHING in this game, as skills mean little in comparison to gear and food which makes for a very strict progression. If you're very unlucky a death could set you back many many hours of progression or more figuratively \"to the stone-age\". I can't stand survival games with death penalties, as it not a survival mechanic, but a rogue-like mechanic for the purpose of artificially extending the perceived play-time.\n\n  I remember my 2nd playthrough I had just finished the snow mountain area (the farthest I have gotten so far) and was scouting a place along the plains for a good spot to put a base when a barely visible deathsquito (a plains enemy) flew over to my boat and one shot me while I was wearing the best gear and ate the best food I could get that was expected of you to bring into the plains your first time. Now, I died off the coast in an area at least 20-30 mins from my set spawn point away with no portal nearby and I wasn't just about to suck it up and grind away another boat and waste 20-30 mins to get back to my corpse where I could just as easily get one-shot by another deathsquito, so I said fu_k this game.\n\n  The devs released an early access game and their strategy of keeping the player-base engaged is to create a playerbase of masochists who don't mind having to waste an hour or two of their day just to reclaim their corpse or who just start over from the previous zone and grind up another set of gear/food. Or mind traveling for 30 mins around a long-winded/pointlessly massive (proc gen world) open world where islands have no relevant purpose if they don't contain the next boss you need to fight. Each world seed is so massive if you zoomed all the way out your player marker would be the size of a tiny ant, so hope you don't mind spending an close to a hour sailing the open seas because the next boss is at the other side of the world and if you have happen to die out at sea all that ways away with no nearby portal I think you're either going to uninstall or suck-it-up. The biggest negative of all is that the devs have barely released anything in 3yrs and are more concerned about shilling their merch shop that's even advertised at the game's main menu. Bottom-line be ready to tear your tee_h out in frustration.",
    "I'm turning my 5 stars into one star because of the lack of updates and content that's been released over the years and after all this money they made its so sad...",
    "ok disregard the negative review for a second. this game is to me, s class. the game play loops and environments really hit all the buttons, its a little jank at times but being straight up vikings sailing to a new land to become stronger and bring hauls back to our giant hall is really fun, setting up tiny shacks then and grand hall, lastly a dope castle cant beat it. honestly its been a game ive been watching like a hawk desperately awaiting ash lands to hop back in.\n\nthe reason im giving it a bad review is the insane gape between updates. there is no reason ash lands to take this long to release. if they don't drop an absolute megaton of new content in other than new floor design 4 they're misusing their funds.",
    "i get to be an angry little norseman with a big sword",
    "Carrot",
    "I somehow managed to turn this game into a building  + wolf breeding simulator. \nEvery wolf I own has their own name and is given lots of pets <3",
    "great game with more potential but sadly even red dead online gets more updates than this game, this ship seems abandoned for some odd reason.",
    "One of my favorite games ever. I fell in love the moment I realized you could build circular structures. That is so unique and incredible to me, I've never seen that in another game. (I'm sure there are games out there). The leveling system is awesome (jumping gives you jumping xp). I prefer that over overall xp leveling systems. As far as a Viking game goes, sailing is a big part of the theme, however the sailing mechanics are a little silly don't change it cause its kinda sweet that its different, but coming from sea of thieves, this game has almost clunky sailing mechanics, it definitely took some getting use to. going from sticks and rocks, to flint, to bronze, to steel, etc. is so well done. It doesn't make me dread starting a new character or even a new server with buddies. I like that its cross-play, games that are not utilizing that are shooting themselves in the foot, I think. This game has potential for role-playing servers, on top of all out PVP servers, i would love to see a dedicated PVP server with clan v clan style combat. make it so trolls can be tamed and used as sentinels or something crazy. Id be curious to see if the creators would be open to creating a community server for holiday events etc. house parties, or special boss raids or something. 400 hours into this game, looking forward to the next 400 more. Skal!",
    "3D Viking Terraria. It's kinda awesome.",
    "Nobody's gonna read my comment so i'll just say ...see more",
    "This game is lots of fun, I highly recommend it. My wife keeps making me go on adventures but I just want to stay safe in the meadows. Don't leave the meadows. It's dangerous out there...",
    "1 major update over a 3 year period. what a joke!!",
    "It can be a really chill, sit back in your chair kinda game and at other times its all in your face. I mean the troll dong",
    "It's like 3D terraria but with shirtless Men",
    "It's aight.",
    "Initially, I was poised to dislike this game, even going so far as to actively try to find fault with it. Yet, to my surprise and delight, I've found myself utterly enamored with it! My journey with this game began early on when I made the decision to purchase it, only to quickly request a refund as it failed to capture my interest. However, after witnessing an influx of glowing reviews, I felt compelled to give it another chance. And oh, how glad I am that I did! Since repurchasing the game, it has become an all-consuming passion. From the moment I acquired it again on Thursday, March 27th, I've been completely engrossed, devoting a staggering 60 hours to its exploration and enjoyment.",
    "It's literally one of the best games. Period.",
    "One of those rare games that seems to be infinitely re-playable. It's extremely satisfying from a creative perspective and amazing either solo or with friends. The pacing is extremely well done in terms of the overall game loop. There are a few minor annoyances in terms of inventory management, but those are also aspects that create little mini puzzles to solve during chaos which can lead to extremely memorable moments. Can go from extremely calm and serene to absolute mayhem in the blink of the eye. Do yourself a favor and grab a copy with your best friend and you will likely get lost for dozens of hours as you progress and discover this charming world.",
    "Can't wait for crack to be introduced to the low income greyling spawners",
    "It's viking Minecraft only Minecraft received more regular updates.\n\nIt's a decent game but the loop is extremely boring, it's a super long grind to get absolutely anywhere unless you're playing with friends and some of the zones just like to fry computers whether it be the blizzards in mountain biomes or any storm in the Mistlands.  \n\nThe only thing that kept me coming back was the building system but since there are no NPC's or anything else in the world it just ends up being a pretty ghost-town.\n\nUnless you've had the thought \"I'd love to waste 4 hours after work accomplishing nothing\" in a game, I'd spend your money elsewhere.",
    "I like.",
    "Spent 30 minutes walking to a mining spot in the peaks just to have a your being hunted pop up on my screen and then a pack of 30 wolfs kill me with nothing i can do. That is hands down the laziest design i have ever seen i my life and completely killed this game for me. How could you do that to a player? Makes no sense",
    "I'd only really recommend if you have one or more friends to play with, otherwise it'd feel like a slog. Also be sure to mess around with the world modifiers as even with the most lenient options for teleportation my hours in the game are going on 200. The game also has a lot of faults but fortunately just about every one of those has a mod on nexus that fixes it.",
    "Epic",
    "How does a game that's meant to look retro perform so poorly? It's a genuine accomplishment just how poorly optimised this game is",
    "Good content yet the slowest dev team i've ever seen.  10,000,000 copies at 19.99, barely any money went back into development and it shows. The content that is in game is good, though definitely incomplete, and I'm sure this game will be great in 2099 when there is another biome added after the ashlands. Probably dont buy this until at least the ashlands update hits.",
    "the raft mechanics made me throw my pc out the window",
    "I kind of like Valheim. I love the concept, but sometimes playing this game feels like putting firecrackers up your ass, and dragging your balls across broken shards of glass for hours upon hours. This game can become extremely tedious, especially on vanilla settings. The vanilla settings are absolutely horrible, but good if you want a bad experience. The game lacks quality of life features big time. I don't understand how this game can have so many positive reviews, and I will explain why.\n\nThere are so many small little annoying things in this game that doesn't seem too difficult to fix. For example that it is impossible to hit enemies that are slightly bellow you or higher up than you on the ground, whilst those enemies can hit your big puff sized hitbox from any angle. The spear hits above enemies 50% of the time. causing you to miss your attacks. There is no inventory slot for your gear, so you have to have all your armor in what is already from before a tiny little inventory.\n\nThis in combination with a max carry weight of only 450kg (which is nothing in this game.) You constantly have to throw away items from your inventory when you are out and exploring. If you die in some difficult biome you will sometimes have to use cheat commands to retrieve your gear, because the monsters who killed you stay on your body. Occasionally the game will randomly crash and you will lose a bunch of progress because the world only saves once every 30 minutes, unless you manually press the save button yourself.\n\nInstead of fixing these issues the developers came out with a new biome update (that took 3 years by the way) called mistlands. This biome looks cool and all, but really it is the worst biome in the game because there are tall mountains everywhere, and zero visibility because of the mist. You have to keep in mind that there is a stamina system in the game that severely limits your character in every way. After a little bit of running and jumping you are left with zero stamina, even with the best food and stamina boosting effects.\n\nWhen you have zero stamina you have to wait multiple seconds to recover all your stamina again. In the meantime you can't really do much except walk. The mistlands biome is a severe pain and impossible to traverse without running and jumping because of all the hills and mountains. You run and jump, wait 5 seconds, then run and jump again. Over and over. Then all of the sudden a bunch of high hitting enemies will come out of the mist and practically one shot you, hitting through your shield somehow.\n\nAs I said earlier this game can be quite tedious. At least 50% of my hours in this game is spent on mundane traveling. 30% of my hours are spent on mining rocks that take forever to destroy. Traveling with a boat from one island to another island (depending on your destination) can take around 15 minutes. You sit there on your boat and just look at the screen for those 15 minutes. It's like watching paint dry. But at the very least you can set up portals around the world after you arrive to your destination.\n\nRemember to check the \"travel through portal with ore\" setting in your world modifier, or else you will be in for the most extreme boredom of your life, where you have to manually travel back to your base by foot / boat, which can take half an hour or longer. This is the vanilla setting for whatever reason, that I as a beginner did not immediately realize, which almost made me quit the game completely in the beginning. When the game first was launched this wasn't even a feature, but luckily they fixed that.\n\nThe fun parts of the game consists of exploring the world's different biomes for the first time. You have different dungeons, caves, crypts etc. I have always liked the idea of leveling up your character and becoming stronger. I do like acquiring a new weapon or a armor set, but it just takes way too long. Visually Valheim is very beautiful, the music is amazing, but there are a bunch of problems in this game that are not considered problems, but instead labeled as features. I don't want to have to download third party mods in order to have fun playing Valheim.\n\nThe community consists of a lot of cultists that don't want to acknowledge that there are any problems at all. All valid criticism of the game is brushed off as \"get better\" or \"be more creative.\" The stamina system is considered realistic. Well, is fighting trolls and dragons also realistic? I also have a feeling that the developers of Valheim purposefully drag out and artificially extend their game to make up for the lack of content. For example an iron sword costs 20 iron to make, whilst a silver sword costs 40 silver to make, for no reason at all.\n\nWhich again, it takes forever to acquire those pieces of iron and silver. There are a bunch of weapons that you don't really get to try out unless you want to spend literally hundreds of hours pressing mouse 1 on a rock all day, every day. I want to see these problems being fixed so that I can post a positive review instead of a negative one. Not that it even matters. I very much like challenging games, but there is a difference between a game that is challenging and a game that is just flat out tedious. I don't think the developers play their own game.",
    "been four years and still stale content.  sad.  this game has a lot of potential.  modders are working harder than this indie studio",
    "Good game held back by devs that are unironically lazier than mojang devs",
    "too much grind",
    "Dev's living the life on that early access success and working part time on content it seems.",
    "I played and played trying to like the game but I don't think I'm the target market. It always ended up feeling more like work than fun. The combat was sluggish, the dungeons were tedious, accessing the world is a hassle without changing the server settings, and the death runs got tiresome. \n\nOne of the most confusing parts ot the game is the comparative power of the enemies. For example, in the Dark Forest I was able to use my shield to block and stagger huge trolls then cut them down while they were stunned. However, a single regular wolf from the mountain region would smash right through my shield. stagger me, and then kill me while I was stunned. Obviously, plenty of people like the game. It's just not for me, I guess.",
    "no updates",
    "I sadly just cannot recommend this game. I've spent very long hours on a cracked version, then decided to buy it since I kinda liked how it played.\n\nUpdates for the game are scarce, the developer sadly ignores features that his community repeatedly requests even though hearing the community voice is the whole point of Early Access.\n\nFurthermore, the game has a huge grind problem. If you decide to play you WILL spend most of your time chopping trees, mining rocks and ore, or travelling  (because you cannot use in-game portals to transport ore and instead have to spent extreme amounts of time 1. Transporting it to your base 2. Transporting your base(s) to where you find ore. Both very suboptimal.\n\nModding community in the game is crippled from what I've seen and there haven't been any big scale mods in the game for quite a while now.\n\nJust follow the game's steam page, watch some let's plays, maybe try out a demo of the game (cs.rin) and then you might want to consider buying the game (if you like it).",
    "Addictive... but also frustrating.\r\n\r\nStarting from a lowly peasant with naught but your nearly naked body you need to gather tools, resources, and food to fight your way past big baddies.\r\n\r\nThat's pretty much it!!! This can be a lot more fun than it sounds. Crafting is great fun. There's few things more satisfying than finally picking up a new material and making yourself a great new piece of armor or amazing weapon.\r\n\r\nThe building elements are basic but that's ok - you just need to make a sheltered bed wherever you go to create a new spawn point after all so you don't need to hoof it all the way from the starting point to wherever you last got slaughtered.\r\n\r\nSidebar - you will die - a LOT. The game is quite unforgiving and will regularly pit you against enemies that vastly outnumber you and will absolutely decimate you if you're not decked out in the proper gear.\r\n\r\nThis brings me to my most hated aspect of this game - respawns. When you die, you lose EVERYTHING. You can recover it by getting back to your death spot which is signified by a marker but often times if you were killed by a particularly vicious enemy or even just a horde of smaller enemies, they'll still be there when you go back. Also, when you pick up your dropped goods, you DO NOT automatically put your gear on (which takes time btw). I find myself dying over and over and over again in dungeons where there are hordes of enemies (enemy spawners suck, I do NOT like them as a feature TBH) and this gets extremely irritating when I just run in, grab my goods, then get slaughtered... AGAIN. Doing the same thing over and over without making any progress whatsoever is tedious and frustrating to say the least.\r\n\r\nAll this being said, the game has potential. Just beware that combat is fast paced and you will absolutely get trounced if you're not prepared.",
    "Great overall game. I got sucked in very quickly and have had a difficult time putting it down since. If you like survival games with equipment upgrading, resource-collecting, building-depth and RPG elements, you'll find this game a home run!",
    "Play this game alone or with friends.",
    "LOVE this game!",
    "It's an oddly slow paced and grindy game until you manage to complete a biome. When you move onto the next biome, the difficulty spike is absolutely jarring. Biomes are difficult to find as well since they're all so far away from each other. The base building aspect is quite nice though, you can really feel like a Viking. But unfortunately the game's pacing is just not for me.",
    "Deer hunting simulator",
    "Lovely visuals and relaxed survival mechanics with a balance of building and exploration. Comfort pixels.",
    "meh\nstart in one biome, grind gear to max, struggle into next biome, grind new gear to max, struggle into next biome.. yawn.\nput on top no new significant content or renewing changes to adjust the above issue. devs zzz",
    "One of the early access slop games of all time.",
    "Early Access for 3.5 YEARS....",
    "Это хуйня, а не игра",
    "Maybe I've missed what is so special, but it feels bland in so many ways that I had to start adding mods for more enjoyment.  After 20 hours I still couldn't find myself immersed or finding much satisfaction like I do with other survival games.  The later zones may have more monsters, but after killing the first 2 zone bosses it was a dull experience and I didn't regain any excitement to push farther.  Future updates, which don't seem to be planned, may draw me back.",
    "FOR EVERY LIKE THIS REVIEW GETS, I EAT ONE SPOON OF MAYONNAISE.",
    "boring",
    "Good concept, but janky at the best of times. Building anything is an exercise in patience. Development is glacially slow.",
    "You will probably not like this unless you're a very good player, much less if you're a bad one like me. You will spend hours of preparation to fight a boss or retrieve your equipment only to die in under 10 seconds. There would be a slight chance of success in these situations, if it wasn't for the fact you get swarmed by 10 or more enemies that each take half of your health in one hit. The way saving works isn't clear, at first it seems like you can save before you try something difficult, but it actually saves as soon as you die. It's also unpredictable what loading a backup save will do. so I almost had all of my best gear deleted and had my world completely reset before I loaded a backup.",
    "Amazing base for a game that the developers haven't utilised in my opinion, once they got their money.  Not much content added and I think they'll abandon it eventually or call it \"done\" when they don't feel like doing more.",
    "From I HAVE ARRIVED to YOU DIED in minutes",
    "It actually feels like the devs have never once played this game, yes the combat and survival aspects are fun however it is also one of the most unforgiving games i have ever played. If you make one TINY mistake you WILL die because all the enemies are way stronger than you and require insane micro management of your stamina bar to kill. And once you are killed depending on your situation it can take literal hours just to get your stuff back then immediately die again just to do the whole process again. i hate this game sm (maybe im just ass)",
    "They already made most of the money they are going to make; why would they work hard to bring out updates quicker?",
    "THREE years, still EA",
    "She val on my heim until I viking.",
    "I highly recommend to adjust the default settings. The game by default is unnecessarily frustrating to play but if you can teleport your iron and dont loose all you equipment on death it is fun to play.",
    "vikimng",
    "Sure, I may have threatened to uninstall the game when Moder was killing me in an endless loop while trying to get my gear back...but I didn't reealllyy mean it..",
    "Let's get one thing straight. This game is incredible. Even with it's clunky UI (made much better with mod support) and terrible multiplayer support, I've never been so engrossed in an open world survival game. This truly is inspiring to every indie studio out there on what true vision for a game can get you.\n\nHowever.\n\nValheim has sold over 12 million copies at the time of this review.\n\nLet's assume they sold those at an average of $15 each.\n\nThat's about $180,000,000.\n\nLet's also assume that Valve and Coffee Stain (the publisher) take roughly half.\n\nThat still leaves them with $90 million dollars. (I understand this is complete conjecture and not all substantiated but I'm upset so let me do this)\n\n$90,000,000 for a team of somewhere between 11-50 employees according to their linkedin page is an unimaginable number. Reminder that they also started with 5 employees.\n\nI'm left here wondering... where did all that money go? Because the game is obviously not finished. There are so many things left incomplete and broken. I can't tell you how many times I've restarted this game only to find that there is still the same amount of content and fixes that there was a year ago. Even their new \"updates\" come out broken and unplayable. I've resorted to playing the game with the many many mods available to fix and add to the game where the developers seemingly cannot.\n\nIt is astounding to me how something can be in early access for so long and have so little to show for it.\n\nSo please, Iron Gate, after you've had your well deserved post release break, I would expect at least some marginal progress towards a 1.0 launch.\n\nThanks for no micro transactions though.",
    "I think I’ve been so engrossed with Valheim and its development over the last three years that I’d forgotten to write a review to comprise my thoughts on just how good this game is. What is pleasing to see is that so many people have written great reviews for this, which makes it a bit harder for me to know where to start with mine. \n\nAs a captivating survival game, it probably sits at the very top of all great survival games. For starters, the procedurally generated lo-fi purgatory, inspired by Norse mythology, is beautifully rendered. From dense forests to snow-topped mountains, you have a plethora of biomes to explore. The landscapes offer a sense of discovery and danger, where players start as humble Vikings tasked with gathering resources, crafting tools and constructing shelters to survive the harsh wilderness. Fast forward hours and hours, you’ll be delving deep into home raids, magic encounters and ancient relics. \n\nI love the sense of progression through biomes and technology, the ability to pickup and sail wherever the wind may take you, and naturally getting yourself into all sorts of trouble, whether it be a lone journey or a camaraderie-fuelled experience. Hitting over three hundred hours on this game has been effortless, and had it not been for me playing a variety of games routinely, I’d easily sink [i]thousands[/i] into this. It’s that good. \n\nOne of the easiest modern-day recommendations, and the price point is a steal.",
    "Wet 2:00 \nCold \nYou could have another bite \nStation needs a roof \nStation needs a roof \nStation needs a roof",
    "I have 662 hours in valheim and an still dont get why this game is so incredibly cheap and insanely entertaining. This game can fully nuke your sleeping schedule though, *You have been warned*",
    "Pretty cool and one of a kind survival game, but after a 3 year break I came back to find that there was only 1 new biome and a couple new bad guys added to the game.  The development speed has been painstakingly slow, even for an indie studio.  I'll try again in 2030 I guess.",
    "For those who have a tendency to addiction, this game is contraindicated. It's a real drug, i immersed into the game like a little schoolboy. Amazing visual, great ambience, giant open world that you want to explore and, of course, construction. All these factors make time to go by unnoticeably.\n\n★★★★★\n",
    "It's one of those games that you wish you could play for the first time again.",
    "The bees love me",
    "This is so easy. \nYeah, this is the best survival game i have ever played. Easily. \nI just finished a solo playthrough with a new character. Now, with the modifiers, i can finally stop worrying about the raids (which are fun in multiplayer, but i did not want to worry about during this play) and do whatever i liked. I also lowered the death penalty a bit for even more chill (i think 5% loss is a bit much). Everything else was normal.\nThe feeling of venturing into a new biome, or just sailing out in the sea... this game recreated my best minecraft experiennces i have ever had and in a few cases went even over that. \nAnd it is even  better with friends!",
    "[b]Rating:[/b] ★★★★☆ - Great\n[b]Time Played:[/b] 29 hours (Meadows & Black Forest Completed)\n[b]Difficulty:[/b] Normal\n\n[b]Gameplay:[/b]\n\t- Engagingly brutal survival mechanics keep you constantly on your toes, from gathering resources to building small Viking towns.\n\t- Seamless integration of exploration and combat, with each procedurally generated biome offering unique challenges and rewards.\n\t- Co-op multiplayer is almost mandatory and adds a whole new layer of enjoyment, fostering camaraderie and epic adventures with friends.\n\n[b]Story\\Dialogue:[/b]\n\t- No traditional narrative, the lore-rich world and environmental storytelling immerse you in Norse mythology.\n\t- Minimal dialogue emphasizes the game's focus on progression, exploration and player-driven experiences, allowing your journey to unfold organically.\n\n[b]Graphics:[/b]\n\t- Surprisingly charming low-poly visuals blend seamlessly with the game's atmospheric lighting and environmental effects.\n\t- Despite its simplicity, Valheim's art style effectively conveys the game's immersive Nordic setting, evoking a sense of every frame a painting.\n\n[b]Before you Play:[/b]\n\t- Recommend playing this game with friends where possible.\n\t- Use a guide to progress otherwise can quickly find yourself aimless and bored. \n[url=https://www.ign.com/wikis/valheim/Progression_Guide] IGN Progression Guide [/url]\n\t- Look around for Map Seeds suited to what you're looking for (eg. Optimisation, Beauty, House Building, Dungeon, Bosses). A mix of all I would recommend is seed: lE0bxYKtaR\n\t- Character you create and migrate across multiple different campaigns so you don't have to restart progression.\n\t- Meat focuses on Health (Combat focused), Berries focus on Stamina (Exploration\\Mining focused).\n\t- Different weapons will be better for different enemies.",
    "Make bank.  Scrap roadmap.  3 years later, still hearing about the updates that were planned for release on the first year alone.",
    "This is not a game, this is a otherworldly journey.\n\nBring friends for extra enjoyment. \n\nDon't spoil yourself anything just experience it.\n\nSo many times while playing I wished to be just there. Right there.",
    "Valheim is certainly one of the open world survival crafting games of all time.\n\nOverall, I like Valheim. I played through it up to the end of the current content with two friends of mine, and we created a good number of memories doing so. We've agreed to come back for the next major update, having ended on a rather good note.\n\nOf the things I like about the game, I'm rather impressed with the scale of the world and the variety of encounters to be found. The procedural generation of lands and dungeons lends itself well to emergent experiences, and while there were some disappointments to be had as a result of the system, the successes are left echoing in my mind far stronger than the failures. Some high points specifically were complex adventures to retrieve lost items which forced innovative or just desperate strategies, The current last boss is by far and away the best of the selection in the game, with varied threats yet appropriate measures to combat them. Interesting gear with special effects near the end was a delight to discover. Some enemies are absolutely terrifying and a thrill to encounter.\n\nThere are a few things I can criticize. The number of items to be discovered is somewhat low, and the realistic amount of solid \"content\" to be found is on the low side. This leads into by far my biggest sense of distaste for the game: the grind. To be perfectly honest, the amount of engagement to be found in Valheim is likely in the 20-30 hour range, but it's stretched to far longer by the level of material grind required at sections of the game, and most of our sessions were centered around resolving this. The fast travel system, a series of interconnected portals built and linked by the player, is a good one, but prohibits transportation of many materials - primarily metal - that are required to progress the game. This means the game's exceptionally lengthy sailing times are necessary not just for exploration, but the repeated shipping of materials for processing. Combined with an inane level of these materials - especially iron - required, the length of the game is artificially inflated as much as 5 times, and is the only real reason my hours are left above 100 at the end of the playthrough.\n\nLargely for this reason, I would [i]never[/i] play Valheim alone. Were I not alongside friends to elevate the experience, this time sink would have left such a sour taste in my mouth that the game would never have been able to redeem itself in my mind.\n\nI leave Valheim, for the time being, with a positive impression, yet the dangerously low amount of engaging content sets a tone that prevents me from really calling it \"great\".",
    "I had no idea about anything about this game when I first started. I heard about it on a dating app and figured I'd try it out for some brownie points with a match. Maybe it was the unknown factor paired with the exploration, but this is probably one of my most played games ever. I love it.\r\n\r\nNo love stories with my match, but I'm glad I found this game as a result.",
    "Phenomenal potential of a game, ruined by what has to be the slowest dev team of all time. 1 new biome in three years, with almost no real content in between is shameful for how great a start the dev team had.",
    "The concept and the game is amazing, the graphics is amazing. it is like a mix of ARK and Minecraft feeling. and somewhat a Rust feeling to. its a lot in the game is really interesting and i had my share good times in the game. \n\nMe personally feel that i was done with the game after the first playthrough. give the game a shot it was really fun playing with friends. but i died A LOT might just be skill issue tho xD \n\nmy rating of Valheim 7.4/10 game",
    "1 major update in 3 years",
    "Iron Gate made millions, bought a horse and really embraced that one day a week work ethic. I think I've seen more mention of merchandise in their update blogs than actual content.",
    "Made millions of dollars on release, still has barely released any updates. GG Iron Gate.\nGood game just still to this day seriously lacking content in my opinion.\n\nlol, wrote this and posted it and decided to see what the \"mostly positive\" reviews were, saw quite a few negatives dabbled in there with exactly what I wrote, glad I'm not alone in thinking this.",
    "Serene as all heck. I'm pretty sure I've barely scratched the surface, but everything I've experienced so far has been a beautiful surprise. People who aren't exactly into survival games might even like this because it's so peaceful. You could even probably choose to stay at the starter area and just use this game as a cozy sim. Can't wait to start wrecking trolls and minotaurs though.\r\n\r\nBasically Enshrouded before Enshrouded was born. Just a little more grindy and lacks the QOL features that Enshrouded has. 9/10.",
    "Hands down my favorite survival game I've ever played and one of my top three of all time, i cant wait to watch this game progress.\n",
    "This was a great game but its disappointing that the Developers haven't been able to keep up with demand. It was released 3 years ago and aside from a few updates, one of which added a 5th Biome, essentially a new level, not much has happened. You would think that with all the revenue that the game has generated there were would be a steady flow of updates or even DLC. I'd happily pay for more content as the game was quite cheap in the first place. Its now been consigned to my list of completed games that I'm unlikely to play again. Shame, as I really enjoyed it.",
    "---{ Graphics }---\n☐ Ultra Realistic\n☐ Beautiful\n☑ Good\n☑ Decent\n☐ Bad\n☐ 2D pixel\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☑ Old Aged\n☐ Everyone\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich\n☐ Ask NASA if they have a spare computer\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Isn't necessary to progress\n☑ Average grind level\n☑ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☑ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Dark Souls\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☑ If it's on sale\n☑ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ Its a freaking infestation\n\n---{Rating}---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10\n☐ THE GOAT",
    "Good but needs more lore. Not much of a story and no end game",
    "Potentially amazing game with hours of fun, ruined by lack of updates and terrible optimisation.",
    "Game's only content is Development Blogs\n\n\n\n\n\n\n\n\n\n\n\n\nwe don't talk about Hildir's quest, its just a fake cosmetic update",
    "Is pretty nice. Works well on my cardboard box of a laptop too lol. And playable offline!!! Absolute steal. just be prepared if you dont have friends and you start building crazy stuff. I got a mega base and a mead hall built...then i remembered that im going to be the only one sitting at the table...eating the food...Toasting! To a hard day of adventuring...yep...im content tho",
    "Development speed of this game is a joke, after 3 years still in EA. Extremly slow update progress, even with a team of just 8 - 10 people you should be \"way way\" faster than this...\nThe leads took their money after selling 12 million copies and ran away, probably only 2 - 3 people are working on this now, if it all, that's just unbelievable...\nThe game is good, the team/devs and especially the CEO is not.",
    "As someone with zero intention of ever building a giant base and only limited interest in crafting mechanics, I'm glad to report that Valheim works great as a solo RPG about learning to live off the land, exploring unknown territory, uncovering mysteries, gearing up and facing ever tougher enemies.\n\nI never played the game at the peak of its popularity as I wanted to wait for it to develop further. Since it doesn't look like Valheim is ever leaving early access I decided to give it a go, and to my delight it seems a lot of work has been put into it. The game in its current state does not feel unfinished or janky at all. Looks beautiful, runs well, and I haven't encountered any bugs.\n\nRuns and plays well on Deck too.",
    "absolutely one of the best survival games, got addicted and moreee fun if you play with your friends, very challenging and sometimes got me stressed",
    "Love the game \nIm Sorry already for giving it a bad review but, at this point i cant wait anymore.\n\nYall taking too dam long to realease a few updates or big ones , the game is slowly dying because there no new content.\n\nIm tired of apologizes im not looking for one , finish your dam game.",
    "A pretty cool survival game that had amazing potential but fell into the pile of a lot of Early access games never finished. The devs for a good amount of time did little to no communication with that changing as outcry became larger. Now we're given dev logs that don't really tell us much about what's next and leaves most as broad as possible. Back in 2021 even 2022 if you had asked me if this is worth picking up, I'd say yes because what is in the game can be an extremely enjoyable experience despite a lot of systems remaining basic or staying surface level with no real evolution. Progression is probably this game's worst aspect now as the further towards the end game you get, the less gear holds an impact. Multiple armor sets and different gear options are basically useless/wastes of time vs the main ore sets. There are more games out there that saw this formula and are more committed to active development. I recommend you go after those unless you're looking for a one and done experience.\n\nAnd a huge sin in these survival games is to add a unfinished biome that when updated, doesn't add the content if already generated and leaves people needing to restart the world. This was a really good time and it's sad to see how they devs treated their success. Everyone was playing this and now its just another game passing in the wind through dev choices.",
    "The game has a lot of positives going for it. It is definitely fun to play overall, until you get to the Mistlands. At this point, the poor fighting, swimming, and climbing mechanics become major issues and the game becomes excruciatingly annoying.\n\nI still recommend this game. The only reason I give it a thumbs down is because I don't believe the overall rating should be this high.\n\nIn order for me to give this game a thumbs up, the game developers really needs to address and change some basic issues and mechanics.\n\n- They need to drastically increase the number of item slots of your character and stack sizes. The game is almost unplayable without mods such as \"Equipment and Quick Slots\". This NEEDS to be part of the vanilla game and expanded on.\n\n- The game becomes a logistical nightmare. Larger storage boxes and other storage solutions should be implemented. Add a label and sign function to the storage boxes themselves.\n\n- Stamina is the most annoying aspect of the game. Stamina drains too fast and regenerates way too slow.\nTools, weapons, and bows use too much stamina.\n\n- Food does not last long enough. The benefits that food provides should not deplete at the rate it currently does. Needs to be doubled at least.\n\n- Discovery radius on boats needs to be increased by about 3x or a dynamic fog of war implemented.\n\n- A vaulting or climbing mechanic needs to be added. If the game has a super annoying stamina mechanic and you design vertical biomes such as the Mistands or even the Mountain biome, you need to have a more robust way of climbing, vaulting, and a much better movement mechanic.",
    "I just have to say I love valheim. It was the early access game that made me never want to buy another early access game again because I realize there is no obligation for devs to finish or even add stuff to their games.\n\nDont get me wrong, the game is fun, fairly challenging, even triggering at some times...but the lack of updates and content is the real killer here on top of the devs asking for a labor of love vote in 2022 after adding literally ONE BIOME.\n\nCore gameplay is not finished. Biomes that are being worked on (for almost 3 years now) and modders essentially fixing and adding content that virtually tripled my playtime.\n\nI bought this game at full price, so the price now really isnt TOO terribly bad ($12) considering the state of the game. Just dont be disappointed in the end game...because there isnt one.\n\n\n\n",
    "I just haven't been able to get into the game for three main reasons.\r\n\r\n1) It feels too much like I'm on rails. Go to a biome, make what you're expected to make there, and then go to the next.\r\n\r\n2) It's easy to manipulate the mechanics. It's more effective to build unrealistic designs than realistic ones. I can keep things out with ditches and earthen ramparts which they can't climb or destroy, then build a platform extending out over the enemy, like an Olympic diving platform, rather than building realistic walls to defend.\r\n\r\n3) Here's the big one: I feel lonely when I play it. As far as I can tell there are no other humans in the game. No villagers. It feels like I'm doing everything for myself alone with no one to appreciate or benefit from it, even if they're just NPCs.\r\n\r\nIt's fun at first to build things, but very quickly it starts to feel a bit like there's no purpose to any of it. Moving to new bases all the time just adds to that feeling like I haven't really accomplished anything other than advancing to the next level. I would prefer to build a village with NPCs in it and watch it grow and become more interesting, prosperous, efficient, etc.\r\n\r\nMaybe just me, though. A lot of people love the game and it has interesting artwork (from a distance). I like designing buildings and then sitting and watching the sunset, but after a furious few hours of building I start to wonder what it all was for. I don't like having to repair every building piece. I don't like the unrealistic way things assault your base, nor the unrealistic strategies most effective for defending them. I don't like the long nights that seem to come too quickly. Maybe I'm just not getting it. Who knows? I just know I want to like it, but every time I try it feels a bit pointless and unfulfilling.",
    "The pace of updates for this game is kind of inexcusable. Good god its been almost 3 years since the last major update and its the 2ND UPDATE OUT OF 4 PROMISED. How on god's green earth are you going to get an indie dev miracle (by this I mean how much they sold) and pull this shit. Goes to show that indie devs can be in the exact same boat as AAA dev studios.",
    "i actually really like this game and I wanna give it a Yes! The homesteading aspect is really cool and addicting and the combat has real potential but the lack of quality of life and other things is really infuriating so I can't give it a yes.\r\n\r\nthere's a lot that i love about this game, conceptually it's so fun but in execution it needs a lot of work - and seeing as I am not that far into the game and its still being updated, I'm afraid to wonder if the devs are just piling on content to appeal to people and forgetting about the current issues.\r\n\r\nI'm gonna list some things that I have an issue with, there's a lot more too it but I haven't given it all that much thought and this is just been about the past day or so.\r\n\r\n- enemies will stay by your grave. makes for a really unfun trip back which might turn into more trips back as you die again, Dev's advice is to make sure you have backup equipment which is shitty, maybe clear enemies around a grave or give ethereal state where you cannot be harmed but cannot interact with anything but the grave instead of putting the issue on the player\r\n\r\n- slight elevation difference between you and the opponent? you can't hit the enemy but they can hit you\r\n\r\n- forced 3rd person camera and yet the interior locations are claustrophobic. in a narrow burial chamber corridor and you can barely see past your own character to see the three skeletons slicing you up.\r\n\r\n-forced 3rd person camera but the foliage between your character and the camera stays visible so you can't see shit when running through the Firs and a troll is thunder stomping your noggin.\r\n\r\n- enemies spawning in a boss fight? all tension and immersion is ripped away when you've got gaydwarves throwin rocks at ya, I was actually having fun with The Elder and then alla sudden I'm playing kissy chase with the peashooters from PvZ\r\n\r\n- not a fan of the weather changing in a boss fight. if it turns night? sure that's my problem, shoulda got that rested bonus, but the gaydwarves showing up and then it raining immediately after just took all the joy out of it for me\r\n\r\n- unintuitive attack animations on animals. can never tell when a boar or a wolf is about to attack me, which is only an issue as a newer player trying to figure out how to parry one but there's very little room to experiment on higher threat animals like a wolf\r\n\r\n- speaking of wolves???? maybe i'm skippin too far ahead but the balancing is way out of wack. tier 3 troll armour and a tier 3 copper shield with perfect parries and i still get two shot. and then I'm readin the same online about people dyin super quick to wolves with full iron? they run faster than you, they do too much damage and they can traverse sloped ground perfectly where I cannot and require stamina to sprint to maintain the same elevation so i can actually hit them.\r\n\r\n- following up on the previous, I went to the mountains because the first thing that I got from the swamp was an ingredient for \"frost resistance mead\", if I'm supposed to be in the swamp as the third region (draugrs  don't two shot me, I know where I'm supposed to be now) then maybe don't have the frost resistance as the very first thing you can get your hands on, it's super misleading and makes the player think \"oh i am ready to face the mountains\" (I was not). put the ingredient for it in a dungeon, like the surtling cores. The surtling cores at the end of a dungeon is proper pacing done right.\r\n\r\n- areas should be graded by difficulty. putting the mountain region in the black forest when it's clearly not the follow up location too the black forest is really misleading. I can imagine that'd take too much work to put it elsewhere but maybe have a star grading system that shows up when you enter a region.\r\n\r\n- lack of direction. bird man and runestones can only tell you so much, and putting vital information such as how to pen and tame a boar in a creative writing majors dissertation feels like a cheap cop out of an actual explanation. some people like hints and objectives, some people don't, but putting it entirely to riddle and exploration is a narrow demographic. i'll pull up the wiki if i have too, but that takes out a lot of the fun.",
    "Way too much grind once u finish the first area / boss, hardly any updates from the devs since the game has been released.",
    "We started a second run of Valheim now after not having played since they put out the food patch. Man, is the game GRINDY.\n\nThe grind is ROUGH, and imo they've made the game considerably worse. The food patch really ruined it for me by increasing the grind 10x.\n\nIn addition, my character now feels like a geriatric pensioner who's constantly out of stamina. I absolutely hate that, feels so bad.\n\nBaseline, building and exploration wise, the game is really good, but it's SO GRINDY.\n\n",
    "I would love to recommend it and I love parts of this game; the building, aesthetic, exploration, and sound are great. The combat is passable, enemy AI is meh at best. The biggest issue is super slow dev time. Check back on the game in 3 more years and maybe it will be done.",
    "At this stage it feels raw, empty, buggy and unoptimized. It brings some fun in the begging when you have to explore and discover new stuff. Building might also be interesting. Crafting is arguable and feels like too much grinding. In general for now there is a lack of everything (places to go, things to craft, bosses to beat, items to collect etc) comparing to similar games. But it does have potential and it might be interesting to revise after some years if not abandoned.",
    "Absolutely!",
    "It is my second time playing this game, I love new updates and I caught amazing nostalgia by playing it a few years later. I will recommend playing it with a friend for better experience! 10 mead out of 10",
    "Kinda sad to leave a negative review for this game...I really tried to like it, but the gameplay loop becomes an absolute, unrewarding grind.\n\nFirst, the pros: \n    - The art style of Valheim is absolutely beautiful. You don't need any 4k texture mods or anything to see that.\n    - Base building is actually useful and a necessary thing to do in order to advance through the game. The vanilla game already has tons of variety in base building that allows you to spend many hours building.\n    - Tons of mods that can help fix some of the quality of life issues in-game.\n\nCons: TLDR - boring, linear combat. Long grind times to craft/upgrade equipment. Limited variety of equipment with an obvious best choice for each enemy type.\n\n    - After the first boss, the game becomes an absolute grind. You need to collect a ridiculous amount of raw materials in order to craft, then upgrade new weapons. This gets even worse after the second boss.\n    - For a game with somewhat soulslike combat, the combat is very unrewarding. Parrying is very easy, and as a solo player, parrying then attacking is essentially the entire name of the game.\n    - You can dodge in combat, but there's little to no benefit of doing so. You use about as much stamina as a parry would and don't get the benefit of staggering your enemy and getting a damage boost for a few seconds.\n    - Stamina feels like an absolute chore in this game. Your stamina is VERY limited unless you gather/cook and eat certain types of food to boost it. However, even with good food \"equipped\" (3 food slots, hp/staming boost, can only eat one of a food item until it wears out), running out of stamina doesn't feel like a tactical decision/blunder. Unlike other souls-likes, it just feels like an artificial block, especially so against the large mob enemies (troll, abomination). Battling them essentially is: parry, strike x3, parry, strike x3, run out of stamina? Abuse the enemies' poor pathfinding and walk around obstacles trying to regain stamina so you can parry, strike x3 again. To be fair, this gameplay mechanic would be less annoying when playing coop. However, as a solo player, it is devastatingly painful. You can eventually craft stamina recovery potions, but that doesn't change the fact that stamina is so annoying.\n    - There is no weapon choice variety in this game. There's three types of non-status damage: pierce, blunt, slash. Pierce are spears/arrows, blunt is for clubs/maces, slash is for swords/axes. Enemies have resistance against certain damage types, so you need to bring all the different damage types to fight against them. However, that's about as complicated as it gets. Bring a blunt type against skeletons/blobs. Bring a pierce type against trolls. Two-handed weapons exist, but are not very useful as a solo player except for AoE attacks. Bows and arrows are essentially useless in solo gameplay except to hunt.\n    - Armor variety is nonexistant too. There's either full heavy armor that slows you down, or lighter armor (troll, vine) that protects against certain status effects, or gives a bonus to a certain skill. For context though, by the time you fight the third boss (and that's going to be after dozens of hours of gameplay), there's only three different armor sets to choose from. For different encounters, there's a very obvious and clear choice of which armor to equip.\n    - Boss design, while initially interesting, becomes very boring. They're not very interesting gameplay-wise. The first boss, Eikthyr has a somewhat interesting mix of parry-able attacks, charge attacks that need to be dodged, and AoE attacks. Second boss, Elder, is slightly less interesting. Summon normal enemies, summon static enemies, ranged attack, parry-able attack. Third boss, Bonemass, I found to be absolutely bland. Parry-able attack, summon normal enemies attack, AoE poison attack. That's it. Just a bigger HP tank that has both close-up and ranged atacks and can summon other enemies. A very obvious choice of armor to protect against poison status effect. This unrewarding fight after a very long grind for equipment was what made me quit.\n    - Lack of vanilla farming. Yes there's mods that you can and I did use to plant and farm berries, but the vanilla version does not. What's the point of spending all this time building up a base if you still have to go on time-consuming scavenging runs for berries (used in stamina-boost foods)? Yes, you can farm some foods like carrots, but many crafting recipes call for consumables that must be scavenged.",
    "Really good game",
    "The games whilst fun and has some very well executed gimmicks just absolutely lacks in content. The world feels dead, the enemies are very rinse and repeat and the wait between updates is absolutely a killer for me. Theres so much 'showcase' work of whats coming in the future but honestly we can only imagine these 'future content' updates are years off given the slow and painful wait between them.\n\nAlso Mistlands. it sucks so hard not being able to see properly a whole are based on movement and stamina management in a game that executes stamina management poorly honestly it killed the game for me and was unbearable to play.\n\nWhilst the game is fun it'd be mad to recommend it in its current state given the sheer amount of content missing that could make the game fun.\n\nFor anyone who says \"oh but theyre working on it\" there are modders out there who have managed to implement significant QoL mods as a single person in less time than it takes for the devs of this game to add a second vendor",
    "I liked building and exploring",
    "Game still has potential, however the devs won't do anything about it, so get Enshrouded/Palworld instead. They are too busy sitting on mounds of cash, snorting coke instead of adding any relevant content to the game in 3 years.\n\nBy the way, consider that these devs released a \"devblog update\" (nothing relevant in it, only to remind people that they still exist) and put Valheim on sale on the SAME day that Enshrouded gets launched. After being called out for it, they start to delete comments and ban people on the forum. Really scummy tactic, Iron Gate.\n\nRemember the 2021 Roadmap? The modding community already did better everything that you promised in the first 3-4 months since launch. After 2 years we get Mistlands which is an uninspired, lazy implemented joke of a biome.\n\nDon't buy this, it's just another case of devs getting blinded by money and success.",
    "2 years now ? Something like that... Thousands of kids in their room modding the game... We love the game but start working, we are fed up with new decorativ windows every 3 months !",
    "1420hrs... ya im hooked!   New players.. make sure you change the settings to allow all objects to be teleported.\n",
    "Valheim is one of my favorite games of all time.\nThe Base building and craftig is amazing, the grind for materials is just the right amount and enemys are at first very scary, but with time you learn how to be a real viking and slay them :D \n\nTo play with friends in the world of valheim is  one of the most amazing experiences i ever had in gaming. I will never forget how it was to slay each boss for the first time for example or when we searched for the next material to make better armour.\n\nMy only \"negative\" comment  is about the mistlands. In my opinion, the mist is just very irritating and not fun to move around in. I hope maybe with a future update it will change, or you unlock a not so misty version when you slay the boss for this area or something. \n\nAnyways, its a great game and i always recommend it to all my friends.",
    "Dev team losing there shit with the mistlands biome,  wow such a good experience.",
    "Whilst I adore the aesthetics of the game as well as the bosses, exploration, and freedom it allows.. I severely dislike quite a few things about this game and some things I absolutely despise. Also, to be honest, building is my favorite thing to do in games and its mainly the genre I like the most so the review is going to be more oriented towards that point of view.\n\n[My Opinion on things I enjoyed, not much to say since I'm sure everyone will have a very pleasant experience with this (: ]\n\nChallenging bosses and reshaping the terrain to suit your needs is so beyond enjoyable. I also loved exploring new areas, finding new mobs, and new crafting recipes which gave a serious sense of progression and development.\nAs well as building a base to suit your needs and developing it over the course of time as you obtain new production blocks and such gives pleasant memories to look back upon if you happen to take as many screenshots going through the game as I do!\n\n[My opinion on the weapons]\nThere are tons of weapons and a large variety to choose from which I absolutely love! I think for the most part everyone enjoys them a lot but..\n\nFirstly, who tf uses a spear like a kitchen knife in the hands of an unruly child? Why would you hold it mid shaft and stab only downwards with it?? Its attack pattern should genuinely be a thrust giving you more range than a small stick since some weapons do that when they shouldn't (Like an axe that doesn't even have a poke bit!)\nThe only thing I can think of is that the devs thought getting extra melee range was too strong so they intentionally prevented you from using the weapon correctly.. and I truly hate it. I don't use spears in this game.\n\nI'll just say this right now, two handed weapons are completely useless to the point its not even funny. With how much stamina cost and time to attack they have, I feel like they should be doing at least 50% more damage than their one handed counterparts. 50% just to make them somewhat competitive. Because two handed weapons take like 3 times the time to swing and use substantially more stamina but only get a measly 5 to 10 extra damage.. like, huh..? Who would ever use them for anything other than gloating rights or fashion? For most enemies, you attack so slowly they see the attack coming from YESTERDAY and casually walk out of range long before you even take a swing. I also do not use two handed weapons.\n\n[My opinions on Terrain Manipulation]\n\nBut the things I absolutely hate the most is the building and terrain manipulation. It's arguably one of the worst systems I have ever seen and the 3 years I've waited they hadn't improved it even remotely in the slightest and it genuinely pisses me off.\n\nNot only am I incapable of shaping the terrain to my liking but it will with out a doubt be disfigured and uneven. Not only in elevation but also length and width wise as well. If I want to create a square piece of raised ground and build a wall around it, it will not happen even remotely in the slightest because what I make after hours of literally fighting the terrain will at best be a completely disfigured blob mound.\n\nThere is also the slight issue where when your cursor is too far away or too close then the game just affects the ground directly beneath you making it extraordinarily frustrating when trying to raise up an area.\n\n[My opinion on Building]\n\nNext major issue is the actual building of walls, floors, and roofs. It never ceases to amaze me how your character is completely incapable of building underneath a floor. If I want a pillar to connect the floor to the ground and the gap is small enough to where my character can't physically fit under it then it WILL NOT HAPPEN.\n\nIt's such a simple adjustment the devs could have implemented day one to reduce the amount of struggle I had to endure with building a slightly raised house but considering it's such a simple issue that hasn't been fixed after 3 years I truly think they're never going to improve the building in the slightest.\n\nYou also often come across inconsistencies and misalignment while trying to build anything other than a square box, but so long as you don't care and manually fill in the gaps it'll be relatively fine despite being slightly annoying if you're a perfectionist like me and need everything even.\n\nI rate whether or not a building system is good based off of whether the tools I have at my disposal will allow me to create what I want and based off my dozens of hours of genuinely trying to build in this game I can say without a shadow of a doubt its a complete failure of a system. I never once thought that what I had made was what I wanted and never once was happy with the outcome. Even after dozens of tutorials, trials, and errors.\n\nI basically just ignored it as much as I could and built only very simple structures because that is the only thing I will be happy with. So yeah, I honestly spent way to much time on trying to get things to be even remotely functional for me to honestly enjoy any of these building systems.\n\n[What would improve the experience]\nHonestly, if you had the farm tools visual effect be a hard cap to where its at and use mouse wheel to change the elevation of where you would build up to or flatten it would make it a lot easier and the mouse would point to what position the farm tool would bring the terrain to.. within reason of course since you won't be able to completely remove terrain like a pickaxe.\n\nAnd another idea is to have a highlight that shows where to raise, flatten, or remove terrain in order to make it actually flat. That would help immensely.\n\n[How I played the game]\nWhen I initially played was at the start when the game was a true grindfest. I often would create worlds with specific seeds just to mine the materials nearby or use worlds to transport items through portals because it truly truly took way to long for my liking. And with that strategy, I beat the bosses in about 110 hours although I did build a big base,\n\nThen recently I came back to the game and used Valheim+ mod which made the game far more enjoyable for me to play and I cleared out the bosses in about 40 hours and also had a big base.\n\n[My final thoughts]\nWhilst the game is very fun at times, a lot of the time its just very frustrating and I don't recommend it for most people. Some will definitely enjoy it but for people like myself I definitely do not.\n\nI could also go on about how absolutely abysmal the games progress at development is in regards to adding new features and content, I don't actually mind as much since what I truly want is for them to improve the already existing experience because the game has a lot of potential and could be even more fun without all the hindrances.\nBut I definitely have to make a note and mention about how much money they made to the level of progress that actually happened over the years because it isn't very pleasing. I really hoped they would ramp up updates over time but it did not and will probably never happen.",
    "Hundreds of millions of dollars from sales. 3 years since release. And barely anything to show for it.",
    "⠀⣠⣴⠾⠿⢿⣿⣿⣶⣤⡀⡀\r\n⠊⠁⠀⠀⠀⠀⠀⠈⣟⢿⣿⣯⣳⣄\r\n⠀⠀⠀⠀⠀⠀⠀⠀⢿⡃⢹⣿⣷⢻⣆\r\n⠀⠀⠀⠀⠀⣀⣀⣀⣀⣴⣶⣿⣿⣿⣿⣤\r\n⠀⠀⠀⠀⠈⠛⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡶⠶⣶⠆\r\n⠀⠀⠀⠀⣀⣴⣿⣮⣟⣿⣿⣿⣦⣿⣿⣿⣿⡖⠛⠁\r\n⠀⠀⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧\r\n⠀⠀⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣆\r\n⠀⠀⠘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢿⣿⡿⣿⡄\r\n⠀⠀⠀⢻⣿⣿⣿⣿⣿⣿⣿⡟⢻⣿⣿⣿⣝⣿⣾⠁\r\n⠀⠀⠀⠘⣿⣿⣿⣿⣿⣿⡟⡇⢸⣿⣿⣿⡟⠛⠃\r\n⠀⠀⠀⠀⢹⣿⣿⣿⡟⣿⡇⠃⢸⣿⣿⣿⣷\r\n⠀⠀⠀⠀⠀⠹⠟⢹⠃⠟⠁⠀⠘⣿⣿⣿⣿⡇\r\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿\r\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⡏⠃\r\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈",
    "I wanted to write a complete review of why you should try this game, but you probably wouldn't read it anyways.\nThe game itself is a Open World Base-building Survival type game set in a Viking Fantasy setting, where the player starts with nothing and crafts the basic items by finding sticks and stones laying on the ground. \n\nThe player eventually scrounge enough mats to craft a workbench which enables crafting more advanced tools and weapons and then, when player has crafted and upgraded their armor and weapons, proceed to beat several Boss entities in each of their respective Biomes.\nYou might want to craft a second pair of each, when you die, you drop all your equipment and need to go get it back, and kill whatever killed you when you were possibly fully equipped.\n\nStill a pretty neat game, very immersive environment and gameplay, the music is the best you could hope for, it really sets the mood right. \nGame is Much better with friends.\n\nCons: Game Crashes often (about 1 every 30-60 mins), most of my friends went on to play other games.\n\nAll this to say it's worth a try, at least.",
    "To the stars",
    "I remember buying this game for my sister a few years back. Didn't think much of it at the time, but I thought it would be a nice gift for her. I remember seeing her playing it from time to time, the message indicating that she'd started playing it popping up on the corner of my screen. There was always a certain small pride in seeing that, because to me it meant that she was enjoying my gift.\nLast September she committed suicide.\n\nAfter everything had more or less settled down from that, I sat down and booted up her computer. All that was on there was Chrome, Steam, Word, and a few games. One of them, of course, was Valheim\nShe had played this game to pieces, clocking over 170 hours and owning practically everything the game had to offer. She had used every square inch to its maximum potential, and was making ridiculous amounts of loot. It was only then did I see just how much she loved my present. No other game she played quite captured her affection as much as this one. None of her friends really knew about it, however; it seems like she preferred to keep it to herself. Like it was her own little bit of heaven she could turn to whenever she wanted.\n\nAnd because of that, I can't help but smile whenever I play this game.\n\nI cannot recommend it enough; every bit of hard work the developer put into this masterpiece shows in every single aspect. The music is catchy and memorable (I'll often find myself humming certain tunes from it), the world feels lived-in and natural, and the gameplay is incredibly laid back and enjoyable. It's hard to stop once I get invested in the game; minutes can easily turn into several hours. And now, I play for even longer with my friends, each of us dedicated to our desired jobs. Most of all, however, we're all just happy to be together.",
    "slower development and need more big update. I want to see new creature and new boss",
    "i made a sex chamber for my pigs, what else do you want me to say",
    "This game blew up when it came out! It wasn't like other games who were rushed and full of bugs. Valheim was the bomb! But its been 2 years now and there has been very few minor updates and the Mistlands. I am afraid that the massive success the game had, may have done some unintended damage to its evolution. I will rate it down FOR NOW, just so the devs don't get blinded by this shiny gem and start doing the work this masterpiece of a game deserves, or this will remain in early access for 10 years",
    "I tried... I really did... I did every single damn thing you could do to make this shit of a game fun. Installed mods playd with friends. Tried rebalancing it. Nothing works. Game is unbalanced, unfun, try to run for more than 10 seconds in order to die since you can't run anymore nor fight back against enemeis that the game throws at you at random. It is a constant grind, for a massive map you can't teleport with key resources like ores. Thus you get like a stack of it and then run back home (have the stamina problem in mind). You constantly have to grind (not in a fun way like in Terraria) but in a chore-like manner you have to dig a bit, fight with the same copied and pasted enemies and then after like 15 minutes of suffering you have to run abck game (stamina again). Game itself is like Avatar The Last Airbender - Overrated. I've lost 40 hours for this game by constantly coping about how it may be fun like other people say if I only get to another progression point. All I got was armor that slowed me down even more...",
    "Unfinished for over 3 years, check back in 2026.",
    "Great game with a lot to do but since the release of the game there's been only one major update in like 3 years which from a game that sold 12 mil copies is crazy so its a good game just not no new content or anything fun because the dev's are just siting around doing nothing.",
    "Anything and everything in this game is annoying. Combat sucks, farming sucks, storage system sucks, exploration sucks (except the first 20m when going to a new biome) especially when you have to look hours for something, stamina management sucks, progression is terrible and grindy as fuck. The quality of life features are non-existant in this game. Everything you do takes too much time in this game and it's not fun. You need to explore 10 mountains to find one thing, but the mountains are all the same. There is a huge map that just contains multiple copies of one island with a different layout. It lacks content, it lacks proper progression/reward system. The more you play the more you become annoyed by this game.",
    "In the start game is fun , but as you progress the grind grows , lack of compensating mechanics is absurd , after 100hrs i just cant recommend it at such state . if you plan to play alone be ready to die a lot and grind your ass off . mist is just awful , new gear is practically irrelevant in the end game . End game is just grind and pain , no fun of exploration , 4/10",
    "The most beautiful looking game I've ever played and I mean it. It's just insane how hard they've nailed the atmosphere.\nHope to see more updates.",
    "Good foundation, but the lack of care for the player-base is becoming appalling.\n\nThat being said, the game still has its high points. Pretty much everything is simple, but hard. This makes things like combat and building annoying at first, but they slowly become the best parts of the game. In addition, exploring any location in this game for the first time is magical. Not to mention, the visual style is breathtaking at some points, and the soundtrack slaps.\n\nIf you like open world games, there is definitely something here for you. Now on to what sucks.\n\nThe game has never had much content, but the fun foundation and mods were enough to keep a lot of people coming back. We are well past the point of absurdity on waiting for a SINGLE biome, though. While biomes can take real life days of consistent playing to get through, the majority of it is just grinding materials. I personally don't find the issue to be with the time spent running around and exploring the massive world. The real issue is that there has been NOTHING released to freshen up this grind. The trend from the devs seems to be that once it's released, it's not thought about again unless it's buggy. This happened between the game's launch and Mistlands, and is happening now as we wait for Ashlands. This is fine in a game with lots of content. However, this is a bare bones open world survival game, and the pathetically small release of Hildir's Quest, and a couple new small, mostly empty structures are the ONLY \"content\" updates we've gotten since Mistlands. In my experience, this makes mods a necessary part of the game for any play-through after your first.\n\nNow to put this on a timeline. For those unfamiliar, Mistlands came out Dec 6, 2022. As of writing this on Apr 16, 2024, it's been about 16.5 MONTHS since the last major content update, and just over 10 months since Hildir (June 2023). While posting about progress and doing these bug fixes (of mostly tiny, many years old bugs) is great, dangling the real new content over our heads for months at a time WITHOUT giving a development timeline or even a release date is irritating. This would be fine from most devs, but it's been almost a year and a half since the gameplay has seen a noteworthy change or addition. That's insanity from a dev team that sold 5 million copies in the first month of their game's release, and over 12 million as of Sep 2023. Instead, the devs did a YouTube mini series that is just about as vague as the patch notes and made a brand deal with a plushie company. This game is approaching an all-time low player count for a reason.\n\nWhile I hate to see this incredible game stagnate, it's been made clear that these devs now care more about trying to stay relevant through media and white truths rather than taking community feedback and making meaningful change to their product. It's gotten to the point where everyone I know that has played Valheim since Mistlands, despite having fun, actively recommends against it, myself included. So while the devs are enjoying their time in Bora Bora, I encourage anyone that's considering buying this game to not do so now. At the very least wait till #ashlands2026\n\nTL;DR- good foundation, but lacks substantial content outside of the grind. devs are taking too long to add to it and neglecting their community in the process. either move on or wait for Ashlands, these people do NOT deserve your money as of right now.",
    "Great game, I've spent a bit of time playing it. The replay-ability is something that can be  what brings you back. Just stay out of the console. :)",
    "This game is in a genre of its own.  Yes, it is a survival game but it's surprisingly unique and intense.\n\nChallenging enemies, awesome bosses, excellent building mechanics, solid soundtrack...  It kind of makes me want to go outside and start chopping down my trees to build a raft.\n\nThe exploration deserves a ton of praise.   Each new world is randomly generated so you'll have to do your best to find key locations and resources which could be anywhere on a giant map.  No two games will ever be the same which gives it tons of replayability.\n\nI'm currently rebuilding my gear and a new boat because I died on a remote island and that's where all of my equipment is now!  Love it!",
    "Make iron daggers",
    "The game is vast and visually amazing. If we were to base the score just on the details and design of the game, then we are looking at a 9/10 game. However, there are so many tediously annoying and lacking elements that I cannot recommend this game to any average player. \n\nThere are 4 quarters of your time in this game:\n1 quarter is preparing food, cutting wood, and building your base.\n1 quarter is exploring, finding the mines, material, and bosses.\n1 quarter is mining metals constantly due to the large amount of material you need.\n1 quarter is continuously running back and forth from home to your grave because you just can't stay alive.\n\nThe game has a serious issue with purposely making your experience a drag and longer when it doesn't need to be that way.\n\nYou spend so much time trying to get to places because your stamina is so draining and slow to re-gen. You can level up to help with stamina, but when you die, you lose your progress in a negative way. Majority of the deaths you experience in this game is due to stamina being out. \n\nList of tedious things in the game that need fixing:\nStamina re-gen (possibly add stamina re-gen to armor and increase it as gear gets better)\nVertical attacking is not a thing so enemies can hit while you can't hit them if they are a little above or below you.\nMistlands is a terrible region which exemplifies all the bad things in the game.\nEating food doesn't immediately increase your health even when you are rested. This may be because the developers want you to utilize potions which are time consuming to make and cost a lot in material.\nMobs constantly attack your base wasting your time even more because now you have shift your focus.\nMany of the boss abilities are lackluster and horrible to which you usually only use a mix of three boss abilities.\nSkills basically mean little to nothing in this game because you don't feel them. They are there, but the level up reward is minimal and non-explanatory. \n... The list goes on.\n\nPlay this game if you want a long aggravating experience. \nI can see this game becoming amazing when it fully releases, but there are a lot of things that need to be fixed at the end of the day.",
    "Game took to long to do anything.",
    "Played on release and had a ton of fun with friends. Played again recently and it felt like nothing was new at all, feels like abandonware",
    "Decent game. Even more fun with friends. Takes forever to mine resources but combat and base building are really decent.",
    "I do smoke grass sometimes and i like play valheim while doing it.",
    "I thought that the thing i hated the most was my life, But unfortuneatly Valheim's Swamp biome exists",
    "i haven't played much but so far it looking like a masterpiece, just like skibidi toilet",
    "ADD ACHIEVEMENTS",
    "I was trying to find a game after playing Grounded and I saw good reviews of this one. \r\nI have to say that I didn't like it. Progress is very slow, lots of mining needed to craft the items, also lots of time walking around while stamina being a problem all the time. Setting up base doesn't really matter since you will have to move after every boss and moving the items from A to B is a pain and a really slow process. Been playing for 14 hours and I only saw 3 types of monsters and 2 times of animals to hunt, very repetitive. The patters are really easy to learn since they have 2 or 3 attacks at most. I fought one boss and it was OK, same 2-3 movements again. Feels very repetitive the first part of the game and exploration doesn't seem rewarding.",
    "Overall, I love the game, but fix your f***ing combat. If an enemy is SLIGHTLY higher OR LOWER than you, you can't hit them. Enemies take no fall damage, you take fall damage from seemingly anything not totally flat. Losing your health the instant your food buff goes away is total BS. You should keep the health until you take damage.\n\nAlso, make the boats faster, or at the very least the longship. One of my favorite things was sailing, but now it's just a chore. 15 minute round trip to the closest plains biome to pick up black metal, and that's using Moder's power. The mistlands will take longer, and the Ashlands longer still.",
    "Addicted to building wood houses.",
    "It is a wonderful game, lots of challenges. Which you can alter to  your own liking, making it as hard as you like or as easy and relaxed if you want. I love how the game feels, how it works and the views are stunning. I'm a huge fan of building, and exploring. Which you can find in the game.",
    "good fun with friends",
    "great game",
    "amazing gameplay it's really enjoyable",
    "/kill ender_dragon",
    "A hairy groined Troll killed my chickens! A must play!",
    "this game is absolutely beautiful, and its only like 1.4gb of space, i highly recommend if you have friends or if you like playing these kinds of games solo",
    "Best survival game in midgard. Odin is watching you.",
    "Chopped down the entire forest, killed all of its natives and started polluting the atmosphere with coal. After that I played a calming session of Valheim to forget my deeds....",
    "It had been a wonderful journey, thank you <3",
    "Overall it's a very fun game, especially when you played with your friends. Build your base, gathering resources, and fighting all the bosses across all the biome. A very good game with good graphics consider it only take 1 GB of your storage. But I think the game dev it's a bit lazy with their update, we didn't get any biome update in ages. Hopefully we will get one. Still a very good game, recommended",
    "Me and my buddy decided to embark the ocean in our newly built longship, armed with the best gear and supplies. We were ready to build up a new base and connect our main base with new biomes through the portal. After 15 minutes of sailing, we found 'Plains' and decided to approach. After that, in mere seconds, we were SLAIN by two mosquitoes that ended our journey. We decided to return for our belongings, only to meet the same fate once more. In the end, we lost everything we had...\n\nMoral of the story? Valheim to learning the hard way and laughing through the tears\n",
    "Typically, I do not leave long reviews. Today I will make an exception.. THIS game right here is a must play, only if you like survival / crafty games. Actually no... even if you're not a fan, at least try this one out. It's got a beautiful art style and the game play is so fun. I wouldn't change a thing about this game. The music is amazing (some cello + clarinet hits the spot) and most of the boss fights are fairly interesting / challenging. I've almost poured 600 hours into this game and I cannot wait for it to be my most played. Play it by yourself (with server modifications if you want, the game is balanced for groups) Play it with your partner, play it with 10 of your friends. It settles well no matter how you play it. I can guarantee though you will make lasting memories and laugh to tears if you play with friends. I already am nostalgic for this game and will make my future kids play it. Congrats Devs, you nailed it. PLAY THIS GAME ALREADY!!",
    "L",
    "3 years later and still in early access release. Worst thing steams ever done is let companies release unfinished work.",
    "I enjoyed this game a lot. And I believe it has the potential to be truly great. The Game is an awesome co-op experience and is visually beautiful. BUT suddenly the devs \"yea we actually aren't gonna do anything from the road map\" that translates to \" we are taking our money and running\" and now here we are years later hardly any updates except small patches and the game is basically what it was at years ago. I don't recommend you buy this abandon-ware as it is and I regret the money I gave these devs.",
    "ᛁ ᛚᛁᚲᛖᛞ ᚦᛁᛊ ᚷᚨᛗᛖ ᛊᛟ ᛗᚢᚲᚺ",
    "Bought the game close to early access release, three years ago. Didn't see it as all that impressive, but I could see it's potential in the Terraria-like progression. Held off on playing too much of the game but kept an eye on the updates since I would rather wait until it was actually done. Would often forget about the game for a year at a time, then check it out for anything new.\n\nSo... What's happened in three years? Not much. In the last three years, there have been three \"big\" updates. One update was a new biome, making seven total. One update added a handful of dungeons and an NPC. Then another update added more base building pieces. That's it. \n\nWhere on earth did all the millions and millions of dollars go? Clearly it hasn't been put back into the game to do something like expand the team or scope, speed up the updates, or anything. \n\nI've seen so many people say things like \"they're an indie dev\" or \"it's $20\" or \"they don't owe you anything\". Like... okay...? This small indie dev has (tens of) millions of dollars to work with now, so what's with these snail paced and snail sized updates? And, yes, I feel like I am owed something. I paid money for a game expecting it to be finished in a timely manner, especially considering the huge success of the game. \n\nAnd apparently, reading their little early access explanation, they say there will be \"at least\" another year until they're done (2025), which does NOT seem realistic considering how they've been dragging their heels to put out three updates in three years. There's still two more biomes to release plus \"smaller updates\". \n\nI think this was the first ever early access game I bought, which explains my stance towards them now. That is, I don't buy early access games. Anyway, rant-review over. No ones gonna read this anyway lol\n\nTL;DR: Okay game, but very slow updates despite huge success."
]