{"reviews": {"160199968": {"recommendationid": "160199968", "author": {"steamid": "76561198021476287", "num_games_owned": 92, "num_reviews": 8, "playtime_forever": 96248, "playtime_last_two_weeks": 0, "playtime_at_review": 96248, "last_played": 1689876034}, "language": "english", "review": "Absolutely one of my favorite games of all time. Build a kingdom with your friends and engage in a medieval political struggle for power. Feed the grind!", "timestamp_created": 1710006466, "timestamp_updated": 1710006466, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.593875646591186523", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160868434": {"recommendationid": "160868434", "author": {"steamid": "76561198269698560", "num_games_owned": 206, "num_reviews": 93, "playtime_forever": 1060, "playtime_last_two_weeks": 0, "playtime_at_review": 101, "last_played": 1711110305}, "language": "english", "review": "welp i gave this game a second try but its still poorly made\nno one should take 4 hours trying to flatten ground to make their starter hut.", "timestamp_created": 1710792302, "timestamp_updated": 1710792302, "voted_up": false, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.555787801742553711", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "162525406": {"recommendationid": "162525406", "author": {"steamid": "76561198006884593", "num_games_owned": 854, "num_reviews": 75, "playtime_forever": 230, "playtime_last_two_weeks": 0, "playtime_at_review": 230, "last_played": 1494235134}, "language": "english", "review": "7 years later and im still recovering from the PTSD caused by my last playthrough. I distinctly remember spending 5 hours trying to flatten some ground in the woods so that I can place a hut.  After all that work I stepped back to look at my progress-- the ground looked virtually unchanged. That moment broke something deep inside me, even now I can hardly stomach almost any grinding and survival mechanics because of this game. I never got REMOTELY close to building that damn hut.", "timestamp_created": 1712643113, "timestamp_updated": 1712643360, "voted_up": false, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.549365043640136719", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161342281": {"recommendationid": "161342281", "author": {"steamid": "76561198059003800", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 4417, "playtime_last_two_weeks": 0, "playtime_at_review": 4417, "last_played": 1683529831}, "language": "english", "review": "Without AI villagers, this is boring.", "timestamp_created": 1711279000, "timestamp_updated": 1711279000, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.526066362857818604", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "157628965": {"recommendationid": "157628965", "author": {"steamid": "76561198964809737", "num_games_owned": 0, "num_reviews": 17, "playtime_forever": 9353, "playtime_last_two_weeks": 0, "playtime_at_review": 9353, "last_played": 1707110009}, "language": "english", "review": "O jogo parece estar abandonado pelos DEVs, mas é um jogo até bem completo, e a comunidade ainda mantem o jogo vivo, sempre criando novos servidores e com isso, modos de jogo. \nAlgumas melhorias seriam muito bem vindas, como na progressão da construção, mais animações, mais opções de criação de personagem, instrumentos e interações.", "timestamp_created": 1707110546, "timestamp_updated": 1707110546, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159638844": {"recommendationid": "159638844", "author": {"steamid": "76561198015991519", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 324, "playtime_last_two_weeks": 0, "playtime_at_review": 324, "last_played": 1709329691}, "language": "english", "review": "Any sort of progression takes far too much time and there's not really any big help in how to do things.  There seems to be a glitch where you can't drop things as the space you want to drop it in is apparently occupied - and have tried all the stuff about not dropping it too close to you, etc.  Really fiddly in equipping the right tool then needing to swap back to something else, it's really faffy. Just too many things that make the game-play clunky.", "timestamp_created": 1709329957, "timestamp_updated": 1709329957, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.520825684070587158", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160364791": {"recommendationid": "160364791", "author": {"steamid": "76561198012772942", "num_games_owned": 57, "num_reviews": 1, "playtime_forever": 42, "playtime_last_two_weeks": 0, "playtime_at_review": 42, "last_played": 1671776577}, "language": "english", "review": "Dated and just dont understand the concept of the game. Go and play space engineers.", "timestamp_created": 1710210534, "timestamp_updated": 1710210534, "voted_up": false, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.511454463005065918", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160619439": {"recommendationid": "160619439", "author": {"steamid": "76561198109451268", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 91, "playtime_last_two_weeks": 0, "playtime_at_review": 91, "last_played": 1710541774}, "language": "english", "review": "I spent an hour and a half in the game settings just to try and get it to work. I could not get a single server to load even on the lowest settings and creating my own. The title screen idle was at 666fps with everything on lowest. Direct connect to my husband would not connect no matter what we did. Dead game doesn't even begin to talk about the issues. There is a lot of work that needs to be done and no one to do it but the modders. Not worth your pocket change.", "timestamp_created": 1710542180, "timestamp_updated": 1710542180, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502487540245056152", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "13654693": {"recommendationid": "13654693", "author": {"steamid": "76561198036654577", "num_games_owned": 423, "num_reviews": 22, "playtime_forever": 77807, "playtime_last_two_weeks": 0, "playtime_at_review": 15124, "last_played": 1577067773}, "language": "english", "review": "I absolutely love this game. I am on a non PVP server and we are usually close to full every evening. I was unsure about the game the first hour or so. I'm used to Rpg's where you wander around killing stuff to level up and craft when you get tired of leveling. This game is completely different. It's all about building and crafting. It'a about wandering around a beautiful country looking for the things you need to make food, tools, armor, houses, keeps, weapons...basically anything and everything.\n      On our server we have like three separate communities or villages. Since PVP isn't an option on this server, we are friendly to one another. On my second day of playing I had made a crapload of mortar and pestles so I shouted out that if anyone wanted some of them for free, just come to my village at the base of the smallest mountain in the northeast by the sea. (There are no roads yet, although they can be built with certain skills so we use landmarks like lakes and mountains to guide people to where we are). So some stranger shouts back asking me why don't I put my stuff in a chest and I respond that i don't have one or the skills to make one. So he yells back that he'll make me one and he lugs this huge chest on his back all the way to my village just to be neighborly! This is the kind of community I like to play in and the majority of the players on my server are like this! Then the guy sticks around a bit and gives me tips on crafting and makes me a blacksmith hammer when I ask him what skill is needed to make one. \n      The crafting is what makes this game fun for me. Gathering my materials and skilling up to make better items is simply a blast once you figure out the mechanics which aren't very hard. Right now, I'm enjoying making tools. Yesterday I tried out hunting. Low level hunting was fun as heck. You're too weak to kill big game, but the game makes it enjoyable in a very unique way for newbies. A noob hunter has a couple od fun skills One is a crafting option to make small animal snares and the other is called small animal tracking. When you activate tracking, an animal's footprints appear and you can see where he likes to travel. Follow his trail and place the snares you make out of materials along the way ( plant fiber, a tree branch and an apple) which are all easy to find, then come back in an hour or so and empty your traps. I got chickens and hares and I put them in a coop in my village and they laid eggs and had babies...totally awesome. You can also track aggressive animals once you learn to defend yourself. I've seen bears and wolves. There are no monsters yet and I'm okay with that...it feels real. Supposedly they will be added in the future. Bear in mind this is alpha.\n        There are PVP servers if that is your thing, but I can't comment on that aspect of the game because I don't like pvp. \n        If you choose non pvp, the game is about building a community. In my village everyone chats, they ask other for items and sometimes we trade stuff or even just give it away. Today a new person logged on and asked us how to get a house, so we told him to join our village and everyone helped to build him one. Since I was too low to actually help build, I helped gather wood. I felt good about it and it was fun to see everyone helping a complete stranger. I've played MMO's for many years and frankly outside of guilds, you meet so many rude obnoxious people in MMO's anymore but so far it hasn't been like that here. \n          I'm really excited. I found it difficult to even take time away from the game to write this post, but I wanted to get the word out. I've got big plans. I'm raising my healing skills and making my own plate mail so i can kill bears, and I'm learning to fish. I'm even going to build a keep which takes 15000x rocks and 4000 shaped stone among other things. It will take months and it will be so much fun to watch it grow into a fortress for me and my friends. \n      Let me be clear on one thing. if you're looking for action packed adventure, the non pvp server aspect of this game is NOT for you. This is laid back...serene music in the background, birds twittering in the trees, the sound of your neighbor chopping wood, a hike up the biggest mountain on the island to watch the sunset and get back home before the wolves come out. It's about meeting people who don't yell, \"I PWNED YOU!\", but instead say things like, \"Hey, we just killed a bear and we're cooking it up in our new village...everyone's invited!\" or \"Hey, I'm a prospector and I have a ton of copper...wanna trade me some of your logs for some of it?\" or \"Hi everyone...I'm new here...can anyone help me?\" and hearing 6 people shouting back for him to come join their village. There are a few bugs...this is alpha after all. In the morning, chicks are born, trees blossom, and everything updates and there's usually a few minutes lag. Once my targetting button wouldnt work and I logged out  and then back on and it solved that glitch. This is early alpha after all, so glitches happen, but so far nothing game breaking. What I really like is it doesn't feel like some madcap rush to endgame...like omg I have to level up to keep up with everyone. It's not like that at all. Even the lowliest noob can help on stuff because gathering is a HUGE part of this game.  It's slow paced, but entertaining as hell. There's such a satisfaction when you gain a skill where you can make a new tool or piece of furniture or armor and actually use it and see a big difference. And since each village is essnetially a guild with houses, there's sense of community, of being neighbors. It's not some strange guy ridng up on his horse, hurrying to unload the gear he got in a dungeon and racing off without a backward glance or a hello. It's about your neigbor looking over at you and saying, \"I feel like mining today. What are you going to do?\" I look off in the distance at some mountain and reply,\" I'm going to go over to that mountain over there and terraform the top so I can build me a little shack at the top with a view of the ocean on one side and this village on the other.\" My neighbor looks at me and says, \"It's going to take you awhile to flatten the land on the top of that mountain. That's a lot of digging!\" I smile and reply, \"That's okay! I like the view and I've got lots of time!\"\n      I love this game!\n\nMore impressions! New impressions after a week. I'm so tired....last night I did not go to bed because I simply cannot quit playing. So much has happened. The lag comtinues to glitch the game at times and kicks  you occasionally but I'm willing to tolerate that due to early access...it's expected. My first server grew unstable in no small part due to my older computer so I've switched twice since then. A FANTASTIC experience both times! My first was another PVE server since I'm terrible at PVP and I met the most wonderful group 2 minutes into getting their and joined their village. Had a wonderful time helping them build and getting to know them. we decided to go for a village surrounded by castle walls and it was cool. Now here's the thing...a lot of these guys had experience by now like me and the town was already coming along great without me, so I decided to take up herbalism because none of them seemed to like the grind of this skill. They make this skill like a mini game. Evetry herb has three hidden qualities and there are 66 herbs. Your challenge is to find them (easy and quick), mix them with a mortar and pestle (Easy again), and finally try to match them up to find which ones share familiar traits (not so easy). Heres the thing...you're looking for one particualar item in these herbs...flux. You cannot mix two of the same with similar traits or it creates an item and your herb disappears. You don't want that to happen on 99% of the items...however, if you get two items with flux characteristics, you DEFINITELY want to mix them because this is the most needed item for", "timestamp_created": 1419739051, "timestamp_updated": 1420643420, "voted_up": true, "votes_up": 512, "votes_funny": 25, "weighted_vote_score": "0.936760127544403076", "comment_count": 68, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "20795033": {"recommendationid": "20795033", "author": {"steamid": "76561198018678339", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 120300, "playtime_last_two_weeks": 0, "playtime_at_review": 90212, "last_played": 1510722327}, "language": "english", "review": "I have played this game a lot. I know almost everything about it, currently. I have built everything that there is to build, been a king, a farmer, a warrior...  so when I write a review, know that it is quite balanced. I am no fan boi, and will let you know all the pro's and cons of this game.\n\nPros. \n1. You can tailor your characters skills to match what you wish to do in the game. Depending on the server skill cap, it can mean you can ONLY be a farmer and a bowman, or a smith and a swordsman, to being able to do everything.  Pick the server that best represents what you want. RP, pvp, rp/pvp, high skill cap (recommended for new players) or low skill cap.\n\n2. crafting system requires a lot of steps. You want to build a small house? Alright the you either have to have a supply of trees nearby, or have forestry to plant saplings and wait half a week in real life for trees to grow enough to harvest. Then once you get the timber, you or a friend better have herbalism to get enough flux to make steel for the locks and mortar needed for doors. Then you better know enough materials prep to make glass for windows... which requires carpentry as do the doors. Oh, and smithing to make the locks... while you make clay tiles. So, you need 1. forestry. 2. logging. 3 carpentry. 4. smithing. 5. materials prep. 6 gathering. 7 herbalism... just to make the smallest house in game.  On a low skill cap server, this will take the combined efforts of 3-4 people. Now imagine what a castle takes.\n\n3. harvesting is indepth. Need leather? Go hunt, make coops to harvest hares, and barns for animals... oh you need to actually trap those animals, or tame them.  Food is grown, and harvested... then a cook is needed ot make it into actual food. All raw resources need to be manufactured into goods.\n\n4. giant battles. I have participated in a 64 man judgement day battle. Took hours of non stop fighting, with trebuchets flinging rocks, bombs and arrows everywhere, people murdering eachother and sometimes friends on accident. \n\n5. Small battles. Nothing is more intense than a 2-3 man vs 2-3 man fight, where every person is needed to hold their own to win. Takes hours and hours of training to get decent, and I mean just decent, at pvp\n\n6. You literally create your own town from nothing. You scoop every bit of dirt, plant every tree, move the world to create a settlement that you can be proud of. You can make a hovel in a swamp, or a giant fortress in the mountains, it all depends on the time you invest.\n\n7. community and roleplaying can be a blast. Politics, intrigue, back biting... all fun.\n\nCons.\n\n1. server wipes. put 200 hours into your place, and its gone, instantly, start from scratch. \n\n2. lazy or no gms. LEaves you at the mercy of the griefers if the server you choose doesnt have active gms.\n\n3. SLOW DEVELOPMENT. And I mean SLOW. I have played for quite some time now... the ONLY thing added to the game since I have played (I played in beta) was advanced weather. That's it. Most people dont even use it as it can lag you. Oh and the dx11 graphic upgrade... which didnt actually add anything to the game. They have been promising horse drawn carts for MONTHS.\n\n4. broken features/bugs will drive you crazy. Wait till you die 20 times in a row, losing a ton of skill points that takes  hours to get because of a bug.\n\n You can't play the game by yourself and expect to win. The fun is in groups. Dont buy this game if you dont want to join a group.", "timestamp_created": 1453936887, "timestamp_updated": 1453936887, "voted_up": true, "votes_up": 505, "votes_funny": 31, "weighted_vote_score": "0.935000956058502197", "comment_count": 12, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "13533565": {"recommendationid": "13533565", "author": {"steamid": "76561198022230345", "num_games_owned": 0, "num_reviews": 40, "playtime_forever": 978, "playtime_last_two_weeks": 0, "playtime_at_review": 4046, "last_played": 1421105762}, "language": "english", "review": "This game is very time consuming.  \n\nI thought I would attempt to play this 'Space Engineers/Minecraft' style and build for fun.   I was not successful.  After 16 Hours, I had managed to build some barrels...  This game is so realistic that one cannot master all the crafting abilities, so you will need friends to work together in order to assign jobs and delegate work.  I.e. Woodsman, miner, carpenter, farmer, and so-on.  I think this game could be great with the right group of friends alas, most of mine are d-bags and aren't into sandbox/crafting games.", "timestamp_created": 1419289460, "timestamp_updated": 1419289460, "voted_up": true, "votes_up": 236, "votes_funny": 16, "weighted_vote_score": "0.928326070308685303", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "42888493": {"recommendationid": "42888493", "author": {"steamid": "76561198042784704", "num_games_owned": 445, "num_reviews": 5, "playtime_forever": 27556, "playtime_last_two_weeks": 0, "playtime_at_review": 26475, "last_played": 1497148019}, "language": "english", "review": "Life is Feudal: Your Own is the game that promised to be what Reign of Kings promised to be. \n\nLife is Feudal: Your Own had amazing potential. You had the promise of making a kingdom, with NPC soldiers, and the potential to go to war with other kingdoms. You had a semi-realistic (but still managable) crafting, harvesting, and farming experience while on your way to an INTERESTING combat setup. They had massive promises to give new features, such as trade posts... ladders... and horse carts! (Let's ignore the NPC's promised years ago). \n\nWhat the devs have delivered: Horse carts... after four years. NPCS? Nah. Trade posts? nah. Ladders? nah. Better combat? nah. Fixing the lag of servers? nah. Updates that actually benefit the game? nah. \n\nThe servers that HAVE players can't stay on the same map for more than a month. You can spend $350 a month on the best gaming server box you could imagine and you will still lag. It has nothing to do with your amazing specs, it has everything to do with the terribly coded server software built for a terribly coded laggy game. Sometimes, you'll be farming (which if you've played this game, you know thats the most tedious nonsense you've ever done in your life), and you'll lose progress due to morning lag. Yes, morning lag. When trees all run checks to grow, die, and plant. Great. Lag galore for no reason, all the time.\n\nThe Devs are not only incompetent, but they are liars and cheats. They promsed free copies of this \"magical MMO\" to \"Your Own\" owners. We got it, yay! You get one free character... on a pay to win MMO. They promised things ON THEIR STEAM STORE PAGE that made the game sound magical, they never delivered. \n\nI'm still waiting on my NPC soldiers for this game, LiF devs. I won't redownload your game until it's updated to be the game you promised years ago.", "timestamp_created": 1529541339, "timestamp_updated": 1529541339, "voted_up": false, "votes_up": 147, "votes_funny": 2, "weighted_vote_score": "0.919495105743408203", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "20051342": {"recommendationid": "20051342", "author": {"steamid": "76561198067099808", "num_games_owned": 312, "num_reviews": 2, "playtime_forever": 60798, "playtime_last_two_weeks": 0, "playtime_at_review": 57310, "last_played": 1663703510}, "language": "english", "review": "[b]The following is a personal anecdote taken from my experiences playing on Role-Play Community: Life is Feudal (RPCLIF) server. In this community heavy RP is enforced and any event done otherwise is punishable.[/b]\n[olist]\n[b]Day 1:[/b] I have finally made my way into the realm from a nearby beach, it has been some time since I last visited the Isle of Maldath. I gather berries and herbs and begin to train in the ways of the gatherer. \n[/olist]\n[olist]\n[b]Day 2:[/b] I have located a nearby settlement surrounded by tall oaks and green grasses known to the natives as \"Woodhurst.\" Upon signaling the guardsman at the towering iron front gate, to my surprise, I am greeted by an old friend of mine, Arnaas of Valencia. We reminisce for a moment and I am soon offered a position among their people as an herbalist in training. Of course I accept, and then am put on a trial period to prove my loyalty.\n[/olist]\n[olist]\n[b]Day 3:[/b] Whilst gathering in the nearby cattle-fields of Woodhurst I notice two men approaching the front gate of the town, one in what seemed to be a religious robe and the other in sturdy plate armour. I am urgent about greeting them, in hopes that I can make a few friends. The two outsiders reveal themselves to be \"Solith\" a priest of the Blood God and \"Korn,\" a fellow mercenary. They are spreading word that the southern faction known as Dominion has fallen and is being rebuilt by their cult. Once again, I am offered a position. Strucken by promises of gold and power... I am torn.\n[/olist]\n[olist]\n[b]Day 8:[/b] After days of training, I have begun to mix potions for Woodhurst as they have accepted me as their full time alchemist. I covertly keep in touch with Solith as I am still partially swayed by his tempting offers. I am introduced to the town bank as I am now added to the pay roll.\n[/olist]\n[olist]\n[b]Day 12:[/b] A raid has taken place on the nearby settlement of Mercia in which the pope of Woodhurst was slain by no other than Korn and Solith's Cult. General Felipo of the Woodhurst army immediately drafts me into their military as a recruit and I undergo extreme combat training. My specialty being Pole-Axes and Scale Armour. \n[/olist]\n[olist]\n[b]Day 20:[/b] Serving for Woodhurst has now become grueling work with little pay. One night at my post, I decide to leave the town in search of Solith's lair, hoping that his offer still stands. I am greeted by their cult and am offered training and safe haven if I leave Woodhurst forever. I state that I must go back to fetch my items. As I am leaving, a squadron of Woodhurst soldiers stops  and sees me conversing with the cult. I am immediately interrogated and claim to be seeking revenge for our pope. General Felipo decides to take matters into his own hands and challenges Solith's mercenary, Korn to a duel. Korn is dramatically decapitated as I make an effort to ride back to Woodhurst.\n[/olist]\n[olist]\n[b]Day 30:[/b] My quarters have been under lockdown and I have been suspended on suspicion of treason. On this night I successfully subdue my guard and make my way into the inner town square. I make my way for the bank. The blackmith's, the queen's, carpenter's, everyones payroll now mine. I have stolen a horse and made my way back to Solith's lair. I am now wanted.\n[/olist]\n[olist]\n[b]Day 31:[/b] The combined forces of Woodhurst and her allies have surrounded Solith's Lair and are demanding that I be handed over for execution. We wait them out after exchanging volleys of spears etc.\n[/olist]\n[olist]\n[b]Day 34:[/b] The heat has cooled off and I leave the lair in search of a plot of land to buy for my own, one that is away from all this conflict. As I approach a nearby village, I make my way into the town inn and have a conversation with the bartender. A long enough conversation in order for their messenger to send word to Woodhurst of my location. I hear a familiar voice call my name. As I turn, I immediately draw my weapon. Then as I see all the other familiar faces start appearing, I dash for my life. I make it just in time to grab my horse and ride all the way across the island whilst evading every single horse archer and lancer bring sent after me. I am now forever an outcast among these lands.  \n[/olist]\n\n[b]Conclusion:[/b]\n\nI'm going to let you all in on a little secret about this game.  Like many others of its kind, this game and its famous hard-core RPG elements, are very closely tied to the servers you play on. This is because to become a \"Grandmaster Hunter\" or even a \"Famous Axe-Man\" means close to nothing unless you have a community that depends on you. So what I'm trying to say is, don't jump into this game by yourself or even with a few friends on a private server because most of you will not get your money's worth. You don't want yourself to end up like everyone else in the negative reviews section who got sick of digging holes and grinding for levels. Instead, find a meaningful server. One that cherishes heavy RP, constant PVP, or even both. That being said, I highly recommend an RP-PVP server of your choice for the adventures to come.", "timestamp_created": 1451348501, "timestamp_updated": 1701052569, "voted_up": true, "votes_up": 699, "votes_funny": 163, "weighted_vote_score": "0.899856150150299072", "comment_count": 45, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "17677235": {"recommendationid": "17677235", "author": {"steamid": "76561198039816947", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 77308, "playtime_last_two_weeks": 0, "playtime_at_review": 53591, "last_played": 1589030543}, "language": "english", "review": "I do not do reviews on games.... But this one I owe a review to.\n\nFirst off, most of all the negative reviews are from players that have not put in the time that is required to enjoy this game. It's really sad that a lot of the negative reviews have given this game a Mixed review status. I have seen one review 0.4 hours invested and they said the controls are broken....\n\nSo before you start playing this game, please go to youtube and search for LiF Basics 101. You will learn A LOT of invaluable information. There is a learning curve to this game and you really never stop learning simply because there are a TON of details about what's going on that you will discover. This will make you more valuable to the community of players which is I believe what this game is about. Playing with others!\n\nWith that out of the way, this game is amazing. They have come along way since the beginning. The graphics are fantastic. (When you start the game is automatically on low settings you need to adjust it!) Sure, just like every single game out there, room for improvement, is a valid complaint. But in the end, this is one of the best sandbox games out right now.\n\nHard work pays off in this game. It will take some time to gather, build, level your way to what you envision. The reward is great once your done. Do not come into this game thinking that you can just gather a ton of stuff and instantly build stuff. It will not happen. (Unless you take the time to find a server that has high leveling etc.) You most likely WILL need help to do things. It is the way this game is supposed to be played, get it in your head. Sure you could play solo.... But it's going to be a long road.\n\nTLDR:\n\nGritty, grindy, sandbox that will have you showing off what you build and accomplish to your community and friends. Excellent graphics, skill system, crafting and just plain fun if you put in the time. Highly recommended if you like the huge reward behind the grind!", "timestamp_created": 1440336564, "timestamp_updated": 1440336564, "voted_up": true, "votes_up": 115, "votes_funny": 2, "weighted_vote_score": "0.892132043838500977", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "12187926": {"recommendationid": "12187926", "author": {"steamid": "76561198009264454", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 2990, "playtime_last_two_weeks": 0, "playtime_at_review": 2976, "last_played": 1411885273}, "language": "english", "review": "I brought this game about two days ago, I thought I'd give a day prior before playing to get a fresh start. I started by spawning near a lake, I found a person fishing by the lake fishing, I asked him whether I could help, so he got food and I started making tools and gathering some logs to cut. 2 days later we now have a small village with 10 or so people contributing in different professions, we have armour and weapons on the way, a general, mayor and we still have so much more to do. This game is honestly amazing, you could see it at a first person age of empires from the villager’s perspective? Or even a Minecraft / mount and blade sandbox. Honestly, it's worth the buy the alpha is steady & this game is proving more and more amazing for the future.\n\n", "timestamp_created": 1411404535, "timestamp_updated": 1411404535, "voted_up": true, "votes_up": 285, "votes_funny": 0, "weighted_vote_score": "0.889554738998413086", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "39599716": {"recommendationid": "39599716", "author": {"steamid": "76561197999489810", "num_games_owned": 0, "num_reviews": 60, "playtime_forever": 61174, "playtime_last_two_weeks": 0, "playtime_at_review": 57562, "last_played": 1711238614}, "language": "english", "review": "I have over 900 hours in this game, so I feel qualified to review it.\n\nWhen I first started playing the game, I thought it was fun. You could build houses, buildings, grow crops. cook, make clothes and armor and weapons, raise animals, tame horses and even siege someone else's castle. It felt like it was medieval and feudal.  We even built a small town on our server and every one who played on it would get together and help. We even had community events of jousting, fighting...like a real tournament!\n\nThen something happened.  Greed. Abandonded by the devs for their MMO rendition of this game.\n\nThis game can still be fun, even if somewhat boring after a while. But the lack of support from the developers puts this game in jeopardy. No more development means it will forever be in an unfinished state.\n\nTherefore, I do not recommend this game and if I were looking at it to buy, I would avoid it like the plague. (Which you can get while playing this game.)", "timestamp_created": 1516867177, "timestamp_updated": 1516867523, "voted_up": false, "votes_up": 103, "votes_funny": 10, "weighted_vote_score": "0.889503836631774902", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "15064785": {"recommendationid": "15064785", "author": {"steamid": "76561198009547074", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 598, "playtime_last_two_weeks": 0, "playtime_at_review": 575, "last_played": 1450656000}, "language": "english", "review": "I really love what this game represents. Real feudal life. Hard, unkind, and taking effort to eke out a living. You get to experience struggle. But then, that's where the dream goes horribly wrong. I understand that they had to make concessions with the interface becaue they wanted to keep the servers from getting loaded with crap on the ground and have it crash. But the methods they came up with to deal with that aspect are painful to work around. Please note that *my friend and I played* this game with the server set on default settings. I wasn't solo.\n\nLet's go from the experience of making a house. The first little hut that you can make at the begining. So how would you make a house/hut in real life? Well, first you'd get some tools. Then you'd use the tools to gather the resources. Then you'd use the same tools or other tools to refine said resources. Then finally you'd assemble said refined resources in some fashion to construct the final product. Also I should include the reality of dealing with the terrain by preparing it. This is both an acceptable convention and a logical one. However, the developers of LiF:YO have decided that they wanted to do it their way.\n\nThe LiF:YO way. First you start off by gathering the tool components. I'm with them at this point. You grab some branches, flint, and plant fiber and away you go with your tools. But here's where it gets convoluted. You don't now get to walk up to a tree, small or otherwise, and start smacking it. You have to \"know\" how to cut this tree down. So start learning. So grab some branches off a tree and other things to learn. Ok, you now know how to cut the tree down, but not all trees, because an axe on hardwood works differently than on softwood. Ok, fair enough, there's something there I won't argue with. But now I want to refine the wood into the construction materials. I have the tools, but again, I don't know how to cut a log into planks or construction posts. So to learn this, I pull more branches off trees and grab saplings and peel bark and cut down more trees. So finally I know how to make a log and planks and I get the materials I need to make the house. So I can make the hut right? Wrong. Now I need to go dig a hole in the ground, over and over and over... Why, you ask? Because I need to learn how to construct a house. The skill required to construct this house is called Construction Material Preparation and you need it to a pretty high level. So appearently digging a hole in the ground and dropping the dirt over and over again teach you something about building a hut. But the digging part is only for the prerequisite skill. Once that is high enough, you start digging rocks. But this does not get you the skill you need directly. You must \"refine\" this rock into smooth stone to learn the art of building. Eventually you finally get the skills required to build said hut and can relax with a Mojito on the porch looking into the forest you just razed to build it.\n\nMy other complaint is that what do you do with all the rock and stone and wood that you didn't use up in this endeavor? You can't put it in storage, because that would require nails and stuff that requires iron ore that requires... Ok, I could go on, but the point is, this game requires you to do things that make absolutely no sense to level up without connections to other things that make sense. One last thing. I can respect the fact they don't want a pile of dirt to fit inside a sack that you drop on the ground as your only means of storage early game. But they already broke that convention with the planks and smooth stone and trees that you can stuff in the sack unrealistically. So make up your mind. You can't have it both ways. It's annoying as hell to have to walk away from your work just to dump dirt and rock on the ground while the capenter has filled his sack to the brim with a forest of goodies. Which by the way, if I wanted to give my buddy a rock to make a cooking pot, it can't happen early game. He has to dig his own rock, which also takes grinding a skill.\n\nI should further note that the majority of people currently enjoying this game are bypassing this entire process by using Admin commands. Doing things like creating resource piles of infinite resources because the mining is still broken. This hardly makes the game as epic and good as they are letting on. If you aren't willing to play the game the way it was meant to be played, at least have the decency to note that in a review. Also, if you are bypassing all the \"broken\" content with changed server settings. What does that really say about this game?\n\nTL:DR I feel like in the end, if I play this game I feel I'd make a better use of my time making an actual hut in my backyard out of the same material this game uses in far less time. I also wouldn't have to learn how to swing an axe for each type of tree I want to cut down. I'd like to know how this character made it to adulthood not knowing how to dig holes and catch food. If this is the direction they want to go for the final product, there's no way I can say \"Well done.\" Please rethink the skill tree and material aquisition aspect of this game and I will revisit your fine work. But untill then, I'll be in my backyard finishing my castle.", "timestamp_created": 1427399960, "timestamp_updated": 1429895978, "voted_up": false, "votes_up": 643, "votes_funny": 184, "weighted_vote_score": "0.88272625207901001", "comment_count": 25, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "60081214": {"recommendationid": "60081214", "author": {"steamid": "76561197984726190", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 1878, "playtime_last_two_weeks": 0, "playtime_at_review": 1878, "last_played": 1576344096}, "language": "english", "review": "The game has huge potential as a medieval survival simulator, its extremely realistic and atmospheric, the survival mechanics are honestly pretty spot on, to an extent it feels like you're really there surviving in the wilderness. But all of that vibe falls flat on its face without NPCs, it makes the entire game feel like a waste of time. If they added NPCs that could join your settlement and interact with you, I'd be putting hundreds of hours into this game.", "timestamp_created": 1576694812, "timestamp_updated": 1576694812, "voted_up": false, "votes_up": 80, "votes_funny": 3, "weighted_vote_score": "0.875658273696899414", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "13581203": {"recommendationid": "13581203", "author": {"steamid": "76561197966542494", "num_games_owned": 143, "num_reviews": 3, "playtime_forever": 3307, "playtime_last_two_weeks": 0, "playtime_at_review": 3307, "last_played": 1418968538}, "language": "english", "review": "Picked through dirt for roots to eat for 3 hours and barely stayed alive. Right clicked on an apple tree and picked enough appled in 30 seconds to last me for 2 days. \n\nSpent 4 hours digging a hole to find ore, some guy came along and hit me over the head with a shovel and beat me to death then built a wheel barrow to haul away my ore. \n\nMade myself a shovel then dug a tunnel under someones wall and got into their castle where i proceeded to eat all their food and steal their pants. \n\n11/10", "timestamp_created": 1419477274, "timestamp_updated": 1419477274, "voted_up": true, "votes_up": 784, "votes_funny": 625, "weighted_vote_score": "0.874663889408111572", "comment_count": 18, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19217066": {"recommendationid": "19217066", "author": {"steamid": "76561198113590474", "num_games_owned": 0, "num_reviews": 47, "playtime_forever": 8756, "playtime_last_two_weeks": 0, "playtime_at_review": 8567, "last_played": 1451090950}, "language": "english", "review": "As of writing this one week after its \"commercial release\" I would say that this game is not currently worth the full price they are asking for it simply because it should never have been \"released\" as it is. I waited until they announced it was being released as I want to be able to play the game rather than constantly reporting bugs, however this game is nowhere near in a releasable state. Frankly it is still an Alpha game and every single play session I have entered into leads to yet more bugs and issues that quite frankly leave me frsutrated and enfuriated. Saxxon, the companies modrator on the steam forums, replies to complaints in snarkiness and with sarcasm and constantly compares this \"release\" to that of Fallout 4 because \"that game has bugs too!\" when the fact is that Fallout 4 does have bugs but is still more than playable with minimal stress or concerns whereas I am unable to get through 20 mins of Life is feudal without finding something else which is either broken or was simply half assed in development. This game's \"release\" in no way compare's to Fallout 4, and for that matter I wouldn't compare it to Arkham Knight either which in istelf had a nightmare launch. Frankly, the release of this game is by far the worse PC release I have ever been a part of and what really pains me about that is that the concept of the game in itself is a very good one. \n\nFrankly I am disgusted that the company went straight from Alpha state into \"release\" completely bypassing the bug detecting beta phase and that they then have the ignorance to have someone like Saxxon treat new players concerns with derision because \"well it's not that bad\". They made a business decision to say that this game was finished and releasable and so with that there comes higher expectations as to the actual standard of the game and quality of the gameplay. At the moment this game fails on both fronts simply due to constantly encountering game-breaking bugs when trying to do the most basic of tasks. Do not be fooled into thinking that this game is as polished as other games as it really is not, and even now you are paying to participate in an Alpha even if they have removed that from the description. Be prepared to encounter lots of graphical and gameplay issues and also be prepared to submit a lot of bug reports. \n\nThe real sad thing is that most of the bugs I (and my girlfriend) have encountered are things that should have been fixed in early alpha stages and so it disheartens me a lot to think that the developer now believes the game is adequate for release. It points to the fact that either the Developer is not actually taking note of issues and fixing them, or that the majority of players who particpated in the original Alpha didnt actually start over from scratch and build things for themselves and instead joined ready built servers. I have read a lot of forum posts from players who quite clearly just joined a pre-existing server where things were already built and so they skipped the majority of the grass routes \"find this and build this\" content early on. There really isn't any other explanation for why some of these bugs are still in the game at release. \n\nThere is also a hell of a lot of mis-information on the internet about the actual workings of the game. The Life is Feudal Wiki being one of the main sources as it seems to be rediculously out of date when you try and look things up. This leads you to look for things that it says you need only to later find that you actually don't and that the process has now changed or become more complicated in some fashion. This is very concenring too considering that the company believes that the game was releaseable and yet they can't even be bothered to update their online information source when they make major changes to the game. \n\nI am extremely frustrated and dissapointed by this game simply because the concept in itself is great. I WANT to like this game and I have been forcing myself to play it and to fight through bug after bug to submit the reports to hopefully get them eventually fixed. The problem is that I simply can not morally support a company who force out a turd and then try and tell you that it is chocolate and that it tastes good because someone else's tastes worse. I have read a lot of forum posts in the last week and Saxxon's demeanor has led me to write this honest review. When a company charges people to play an Alpha version of a game, they damn sure need to listen to the feedback they are given and they need to listen to it with a smile as far as I am concerned. We are playing it more to help at this point than for any real enjoyment of our own and so when you read someone dismissing legitimate concerns simply because they can't be bothered to face the reality, it really frustrates me. \n\nRight now in it's current state I do not recommend this game at it's full listing price. If you see it at 50-60% off again (as it was on its launch week) then by all means buy it but do not expect to play it every day unless you are mentally prepared to encounter a lot of bugs. This game is not worth the full price which is a real shame. \n\nI do have hope that eventually they will get the game in a good and playable condition but I am not expecting that to be anytime sooner than 6 months or so from now, maybe even longer. This leaves me very dissapointed that they have considered \"releasing\" the game as they have. I will edit this review as and when issues become fixed and the game becomes playable and enjoyable but for now I would say save your money and wait for a sale. I still have hope that this game has a good future, but right now that future seems far off and my hope is not as high as it once was. \n\nEDIT 1:- Well my initial review was written at approx the 40 hours of game time mark, and now since I have doubled that and am at approx 85 hours, I figured i'd update my review to show if anything has changed. Sadly, It hasn't. The more I play the more I see issues which should have been fixed months ago. The in game systems such as Herbalism or Animal Taming are rediculously bloated and make the game a tedious grind more so than any other game I have played, and to make matters worse because the developers have relied heavily on Random Number Generators for everything in game it actually leads players to argue at how easy/hard things are to complete. What people forget is that because the game randomly assigns all recipes to you in something like Herbology, what works for you will not work for anyone else and so if you find it easy it is because the game has made it so the most common herbs are the important ones where as for everyone else the important herbs are the most rare. There is no definitive \"the game is easy or hard because\" simply because the RNG decides that every time you click create character. The RNG's seem to be everywhere too, such as in taming an animal. I have had one boar that would tame after 5 apples, but then another takes over 50. When you are playing the game as a single or co-op player that is a ton of resources to lose just for a single animal, but the problem is that you have no idea how many you will use until you have used them. Animal taming has many other flaws too such as the idea that you have to chase the animal until it tires itself out which again seems to rely on an RNG as to how long you will have to chase it for. Just today myself and my girlfriend had to chase a horse from dusk one day until the following morning in game and at no point did the horse tire out. It just ran and ran and never stopped. Another major issue is the fact that the animals can run straight through anything that would stop you, so they will literally pass through a tree trunk, stone wall or garden fence whilst you have to run around them. For a game that is supposed to be realistic, more and more I see issues that are simply unrealistic.\n\nMore notes can be found in comments section", "timestamp_created": 1448206369, "timestamp_updated": 1450825872, "voted_up": false, "votes_up": 735, "votes_funny": 39, "weighted_vote_score": "0.861941814422607422", "comment_count": 122, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1460414760, "developer_response": "We would love to hear back from the reviewer considering over 95% of issues with the game at launch he was concerned about have been addressed. New bugs and issues pop up but are dealt with as quickly as possible. Hopefully the reviewer will be able to update his review. \n\nWe deeply appreciate everyone understanding the issues at launch and glad to see the majority of the bigger issues solved. The team wants to thank everyone for their awesome support and we hope you are enjoying the game.\n\nIt seems you are still having issues. When I saw your playtime of almost 140 hours after your review I assumed many of the issues for you were addressed as with many other players issues.\n\nWe do not manage that wiki and was setup by users of the game (actually I believe there are 2 or 3 of those wikis). We did upgrade our ingame tutorial system that walks all new players through the basics of getting started.\n\nOur communication and interaction with the community can clearly been seen throughout the forums as all of our posts are clearly marked. We have made excellent progress throughout early access and release, we hope you check back from time to time on progress as bugs are fixed and new features added. \n\n"}, "14000529": {"recommendationid": "14000529", "author": {"steamid": "76561198079201368", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 26253, "playtime_last_two_weeks": 0, "playtime_at_review": 24756, "last_played": 1423355012}, "language": "english", "review": "After 400 hours of playtime, I think i can inform others about the game. First of it all: It's still an alpha, but the most developed one I've ever played. Combine Minecraft with War of the Roses, and you got your game. The game is, although some mechanics are highly repetetive, very addicting. It's not a game for a few hours a month and without the necessary endurance you will give up soon. If you like crafting, fighting and role-playing with other human beings, then get it and check it out. Otherwise: Don't.\n\nOn the positive side you got very good graphics, a great variety of armor and weapons you can choose from and a crafting system that highly supports team gaming. You got a lot of different building, the map is large enough for 64 players and every 2-3 weeks comes an update. The sound is ok, as long as you don't put tanning tubs aside your house..\nThe skill system is fair and interesting, because on most servers you can only skill 1-2 skilltrees to the max, and it is possible to deskill every time. It is like in Skyrim: With doing certain things, you get better at doing so and with rising skill level there are some other options you unlock. The fighting system is a bit sloppy, but also very detailed. For example: The damage you get from an opponent is the result of the weapon you use, the skill of your weapon, the armorskill of your enemy, the location of the hitbox where you hit and if your enemy is defending with a shield or not. Conclusion: Good mechanics, very high potential overall.\n\nOn the bad side you have no game-goals, quests or whatever. Your experience with the game will highly depend on the server you play on, considering if your serveradmins are fair or not and how other players fashion their role on the server. The first time, of course, you will be motivated by building your town with others and learn how to work, but after your village or castle is built, you have no other option then to fight and roleplay.\n\nConsidering this, there are also some broken mechanics that must be fixed soon: Since every digged tunnel on the server delays the login time of the players, it is impossible to run a 64 player server over a long time without getting a slow server. Some players on my server have login times beyond 6 or 7 minutes, and when you come to that point it will be extremly hard to get new players to join your server. Others may quit due to this and.. you get the idea, over a longer time your server will get more and more abandoned. There are some fixes to this, but nothing official is implemented yet, a server wipe is in most cases the only solution to get a fresh and playable server.\n\nAnother problem is the erasing of buildings: Once built, you cannot deconstruct anything without admin help. This is also highly annoying, because you have to plan really good before building your own town.\n\nSo, my conclusion: Don't start this game alone, pick one or two of your friends, start an own server to test things until you feel ready to play on a bigger server. Try to get to a server with active and friendly admins. You may wait until the tunnel-digging is fixed, but if you like crafting & boxing bears, then give it a try.", "timestamp_created": 1421359166, "timestamp_updated": 1421363230, "voted_up": true, "votes_up": 96, "votes_funny": 4, "weighted_vote_score": "0.858622074127197266", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "29701637": {"recommendationid": "29701637", "author": {"steamid": "76561198056449434", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 52198, "playtime_last_two_weeks": 0, "playtime_at_review": 51060, "last_played": 1530379664}, "language": "english", "review": "I absolutley love this game but I can not recommend it.\n\nLife is Feudal is a hardcore sandbox game where you can terraform the landscape, build awesome villages, craft to your hearts content, and pvp with other players.\n\nI have many reasons why I can not recommend this game. Number one reason is if you have any life outside of gaming whatsoever you will eventually find out that you cannot keep up with the game unless you have a giant group of players who cordinate times etc. I was thankfully in a awesome group of almost 30 people and we were able to complete a full castle village. It took every single one of us 3 weeks and 8-10 hours a day some more for a combined low estimate of 4,536 hours just to complete to castle walls ( a week later the server was crippled by a bug a thus needed wiped), You have to have multiple people farming to see any decent kind of harvest, every building is pre fab, animals have some of the worst coding, you will find yourself standing over a pig with a axe hitting it 50 times just to down it, horse riding is badly coded, terraforming which is the best in any game I have played is the most tedious non fun thing you can possible imagine doing, if you could put you dirt into piles like Wurm it would still be tedious but a thousand times better. The devs are money greedy and have been scheming ways to make money in there beta which was originally promised to backers and early buyers, I would rather have polished content, optimization, and more stuff to craft than better lighting, grass graphics and such. Pvp encounters are lacking whether your winning or losing. My group had one pvp encounter that was fun, it was pre planned and before they added land claims both teams were back and forth seiging each others fortifications. Singleplayer blows and is basically non existant.\n\n I heard something about instanced battles and I have to say I feel that is a terrbile idea, put in instanced pvp and you cripple open world pvp.\n\nI believe this game can come on top though if good changes are made though I am highly doubtful this will happen.\nEven though I am not recommending this game I will probably put another 500hrs, it is addictive and I love sandbox games.", "timestamp_created": 1486237960, "timestamp_updated": 1486243896, "voted_up": false, "votes_up": 93, "votes_funny": 4, "weighted_vote_score": "0.856992483139038086", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "12757954": {"recommendationid": "12757954", "author": {"steamid": "76561198024338461", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 8869, "playtime_last_two_weeks": 0, "playtime_at_review": 8022, "last_played": 1475724104}, "language": "english", "review": "Life is indeed Feudal, but unfortunately this game is futile.\n\nAt the time of purchase, this game was advertised as Life is Feudal, then they made a hard right turn and shut down their original servers used for testing the MMO of this game and repurposed it for \"Your Own\", a small 3kmx3km island that resembles RUST only that it is set to a medieval time scale. The game promised group oriented combat and large group vs large group sieges to claim land and castles of such grand scale that it truly did blow everything else out of the water, including the Persistent World mod for Mount and Blade.\n\nAfter the game's EA release here on steam it was clear that they were completely derailing from their original intent of the MMO, and sought to make some extra cash. That's wonderful and all, but the simple fact that they openly said, \" We're looking to fund LiF:MMO with all the money we earn from LiF:YO...\" makes this game dangle ever so slightly over the toilet that snaps at it with hungry jaws.\n\nThe marketing idea is flawed, fine, maybe the game is good enough to overcompensate.\n\nLet's look at some of the keystones for the game:\n\nBuilt with Torque 3D ( HEAVILY modified)- While this engine looks decent enough, it's not even capable of handing a 16 player server with minimal terraforming, the rigging is so clunky that most of the hit boxes actually twist with the character's movement, which translates into mangled hitboxes that are impossible to land hits on when you can clearly see the head of your hammer or the blade of your sword going through the body of the other player.\n\nBi Weekly Updates- While the updates seem frequent enough, the content that is updated is more of a \"hotfix\" nature and not an actual Update to the game or its content.\n\nDeveloper presence- The presence of the Devs is definetly felt, they seem to be making a good bit of appearances on the forums both in Steam and in their own bug tracker. This could be both bad and good, as the more time they spent scrolling through the forums.. the less time they spent fixing the heavily modified game engine that requires a lot of love due to the fact that the engine is not designed for such a game, even with modding... it's limitations are clearly visible.\n\nTerraforming- The trailer made it look sweet right? Well... unless you dig a tunnel in a straight line then you need to expect gapping holes in the world that will cause you to fall beneath the playerworld and into a vast underground sea. The other side of terraforming, which doesn't involve mining, is almost a death sentence to the server. Get a group of friends to terraform your lands so you can properly build your kingdom and you'll increase the time it takes to load into a server by 10-30 minutes. The more you change, the longer it takes for the server to give you the files as it seems to be replacing ALL the local files with modded files from the server.\n\nBuilding- You can't do it alone unless you crank up the skill cap and become the God of All Skills. The only way to enjoy the game is to do so with atleast 3+ friends on a server that has skillcap/harvesting/growthtime all cranked up, and even then it will take days to complete small projects.\n\nOnline play- I can only consider this an option if I'm part of a private server, as the game does little to nothing to stop griefing. Between folks digging unrepairable tunnels throughout your village, to people deconstructing your homes and putting unremoveable campfires in their wake. This game's Troll factor reaches that of RUST, minus the hacking... they did a good job of preventing that by keeping ALL files server sided.\n\nServers- So, this is the fun part. Even a high end server can barely run this game without hourly spikes of lag that have been dubbed, \" Morning lag\" due to the obsurb amount of trees and plant growth that all require 2-4 calls to the database before updating. Each time you change a value, the client requests information from the database and the database requests information from the client... multiple times for the same change.\n\nInventory- If you have OCD, step away. The inventory bags are nothing more than visual vomit. You COULD take an hour to organize the herbalist bag of yours... but your friend will still see visual vomit when he opens it, due to all inventory placement being clientsided.\n\n\n\nThere are countless other issues that arise when you talk about the keystone features of the game, and I understand it's an embryotic alpha, damn near a tech demo, BUT.... the icing on this wonderful cake is the fact that the game doesn't properly used your video drivers as NONE of the video display adapter profiles are implemented into the game yet... want some more sweetness? a 16gb rig still gets  \"Out of Memory\" errors from playing the game for less than 5 minutes.\n\n\n\nLast but not least, the bug tracker for this game is a mile and a half long, and seems to be at a stand still.\n\n\nOverall, 2/10 but 7/10 when played with friends.\nWould not recommend.\nThis is my first review, enjoy.", "timestamp_created": 1414995808, "timestamp_updated": 1414995808, "voted_up": false, "votes_up": 453, "votes_funny": 1, "weighted_vote_score": "0.855460703372955322", "comment_count": 23, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "13744460": {"recommendationid": "13744460", "author": {"steamid": "76561198025027992", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 2855, "playtime_last_two_weeks": 0, "playtime_at_review": 2809, "last_played": 1458447563}, "language": "english", "review": "Upon returning to our base, my friends and I discovered a man wearing a royal helmet rummaging through our things.\n\nHe claimed to be friendly.\n\nWe claimed to be friendly.\n\nNow we have a cool helmet.", "timestamp_created": 1420055109, "timestamp_updated": 1420055109, "voted_up": true, "votes_up": 527, "votes_funny": 987, "weighted_vote_score": "0.853696584701538086", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "14296889": {"recommendationid": "14296889", "author": {"steamid": "76561198056645320", "num_games_owned": 0, "num_reviews": 24, "playtime_forever": 18351, "playtime_last_two_weeks": 0, "playtime_at_review": 3869, "last_played": 1510936153}, "language": "english", "review": "I did not have the option of clicking the \"Maybe\" option.  A very interesting game but...\n\nKeeping in mind that it is just a pre Alpha and very buggy I will limit my comments to gameplay and not stability and such.\n\nThe world is detailed and beautiful.  The crafting system is deep and satisfying.  As many others have said it can be a bit grindy but not in a bad way.  I felt a real sense of accomplishment when I built my first shack and began setting up my first base of operations.\n\nJust as I felt I was getting somewhere a 12 year old punk ran up to me, called my mother a bad name and smacked me with a shovel knocking me out and taking all of my hard won stuff.\n\nI tried three different servers over a few weeks and the results were the same.  Just when you feel you are getting somewhere some  rag wearing peasants show up, kill you for sport and take all your stuff, over and over.  Currently, there is no way to protect yourself from being completed looted until you can build a warehouse which takes a significant amount of skill accumulation and materials.  If you don't log in to the server for a few days even those locked items can be freely looted by anyone.\n\nThe mantra is \"Life is Feudal it is supposed to be tough.\" Well, feudal life was not full of phsycopathic 12 year olds that kill and loot you for sport with no repercussions.  At the moment the 'penalties' for kiling players are largely ineffective and once you acquire something worth having you can expect to be killed/robbed every few hours of gameplay.\n\nIf you can get on a server when it first starts you will have a huge technology advantage over anyone that comes later and if you can make friends and work together you will be alright.  If you are a latecomer then God help you.  You will be farmed over and over.  The player turnover on every server I have played is very high and the servers quickly become full of empty shacks and half built structures.  No wonder most the servers are dead or go through frequent wipes.\n\nI really want to love this game.  There is a ton going for it  but the constant ganking/zerging/ glitching (its in alpha, lots of glitches) make the game very frustrating.    I give the game a  MAYBE because it could be great but it is not at the moment.  And $40 to play test an unfinished game is more than a little too pricey.", "timestamp_created": 1422889863, "timestamp_updated": 1422889863, "voted_up": true, "votes_up": 93, "votes_funny": 12, "weighted_vote_score": "0.853553891181945801", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "16316335": {"recommendationid": "16316335", "author": {"steamid": "76561197994796022", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 77489, "playtime_last_two_weeks": 0, "playtime_at_review": 65073, "last_played": 1610998146}, "language": "english", "review": "Edit 3: 1100 hours.  GM a server now.  Where'd my life go?  Can't wait for the MMO.\nEdit2: 700 hours in.  Woah. \nEdit: 300+ hours in.  Still great.  \n\nI'm writing this review because some negative reviews led to me almost not buying it.  I am sincerely glad that I did.  This is the game that I've always wanted.\n\nLet me tell you about my first night on LiF.  I logged into an RP server and was almost  instantly greeted by experienced players who were not only willing to help me with every question that I had - but also fillled me in on all the political happenings that were revelant to that evening.  the community, if nothing else, makes this game worth playing.\n\nBefore I knew it, they outfitted me with a basic sling and some sling ammo and I was marching off to battle.  We arrived through the woods to a small fort in the north which seemed relatively empty - I was disappointed at first: This was it?  Little did we know that the enemy was crouching behind their walls equipped with heavy plated armor and bowmen galore.  After about 20 minutes, two concussions, an arrow through the chest, and general astoundment that I was still alive - I heard that the enemy king was knocked unconscious and his nobles lay dead around him.  Opposed to killing the enemy king, our king inisisted that we let him regain consciousness so he could role play his reaction to the embarassing defeat. \n\nWhile waiting patiently around him, celebrating our clear victory, we were ambushed by almost a dozen of the fallen king's allies from the west.  They streamed in behind us and we fled with our tails behind our legs.  By the time we hobbled back home, bloodied and broken, we had only lost one ally - a clear victory if you ask me! \n\nSince then, peace has been negotiated and I've decided to make a pacifist character. - dedicating  my time to building a religious school on top of a mountain.  That's the best part of this game, you can literally do whatever you want.  Want to be a cook? Someone needs you in their guild.  Want to be a warrior? Someone wants you for their realm.  Want to dedicate your time to stacking wood, mining deep into a mountain, watching wheat grow? Well, you're probably going to have to do it anyway. \n\nAdmittedly, I've only been playing LiF for 15 hours (and that is not much for this game!) but i felt like it was my duty to defend it at least a little bit.  \n\nYes this game is still in development, yes there are many features that haven't been implemented yet.  But I promise you that if you connect with the right people in-game then its not something you will regret contributing to.  There's a steep learning curve but once you get a hang of it everythings really intuitive and well thought out.  I can't wait for final release.", "timestamp_created": 1434064022, "timestamp_updated": 1485973832, "voted_up": true, "votes_up": 96, "votes_funny": 9, "weighted_vote_score": "0.85199970006942749", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "19133396": {"recommendationid": "19133396", "author": {"steamid": "76561197964538085", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 42686, "playtime_last_two_weeks": 0, "playtime_at_review": 4100, "last_played": 1495594666}, "language": "english", "review": "Life is Feudal is a complex sandbox box, with a very open world. For those of you that remember it, it's VERY akin to the old Star Wars Galaxies (pre NGE)\n\nPro's:\n-Complex Crafting system.\n-Fantastic system to socialize, as it is impossible to pick up every skill\n-Complex skil system that allows you to try new things, grow into new skills, and forget them if you don't like them.\n-Fantastic challenge rating for skills: Easy to pick up, time consuming to master. You can grow, loot, and craft high quality materials.\n-Great graphics. Really nice visuals on higher settings.\n-Terraforming: Push over minecraft, you can literally level landscapes, dig siege tunnels, and build ramps. Or just flatten terrain so you can build a city!\n-City building: Akin to SWG, you can drop down pre-generated structures, tools, build roads, claim ownership.\n-Nothing is worth doing that doesn't take time to do: This whole game takes time. It's not a fast paced, get your guns in a day and rule the world. BUT... it is fantastic, and well conceptually well designed.\n\nPro&Con:\n-This is an MMO Sandbox. It is what you, and others make out of it. If you want to be a trader or bar keep, you can actually craft resources, make food, sell high quality foods, trade for better resources, and even pray for absolution from your sins. However, for every peaceful choice you make, someone out there will want to be a rampaging psychopath that will run into your shop and wreak everything...\n\nCons:\n-Right-click-simulator: The game is fantastically in-deptch, but in order to make it EASY to manage, it uses a right-click system. Where you end up openning that menu... A LOT.\n-It doesn't like it when you alt+tab. Seems to work better on windows 10.\n\nTLDR:\nThis game is a fantastic open world complex to the likes of SWG Original Release. It's got a deep crafting system and really encourages social play. So build your character, find new people, and start carving up your plot of land! Because this IS the sandbox game you've been looking for!", "timestamp_created": 1447786421, "timestamp_updated": 1447786421, "voted_up": true, "votes_up": 253, "votes_funny": 19, "weighted_vote_score": "0.849342942237854004", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "39314856": {"recommendationid": "39314856", "author": {"steamid": "76561198052410758", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 244615, "playtime_last_two_weeks": 0, "playtime_at_review": 147911, "last_played": 1672838607}, "language": "english", "review": "Im going to offer an objective review of the game in notation format. \n\n-Started playing LiF is feudal in 2014. I own 3 copies of the game, and have 2 charcaters on the MMO on 1 account(try that for transparency). The sandbox that was offered was very basic, but had amazing development potential, based on the fundamentals of game play; Terraforming/Digging, quality system, realistic PvP, no fantasy nonsense. \n\nThe dev team eventually added in seige equipment, horses, horse pulled carts etc\nUnfortunately certain models such as the lumber mill, border monuments and a series of other half implemented ideas were removed without any explaination or replacement(not that they worked anyways). \n\nWhile the dev team was quick on their toes to address in game issues with game-play-out, the choice they made were half measures. Problems such as increased load times due to tunneling or extreme terraforming, Repetative sound gliches tied to a specific area(youll hear a sound on repeat in the area thats bugged). Duping or losing items during heavy server loads, massive morning lag due to compiled processes being forced through the line. \n\n-The movement in the game is half-terrestrial, in where you jump, gain a helpless debuff and then proceed to defy gravity in a slow-motion decent humping an invisible beach ball. This translates like shyt in pvp. There is no crouching(wtf), there is no straffing(wtf). Where the nav map/terraforming come in, many groups create terraces which funnel movement through choke points. Did I mention theres no climbing either?\n\n****Dear Bobik, build a fvcking seige ladder. Stop changing container drop permissions back and forth demonstrating you dont know how to fix the problem. Places wont have the lag, the place wont look like a wallgreens/Leons and people that dont play the game can stop asking why people are decorating the outside of their keep walls with wooden furniture.****\n\n****Dear Saxxon, confirmation on you deleting posts based on your patheticly biased administration position. Stop now.\nSilencing people on forums based on your subjective oppinion as a dev is frankly pathetic and I wouldnt be surprised if you incur several maliscious attempts against your home machine(because thats what people do right? after all you deleted their posts). This is not a threat from me to you by any means, but you're teasing fire on the internet by erasing peoples concerned posts, youre in a beta, suck it up. You can control your forums and somewhat Steam, but you cant control Youtube or other advertisment methods......do you understand yet? \n\n- https://i.imgur.com/zaai4hS.jpg\n- https://i.imgur.com/SF3Kbza.jpg\n\nNo this wasnt me getting banned either it was a friend whos \"was\" paying your wage.\n\n\nSo lets get down to the meat of the potatos, the MMO, yeah we havent even delved into the issues that plague the community. In hopes you read my notations, you clue the fvck in, all synapse go;\n\n- Regular scheduled downtime.........like every other MMO\n\n- DISABLE THE FVCKING CONSOLE < OH GOD WHY CAN PEOPLE RUN SCRIPTS??!?!?! WHAT ARE YOU DOING?!?!?! -\n\n- Stop making more servers, this isnt YO, Buy more hardware and do more admin supporting the single instance world. Make this the EVE of the medieval world, or descend into blither.\n\n- Your skins are average design, the price is -greedily-fvcking- rediculous. I did how ever buy a outfit skin to support your cause.\n  - More skins.....lower price..CSGO it.....\n\nNOTE: most of the above is where youve spent your admin time, reevaluate plxthx. I will review you again in a few months. I would hope these issues have resolved themselves.\n\nAlso, the NA is NOT your testing ground, its currently holding your paycheque so play nice kids.", "timestamp_created": 1515864069, "timestamp_updated": 1515871138, "voted_up": true, "votes_up": 101, "votes_funny": 14, "weighted_vote_score": "0.847518563270568848", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "20422298": {"recommendationid": "20422298", "author": {"steamid": "76561198044677472", "num_games_owned": 217, "num_reviews": 13, "playtime_forever": 61101, "playtime_last_two_weeks": 0, "playtime_at_review": 13253, "last_played": 1589221734}, "language": "english", "review": "I began my life as a simple peasant with no particular skill. I woke up on the shore of an island and soon found my place in the world with a small tribe that will one day be called the Southern Veil. We become allies with the neighboring town of the Sweetcottons before we are even able to erect a palisade wall. Soon after we gain these close allies we are rode upon by members of a place called Killian's Keep. They tell us that we must pay them a tax of straw. We refuse and militarize ourselves. \n\nNot soon after the taxes are imposed we erect a wall around our small settlement. I become the town blacksmith and I am known as one of the most skilled blacksmiths of the land. We then begin construction of a wooden keep surrounded by stone walls. Once these walls are complete we are invaded by the Huns. They used our wooden walls as cover from the arrows fired from our stone walls and soon created a ladder over our wall and slaughtered us. This was not the end.\n\nWe grew larger, gained another close ally known as Ciderwood, and began to raid them back. We first struck Killian's Keep, coming in through a weak point in their wall and killing masses of them, then we come back again and again and we successfully slaughter them every time. Every time we raid the Huns they are never home so we wait and slaughter them every time they attack us or one of our allies. \n\nNow we are a huge militarized force with all of our allies only a moment's notice away from aiding us in combat, and we are the same for them. . . I began as a peasant and am now a warrior. Life is Feudal\n\n10/10 would blacksmith again", "timestamp_created": 1452350195, "timestamp_updated": 1452350195, "voted_up": true, "votes_up": 213, "votes_funny": 81, "weighted_vote_score": "0.841466546058654785", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "26345637": {"recommendationid": "26345637", "author": {"steamid": "76561197986984038", "num_games_owned": 806, "num_reviews": 22, "playtime_forever": 54840, "playtime_last_two_weeks": 0, "playtime_at_review": 26939, "last_played": 1520600282}, "language": "english", "review": "It is very hard to create a proper review of this game, as your experience may be completely different from mine. It really depends of the server you'll settle in.\n\nI have been : \n- co-leader of a small village, part time soldier for the king\n- second in command of an entire kingdom after my friend seized the throne by cunning and diplomacy\nAnd done :\n- building, farming, crafting, terraforming, hunting...\n- fighting PVP as archer in both field battles and sieges, and also militiaman against raiders\n- organizing a guild, recruiting new members, dealing with bullshit situations\n- A lot of Roleplay involving weddings, meetings, diplomacy, wars and back-stabbing.\n\nPROS\n- A very nice medieval atmosphere. Realistic, yet fun.\n- You'll meet awesome people (and assholes, but that's the case in every online game)\n- Recommended for Roleplayers and adepts of politics/diplomacy : if you choose the right server it could be an amazing experience. It definitely felt  like a Game of Thrones ! \n- Building your city is more than just it looks (posing blocks), you need some creativity to make it beautiful.\n- Addictive.\n- Gameplay combat is better than most survival games...\n\nCONS\n- ... but combat is mediocre compared to mount & blade.\n- PVE aspect is non existent.\n- PVP is sometimes unbalanced (poisons, some weapons...)\n- Performances sometimes suck, and especially during massive battles.\n- Devs focus on MMO and do not fix bugs of LFYO as fast as they should.\n- Requires a lot of farming. bring your friends ! Definitely not a solo player game or someone with short gameplay time.\n- Shitty admins are legions, abusing power or simply not enforcing rules. Unfortunately there is little players can do other than leaving and trying another server.\n- Servers lifespan are on average one to three months : don't expect to have anykind of \"persistant\" cities, and be prepared to start over again a lot.\n\nConclusion : if you find a good server with a nice admin, then this game is amazing. If you don't, it sucks.\n\nFOR :\n- fans of middle-ages \n- fans of RP and backstabbing diplomacy\n- fans of... farming stuff and building stuff.\n- fans of medieval warfare that do not mind some bad performance.\n\nNOT FOR THOSE LOOKING :\n- for a survival game. It is not.\n- for a quick experience or a solo game : you need to spend a lot of time on the game\n- for PVE : there is no real danger from beasts after a while and fighting  them is not interesting. The true aspect of the game revolves in Building/PVP/RP", "timestamp_created": 1477957236, "timestamp_updated": 1477958094, "voted_up": true, "votes_up": 84, "votes_funny": 0, "weighted_vote_score": "0.840913236141204834", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "45306623": {"recommendationid": "45306623", "author": {"steamid": "76561198002663428", "num_games_owned": 170, "num_reviews": 4, "playtime_forever": 107718, "playtime_last_two_weeks": 0, "playtime_at_review": 102169, "last_played": 1485609024}, "language": "english", "review": "Things went as most people predicted and the devs abandoned YourOwn. when the MMO came, even though they said they wouldn't. Every cent is spent on the MMO, which is in their right. They want the players to play the MMO, but it turns out that the players prefers YourOwn. Not that the devs gives a flying toss about that, they have never listened to the community anyway. So we end up with two games that almost nobody plays, both with unfullfilled potensial. Have the devs paid attention they would have noticed that the playerbase for YourOwn is greater that that of the MMO. They may not like it as the MMO was their main goal, but if you can't adapt and change you fail. So I am sorry to say that Life is Feudal: You're dead.", "timestamp_created": 1539765673, "timestamp_updated": 1539765821, "voted_up": false, "votes_up": 98, "votes_funny": 5, "weighted_vote_score": "0.83822023868560791", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "19574605": {"recommendationid": "19574605", "author": {"steamid": "76561198018351647", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 5725, "playtime_last_two_weeks": 0, "playtime_at_review": 4564, "last_played": 1451544061}, "language": "english", "review": "Pros\nFull Loot ( Feels very much like the same feeling I got from the late great Ultima Online ) \nGraphics are stunning . ( need a nice gpu tho... I have gtx 980ti )\nMusic is very medievally. \nCombat is slow paced which is a good thing ( meaning people dont warp around and it aint a mad crazy swinging fit of spinning forward and backward not knowing if your hitting ur enemy i.e )\nCrafting is well thought out. A nice balance of grind/reward ( IF YOU MAKE SURE YOU SELECT THE RIGHT SERVER FOR YOUR TASTES. Certain servers will have skill gains faster)\nIts a great medieval Simulation. \n\nCons\nSTEEP LEARNING CURVE ( YOUR FIRST ACT SHOULD BE WATCHING YOUTUBE TUTORIALS and the INGAME HELP MENU)\nA big buggy still\nSkill gain and crafting can be and will be a bit tedius. Thats why i recommend a server of AT LEAST 5.0x skill gain. And at least 1000 skills points so you dont have to locate 10 other people to help you build items. ( just my preference , some people might like having to haggle and deal with people all the time)\nSometimes the game CTDs. \n\nOverall ... I love the game. One of the best games I've played in 10 or 15 years. Id buy it for 60 bucks. Its that good\n\nBut to each is own. If you like building and medieval combat this game is the one.", "timestamp_created": 1449619105, "timestamp_updated": 1449619105, "voted_up": true, "votes_up": 128, "votes_funny": 12, "weighted_vote_score": "0.834520936012268066", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "14722083": {"recommendationid": "14722083", "author": {"steamid": "76561198046871782", "num_games_owned": 76, "num_reviews": 2, "playtime_forever": 38249, "playtime_last_two_weeks": 0, "playtime_at_review": 37731, "last_played": 1423667161}, "language": "english", "review": "[b] M&B, Chivalry, War of the Roses/Vikings players - READ THIS FIRST [/b]\n\nI loved this game, and i can honestly say i got my moneys worth. It has a fleshed out crafting/skill system and on that side of things, it's going in the right direction. But i bought this game and played 600+ hours because i read their website Game Info under  [url=http://lifeisfeudal.com/Life-is-Feudal-like] LiF is Like... [/url] which STATES: \n\n[b] \"LiF is... like Mount&Blade Series in terms of melee, ranged and mounted targetless physics based combat\" [/b]\n\nSo I've spent a lot of time in this game waiting for the combat to be polished/worked on to actually even have a proper parry/blocking system like they promised. However, after an official reply from the moderators a couple of days ago in the official forums to outcries of people wanting a parry system to be implemented, this is what was stated by the moderator:\n\n[b] \"2. We want to go our own way. We want to WEAKEN player reaction and player ping component, by removing directional parrying.\" [/b]\n\nSo basically, if you're a big M&B fan, or even Chivalry/WotR/WotV - you will cringe at the combat in this game like i did. It is only 60% complete which is fine, but their intention is to let this game be a slash-fest using combo's and the first person to lose all their health dies. Does that sound like M&B to you? They have no intention of ever allowing \"skilled twitch fighting\" to be a part of this game because, and again i quote \n\n[b] \"we want to do something new, not just blindly copy some cookie cutting mechanics that some of players got used to and trying to push\" [/b]\n\nWell i wish they had said that on their website instead of misleading the public. So this game gets a \"no\" from me.", "timestamp_created": 1425289065, "timestamp_updated": 1425289745, "voted_up": false, "votes_up": 684, "votes_funny": 31, "weighted_vote_score": "0.834373831748962402", "comment_count": 87, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1426794007, "developer_response": "We are glad to see you have enjoyed the game so far. We also would like to remind you and any other readers that the game is still in active development meaning that the combat system has not yet been fully implemented much less balanced based on testing, player feedback and also final polish before the scheduled September 2015 release date."}, "40620506": {"recommendationid": "40620506", "author": {"steamid": "76561198075810550", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 37093, "playtime_last_two_weeks": 0, "playtime_at_review": 36816, "last_played": 1520604847}, "language": "english", "review": "I am torn. LIFYO definately made an impression on me when I started playing. I loved it! This game is not for everyone, thats for sure. It's a grind fest, and to be honest, for some, it can be quite boring especially if you play alone. In order to really enjoy the game, you must play on a good server. With friendly, helpful people. I was lucky to find a remakable PVE server when I started and I had a blast. It wasn't just the game that I had fun with, I was in a great community with kind people which really made it for me. \n\nEventually,  I started to realize that once you hit a certain point in the game, and want to start building bigger, there isnt many options. I like to design my own structures and LIFYO doesn't have that. You lay down Pre-fab buildings and  basically everyone's place looks the same. To some that may not matter, but it did to me, because I like to create and be original. \n\nAnyways, it's obvious that the game was abandoned by the developers to work on the LIF MMO. Once you build this massive castle which takes a lot of materials, and time you really don't have anything to put in it. There is a very limited amount of things to make to decorate. \nAfter a while, it became apparent that this game is meant to be played PVP to really utilize the castles, keeps, combat, armor, weapon, war/ horse training, and siege engineer skill trees, to get the most out of it. There are things for PVE players that will keep the player busy for a while, but eventually the PVE player sorta hits a dead end. \n\nI do not regret the time or money I spent. It is my style of game and I love so many things about it. I just wish that the developers would pay attention ( Just a little.) to the dedicated LIFYO community they have and work on it more, by doing occasional updates and adding things for them too. As far as I know, there hasn't been an update in a very long time, and knowing that, I sadly had to drop it and leave. Hopefully one day, The developers will add more content, but until then, I cannot dedicate any more game time to LIFYO.", "timestamp_created": 1520388373, "timestamp_updated": 1520392185, "voted_up": true, "votes_up": 52, "votes_funny": 1, "weighted_vote_score": "0.834096670150756836", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "73444298": {"recommendationid": "73444298", "author": {"steamid": "76561198021354995", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 293107, "playtime_last_two_weeks": 0, "playtime_at_review": 293061, "last_played": 1601262668}, "language": "english", "review": "Been close to 2 years since an update (Sept 2018), safe to say now this was just the Devs test for the MMO and it wont be seeing much love going further.", "timestamp_created": 1595989436, "timestamp_updated": 1595989436, "voted_up": false, "votes_up": 79, "votes_funny": 1, "weighted_vote_score": "0.833328366279602051", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "13177899": {"recommendationid": "13177899", "author": {"steamid": "76561198055981747", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 2075, "playtime_last_two_weeks": 0, "playtime_at_review": 2074, "last_played": 1419629252}, "language": "english", "review": "There are some things about LiF that are really neat: the crafting, the graphics. Building your own medieval town is really such a wonderful idea and I was eyeing this game for ages.\n\nBut as a single player (and this game is being marketed for single players as well as multiple), this game has been nothing but a disappointment.\n\n- For solo players, the grind is really the only thing there is. There's no danger and no purpose really to play: any wildlife that may attack you is easily avoidable. There are no other mobs. I had read before purchase of intentions to create quests and mobs, but it seems that those ideas have been abandoned in favour of keeping LiF:YO as a game that relies entirely on PvP for non-crafting content.\n\n- The grind is real. It took me over thirty RL hours to flatten the land and collect the mats I needed to build a small shack. This was after tweaking settings so I could have a chance in hell of creating anything on my own. As much as I love crafting, it's going to take absurd amount of time -- hundreds and hundreds of hours -- to build anything. But with no danger present in the world, there's no purpose to build other than aesthetics.\n\n- Some of the cool features in the LiF video are -only available for the MMO-. This is not the MMO. There are no crafting games here. The island you get is small and not likely to get bigger. No quests planned. The only thing in the world is you. And the tedious grind of creation.\n\n- Speaking of the MMO, that's where the devs are focused. Buying LiF: YO isn't giving you a version of the MMO: it's giving you the redheaded stepchild of the family. It's sickly, underdeveloped, and simply not getting any of the attention that they are lavishing on its brother. Reading the official forums makes it clear that this isn't likely to change. (Seriously. Go look at the list about the differences between YO and the MMO. You may find that the feature you're purchasing this for doesn't exist in the YO version.)\n\nDon't get me wrong. I really want to like this game. I'll keep my eyes on it and see if maybe the devs have a change of heart about the PVP-only content. But LiF is too much effort for very little pay off. Even if you are a solo player -- especially, even -- I'd highly suggest you wait for the MMO when it comes out.\n\nIf it comes out.", "timestamp_created": 1417424292, "timestamp_updated": 1417424292, "voted_up": false, "votes_up": 1007, "votes_funny": 1, "weighted_vote_score": "0.832830607891082764", "comment_count": 60, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "16241046": {"recommendationid": "16241046", "author": {"steamid": "76561197983409609", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 2553, "playtime_last_two_weeks": 0, "playtime_at_review": 1651, "last_played": 1455490617}, "language": "english", "review": "**********************\nEdit\nAfter the developer response i thought i'd give the game another run through. \nI tried to keep an open mind, especially (and surprisingly) now the game has left Early Access; and visually i thought it was much better. \n\nHowever - after spending 15 minutes fine tuning myself in the updated character creator while joining a server, i received the message \"you cannot use this name\". This happened twice, until i went with the default character with the name \"ILBAsdbasd askdjsjjs\" of which the game was much happier to allow.\n\nAnyway; I walked around, there were several frame rate drops that were temporary but nothing bad. A lot of effort has indeed been put into the aesthetic with a much more streamlined UI.\n\nI managed to squeeze in another 5 minutes before:\n \"Life is Feudal encountered an error and needs to close down\"\n\nMy breif edit and response to Saxxon is as follows.\n\nI was highly surprised before even starting the game that you made the decision to leave Early Access. The game runs smoother, i did notice.. However i was able to play even LESS of your game than i was back in June. \nRegarding the comment about my issues being with the servers and \"not the game itself\".\nI can't understand how that salvages anything. The game is only accessible through these servers, especially for new players. \nHowever you are correct and many of the issues i originally encountered have been fixed. \nBut if i bought this game now, in \"release version\" and was unable to play due to the crash i wouldn't really give a flying **** about mining a tunnel.\n\n************************************\n\nOriginal Review:\n\nAfter spending nearly 40 hours trying to get myself started on this game (over the course of 2015) i've just had to give up!\n\nHere's one example. To build a warehouse to store anything, you need a ton of metal ingots. To get ingots, you need to mine. However, after joining many servers hoping to find a stable playing environment (some servers don't load, others you get kicked for not speaking their native language) i was banned for simply mining. \nTurns out mining for metal causes lag for the rest of the server, who knew? So after finally finding another stable server, speaking my native language, i asked what the 'work-around' was for gathering metal. The response was \"An admin needs to build an 'infinite pile' for you\". However, the admin of this server was sick and wouldn't be on for a month, poor guy. You won't be able to continue with your mining skill progression either, unless an admin cheats this for you.\n\nEventually, i got my \"infinite pile\" of resources and my mining skill was boosted for me. At this point, i felt like i had cheated the game. The last few hours of my time with Life is Feudal felt cheap, cheesed.. And upon rejoining the server after a little over a day, everything i'd built was on fire. This was due to the decay system that's been introduced to remove trash. I had spent hours trying to build my house and a warehouse, which was now defined by the game as 'trash'. \n\nAll in all, if you are very lucky and find a stable server and don't mind cheating the game for resources, then you'll probably enjoy it. Just be aware about inviting a friend to purchase the game too, as they might not even be able to join the same servers as you.\n\nFor me, i won't be revisiting Life is Feudal until these game breaking flaws are resolved. \n\n\n----------------\nOn a side note \"This Early Access game is not complete and [may or may not change further]\"\nShouldn't this be illegal? I mean, everyone knows early access is a big cash cow for most devs, as well as Steam.. \nYet a good analogy would be to pay for a 3 course meal at a restaurant, sit down & receive your starter but nothing else.\n\nMaybe i'm just hungry.", "timestamp_created": 1433680195, "timestamp_updated": 1448734271, "voted_up": false, "votes_up": 579, "votes_funny": 108, "weighted_vote_score": "0.831822514533996582", "comment_count": 35, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1448213736, "developer_response": "Considering the review is from June 7th we hope you can come back a checkout the final release version. We have implemented a huge amount of changes in the last 6 months.\n\nIt seems many of your issues you brought up in your review have to do with private server admins and not the game itself. There are many servers out there, some good and some bad. The admin of those servers ultimately dictates your experience.\n\nDuring early development we had an issue with mining tunnels causing server lag which forced us to put in the infinity pile workaround temporarily.\n\nOur new dynamic tunnel and object decay system actually allows structures and mining tunnels that have been abandoned to naturally collapse and decay to keep servers fresh and performance great with little to no object-entity lag.\n\nOnce again we hope you come back and experience our release version and find a good community to play with.\n\nThanks for your support.\n\nThe Team"}, "16194283": {"recommendationid": "16194283", "author": {"steamid": "76561198045605257", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 6899, "playtime_last_two_weeks": 0, "playtime_at_review": 6823, "last_played": 1434572097}, "language": "english", "review": "Lots of potential and i mean A LOT of potential. For now it's all it is though. I just wish there was a middle thumb for \"Buy at your own risk.\" But there isn't. For now I wouldn't recommend it it's still in early access and even if it's supposed to come out this year... I doubt it. there's really too much work to be done in optimization and content.\n\nDepending on the server you choose, you will be able to top your level in either a day or a month. Same goes for construction, some servers make it easy and fast, on other you will definetly feel the grind. Personally, i prefer the later it makes it more realistic, you're actually gonna need workers to build a basic town. Combat is... Well hard to explain. Skill based ? Compared to other similar titles it fairs pretty well but you're probably just gonna get an arrow between your eyes before you even know you're in a fight. Crafting is mediocre just grind grind grind and manage your stuff in a very messy inventory. Stuff just goes everywhere in there, if you're gathering for a while you open your inventory and it looks like someone took your bag and just smashed it against a couple of rocks before giving it back. \n\nSo... If you're looking for a medieval fighting melee arena look elsewhere because this game is SLOW and the fighting is a really small part unless you're a thief (And usually you have a lot of rules to follow or else you will get kicked from the server) If you're looking for an historical medieval life simulator... With all the work and hardships, you're probably at the right place. I wouldn't recommend to buy it for now. I know devs need money to develop the game but at this state it's not worth 1/2 the asking price...", "timestamp_created": 1433455201, "timestamp_updated": 1433459846, "voted_up": false, "votes_up": 277, "votes_funny": 18, "weighted_vote_score": "0.82915806770324707", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "38550838": {"recommendationid": "38550838", "author": {"steamid": "76561197999909435", "num_games_owned": 0, "num_reviews": 55, "playtime_forever": 23105, "playtime_last_two_weeks": 0, "playtime_at_review": 1839, "last_played": 1602884944}, "language": "english", "review": "From the store page itself:\n\"[i]Hardcore and realistic; LiF is a Medieval multiplayer sandbox RPG, with free terraforming, a rich crafting system and preset and modular building construction. With engaging survival aspects, no target physics-based combat and a unique formation system - along with numerous other features - LiF is not for the faint [/i]\"\n\nIt sounds absolutely awesome on paper, but when put into a game it just doesn't work. The idea of a game is to create a form of escapism from reality and enter a new world in which to have fun. LiF has a severely strong grinding aspect that does nothing to show us the escape from the grind of daily life.\n\nIt feels as though the developers have played other survival/sandbox games and thought to themselves \"wouldn't it be great if you had to really build something as apposed to just click and erect\". Yes, it does sound great, it sounds realistic; but then let's go through the process of building a tiny shack (the first house you will build):\n\n1) First you need to level  a 4x4 track of land\n2) Break a branch from a tree (8 seconds)\n3) Gather a piece of wild plant fiber from the ground (8 seconds)\n4) Pick up a piece of flintstone from the ground (8 seconds)\n5) Construct a primitive shovel (8 seconds)\n6) Begin to level one piece of the 4x4 land (this can take anywhere from 16 seconds to 40 seconds)\n7) Repeat x15 times while emptying your bag of dirt every 8 digs\n8) Build the tiny shack blueprint (8 seconds)\n9) Break a branch from a tree (8 seconds)\n10) Gather 2 pieces of wild plant fiber from the ground (16 seconds)\n11) Pick up a piece of flintstone from the ground (8 seconds)\n12) Construct a primitive axe (8 seconds)\n13) Break 3 branches from a tree (24 seconds)\n14) Gather 3 pieces of wild plant fiber from the ground (24 seconds)\n15) Pick up 7 pieces of flintstone from the ground (55 seconds)\n16) Construct a primitive saw (8 seconds)\n17) Cut down enough trees to make 5 building logs (5-10 minutes)\n18) Use the saw to make 1 building log (20 seconds)\n19) Repeat x4 more times\n19) Add them into the blueprint\n20) Cut down enough trees to make 10 wooden boards (3-5 minutes)\n21) Use the saw to make 1 wooden board (20 seconds)\n22) Repeat x9 more times\n23) Add them into the blueprint\n24) Gather 20 pieces of wild plant fiber from the ground (3-5 minutes)\n25) Add them into the blueprint\n26) Construct your tiny shack (8 seconds)\n\nThere you go, after spending 1-2 hours watching the same repetitive animations, you have just created your first home. My steps did not even include running around, failed attempts at gathering resources, and the fact that some trees won't yield enough wood, so you need to cut down more, etc.\n\nSo what can you do with your tiny shack? You can bind yourself to it as a \"recall\". Can you decorate it? Does it come with other homely options? Can you sleep in it? No. It does absolutely nothing else. Even walking inside, you cannot see your character as it extremely cramped with no space to place anything. You can place one bedroll inside, that will fit, but bedrolls do absolutely nothing.\n\nApart from the momentous grind, the game also puts in these huge progression hurdles. I have two words for you... \"bone glue\". If you want to construct or make anything decent in the game, you need this resource and lots of it. You won't be able to do ANY combat unless you have it (unless you want to be an archer or you're happy hitting people with a shovel). It took me 20 hours of playing to unlock bone glue and I'm just an average gamer.\n\nIn order to make a certain item you need to make a prerequisite item and in order to make that prerequisite item you will need a pre-prerequisite item, each of which is crafted in certain ways that have prerequisites of their own. It is a dirty grind that leaves a foul taste in the mouth.\n\nThe game is MEANT to be played with friends. Forming a guild completely changes the game and actually makes it much more playable. Lone-wolf gamers out there will meet so many progression hurdles it will make your head spin.\n\nI can certainly see the appeal from a role-playing perspective. This game is definitely suited for role-play, yet the only communication is through a tiny text box in the bottom corner of your screen.\n\nThe game has a \"mixed review\" rating and I think this suits it fine. I wish I could give a sideways thumb, but alas, it verges more towards not recommended as apposed to recommended. I do look forward to trying the mmo version though.", "timestamp_created": 1513978575, "timestamp_updated": 1513978575, "voted_up": false, "votes_up": 97, "votes_funny": 5, "weighted_vote_score": "0.82810211181640625", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "12184242": {"recommendationid": "12184242", "author": {"steamid": "76561198027576298", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 3075, "playtime_last_two_weeks": 0, "playtime_at_review": 1498, "last_played": 1448314525}, "language": "english", "review": "Life is Feudal\n\nSome would call it \"Hitting the grass simulator 2014\", u need to play it to understand.\n\nThis game is one of those you look at and think, \"i could really see myself loving this game, in a year\"\nAs it is ALPHA dont buy if you want a perfect game, can't stress that enough.\n\nDo you like building ?\nDo you want to create a town from scratch with mates ?\nDo you want to live in a castle ?\nDo you want to fight moose on the beach ?\nDo you want to hit the grass ?\nDo you like level progression games ?\n\nThen LiF is for you\n\nAnd the community so far is a group of helping lads, great fun to play even in Alpha !", "timestamp_created": 1411374724, "timestamp_updated": 1411374724, "voted_up": true, "votes_up": 232, "votes_funny": 0, "weighted_vote_score": "0.826289594173431396", "comment_count": 9, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "123567177": {"recommendationid": "123567177", "author": {"steamid": "76561198088500570", "num_games_owned": 364, "num_reviews": 35, "playtime_forever": 54478, "playtime_last_two_weeks": 0, "playtime_at_review": 54478, "last_played": 1522651711}, "language": "english", "review": "I could write you a big long thing explaining how the devs purposely sold this to fund the mmo side of things and then set the whole YO scene on fire when they were ready to launch the MMO. I could explain how they took what was honestly a PERFECT game and gutted it so no one could really have fun with it anymore. Instead I'll tell you that when this was new, it was THE game to play. I ran Valorim, a wonderful pvp-lite community, for about 8 months during the height of LIF:YO. This game WAS incredible. Now it's garbage; left unplayable in effort to shepherd the YO players to the MMO which died so fast it was impressive. Now we have nothing.\n\nScrew this game.", "timestamp_created": 1665285002, "timestamp_updated": 1665285002, "voted_up": false, "votes_up": 44, "votes_funny": 0, "weighted_vote_score": "0.824647188186645508", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "32210139": {"recommendationid": "32210139", "author": {"steamid": "76561198120914098", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 790, "playtime_last_two_weeks": 0, "playtime_at_review": 790, "last_played": 1496704636}, "language": "english", "review": "This game is like ARK: Survival Evolved mixed with a little bit of The Forest and a tad of Chivalry. But this game is pretty shit. They tried to make this game realistic, but is a terrible idea when making a game because then it requires hundreds of people to produce each individual part and have each machine to process the part, then you need people to gather all of the raw materials and resources in order to produce the product. For example, in order to make fucking shoes, you need 1x Thin Leather and 1x Hank of Linen. To make the Thin Leather you need to put a thin dried hide and 3x water in the tanning tub, and this alone takes an hour to process. To get water you need to go to the ocean or a well and collect water, and to get thin dried hide you need to dry thin hides at a drying frame, and this requires level 30 in procuration. To get level 30 in procuration you need level 60 in Animal Lore. To get level 60 in Animal Lore you need level 90 in Hunting. This all requires repeated processes of actions that has to do with hunting, animal lore or procuration to level up. These processes require the constant clicking and a loading bar. An auto clicker would be good for this. To make the Drying Frame you require 4 branches and 1 Bone Glue, and level 45 in Carpentry. You therefore need to get a saw to build the Drying Frame and also need to gather branches from trees nearby. Then you have to gather flintstones and sticks to also build the saw. To make Bone Glue you need 10x Bones and 6x Water. Again, you need to go collect water from the ocean or a well, and to get 10 bones you to kill an animal of some sort, and the animals have ridiculous amounts of health that require atleast 30 hits with a hatchet, also they do ridiculous amounts of damage, and to be able to kill an animal before they kill you requires a decent weapon, such as a spear. Or you could ask 4 of your friends to come help you kill the animal, and just hope that it doesn't run away. All of your friends will be near death with very low health. To make the bone glue you need to use a Big Cauldron, which you need level 0 in procuration to make. The ingredients required to make the Big cauldron is 2x Copper Ingots and 4x Handle and 2x Hardwood billets. OKAY YOU GET THE POINT BY NOW I'M NOT EVEN HALF WAY DOWN EXPLAINING OF HOW LONG IT TAKES TO MAKE A PAIR OF SHOES. DO NOT GET THIS GAME UNLESS YOU HAVE 20 HOURS TO SPEND ON MAKING 1 PAIR OF VIRTUAL SHOES.", "timestamp_created": 1496705891, "timestamp_updated": 1496705891, "voted_up": false, "votes_up": 244, "votes_funny": 96, "weighted_vote_score": "0.824217319488525391", "comment_count": 19, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "32575590": {"recommendationid": "32575590", "author": {"steamid": "76561198038432672", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 13087, "playtime_last_two_weeks": 0, "playtime_at_review": 9174, "last_played": 1582929096}, "language": "english", "review": "It truly pains me to write this review, but the time has come for that.\n\n[b]In Short[/b]: I do not recommend this game.\n\n[b]In Full[/b]: I do not recommend this game and here is why:\n[list]\n\n[*] I played this game in 2 different occasions, June 2016 and June 2017. I can tell you that virtually nothing of much importance was added or updated during that time despite the promises of the devs. In fact, I read all the change logs and major news between these two dates and a bit before june 2016 to give you all an idea of it. Lets start:\n[olist]\n\n[*] Before May 2016 the game had a steady, if you can call it that, income of updates and features, but the reason the date is May 2016 is because that was the date when the MMO beta tests were announced. From that point onward it just went downslope. The servers went up for a year long test (That fact already annoyed a lot of people who waited since the first announcement in 2014). Not only that, it meant they had to shut down the Your Own official server for that, already a sign that they were ready to concentrate on the MMO with the excuse that its a game meant to be \"your own\". That in b itself makes little sense. Your Own, basically became testing grounds for the MMO and work on MMO basically meant, ignoring Your Own for a large amount of time. The map for the MMO is a big evidence of it, since it consisted of 49 squares each the size of the LiF:YO map. Working on a map 49x bigger than the original, improving it, balancing it as well as adding everything else for it, requires full concentration taken from YO.\n\n[*] Life is Feudal: Forest Village, one more title that would require cutting attention from Your Own. Took a year and it didnt even come out that well.\n\n[*] The most remarkable features and updates between the times I played this game: Physics model approximation meaning better collisions and no more floating stuff; Grass rolls on the wind and groundcover optimization; Better cart speeds; Wooden Walls; Reworked HDR and Darker nights (whats moonlight even?); New animal AI; Easier to spot Herbs; Crops grow better; 64bit and other performance fixes; Logoff timer; Actual suicide and a shit load of combat updates. It may seem like nice stuff but for a game that has regular improvements being done. This was all added over a course of a year. The entire year was a mess of quick fixes and occasionally a meaningful feature update that didnt add what people needed and wanted. Not to mention the amount of combat updates that just makes me think its meant more for the MMO than YO. \n[/olist]\n\n[*]I will write for you some quotes of promises from the devs that have been late not days or weeks or a few months but a year. Given in 14th of January, 2016 by Saxxon, titled \"Development Information Update\" it stated. They themselves admit to be consumed with the MMO tests and still unsure how to split the work between the team for bug fixes and features, so until the MMO is done, the game will be stale as a cookie in the back of a fridge. When asked when the most voted for feature will be added, that being animal pulled carts, they claim working on it and that it [b]WILL[/b] be implemented before beta tests start in March 2016. Im writing this in late june 2017 and I can assure you there is no sign of them being added since they never even mention it anymore. They hoped to add usability to furniture around mid 2016 which also barely happened if at all. The Sawmill concept was introduced years ago and it not even buildable yet claimed to be worked on in that Dev post, but along side the Animal Carts, its not even mentioned since. The only thing they somewhat hit with that post was the optimization update and the MMO testing.\n[/list]\n\nTo finalize my point. The game has a great deal of potential and incredibly fun to play if you have the people and a machine or provider powerful enough to hold the server for your group. Yet there are so many big issues that need to be fixed that it can kill the mood of the game incredibly fast, like the lack of material mobility, the confusing and impractical method of terraforming, the lack of modulation (for example, adding parts to buildings or the same tile), sloped walls and fences, the unrealistic animal combat, some useless items like slate and improper honey, and a whole box of more issues. \n\nSo in a conclusive answer whether you should buy this game, I say dont. At least not yet. There are so many missing things that can slow down or kill the game, its practically not worth it. I love the game, but its kinda like a toxic relationship.\n\nTL;DR: Dont buy the game until it actually has all the planned features.\n\nThank you for reading and I hope I didnt miss anything.", "timestamp_created": 1497904804, "timestamp_updated": 1497904922, "voted_up": false, "votes_up": 126, "votes_funny": 4, "weighted_vote_score": "0.823407530784606934", "comment_count": 11, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "19415448": {"recommendationid": "19415448", "author": {"steamid": "76561198061452323", "num_games_owned": 191, "num_reviews": 12, "playtime_forever": 32349, "playtime_last_two_weeks": 0, "playtime_at_review": 8453, "last_played": 1596767467}, "language": "english", "review": "At 90 hours in, I have to say I'm really enjoying this game.\n\nI joined it as I love any type of world builder game. I'm a crafter at heart.  This game doesn't disappoint on that front. The crafting system is extremely deep and can be complex, with long item trees.  Farming, to animal husbandry, to carpentry, etc.  I'm definitely in my element there.\n\nWhat I wasn't expecting was finding myself on a server with a very robust social game. Kingships and Dukes, and wars, and strife and witches in the bogs.  It's been great watching and being a part of what really feels like a living breathing world.\n\nI'm looking forward to seeing what the next few months bring to this new game!", "timestamp_created": 1448986208, "timestamp_updated": 1448986208, "voted_up": true, "votes_up": 122, "votes_funny": 5, "weighted_vote_score": "0.822964072227478027", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "19145886": {"recommendationid": "19145886", "author": {"steamid": "76561198097528994", "num_games_owned": 0, "num_reviews": 35, "playtime_forever": 58308, "playtime_last_two_weeks": 0, "playtime_at_review": 55792, "last_played": 1547609520}, "language": "english", "review": "*EDIT. Original down below (Update June, 2018)\n\nWell, after years I played it again. Really remembered that immersion and the game can really draw you into it. I didn't like the MMO at all, but a solid group of friends on a server and you can really, really, get into it. Honestly, this game doesn't deserve a mixed review. It's well worth my 900+ hours\n\n\n*** Old review\n\nThe early access version went through a lot of ups and downs, but it was pretty solid. Obvious issues like infinity piles/tunneling and some getting stuck on terrain/etc but generally speaking it was a 'good' game.\n\nThen something odd happened I've never seen an EA game do before... They released a different game than what we have been testing/playing these last few years. I don't get it, you have us test this game for early access so you can work out the bugs/etc. But on launch day you change dozens and dozens of things that basically no one has tested. Why would you do this... The current version is so incredibly broken with bugs and glitches dedicated servers won't even run in a stable fashion. \n\nFor whatever reason the devs had a 2nd version of the game they were developing on the side and released that instead of the game we've all been playing this entire time. What happened??", "timestamp_created": 1447862318, "timestamp_updated": 1528437780, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.822203338146209717", "comment_count": 54, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "41029047": {"recommendationid": "41029047", "author": {"steamid": "76561198038515973", "num_games_owned": 0, "num_reviews": 49, "playtime_forever": 2699, "playtime_last_two_weeks": 0, "playtime_at_review": 2411, "last_played": 1459276051}, "language": "english", "review": "The devs scammed us - they didnt even finish this game. Nowhere close to being finished. They took our money and made ANOTHER game that they are charging even more for - instead of finishing this game as they promised with all the features that the OTHER game now has.\nScamming lowlife devs. Will never buy another game of theirs for the rest of my life.\nOh - and this game sucks. It was basically a beta test for them to build and rip us off, so they could then go make other games and charge us twice for the same game they promised (both times).", "timestamp_created": 1521934114, "timestamp_updated": 1521934114, "voted_up": false, "votes_up": 75, "votes_funny": 0, "weighted_vote_score": "0.821126937866210938", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "12653194": {"recommendationid": "12653194", "author": {"steamid": "76561198024353470", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 171, "playtime_last_two_weeks": 0, "playtime_at_review": 171, "last_played": 1412618568}, "language": "english", "review": "you are not paying for the devlopment of this game.\ninsted they are using the money made from this to create an MMO that will be pay to play based on the gameplay from this.\nbasicly you are testing and ironing out bugs so the MMO will be launched near perfect with little or no cost to the devlopers, those that have pointed this out on the companys forums have been deleted.\n\nas far as this \"game\" goes, it remains to be known what will happen at the launch of the MMO (btw you get 1 free chr for buying this, thats right, only 1!) but my guess is this will be pulled.\n\nthis is not a direct flame at the compnany involved, but i wish i had known this before buying.\nguess i should have reserched it first.", "timestamp_created": 1414395572, "timestamp_updated": 1469266261, "voted_up": false, "votes_up": 840, "votes_funny": 7, "weighted_vote_score": "0.820542693138122559", "comment_count": 114, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23862272": {"recommendationid": "23862272", "author": {"steamid": "76561198028265740", "num_games_owned": 0, "num_reviews": 29, "playtime_forever": 61975, "playtime_last_two_weeks": 0, "playtime_at_review": 60988, "last_played": 1472358018}, "language": "english", "review": "Devs failed to fullfill any promises during development. Instead of using early access funds for this game they used it as a test grounds for their MMO. On top of that they are now branching out again and are claiming to be publishers of a Life if Feudal franchise. There isn't 1 complete game yet but they have 3 in the franchise? This is a scam. \n\nI'm sad to say that I've played this game from conception to \"completion.\" Waste of time and extreamly disapointing. Do not pay for this unfinished beta piece of junk. \n\nAt first it was a great concept and I looked forward to development. Development was slow, spotty, and buggy. Then they got bored with it and released it as a full version game so they could move on to their MMO project. THIS IS NOT A COMPLETE GAME. Many systems, items, and recipies aren't even implemented from beta. Nothing is optimized and no matter how beastly your rig is the game will lag, crash, and glitch. Speaking of glitches there are a tons of them and most require a GM or server reset to fix. Want to craft something? Too bad your crafting station is bugged and you have to wait until the server resets.\n\nThe combat system is clunky, unrealistic and unfinished. The hit boxes don't fit the character modles and you can littereally beat most people by looking at the ground, spining in circles and swinging at their groin. You can charge someone and drive a spear clean through thier character and not have a hit register for any amount of damage. Why? b/c you didn't aim at their nuts. \n\nIn short this isn't a game its a cheap concept and ball buster simulator.", "timestamp_created": 1467036136, "timestamp_updated": 1467036136, "voted_up": false, "votes_up": 211, "votes_funny": 32, "weighted_vote_score": "0.818875730037689209", "comment_count": 24, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "92970923": {"recommendationid": "92970923", "author": {"steamid": "76561197999796344", "num_games_owned": 0, "num_reviews": 27, "playtime_forever": 87774, "playtime_last_two_weeks": 0, "playtime_at_review": 84884, "last_played": 1700532914}, "language": "english", "review": "Best concept ever brought to sandbox gaming, destroyed by the worst development team, patching and general disregard for player feedback ever seen. Brought one of the best PvP system's ever seen to the mid-eval genre and then sidelined it focused completely on a PvLoading Bar/Material Grind, listening to their smallest friends/voices in the community. Great tera-forming and true city building experience destroyed by regional materials and completely shortsighted barriers at a poor attempt at \"content\". Zero true PvE elements were ever delivered so all there was to do was walk hours, yes literally hours to the nearest player base and ask them to come outside their walls for some PvP. Set out to create the largest world with no player base to back it up... On the second attempt know what they did? Increased the map size even more AHAHAHAHAH, tools. Spawn some more pocket horses and do nothing for anti-cav when the KDR for lancers is like 4to1. \n\nHope you learned something, sell this shit to a developer who can provide content and most of all fun to a great game and actually polished system. Takes real skill to destroy a game like this.", "timestamp_created": 1622518956, "timestamp_updated": 1622519224, "voted_up": false, "votes_up": 55, "votes_funny": 5, "weighted_vote_score": "0.817671418190002441", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "12218313": {"recommendationid": "12218313", "author": {"steamid": "76561197976362887", "num_games_owned": 1183, "num_reviews": 14, "playtime_forever": 6333, "playtime_last_two_weeks": 0, "playtime_at_review": 2262, "last_played": 1458681820}, "language": "english", "review": "Life Is Feudal is a hardcore sandbox MMO('ish) game with great potential. You'll be able to build villages, farms, castles, craft armor and weapons. And not to mention - kill people with those crafted weapons. There's an arsenal of weapons waiting to be crafted, both ranged and melee, but not all of them are implemented yet. \n\nThe game is still in alpha but you can already get a feeling of what the released game will become. It can sort of be described as a mix between Wurm Online in gameplay, and Rust with it's graphics. There's a couple crucial bugs at this point (for example the server browser freeze) and the servers go down alot, but once you get on a server and start playing there's hardly any bugs bothering you - which is pretty impressive for a alpha build these days. \n\nOne thing that's important to mention though, is that this is not really a singleplayer/solo game, you would want to gather your friends or join someone else in-game when you set out to build those small, big and gigantic settlements. And you and your friends will need alot of patience in the process of building your land and skills. The world is available for you to shape and form as you like, but like the real world it's going to take lots of time to shape it. \n\nI would definetly recommend buying the game for the sandbox fans out there, but there's no rush in doing so. I would guess the most crucial bugs are getting fixed pretty soon though, and when they do Life Is Feudal will bring you tons of hours of fun even in it's alpha stage.", "timestamp_created": 1411564403, "timestamp_updated": 1411564403, "voted_up": true, "votes_up": 97, "votes_funny": 0, "weighted_vote_score": "0.816279590129852295", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "28672233": {"recommendationid": "28672233", "author": {"steamid": "76561198036661646", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 110162, "playtime_last_two_weeks": 0, "playtime_at_review": 63856, "last_played": 1642029225}, "language": "english", "review": "[h1]In one sentence: After three years this game is a spectacular monument to failure.[/h1]\n\n\n\nPlayed this game from the time it was first released as an early access game on steam up to the current date. Over this period I experienced first hand how it was evolving and where it was going. Played on public servers as well as on my own server. At times it replaced my real life which is sad to be honest. \n\nI really liked this game because it had lot of potential. However it seems that after every update it became worse and worse. I was hoping the devs would first adress the issues of the game in order for every asset to be functional. I was reporting bugs, errors, malfunction and hoped that with the next update it would be fixed. But no. It never happened. Instead each update brought assets to the Clusterfuck and with that came more issues.\n\nI am not going to adress each bug here because there are many and the devs know about it. It's bad sounds worse and the physics are a joke.\n\nI do not recommend it.\n\n[h1]EDIT[/h1]\n\nI figured there should be some more explanation why i do not recommend this game. The thing some of you have in mind are the so called pros and cons. There are many pros but they work against themselves so in the end the pros become cons.\n\nHow?\n\nGraphichs: With the new models and textures + effects the game looks really good. There is a skill in the game called Herbalism where you gather herbs for making preparations like antidotes for snake bites or flux for making of mortar and steel. However the grass meshes are taller than the herbs. You need to turn the grass off in order to gather herbs. So why have good looking grass if it's not functional? \nThe trees in the early access stage of the game were thinner than the ones that came with an update at games release. What they didnt change was the activation box which remained small. So now instead of just walking up to a tree and selecting it you need to find a spot where you can actually access the activation box to be able to select it.\n\nMechanics: Starting from horses beeing stuck, wildlife able to walk through trees, fighting system wich ends up to be a pain in the ass because the hitboxes are a mess and you cant hit anyone if you arent aiming for the nuts. On the other side you have animal husbandry where you can tame few animals and domesticate them. Once you place them in barns or stables these become just listings. In the index you can see the age and quality of an animal but its just a list, the are no actual animals (meshes+textures+animations) in these stables. So why build a freaking stable? It could as well been a rock called \"the stable/barn\", you can activate it put the animals inside, feed em, clear the dung, slaughter and so on....I mean...if i need to build a massive stable I want to see the animals in the freaking stable.\n\nThe Content: There are lots of things you can do. Crafting is one of them. From primitive tools basic object to more advanced ones. Every item has its quality. The better the quality of resources used and the higher your crafting skill the better the results you get - which translates into better quality tools and objects and longer durability of tools. Let's say you get into forestry like i did...increase your skill to 100 (and it takes forever to do so depending on server settins), get some sprouts and plant them. Now you have your own forest with trees of the quality 100. Usefull for carpentry making handles, boards, coal...then the devs decide to release a patch with the new tree growth algorithm they been working on for some time. What that actualiy did is lowered the quality of everyones trees from 100 to 10. Now if the game were still in it's early acces stage it would be ok because we had an agreement and everything can occur. But the game is officialy released yet it feels like we are still testing it. I dont know if the devs realize this; we spend weeks working on something which they render obsolete. We lost so much, words can't express it all.\n\nFor solo players: The grind is really the only thing there is. There's no danger and no purpose really to play. As much as you might love crafting, it's going to take you absurd amount of time, hundreds and hundreds of hours to build anything. But with no danger present in the world, there's no purpose to build other than aesthetics.\n\nFor groups of players: Can be fun with friends on teamspeak, but you dont need to play this game in order to have great time conversing with your friends... You could as well have a good time if you go out with your friends or just talk via teamspeak and do nothing else. At least you will avoid the disapointment in the game which needs to be constantly played, otherwise everything you have built will decay in a matter of days. Life is feudal either becomes your life, or you just should not even try to play. Then one day you will lose your patience like many of us did.\n\nThese are few things i mentioned. It is difficult to go into minor details wich will cost you greatly in the long run and hope someone who didnt play the game can comprehend. I would have to explain more which becomes complex and leave you more confuzed than you were prior to reading this review.\n\nIn the age of information, ignorance is a choice. Inform yoursel (read reviews, watch some gameplay videos), dont buy early access games, don't preorder games. Give your money to the developers that actualy deserve it, developers who can deliver. And there are so many good games these days worth your time and money. All gamers want is to have a good time so choose wisely  my fellow gamers.\n\nCheers!", "timestamp_created": 1482760736, "timestamp_updated": 1485426988, "voted_up": false, "votes_up": 183, "votes_funny": 8, "weighted_vote_score": "0.815866470336914063", "comment_count": 18, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "53601766": {"recommendationid": "53601766", "author": {"steamid": "76561198130364528", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 147648, "playtime_last_two_weeks": 0, "playtime_at_review": 102958, "last_played": 1630525227}, "language": "english", "review": "If the devs would just add some modding tools this game would blow up again.  It has so much potential the devs just don't have the resources to give it what it needs.  Modding tools would help this so much.", "timestamp_created": 1562291968, "timestamp_updated": 1562291968, "voted_up": true, "votes_up": 46, "votes_funny": 2, "weighted_vote_score": "0.815404653549194336", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "24788725": {"recommendationid": "24788725", "author": {"steamid": "76561198144630137", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 62904, "playtime_last_two_weeks": 0, "playtime_at_review": 61650, "last_played": 1446252549}, "language": "english", "review": "Lets get this game back on track....\n\nReduce terraforming speed drasticaly (By 80%)\nMake the progression overall quite a bit faster, afterall this is Your Own.\nKeep in mind devs, you really need to find the right balance of work vs reward, right now it is so over the limit of work ther eis no real reward because most people can not handle that much work.\n\nI built a lot in this game, and seen a lot. Please consider carefully weather or not you want to have a community ever again, listen to the players, they are who the game is for right?", "timestamp_created": 1470723550, "timestamp_updated": 1470723550, "voted_up": true, "votes_up": 55, "votes_funny": 1, "weighted_vote_score": "0.813535749912261963", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "17887291": {"recommendationid": "17887291", "author": {"steamid": "76561198004916879", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 57579, "playtime_last_two_weeks": 0, "playtime_at_review": 56190, "last_played": 1507078421}, "language": "english", "review": "First things first. The game has a very steep learning curve. Much of it does not make sense at the outset. It is not intuitive and you will not enjoy the time you lose learning hard lessons - for example, that you need to figure out how to make a primitive hammer in order to make a blacksmiths hammer to make other things - oh, and that same hammer is sitting next to the forge thingee but that's just stickering, you can't use it.. Oh - and you can't even use the forge until you learn how to mine, etc.\n\nLooking at the negative reviews, it looks like most of those people did not get past this point. If you want fun and whimsical out of the box then stop reading now. If you're looking for something gritty and unique, keep reading.\n\nOnce you are past the learning curve and get confident with the interface, it really opens up. There's no AI enemies. Just people. People will be friend or foe based on how you treat them and how you respond to their treatment. People will lie and cheat, People will steal from you and take your hard work. People will break or ignore the rules to shortcut themselves at others expense. People will bully you and exploit weakness. \n\nPeople will also believe in you. You will meet people. You will trust them and in turn they will trust you. You will build bonds and with those bonds grind out amazing things that you never thought possible. You will be there for them and they will be there for you. \n\nYou will get addicted. You will find yourself staying up way too late or getting up way to early to care for what you've made in some foolish video game you almost didn't figure out. \n\nYou will be afraid. Someone you do not know will suddenly approach you and your heart will race as you struggle to figure out what to do. Those that make is this far are all experts - skill counts for little advantage and all that will matter is how you've treated friend and foe. \n\nIt's just like life; it's what you make it. Game on.  \n\n\n-= Update 1.1.2017 =-\n\nI've noticed a lot of people spouting misinformation about the MMO version (for example, you have to buy it again) or complaining about how things have changed or that it was so much better before. It's unfortunate that people don't take the time to understand early access - that there will be bugs, that there will be changes.. I also understand that, to run hundreds of servers it takes money to launch, and three years in that can be hard to come by. I believe the team is very much trying to do right by the game still. \n\nAs for the MMO - Well. I've played it - and it's awesome. Everything is harder. The terrain, the animals, the skill tree.. Finally a game where we don't all just get a trophy for showing up.", "timestamp_created": 1441425363, "timestamp_updated": 1483493491, "voted_up": true, "votes_up": 67, "votes_funny": 3, "weighted_vote_score": "0.812594234943389893", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "44399532": {"recommendationid": "44399532", "author": {"steamid": "76561198053939034", "num_games_owned": 0, "num_reviews": 27, "playtime_forever": 382, "playtime_last_two_weeks": 0, "playtime_at_review": 382, "last_played": 1516497305}, "language": "english", "review": "Dont buy this game! The devs are full of crap. No updates, bugs and they promote thier in-game store. THEY MAKE YOU BUY because the grind rates are set artifcially high", "timestamp_created": 1535334041, "timestamp_updated": 1535334041, "voted_up": false, "votes_up": 164, "votes_funny": 5, "weighted_vote_score": "0.81209796667098999", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "30269247": {"recommendationid": "30269247", "author": {"steamid": "76561197970310796", "num_games_owned": 534, "num_reviews": 63, "playtime_forever": 2949, "playtime_last_two_weeks": 0, "playtime_at_review": 2949, "last_played": 1486745979}, "language": "english", "review": "TLDR: Get a guild or a big group of friends. You can't play this solo. \n\nThere are some things in this game that I both hate and love. I really don't know should I actually recommend or not recommend this game, I wish Steam had a neutral thumb. \n\nFirst off, don't buy this game if you aren't capable of doing these:\n\n- Getting some friends to this game also\n- Finding company to play with\n- Time. \n- Time and more of your time.\n- Looking for some kick ass medieval combat but with open world & crafting (you have to spend hundreds of hours before you get armors & weapons first)\n- PvP (to get any combat gear, yup, grind hundreds of hours, others who have done this before you on a non-wiped server will just rape you)\n\nIt's for a specific audience. I loved the game for the first 40 hours with my friend until we noticed we were living on this game AND to actually get anywhere you have to live on this game and micromanage like hell. Take care of your stable, take care of your farm, take care of everything. \n\nIt's truly immersive and when you get somewhere, you feel good that you actually made something but holy shit is the GRIND REAL!!! To get contruction to 90 is hell. Everything you do in this game takes fucking loads of time. It's one of the most grindiest games actually I have ever witnessed.\n\nHaven't visited your coop in two days? Chickens are dead, your progress is gone with animal lore skill. Wanna make linen rope? Chickens died, you have to get more of them and you need 30 skill of animal lore to get the skill so you can make linen rope, one of the most needed items in the game. \n\nActually it's not just linen rope, everything, get to 30 skill, unlock another skill, grind it to 30, oh wait, you need that too from skill #1, grind it to 90 so you can unlock 2 more skills.\n\nIT'S SO GRINDY!\n\nOther aspects? The graphics are good and the world is beautiful too. The world is immersive and you feel like you're living in a world.  \n\nPros? It's immersive. It's authentic. You get rewarded from your hard work if you have the patience. Terraforming is an awesome feature. \n\nI hope they fix some of the grindy aspects at the MMO, actually make it so you can progress without having to dedicate your life to this game.\n\nRating:\nToo hardcore for me, maybe coming back at some point/10", "timestamp_created": 1488411402, "timestamp_updated": 1488411402, "voted_up": false, "votes_up": 62, "votes_funny": 3, "weighted_vote_score": "0.811060190200805664", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "36115893": {"recommendationid": "36115893", "author": {"steamid": "76561198065917210", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 3007, "playtime_last_two_weeks": 0, "playtime_at_review": 2984, "last_played": 1509227469}, "language": "english", "review": "This game seemed to be a good game to play with friends.  After days if grinding to build a fort by constructing walls to keep other players out, it turned out that none of that works as advertised.  Anyone can get over any wall in this game just by stacking sleeping bags or other objects.  Everything describing how this game works shows that walls must be destroyed by other mechanics in the games.   This is not true.  I even watched someone riding a horse glitch over a wall.  After doing more digging on the internet I found that these issues have been going on since 2014 with this game.   Players can “float” objects and get over anything.  \n\nAlso during “Judgment Hour”, which is when anyone can access anything for a couple hours, anyone can take your stuff.  They can open any door or container.  This would seem fine except there is no way make it hard for them to access your items.  \n\nI don’t mind playing a game with a grind, I play many that do.  It is just very frustrating when significant mechanics in the game do not function as advertised.  I can accept waiting on things getting fixed in a game that is in development.  Unfortunately it is reported that most of these type of things are not going to be fixed since the developers are focusing on the MMO version, which is a separate game.  All they seem to be doing is tweaking things in the game and not fixing game play mechanics.  It appears that there are many key game play “glitches” that have been exploited in this game for years with no resolution.  \n\nFor a game that was released over 3 years ago the grinding and crafting has a lot of potential, but if you want to play a multiplayer game you are wasting your time and money.   The multiplayer interaction and mechanics have been open to exploits and glitches for years that undermine the described and intended game play experience.  \n", "timestamp_created": 1509292848, "timestamp_updated": 1509292848, "voted_up": false, "votes_up": 92, "votes_funny": 5, "weighted_vote_score": "0.808280348777770996", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "19975025": {"recommendationid": "19975025", "author": {"steamid": "76561197989829962", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 4104, "playtime_last_two_weeks": 0, "playtime_at_review": 4079, "last_played": 1452233544}, "language": "english", "review": "Now let me get one thing straight, this game is not for everyone.  This game is one of the very few honest to god hardcore games I have ever played (You can attribute this to a lot of the negative reviews).  Playing solo is possible on modded servers, but if you want the REAL LiF experience by playing on vanilla, you WILL need a group of people.  This is boderline non-negotionable, this is where a lot of new players make a mistake and thus ruin the experience for themselves.\n\nNow to get on to actually reviewing it...Let me start off by critiquing it.  The game does have some honest issues.  Animations are stiff and unnatural (Which normally wouldn't be a huge issue, but this effects combat so I have to point it out), game does have some performance issues, and can be VERY tedius.\n\nBut onto why I recommend the game, even though the game has it's own set of problems and isn't exactly perfect I still have to give this game a big thumbs up on it's core design philosophy.  If you enjoy a game that punishes you, a game that is unforgiving, but pays out when you work your ass off to achieve something....This game feeds this desire better than no other in my experience.  End game isn't achieved with ease.  It takes the combined efforts of you and your group working hard to achieve your goals, which gives you a sense of satisfaction I have never felt in a game before.\n\nSo in conclusion, if you are the type of player who can't and won't dedicate all their free time to a game, a player who wants things handed to them on a silver platter, or a player who just might not have the time in their lives to play this game.....Please don't buy this game, the game wasn't made for you to begin with.  But if you are like me, someone who enjoys the feeling of putting in hours of work and grinding into a game to accomplish things other players don't have the stomach for, this game is meant for you.", "timestamp_created": 1451165953, "timestamp_updated": 1451165953, "voted_up": true, "votes_up": 85, "votes_funny": 11, "weighted_vote_score": "0.806613445281982422", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "124754071": {"recommendationid": "124754071", "author": {"steamid": "76561198086083328", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 472, "playtime_last_two_weeks": 0, "playtime_at_review": 335, "last_played": 1704090295}, "language": "english", "review": "The moments I had on this game were the best gaming moments in my entire life. I am 30 years old and a serious gamer, so for me to say that, the game must be good!\n\nFirst of all, the 5 hours doesn't accurately reflect my experience with this game. I used to play on a cracked server and probably have about close to 1,000 hours, honest to God. Let me describe the game now.\n\n\nOk, so I started off, a mere naked peasant. I'm on this island on the east side of the map, just searching around I notice the scenery looks amazing. I pick an apple off a tree and am instantly met by, my soon to be new good friend Donny. \"Hey, man, what's up\" He says, with a thick South African accent. \"Hey, I'm new! Can you show me the game?\", I say. \n\nHe takes me to his little village, as he tells me he claimed this whole island, \"Torture Island\" as he calls it lol. COOL! I start helping him gather the materials we need to upgrade the village, you can make kilns, and chicken coops, barns, reinforced castle walls, castle towers, A KEEP! A FREAKING CASTLE KEEP? I'm instantly hooked, as he starts telling me all the possibilities. I just want to grind, and grind so I can see this beautiful castle. \n\n\"I made you a sword\" He says! My first sword! I wield it with grace and honor as I swing it a bit. \"Combat is a bit tricky, soon I'll show you how to fight\". He says. And, jeez, how right he was. You must practice sword fighting, because you'll get wrecked if you don't know how to fight in this game. Some players will challenge you to a duel, others are just barbarians and will attack with no honor so you have to be on guard.\n\nA new friend joins the village and quickly takes on the role of blacksmith and our village is growing. We meet more friends and they take on other roles. Me. personally, I love to farm and take care of the animals. My days mainly consisted of hunting for animals I could tame, searching for fertile dirt for crops and trees I would soon plant. I planted a mulberry grove, where we would harvest it and make silk, which was used to craft various things, like clothes. I planted apple trees in the highest quality of soil, which gave us tier 99-100 apples, which are well sought after for feeding animals or yourself. \n\nDonny, the village elder, comes up and starts gathering the men. \"We must go out and search for iron ore, we're running low.\" Ok! I gather the horse and cart and pack it with the gear we'll need, picks and food, etc., and we ride off to the mountains, 2 of our villagers are flanking the cart, in case we're robbed by bandits or bears. You can never be too careful. We get to the mountain and start prospecting. The higher your prospecting skill, the farther the radius is that you can scout out ores, there are lots of skills to level up in LIF!\n\nWe gather the ore, and head back to the village. Days go by, weeks go by...the daily grind continues, but it doesn't feel like a grind. With every ore gathered, every tree planted, every high quality cow born, you see the progress you're making right before your eyes. You see your work coming to fruition and it's so pleasing. I played every day, jobless irl, for months on end!\n\nWe meet other villages, develop good relations, some not so good LOL. And come to find out there is a daily market gathering of the servers players in a castle, where all the settlements can bring their wares to sell and trade! We have plenty of things to trade, and we bring 2 horse carts full of metal bars, gold, food, animals, clothes and tools. However, we know there are bandits out there (when I say bandits I don't mean AI btw, there's no AI NPCs, I'm talking about bandit players!) so, we know there's bandits and we hire the servers best mercenaries to protect us. It wasn't needed though, however I do have a fond memory of them rushing to this one little naked peasant boy and telling him to halt, and interrogating him on why he was there. It was cool to see OUR mercenaries protecting us as we took our wares to market!\n\nEventually, we form our huge castle walls, we're wearing quality armor and wielding quality weapons. We even have a member who specializes in archery! We create the huge, towering keep, and now we can officailly say we live in a castle! WE EVEN TERRAFORMED THE EARTH AND CREATED A MOAT, supplied with water from the local river. \n\nLike I said earlier, some of the settlements were not so fond of us, and 1 day we come under attack! Oh jeez, what a rush that was. Good memories, man. We all grabbed bows, and proceeded atop of our newly built castle towers, shooting arrows at these invaders. These guys were the top players on the server, and they laid a successful siege to our castle walls and breached the castle, killing all of us. It was a dark day, but was still cool. We eventually made peace, and life went on.\n\nIn this game, you can live a fantasy, a medieval life fantasy. The players are really great, they're all here for the same reason you are, and most of them are extremely helpful, loving and caring. I can't say enough about this game.\n\nAnyway, to end my story, life went on in LIF, we grinded, we got the end game weaponry, armor, and castle. We had literal mountains of ores in our castle fields, gold, silver, iron, copper, etc. We killed it! I ended up buying this game in hopes to play with them again, but 1 became a lawyer, the other got married and has an ill wife to take care of. They don't have time to play, so that's why I don't have many hours. BUT, I'm going to get back into it now.\n\nI hope this review encouraged you to give this a shot.", "timestamp_created": 1667274260, "timestamp_updated": 1667274260, "voted_up": true, "votes_up": 74, "votes_funny": 3, "weighted_vote_score": "0.802597165107727051", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "95692929": {"recommendationid": "95692929", "author": {"steamid": "76561198081627885", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 83945, "playtime_last_two_weeks": 0, "playtime_at_review": 83684, "last_played": 1700180788}, "language": "english", "review": "Some of my best memories are playing this game. I have made long lasting good friends on this and if it wasn't for the birth of my son, I would easily be sinking whole evenings into this game. The interface is clunky, but you get used to it. The settlement building is great. There is room to make either great towns or going solo. But towns need groups to maintain them, defend them and you share the workload grind. \n\nAfter 12 months of playing the game, 3 months of running a server, I was spent. Great memories, but tired of leading a group of people and dealing with the infighting. I decided to join a new server and have a simple farm. I could log in, tend the chickens, reap the hay and raise pigs. It was great. But then some familiar friends appeared. I took them on as farm hands. We expanded the farm a bit, then more people turned up, we built a wall. Then some more faces appeared and before I knew it, something solo had organically turned into close knit community and some of the best RP I had the joy being part of - and some really great PvP.  It's always a little sad when the servers have to be reset (c. 3 months) but by then you're already planning your next settlement and how you'll improve for next time!\n\nGenuinely loved this game. It is not an easy start but once you've got it (and you find some decent people) it's truly epic.", "timestamp_created": 1626220377, "timestamp_updated": 1626220377, "voted_up": true, "votes_up": 40, "votes_funny": 0, "weighted_vote_score": "0.802409172058105469", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "29431785": {"recommendationid": "29431785", "author": {"steamid": "76561198020970508", "num_games_owned": 173, "num_reviews": 1, "playtime_forever": 79767, "playtime_last_two_weeks": 0, "playtime_at_review": 59047, "last_played": 1512063862}, "language": "english", "review": "If you've played age of empires, and watched your little villagers carry the logs back and forth to your supply pile....you may understand this.  You are that villager carrying logs to your supply pile.", "timestamp_created": 1485121525, "timestamp_updated": 1485121525, "voted_up": true, "votes_up": 63, "votes_funny": 48, "weighted_vote_score": "0.801893234252929688", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "15857553": {"recommendationid": "15857553", "author": {"steamid": "76561198170914337", "num_games_owned": 415, "num_reviews": 90, "playtime_forever": 8543, "playtime_last_two_weeks": 0, "playtime_at_review": 6638, "last_played": 1438103439}, "language": "english", "review": "It is very interesting, and if you're dedicated and have the patience for this game, then it's for you. It's a nice medieval game full of crafting and adventuring, although, here's where you'll have to be patient: You could work on getting all of your stuff built and grown for 100 hours and some random people could come over, do something stupid, and then all of a sudden BAM. You're back at hour 1 again. The server could restart too, and BAM. You're literally at hour 1 again. You can't just spend 30 minutes to build stones walls and gates around your little village, no no... It can take about 10 hours to finish of none stop gathering. Oh and is there a little clift that you need to expand to get more land? No problem, as long as you got a couple of weeks of nonstop playing, then you'll get about a couple feet of land out of it for sure! And then there's the fact that you'll most likely be told that the server will restart in a month or so right after you're done. So if you got a lot of time on your hands and you have the patience to start all over again, even if you spent 300 hours on it, then here's a game for you!\n\n(sorry, I tried to write it positive, but I wrote this right after a rage quit so.. All I'm saying is that you should maybe wait until the game's finished so there aren't as many server restarts. It's actually a pretty fun game, though.)", "timestamp_created": 1431797447, "timestamp_updated": 1438715938, "voted_up": true, "votes_up": 235, "votes_funny": 96, "weighted_vote_score": "0.800860047340393066", "comment_count": 10, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "15639678": {"recommendationid": "15639678", "author": {"steamid": "76561197992972642", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 59375, "playtime_last_two_weeks": 0, "playtime_at_review": 22710, "last_played": 1665706398}, "language": "english", "review": "First off let me say that I LOVE THIS GAME!!!!\n\nThis is probably the most fun sandbox game I've played, ever. I initially opted to start solo on my own locked instance; just to learn the ropes, learn the UI and the crafting. I figured that would allow me to survive more easily when I moved to a PVP server. I expected it to be a learning experience, not a fun one. Actually it turned out to be so much fun that I got all carried away in the crafting and forgot to check out the multiplayer experience.\n\nI've now restarted anew 3 times, as the server I settled on recently migrated. And one of my favorite things about this game is the leveling system. For one thing it makes it easy to start anew; no more spending an entire month of long grinding hours just to get back to level x at which you can finally do fun stuff. Nope, in this game you can train the basic combat skills in minutes and start to have fun. You can train your crafting skills in a couple days and hit the ground running on building. That is just great. \n\nThe game is barely half way done and already it offers and amazingly rich, deep and compelling experience. It sucks you in, but in the same time it allows short gaming sessions (which few MMOs do). So even if you only have 30 minutes to play you always have something you can do. \n\nThe Devs are very passionate about the game and are very active; they offer regular updates and even provide a public roadmap showing their progress on upcoming features.\n\nI've fallen head over heels for this game, it has destroyed my Battlefield 4 career. :D", "timestamp_created": 1430497778, "timestamp_updated": 1430497778, "voted_up": true, "votes_up": 74, "votes_funny": 8, "weighted_vote_score": "0.798668742179870605", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "16114832": {"recommendationid": "16114832", "author": {"steamid": "76561197981973419", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 11137, "playtime_last_two_weeks": 0, "playtime_at_review": 10894, "last_played": 1433160517}, "language": "english", "review": "I do not recommend the game, it's been many months and the development of the game is practically non-existent.\nTheir rate of progression is laughable, which is probably cause of their focus on the MMO version (probably will end in tears). The game could be nice eventually but that won't happen in years.\n\nI would advice looking els where for your doze of medieval sandbox gaming.\n\nGame development is very long process, but this game has barely improved within a year. The community fixed lot of the optimization problems within days (or maybe even hours), when game was released for early-access. (Yet it took months for devs to integrate community solved fixes in to the game)", "timestamp_created": 1433161170, "timestamp_updated": 1433161170, "voted_up": false, "votes_up": 815, "votes_funny": 49, "weighted_vote_score": "0.795760035514831543", "comment_count": 39, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1433969299, "developer_response": "We are still in active development and hope you log into the game from time to time to discover all of the great new content and optimizations that have been integrated into the game. We are sorry you are upset, so we will point out some things that will help put perspective on Life is Feudal. \n\nDevelopment and what to expect was clearly defined when we launched into Early Access  [url=http://store.steampowered.com/app/290080/] [b]Here[/b] [/url]. \n\nOur development is right on schedule as you can see  [url=https://lifeisfeudal.com/billing/roadmap.php] [b]Here[/b] [/url].\n\nA masterlist of all past released patches here [url=http://steamcommunity.com/app/290080/discussions/0/617319460859534119/] [b]Patchnote archive[/b] [/url] and link to the most [url=http://steamcommunity.com/app/290080/discussions/0/615086038668350084/] [b]Current patchnotes[/b] [/url]"}, "23003733": {"recommendationid": "23003733", "author": {"steamid": "76561198091006682", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 6030, "playtime_last_two_weeks": 0, "playtime_at_review": 4020, "last_played": 1676482455}, "language": "english", "review": "***This will be my first review on any game from Steam/in general, so if I miss anything out, please forgive.***\n\nI only have 60 hours or so of play-time recorded, but around 55 hours of those 60, I had been playing Life Is Feudal with people I never even gamed with before. By this, I simply mean that while at first not knowing/understanding much, I came across one person, then a couple more people, etc, until eventually (my favorite moments in the game) this group of ours had owned a small farming/fishing/trade village. Needless to say, the very first 6 hours or so of game-time was quite unfamiliar and I had a lot of help. But from that point on, I realize now that there are probably slim-to-none other games that can replicate what Life Is Feudal is about. What do I mean? How can I say that (with only just one review/little experience)?\n\nThis game boils down to having patience and having the ability to take in advice/learn from others. If you have no patience or have no interest in taking advice or learning from others, you won't enjoy this game to its fullest potential!\n\nThe grind can be offsetting, the in-depth complex skilltrees can be confusing, but the learning and level of detail put into this game... I have not found one in this similar era/style, to be better. And I am still looking till this day for one to top it.\n\nYou start off with basic character customization. Couple different race options, hair-styles, facial hair; you get the jist. From then, you either have no idea what to put what points into which stat/skill, or looked up a general guide and understand. If you didn't, which I didn't (at first), you'll then load into the game and be off to your new 'life'.\n\nThe very first thing I can say that differs from most games: the controls. The way in which you switch in and out of different modes. Then, the way in which you interact with your environment. Not sure since when, but luckily now, you can Mass Produce things, which makes (incoming tip) gathering something such as Plant Fiber, so much easier. Now, you can follow the Tutorial, which guides you to making Primitive Tools. There are a plethora of them, each correlating with different crafts/skills. Once you have the Primitive Tools, you start to attempt to build things. You need resources of different types, in order to construct certain things. So you branch out to other skilltrees. Long story short, there is so much to do in this game that you could sit for 12 hours straight on this and not realize how long it's been!\n\nWhat I will not do is list pros/cons. I feel this game has enough positives in its arsenal to warrant at least a try. Hell, I was on a certain server or two, got really far in my skilltrees, then said server or two either would wipe their servers, or would be inactive/shutdown for a bit of time. I just recently got my gaming-motivation back and not even a few days later, I reinstalled this game and might even log back in after completing this review.\n\nWill you enjoy it? I have no damn clue. I think if you have a reasonable amount of time, a reasonable amount of patience and learning skills.. I *think* this game deserves a shot on your computer. Try it. I would also suggest something else, in terms of how you can get the game, but I will not say on this review (message me 'G). What I do think, though, is that if you are a person who enjoys a challenge; maybe even possess a taste for Medieval Realism, then I am confident you will enjoy this game as much as I have for my not-so-lengthy time spending (60 hours, to me, is quite a bit >.<)...\n\nFeel free to add me on Steam if you need any advice or help, I'll gladly play as well if time permits.\n\nHope this review helped, even a little! Now get out there, ya 'Bloody Peasant!", "timestamp_created": 1463331724, "timestamp_updated": 1463331724, "voted_up": true, "votes_up": 41, "votes_funny": 1, "weighted_vote_score": "0.794168770313262939", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "27787447": {"recommendationid": "27787447", "author": {"steamid": "76561198042598683", "num_games_owned": 265, "num_reviews": 3, "playtime_forever": 126824, "playtime_last_two_weeks": 0, "playtime_at_review": 72638, "last_played": 1554520504}, "language": "english", "review": "There are a lot of negative reviews for this game, and I think a lot of them are a bit unfair. \n\nThis game is not for everyone. If you're expecting 24/7 action, don't bother. This game requires a lot of grinding, however it's extremely rewarding once you've finished the grind.\n\nThe main tip i'd give people who are looking to buy the game or players struggling with the game is to focus on finding a good group you feel comfortable in. This game revolves around communal play, and spending 10 hours bantering on voice chat while you grind is a lot more interesting than spending 10 hours grinding alone in silence. \n\nPutting the grinding aside, the combat is quite interesting, though not particularly good. The game is plagued with poor performance because the developers spend the majority of their manpower on their mmo.\n\nHowever, where this game truly shines is in it's rp community. You'll see it all, political betrayal, forced marriages, prostitution, alliances, coalitions, kingdoms, bandits. There really are no limits to what you can do with Rp. \n\nI began playing the game without ever really being aware of the Rp aspect of it and by coincidence ended up on an rp server, and i suppose the amount of hours i have on the game can attest to how great it's been. All my hours have been on the same server, Rpclif.", "timestamp_created": 1480233051, "timestamp_updated": 1480233051, "voted_up": true, "votes_up": 40, "votes_funny": 2, "weighted_vote_score": "0.793547868728637695", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "34761360": {"recommendationid": "34761360", "author": {"steamid": "76561198009419350", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 20277, "playtime_last_two_weeks": 0, "playtime_at_review": 6142, "last_played": 1581779006}, "language": "english", "review": "Dont buy unless you are happy paying for a beta to fund a future MMO - Various gamebreaking issues that havent been fixed for 2 years such as durability. Terraforming is very good and 90% of the game is a little toó easy.\nE.G - Build a furnace to start melting ore.. Within a few minutes the furnace is broken from being used and low durability. Items to repair durabillity is not available until much further in progression tree. As a new player you practically have to craft a new building for each item you make. THis appears to be a known issue intentionally left in to slow progress for years.\nUnusual game with a nice mix but not worth paying for as the development focus is on an MMO and this is more of a beta that is being used to fund the MMO.", "timestamp_created": 1504633627, "timestamp_updated": 1504633627, "voted_up": false, "votes_up": 111, "votes_funny": 7, "weighted_vote_score": "0.788872301578521729", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "34489112": {"recommendationid": "34489112", "author": {"steamid": "76561198131257913", "num_games_owned": 64, "num_reviews": 15, "playtime_forever": 25245, "playtime_last_two_weeks": 0, "playtime_at_review": 16383, "last_played": 1628642943}, "language": "english", "review": "I told myself, let me play this game about 7 days before I write an honest comment about it. 7 days ago I came into this game thinking it would be another Ark simulation, thus the content that I have experienced really blew my mind away. This is so much better than what the critics subjectively acused it of being. To be quite honest and since I have been playing sandbox MMO's for quite some time, since Star Wars Galaxies, I will say that Life is Feudal is not only ambitious and unique, but it is possibly one of the greatest sandbox ideas ever done. People complain about the grindiness, but let me be clear, it is not a game for people who don't enjoy putting in the work. You can't do everything in one day or even one week. You will not be able to experience everything even in one month. \n\nThis game is hardcore! You will need to work to level your skills and start from pretty much a primitive savage. Another thing, it is very difficult to play this game alone. You will need a friend (or friends) who will support and care about the game to actually enjoy this. Conan is so broken now, and the mobs are just silly, the combat is clunky and now broken also where when you run you automatically sheathe your weapon. In LiF none of that exist here. The combat is actually one of the greatest things about this game. Two things it reminds me of, and games that are dear to my heart: Mount & Blade Wardband with a ruthless feel of Mortal Online. \n\nYes! The combat is truly skill based (With first or third person options), probably with more combat ambition ever done in a game; from tactical formations, to siege equipment and mounted warfare. Each combat discipline has skill trees; Cavalryman Knight, Militia, Footman, Slinger/Archer, Assualter/Berserker and so many secondary options birthed from these parent trees. This game finally got combat right! But it is not just combat that is intriguing, but the entire crafting system. You have Carpentry, Masonry, Herbalism, Farming and Hunting with so many skills underneath these parent skills.  The graphics are breathtaking and the nighttime is dangerous and feels like a real forestry. \n\nAlso the weather system is very intricate. You actually have seasons that allow you to progress and do things like plant crops, plow and harvest resources. I am not sure how the cycle works, but since we've been playing on our server, every 24 hours is like a month. And you can see the months and days on your map.               \n\nNegatives\n\nThere are a few things that can be fixed and maybe this will happen in the MMO, when it releases. Character customization is really bad and the race selection in this game is minimal as well. There are pretty much four faces to choose from for everyone. Not much here, but so much better than that other stuff out there. Conan is pathetic and Ark is a waste of money. But Lif is a game for the ages. If you want to play a real game with little bugs and a fun and rewarding experience, with an opportunity to make your mark on a realm, I encourage you to check this game out. Please do it with friends though, because alone this game can be laborous to the point of rage quit. \n\nI hope this helps.", "timestamp_created": 1503692166, "timestamp_updated": 1506005314, "voted_up": true, "votes_up": 44, "votes_funny": 2, "weighted_vote_score": "0.787305355072021484", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "44565314": {"recommendationid": "44565314", "author": {"steamid": "76561198053739288", "num_games_owned": 77, "num_reviews": 8, "playtime_forever": 35341, "playtime_last_two_weeks": 0, "playtime_at_review": 34390, "last_played": 1498369873}, "language": "english", "review": "how could you destroy such a good game, life is feudal: your own was one of the greatest games ive played. As time went on the developers ruined the game with ridiculous changes that made no sense, not to mention the community was ignored. Having played lif YO for many hours and testing the mmo out of externally from steam, i can safely say life is feudal has become absolute trash, so please do not bother wasting your life on this game", "timestamp_created": 1536062723, "timestamp_updated": 1536062723, "voted_up": false, "votes_up": 53, "votes_funny": 3, "weighted_vote_score": "0.785868406295776367", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "31192368": {"recommendationid": "31192368", "author": {"steamid": "76561198180631541", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 192054, "playtime_last_two_weeks": 0, "playtime_at_review": 150068, "last_played": 1569711828}, "language": "english", "review": "At the time of this writing I have spent over 2500hrs in game.  That is over 100 days of game time.  What have I to say about my first 100 days?  \n\nYou will grind.  You will become the grindiest grinder ever.  If you stick with it.  \n\nIf you like games that will keep you coming back to finish what you started then LiF:YO is the game for you.  If you have the attention span of a tea spoon?  Maybe not so much.\n\nFinding an active server with an active admin is a big help in LiF.  Finding a server that suits your play style is very important too.  If you want PvP, there are servers for that.  PVE?  Yep, there's servers for that too.  I play PVE because I like to build and have alot of Netflix to watch but LiF offers many opportunities for many different play styles and schedules.\n\nOverall, like any game, there are frustrating aspects.  Mostly tea spoons crapping up the landscape with fences and furnaces that can't be removed easily.  Horse drawn carts are still not a thing and terraforming will suck the soul from your breathing corpse.  There are also some real positive aspects.  Community, a sense of accomplishment, different types of game play to suit your needs, a very deep skill tree and the feeling you get when you finally figure out how to do something and get to pass that knowledge on to someone else because you've been there and done that.\n\nOh yeah, the wiki is so out of date it still predicts Hillary will win.  Should probably work on that.", "timestamp_created": 1492403363, "timestamp_updated": 1492403363, "voted_up": true, "votes_up": 50, "votes_funny": 18, "weighted_vote_score": "0.784958243370056152", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "13903431": {"recommendationid": "13903431", "author": {"steamid": "76561197970485284", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 2593, "playtime_last_two_weeks": 0, "playtime_at_review": 1690, "last_played": 1512668671}, "language": "english", "review": "I spent my first day fashioning crude tools and scavenging for anything edible.  By nightfall I had yet to get a fire going and had no food left.  Across the bay, I could see another player's campfire flicker into existence.\n\nWorried that he may become technologically advanced and threaten my survival, I decided to sneak over to his camp in the middle of the night and club him to death with a tree branch.\n\nI now have fire and a handful of tasty berries.\n\n10/10", "timestamp_created": 1420773035, "timestamp_updated": 1422687050, "voted_up": true, "votes_up": 166, "votes_funny": 364, "weighted_vote_score": "0.784249305725097656", "comment_count": 11, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "17415348": {"recommendationid": "17415348", "author": {"steamid": "76561198123193011", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 129491, "playtime_last_two_weeks": 0, "playtime_at_review": 11591, "last_played": 1519757697}, "language": "english", "review": "you start off as sort of a drifter and slowly work your way up, gaining skills and exploring the island for resources. then you settle down (alone or with a group) and continually build a village/city/kingdom. this game is excellent for people who seek a challenge, like to create and build and want to shape the final product. if you only want games where you kill tons of monsters and grind for gear, LiF is not your \"cup of tea\". but if you like to build, shape your surroundings and create both an environment AND a community, I can warmly recommend this game. ;-)", "timestamp_created": 1438873975, "timestamp_updated": 1438873975, "voted_up": true, "votes_up": 57, "votes_funny": 2, "weighted_vote_score": "0.784199118614196777", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "43785960": {"recommendationid": "43785960", "author": {"steamid": "76561198283336003", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 157610, "playtime_last_two_weeks": 0, "playtime_at_review": 107497, "last_played": 1619958481}, "language": "english", "review": "You first need to learn to play the game a bit before it gets fun. And you have to build yourself a base. And with the Quality that makes a difference it takes a bit of finding and grinding. But it is definitly a game that is worth this effort. \nFor the Combat system alone i would reccomend it. And even though the game is mostly PVP based. \n\nThe differences in servers and their admins with their own rules make it a game for everyone that likes miedeval type games. Some servers focus on PvP but others focus on Role playing. So wheter you want to be an outlaw and go out robbing people. Or go be a farmer and trade your products with your neighbors. It is possible and definitly fun. \n\nIt is sad that alot of people view the game as unlikable because they don't have the patience for the beginning grind. But if you get in a new game. Ask around. There is a big chance someone will let you in their clan and teach you how it works. And in time you might do the same with other people. \n\nI definitly reccommend people to play it. And i normally don't write reviews. But i had to stick up for this game. Since alot of people trash talk it since they couldn't handle their life being feudal", "timestamp_created": 1532731156, "timestamp_updated": 1532731270, "voted_up": true, "votes_up": 48, "votes_funny": 7, "weighted_vote_score": "0.78344351053237915", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "31795520": {"recommendationid": "31795520", "author": {"steamid": "76561198050863280", "num_games_owned": 364, "num_reviews": 8, "playtime_forever": 59026, "playtime_last_two_weeks": 0, "playtime_at_review": 52780, "last_played": 1508089292}, "language": "english", "review": "Okay, To Start off I'd like to say the game itself has great potential and this could become something greater than it already, is having tons to do in game. The crafting system itself is very in depth though some of the recipes are a bit strange or off in my eyes. Also note that I’m not trying to be little, disrespect or flame the Dev’s I’m trying to give an honest review of my time spent playing the game and interacting with the Dev’s and customer service. The Game is great and worth $20 US - $30 US  NOT the current $39.99 US. Especially since the game has been “Released” and has still got many bugs and non working features “Tradepost, In-game Coin, and a Promised for 2 years Horse Drawn Cart”. Now we get to the Dev team and custom service to them it's just another \"trash\" project they happened to KickStart and made a bit of money from. Which happened to fund the first 3 months of productions and funded the base operations for LiF:MMO. Yes’ They mentioned the game was a Skeleton for the upcoming MMO but, that’s besides the point. This being said they've also stated in the beginning anything to be introduced to the MMO would be tested and introduced to LiF:YO first but, they have already backpedaled on this. Now Claiming they are going to test new ideas and Implementations on the MMO and introduce them to LiF:YO. On top of this they promised a copy of LiF:MMO and a Free Character to access the Closed beta wave 1 test runs but back pedaling yet again. They altered their store page to now say Open beta Wave 2 and never said a word about it. On that note they have even gone to the lengths of deleting Discussions in the Steam Forums to keep their image. So much so that when reading them to decide whether or not you’d wish to play the game. You’d probably buy it from reviews alone. I feel as if they have placed a false image of themselves as a company by using this tactic/method. I believe in the long run BitBox is going to leave it unfinished just like their past projects. Instead of doing as they have said/planned/promised they have pushed LiF:YO onto the back burners giving it a patch once a month. that normally breaks the game and takes another 1 or 2 hotfixes to make it playable again and focused in on the MMO that they will probably also fail on and leave behind with false hope and promises.\n\nI will Gladly Change my review if they start to address these major iusses with the game and staffing. Maybe a custom service class for thier folks would help?\n\nEDIT: The game has become abandon they even shutdown the MMO they made from it.", "timestamp_created": 1494973800, "timestamp_updated": 1644950977, "voted_up": false, "votes_up": 61, "votes_funny": 4, "weighted_vote_score": "0.78239595890045166", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "15261918": {"recommendationid": "15261918", "author": {"steamid": "76561197973049709", "num_games_owned": 1324, "num_reviews": 14, "playtime_forever": 1240, "playtime_last_two_weeks": 0, "playtime_at_review": 657, "last_played": 1456982424}, "language": "english", "review": "The game description for Life is Feudal: Your Own refers to itself as a \"realistic medieval multiplayer sandbox\". Sadly what has been delivered so far is a grind intensive RNG experience in frustration. While I have quite a few criticisms about this early acces game, in this review I will cover my initial thoughts, focus on my attempt at making a torch, and present my conclusion for the game in its current form.\n\nThe player starts off with a small amount of food and some clothes resembling a cloth sack. From there it is up to you to start living your life any way you want. I was initially surprised by the depth of options presented in the tool tips. I could prospect the ground for ore, strip the bark from a tree, collect sticks, search for edible food on the ground, and much more. I could already picture the village I would build in my mind, bustling with life and promise. How wrong I was. \n\nMost actions in Life is Feudal are painfully slow or based on random chance. Each time you search the ground for food the action takes a significant period of time and often turns out no results. If you don’t find food you don’t skill up. If you do find food you gain a skill up, yet seemingly don’t increase your chances of being successful in future searches. My friend and I tried with default settings and with skill gains set to high with the only benefit being additional skills unlocking faster. The only things in the game that are close to realistic are extremely frustrating. Digging a tunnel  or terraforming takes a very long time and requires you to go drop all your dirt in a different location after every 5 or so digging actions.\n\nOne of the most pointless grinds I have experienced is trying to create a torch. Torches are often one of the first items crafted in a sandbox game and usually one of the most simple. This is not the case in LiF:YO even though only two materials are required. The first material, a stick, is easily gathered from a tree. The second, naptha, is synthesised from herbs. The process is as follows: \n\n- Create a sickle,\n- Search for herbs \n- Gather the herbs\n- Discover their properties by combining random herbs\n- Gather more of the herbs that have the correct properties\n- Create the naptha\n\nWhile this initially doesn’t sound too difficult it is important to note that all the herbs look the same. You are given a random herb each time you gather so you cannot focus on collecting a certain type. Each herb was taking around 10 seconds to pick up and there are also a lot of different herb types which makes the odds of geting a specific one a lot worse. Due to poor inventory management/UI it takes a long time to combine herbs to discover what properties they have. After devoting more than half an hour to nothing but gathering and combining herbs I had not found the correct ones to make torches. In comparison It was far easier to build a house.\n\nTo conclude, my biggest problem with LiF:YO is that the developers seem to equate realism with random chance. If the game were more realistic a player would be able to identify herbs by sight before gathering them. Players would be able to locate berries and mushrooms visually instead of having to click on a tile hoping for the RNG gods to award them something to eat. While the idea of the game has merit and the future of the game does not look entirely grim it is my hope that the developers shift a focus more towards something that is more user friendly and gives rewards based on work and skill rather than random chance.", "timestamp_created": 1428486585, "timestamp_updated": 1428552114, "voted_up": false, "votes_up": 155, "votes_funny": 10, "weighted_vote_score": "0.781192362308502197", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "23346058": {"recommendationid": "23346058", "author": {"steamid": "76561198014550946", "num_games_owned": 0, "num_reviews": 40, "playtime_forever": 6585, "playtime_last_two_weeks": 0, "playtime_at_review": 4782, "last_played": 1564418956}, "language": "english", "review": "Background: I have little time in survival/crafting games other then some time I put into minecraft years ago and a few hours in Don't Starve. The fact that they are all in early access for years turns me off. I followed this game since release because I liked the setting but only picked it up around March16 after they had upgraded the engine and ironed out alot of issues people complained about. I just had the itch to craft.\n\nShort and Sweet: Deep crafting systems, nice graphics, Long building times and skilling up can be a negative to some but it makes the accomplishment SOOOO sweet. Engine still seems to have issues and doesn't run great, concerning if they are using the same everything for the MMO. Worth it if you enjoy crafting games and don't mind that it takes awhile to craft things.\n\nNotes: I originally was turned off by the menu system, \"why can't I just click a bunch of times to chop down a tree?\" Well you can set an action to default click the menus are there because of all the options and how deep the game is compared to most open world/crafting games on the market. \n\nBottomline: I spent 70 hours on a server that had speed up on leveling up your skills as well as a higher cap, however things still went at a snails pace. This is a great crafting/openworld ONLY if you can deal with the slow pace. Example: If you need logs for a house? You have to carry a giant log on your back slowly to your work site. Not just chop it down and place 30 logs in your inventory.", "timestamp_created": 1464882000, "timestamp_updated": 1464882000, "voted_up": true, "votes_up": 47, "votes_funny": 3, "weighted_vote_score": "0.780708670616149902", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "12211891": {"recommendationid": "12211891", "author": {"steamid": "76561198037937903", "num_games_owned": 601, "num_reviews": 9, "playtime_forever": 1460, "playtime_last_two_weeks": 0, "playtime_at_review": 1262, "last_played": 1442349150}, "language": "english", "review": "I don't know where to start with this review, but. Life is Feudal is a big open-world medieval sandbox game, i liked it as soon as i saw it, had my doubts about it but so far it is just as great as i expected it to be.\n\nYou WILL feel its an Alpha game, that is unavoidable of course, but for an Early Alpha it's really awesome.\nIt might be known as crash-simulator 2014, but after some tries with sick taming skills you will most likely get it working.\n\nThe game is positively builded up in a way which makes co-operation important, which is realistic considering most games like these are filled up with players who kill on sight. It features a high range of skills which mainly makes you focus on some hand-picked individual ones.\n\nOverall some amazing work done by the devs, can't wait for this to get fully developed.\n\n\n", "timestamp_created": 1411519492, "timestamp_updated": 1411519492, "voted_up": true, "votes_up": 108, "votes_funny": 0, "weighted_vote_score": "0.780331313610076904", "comment_count": 11, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "119411520": {"recommendationid": "119411520", "author": {"steamid": "76561197975080813", "num_games_owned": 167, "num_reviews": 32, "playtime_forever": 2005, "playtime_last_two_weeks": 0, "playtime_at_review": 2005, "last_played": 1464902670}, "language": "english", "review": "1. This game is not worth the money\n2. The devs abandoned this game still broken, buggy and without key promised features\n3. The Developers are notorious for taking your money during early access and never finishing their games.\n\nDon't be fooled by a few *new* positive reviews, read the older -honest- ones before buying.\nIf you read 3 Helpful/Negative reviews and still think this is worth 20 bucks, by all means.", "timestamp_created": 1658703870, "timestamp_updated": 1658703870, "voted_up": false, "votes_up": 40, "votes_funny": 2, "weighted_vote_score": "0.77809518575668335", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "41992819": {"recommendationid": "41992819", "author": {"steamid": "76561198091066625", "num_games_owned": 14, "num_reviews": 5, "playtime_forever": 60838, "playtime_last_two_weeks": 0, "playtime_at_review": 56198, "last_played": 1560494583}, "language": "english", "review": "Being a former game developer, I have serious issues with the direction of LiF-YO. I will only list the worst ones here.\n\nThis new random crop-cycle farming approach makes no sense. Your crops used to advance in stages and be ready to harvest around the time that you usually log in, with default server settings.\nNow crop progression is random, from planting to harvesting it goes in stages that advance depending on day/night cycle random weather changes. This means that it is random whether or not your crops advance to the next stage towards the harvest-ready end stage, making the time of real-life day that your crops are ready also random. You can plant crops at 9:00pm and they can be ready for harvest at 3:00am a few-to-several real-life days later, you have no way of knowing.\nIt is a video game, but in order to prevent losing your crops you are forced to log in multiple times a day to check on them. Most people already have a real-life schedule. If you miss the harvest (3:00am in my example), your crops will be rotted and gone by the time you log back into the game, wasting a few-to-several real-life days of game play.\nThis random-farming-result makes the game unplayable. Some people work with it by having others log in to check the crops, or they log in a few times a day, or they have multiple crop fields with different planting times, or they may change the default settings, which causes problems in other places. These are all workarounds for a bad design.\nTwo things: either the random-crop-stages need to go, or the rot-time needs to be over 24 real-life hours. There is NO REASON to have crops, IN A VIDEO GAME, that take a few-to-several real-life days to grow, die before you can log in.\n\nThe storage interface has always been an issue. There are different quality levels for everything, and no way of automatically stacking based on quality. You either horrifyingly stack every like-item automatically, or manually stack like-quality items, or have a ton of stacks of the same item all over the place. Items stack underneath other items making it so that you do not know what you have unless you move everything around to check underneath it. Items in your inventory and storage do not have hit-boxes, so in order to select an item, you have to have your mouse cursor over the item, even if that item is only a pixel or two wide, making it very difficult to quickly select items.\n\nThe interface has had issues since day one. One of the biggest is with the two-modes. You have a movement-mode, where you cannot see your mouse cursor and your mouse changes your viewing direction; and you have a select-mode, where you can see your cursor and you can use it to interact with items on the screen. When you go to craft something you will NEVER BE MOVING. No one will ever move when crafting, but when you start crafting the mouse cursor disappears and it goes into movement-mode. This is a time when you will be selecting items on the screen while crafting, but it changes to movement-mode for some unknown reason. Each time, you have to change it back. There is just no reason for this. There are other times when the game puts you in select-mode when you will always need to be in movement-mode.\n\nCurrently, items degrade very fast. Early in the game, if you make a furnace and forge, you will spend time smelting iron and making nails to use for repair kits to repair the furnace and forge from the damage they took from making the nails. If you do not, they will be unusable for anything else.\n\nPeople play the game and work around these issues, but that doesn't change the fact that they need to fix these. Some of the issues have needed to be fixed since day-one.", "timestamp_created": 1526111626, "timestamp_updated": 1526111794, "voted_up": false, "votes_up": 45, "votes_funny": 1, "weighted_vote_score": "0.77679443359375", "comment_count": 11, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "34876489": {"recommendationid": "34876489", "author": {"steamid": "76561198233821552", "num_games_owned": 38, "num_reviews": 6, "playtime_forever": 1920, "playtime_last_two_weeks": 0, "playtime_at_review": 1920, "last_played": 1502934060}, "language": "english", "review": "I was convinced to buy this game by a friend, and I knew what I was getting into based on the gameplay explanation alone.  I knew it would be a grind, and even during the grind and thinking \"Life is too short for a game about digging dirt\", I knew that I was building something with my friend, something unique to all other settlements - even in minor ways.  THEN THE SERVER WIPE!  Most servers that had acceptable ping and enough players for a good time had server wipes every 6 months or so, which wipe all player-built settlements and progress from the server, and you start all over.  \n\nPart of the advertised gameplay is that you can lose ALL your stuff by enemy players, or even an ally betraying you.  This is worse than that.  You might need more than 6 months - balancing all the other responsibilities you have IRL - to build a settlement with stone walls, with just two players.  But even if you have a team of 20 players working on an eventual-castle, you got no choice but to deal with the server wipe.\n\nLife is More Precious: Than This Game.", "timestamp_created": 1505103597, "timestamp_updated": 1505103597, "voted_up": false, "votes_up": 158, "votes_funny": 17, "weighted_vote_score": "0.776777684688568115", "comment_count": 13, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "19125868": {"recommendationid": "19125868", "author": {"steamid": "76561198045136065", "num_games_owned": 253, "num_reviews": 19, "playtime_forever": 7988, "playtime_last_two_weeks": 0, "playtime_at_review": 6102, "last_played": 1497676457}, "language": "english", "review": "Only play this game if you've got alot of time on your hands that you're willing to commit to it. it takes a good long time to do anything, but for this type of game that isn't necessarily bad. There is an actual feeling of acomplishment when you and your group finish something that you had to put alot of effort into. Things aren't exactly clear as to what you need or what you need to do, but the community (at least what i saw of it) is almost always willing to help you figure things out. Which is more than i can say for alot of survival game communitys *cough* rust *cough cough.* If you're going into it alone don't be afraid to ask to join groups. they won't always accept you, but the ones that do are really the ones you want to group with anyway. Anyway, yes the game is enjoyable, don't go into it thinking \"I'll just play it every once in awhile,\" and make sure to find yourself a good group. Do these few things and this game is worth the time really.", "timestamp_created": 1447746996, "timestamp_updated": 1447746996, "voted_up": true, "votes_up": 105, "votes_funny": 6, "weighted_vote_score": "0.776007771492004395", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "12186969": {"recommendationid": "12186969", "author": {"steamid": "76561198022860976", "num_games_owned": 696, "num_reviews": 59, "playtime_forever": 4891, "playtime_last_two_weeks": 0, "playtime_at_review": 4020, "last_played": 1506741586}, "language": "english", "review": "I am really liking what I'm seeing from the sandbox/exploration sense. I'll be keeping a close eye on this! Here's a quick video of my early experience with LiF: https://www.youtube.com/watch?v=QY_T4RMiYuo", "timestamp_created": 1411397999, "timestamp_updated": 1413040633, "voted_up": true, "votes_up": 91, "votes_funny": 1, "weighted_vote_score": "0.774306654930114746", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "86918827": {"recommendationid": "86918827", "author": {"steamid": "76561198004011207", "num_games_owned": 244, "num_reviews": 73, "playtime_forever": 439, "playtime_last_two_weeks": 0, "playtime_at_review": 385, "last_played": 1613627113}, "language": "english", "review": "Don't waste your money on this.\n\nThe Steam profile describes this as a game that allows you to build and explore a medieval world however you want.  Everything suggests you can build a house or a town or whatever you want, and all will be fine.  Wander out and go hunting.  Farm.  Get creative.  It even looks like you can get NPCs to live in your towns if you get it up there.   In short, exactly what I was looking for.\n\nIt's actually an MMO with subscription services (pay them $$ to do things in game).   I can't actually own the little shack I built because I need to claim the land.  How do I do that in a server that has just me in it?\nFind the castle and pay in game coins every day to claim it.   How do you get these in-game coins?  Pay real money for them seems to be the most common method unless you're in a big guild...\n\nFirst, there is no castle anywhere.  No NPC city, no crown land.  Nothing.\nSecond, I don't have a big guild because I'm the only person in my private server.\n\nEssentially, they took a game that was an interesting combination of Mount & Blade, Conan Exiles, and Minecraft, and F'd it all up with a cash grabbing scheme.   A sneaky, underhanded one since they don't ever make it clear how this MMO stuff impacts the game as described.", "timestamp_created": 1613610268, "timestamp_updated": 1613610268, "voted_up": false, "votes_up": 101, "votes_funny": 4, "weighted_vote_score": "0.772790253162384033", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "13916384": {"recommendationid": "13916384", "author": {"steamid": "76561198035480867", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 11578, "playtime_last_two_weeks": 0, "playtime_at_review": 1964, "last_played": 1451055051}, "language": "english", "review": "I'll be honest. This game does love to eat your time. After you build your first shack you feel invincible... until a naked man with a 2h sword chases you away, but if you pray really hard you can just fall from the sky back home. Lots of time digging ditches, finding clay, making things with clay, wondering why you can't make more things with clay, drop all your clay, and go back to digging ditches. \n\nIt makes you wonder why you don't just go outside and dig a ditch, but let's be serious it's cold out, or hot out idk i don't go outside. \n\nAnyways 10/10 awesome.", "timestamp_created": 1420847686, "timestamp_updated": 1420847686, "voted_up": true, "votes_up": 66, "votes_funny": 151, "weighted_vote_score": "0.769194185733795166", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "13123268": {"recommendationid": "13123268", "author": {"steamid": "76561197974314933", "num_games_owned": 783, "num_reviews": 2, "playtime_forever": 15093, "playtime_last_two_weeks": 0, "playtime_at_review": 6533, "last_played": 1577214046}, "language": "english", "review": "Bearing in mind this is infact an alpha (which many gamers are forgetting nowadays means there will be bugs and issues).\n\nThis is a really fun and addicting crafting/survival game. It relies on teamwork to go beyond having a small hutt in a forest. You need a cook, a miner, a blacksmith, lumberjack, farmer, etc. You can't be all at once, so you actually need to be a part of a group to get anywhere. You can build everything from a tiny wooden hut, to a spawling castle with its own village inside massive stone walls.\n\nPlayable? Yes. Though there are optimization issues. FPS isn't amazing unless you turn your settings way down.\n\nEnjoyable? Definitely. This is an amazing concept for a survival game. Every update adds more features to the game to make it more addicting.\n\nTotal recomendation: Great for survival/crafting game lovers. Has more realism to it than most. There are many bugs and missing features, but this is also nowhere near being released, and updates come frequently enough to keep you interested.", "timestamp_created": 1417189573, "timestamp_updated": 1417189573, "voted_up": true, "votes_up": 127, "votes_funny": 0, "weighted_vote_score": "0.768938839435577393", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "107225720": {"recommendationid": "107225720", "author": {"steamid": "76561198013665015", "num_games_owned": 213, "num_reviews": 1, "playtime_forever": 11003, "playtime_last_two_weeks": 0, "playtime_at_review": 9776, "last_played": 1664710147}, "language": "english", "review": "I can see a lot of reviews stating that this game will no longer be supported as of the 18th January 2022, THIS IS INCORRECT!!!. if you read the articles properly, it is the MMO variant of the franchise that is no longer being supported, they state very clearly that the 'your own' and 'village life' versions of the game are not being effected. \n\n", "timestamp_created": 1641221014, "timestamp_updated": 1641221014, "voted_up": true, "votes_up": 75, "votes_funny": 5, "weighted_vote_score": "0.768765628337860107", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "12384934": {"recommendationid": "12384934", "author": {"steamid": "76561198076033989", "num_games_owned": 1841, "num_reviews": 33, "playtime_forever": 1961, "playtime_last_two_weeks": 0, "playtime_at_review": 1434, "last_played": 1457162442}, "language": "english", "review": "Thanks to the developer of this game, finally i fulfilled my dream to become a [strike]mighty and noble medieval warrior[/strike] farmer", "timestamp_created": 1412569609, "timestamp_updated": 1412569609, "voted_up": true, "votes_up": 172, "votes_funny": 2, "weighted_vote_score": "0.768266558647155762", "comment_count": 10, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "145623873": {"recommendationid": "145623873", "author": {"steamid": "76561198103380397", "num_games_owned": 130, "num_reviews": 2, "playtime_forever": 152191, "playtime_last_two_weeks": 0, "playtime_at_review": 143635, "last_played": 1707511575}, "language": "english", "review": "this game used to be the pinnacle of medieval sandbox pvp and pve experience, im a stark believer that the MMO's implementation killed this game outright and caused what could have been something really special to slip through the cracks. Heres to hoping another studio can do better by this hidden gem and revive its player base.", "timestamp_created": 1693782675, "timestamp_updated": 1693782675, "voted_up": false, "votes_up": 29, "votes_funny": 1, "weighted_vote_score": "0.7652243971824646", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "13861051": {"recommendationid": "13861051", "author": {"steamid": "76561198052743411", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 1032, "playtime_last_two_weeks": 0, "playtime_at_review": 912, "last_played": 1457243492}, "language": "english", "review": "Spawned in and immediately became a groups slave by force. They dropped a picaxe on the ground and told me to start mining if I want to survive. In the mining hole is where I now and the others live, working for food.\n\n\n10/10", "timestamp_created": 1420532611, "timestamp_updated": 1420532611, "voted_up": true, "votes_up": 68, "votes_funny": 129, "weighted_vote_score": "0.762570500373840332", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "30450114": {"recommendationid": "30450114", "author": {"steamid": "76561197985976832", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 25495, "playtime_last_two_weeks": 0, "playtime_at_review": 20582, "last_played": 1491966409}, "language": "english", "review": "It's a very grindy co-op sandbox. Where Grindy just doesnt really do any justice as to explaining how grindy the grind actually is. It's a kind of rewarding grind though.. in a Stockholm Syndrome sort of way.\n\n       \"Oh! It gave me a point! It likes me...\"\n\nYou'll also need to con at the very least, 4-5 friends into playing with you for around 20+ hours before you'll have almost gotten to a point where you feel like you may be able to accomplish something soon... maybe. The only way to get anywhere solo, you would need to run your own server and then cheat. I saw in another review, \"The only thing that comes easy in this game is Death\" and that is the truth!\n\nIt's not ready, yet. Which pisses me off, because I really want to play this game! I played a fair bit when it first came out and decided to put it down for awhile due to bugs/burnout. I've come back again after a year or so and I can tell there's been some progress but it's still too buggy for me. I'm 20+ hours back into the game and I've found a bug that basically has the entire group stuck in limbo on the cusp of getting metal tools for the first time... and it's not going to happen. So we're going to put it back in the oven for another year. Expect an update in 2018... fingers crossed.", "timestamp_created": 1489247553, "timestamp_updated": 1489248250, "voted_up": false, "votes_up": 40, "votes_funny": 9, "weighted_vote_score": "0.761826574802398682", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "77776219": {"recommendationid": "77776219", "author": {"steamid": "76561198114950823", "num_games_owned": 0, "num_reviews": 64, "playtime_forever": 6644, "playtime_last_two_weeks": 0, "playtime_at_review": 6644, "last_played": 1603046415}, "language": "english", "review": "Years of development for little improvement. The game has continued to get more complex, the UI is crummy, and it's all running on a crappy game engine. \n\nEven with cheats, the game is very slow and grindy... Combat hits miss half the time because of bad collision detection. \n\nDevelopment has slowed to a crawl, maybe a bug fix patch every 3 months. \n\nThis was a very cool and ambitious project, but it hasn't been able to advance properly... At this pace of development, maybe in 2040, they'll release a game that would have been cool in 2018. \n\n", "timestamp_created": 1603046916, "timestamp_updated": 1603046916, "voted_up": false, "votes_up": 37, "votes_funny": 2, "weighted_vote_score": "0.761411964893341064", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "17018991": {"recommendationid": "17018991", "author": {"steamid": "76561197980973212", "num_games_owned": 0, "num_reviews": 17, "playtime_forever": 24070, "playtime_last_two_weeks": 0, "playtime_at_review": 3798, "last_played": 1608933399}, "language": "english", "review": "First, I would like to say that you will either love or hate this game, and you will know it within the first few hours of playing. I dont see anybody that just sort of plays this game here and there for fun. This game simply does not work that way. However, I will dissagree with other reviews in regards to playing alone. I play alone, and have my own little medieval farm tucked away surrounded by forest. It took me many many hours to get to that point, and the server does not skill cap anything, so people can level up as much as they want. Those types of servers, one can go solo and thrive. \n\nWith that little background, the game is for the most part realistic. Almost everything in this game is time consuming, and Im not going to lie... perhaps a little too time consuming. I have a small hut, back yard garden with wattle fence surrounding it, and that literally took me three days to build. However, during the time of construction, I had to stop and go looking for food because the last thing you want to do in this game is die. \n\nSo what is the goal of this game? What ever you want it to be. My goal was to simulate a nice little medieval farm, tend to it, improve it... etc. I am very pround of what I have built, and this game has some lasting rewards. Some may strive for control, the amount of weapons and possibilites in this game is ridiculously huge thus allowing them to control by force is neccessary. However, you will not really find players like Reign of Kings, just running around killing people. You dont do that in this game because their is just too much to lose, too much progress, and too much hard work being put in by people. With that being said, the community is awesome, very mature, and helpful. \n\nBuy this game if you......\n\n1. Want realistic medival simulator\n2. Are a dedicated player \n3. Willing to actually learn the game, because the learning curve is huge!\n\nDo not buy this game if you...\n1. Are a casual PC gamer\n2. Think progress in Rust, or Reign of Kings is too slow\n3.  Cant deal with a little bit of bugs, not game breaking... but complete lack of understanding for early access games.", "timestamp_created": 1436745139, "timestamp_updated": 1436745214, "voted_up": true, "votes_up": 62, "votes_funny": 3, "weighted_vote_score": "0.760993897914886475", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "130134156": {"recommendationid": "130134156", "author": {"steamid": "76561198056022059", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 14117, "playtime_last_two_weeks": 0, "playtime_at_review": 8267, "last_played": 1675349243}, "language": "english", "review": "This game is terrible, and I love it.\n\nDon't buy it!\n\nLife Is Feudal is a game for the nichest of niche playerbases, and even so was an utter failure in delivering on its promises around its hayday. Today, it stands as nothing but sheer abandonware, seeing no updates since around 2017 - at which time the developers attempted to make it into an MMO, and then promptly demolished that version of the game, leaving behind only this one.\n\nModding and a closely-knit, small community are what have kept any playerbase at all within the game's few servers. The gameplay is grueling, grindy to an absurd degree even, and is *not* for the usual player to enjoy in the least. It's survival mechanics and cooperative gameplay taken to an extreme, and while some would argue it's \"hardcore\" - in reality it's just kind of tedious.\n\nThe reason I've played it so much is because the game scratches some *very* particular itch for me at the moment. It was on sale for 3€ when I got it, which is not a terrible price tag at all for something like this. It could be argued the game's hardly worth that much, but in my case it was well worth the few bucks.\n\nIn good conscience however, I cannot recommend it to anyone else at all. The game fundamentally is not a good one, and I recognize that - I simply have a knack for acquired tastes, and this is definitely one.\n\nAgain, don't buy it!", "timestamp_created": 1672862831, "timestamp_updated": 1672862831, "voted_up": false, "votes_up": 60, "votes_funny": 6, "weighted_vote_score": "0.760755598545074463", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "48911163": {"recommendationid": "48911163", "author": {"steamid": "76561197962390429", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 76707, "playtime_last_two_weeks": 0, "playtime_at_review": 69615, "last_played": 1608386725}, "language": "english", "review": "The game is dead and effectively abandoned by the Devs who ignored and drove away the casual player base.  This is really a shame because the RP potential this game has as a medieval survival sandbox is incredible.\n\nLIF was very good back in the “twitch dynasty” days and I wanted it to succeed (i have over 1k hours, not that that matters).  To be sure, everything about this game was always a grindfest.  However, many of the gameplay changes the Devs have implemented, although well-intentioned, has made LIF more tedious, more time consuming, and unplayable for those with IRL obligations.  Playing a video game should not be like taking on a boring, repetitive, menial, or soul-crushing job.  I already have one of those.\n\nTo name a few, current examples of the grind in LIF (there are many, many more):\n-Region specific resources to make certain buildings (e.g. you need to smelt an ingot from rare copper found only in a specific region in order to make a fucking kitchen).\n-Animals coops and barns need to be tended to at least once each IRL game.  Fail to do so and your animals either starve to death or die in their own filth.\n-Player planted trees and crops take roughly 3-11 IRL days to grow and die within a 1-2 IRL days after reaching maturity.\n-Use of crafting buildings causes degradation to the point that the player must repair the building for it to become usable again.  There is way too much time spent in the cycle of: smith items, blacksmith shop breaks, make repair kits, repair blacksmith shop, smith items, repeat ad infinitum.\n-Player made monuments protect your claim from looting by other players, but require constant upkeep to maintain the claim.  Spend a week away from the game and the monument with destroy itself, opening your claim to looting or a for a squatter to move in and take over your claim.", "timestamp_created": 1549831055, "timestamp_updated": 1580135014, "voted_up": false, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.760558009147644043", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "12237094": {"recommendationid": "12237094", "author": {"steamid": "76561198041433797", "num_games_owned": 498, "num_reviews": 4, "playtime_forever": 3896, "playtime_last_two_weeks": 0, "playtime_at_review": 2084, "last_played": 1510612176}, "language": "english", "review": "First off Let me be clear this game is buggy its glitchy your server will probably crashed every hour. theres no back button to the main menu only an exit button. Features are missing and the ones that exist are not even that fully fledged out. That being said. This game is great at what it is now. Honestly if the devs ended up fixing just the bugs and crashes and for some reason abandoned the game. I would feel as though I got my moneys worth. However there are certain things you should know before purchasing this game to make sure you do get your moneys worth. \n1. Have friends. This game will not be nearly as much fun alone and if you play on a multiplayer server. You need friends. Or atleast find some other players to join\n2. This game is Hard not like oh its a challenege I mean like you will spend an hour hitting a rock with a pickaxe trying to create a tunnel to mine from. You need to be willing to invest time and to learn the crafting system.\n\nIf you can deal with these two things you should be fine. Another thing I noticed is people complaining about the combat. The hit detection is actually amazing if you miss its because you suck. That being said the swing direction registering is not nearly as good as M&B IMO\n\n", "timestamp_created": 1411673678, "timestamp_updated": 1411673678, "voted_up": true, "votes_up": 52, "votes_funny": 0, "weighted_vote_score": "0.760342299938201904", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "15317070": {"recommendationid": "15317070", "author": {"steamid": "76561198061740176", "num_games_owned": 0, "num_reviews": 275, "playtime_forever": 9038, "playtime_last_two_weeks": 0, "playtime_at_review": 9011, "last_played": 1452211750}, "language": "english", "review": "Have to delete this old positive review and change it to negative. They switched to MMO version, gave their old buyers NOTHING in return for the $40 minimum that they spent, and still expect us to keep playing the game for some reason. This has to be some form of fraud.", "timestamp_created": 1428814989, "timestamp_updated": 1576615200, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.760314047336578369", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "12181230": {"recommendationid": "12181230", "author": {"steamid": "76561198042763625", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1079, "playtime_last_two_weeks": 0, "playtime_at_review": 97, "last_played": 1476830828}, "language": "english", "review": "The developers are seeming quite shady. Deleting ANY forum thread on steam that remotely mentions their overpriced early release game, Or, The fact that they delete any thread that draws attention to a negative point about the game should be a red flag.\n\nNotice the 10/10 review from HotRise here on metacritic?\n\nGo check out the life is feudal website and notice how similar their 'selling points' are.\nHotRise's review has no ACTUAL cons. This is a typical market tactic. Look constructive and modest, yet, have no ACTUAL downside.\n\nThe developers aren't well known. And while this DOES NOT mean they shouldn't be trusted, it DOES mean to be careful.\nHow do we do this?\nBy monitoring their \"First impression practises\"\n\nI have seen a video from AffectiveGamers/DecryptedGaming on steam that he did himself that sums them up very well if you want to see this video click the link http://encryptgames.wordpress.com/2014/09/22/too-much-power-for-steam-developers/\n\nWhat are they?\n-Overpriced $40 early-release (very unfinished) game. (When compared to Rust and DayZ both having big names behind them, lots of trust, and a less expensive early release product)\n\n-Lack of professionalism Re: not being able to take consumer criticism, and instead deleting any sign of it. (This is propaganda)\n\n-The developers don't seem to have a decent grasp on marketing and sales.\nAnd think about this.\nIt is a scary thought that a bunch of people who may or may not be able to create a game will pull out random figures of \"we need $200,000 for making the game\" without being able to tell you where the money will be spent and why.\n\nA bunch of people who don't understand market trends and values and will charge twice what other more well-established companies charge for an Early Release game without understanding that as an upstart company, where there has been no established trust, that they need to charge less to sell more.\n\nAnd this will potentially create more revenue, but, DEFINITELY generate a larger \"copies sold\" statistic. Which in of itself, creates more trusted statistics for further backing/sponsorship/sales.\n\nThis game may be great. But right now, the developers seem to be a bunch of guys who haven't much idea about business.\nMaybe they can design a game. But it takes more than that to be successful.\n\nToo scared to pay $40 and watch the company shut-down so I could just make a few people rich. As has happened with 'companies' in the past.\nWhen and if the \"company\" starts acting more professional and less shady/disrespectful to their consumer-base, I will re-do my review.\n\nUntil then, I will have a close eye on them. And also warn others to not throw $40 down the tube to a company who's LEAD DESIGNER has doubts about the probability of success.\n\n\nEdit:\nTo the people that are saying that I am wrong I may be BUT these are my 2 cents I am tentively watching this game as I LOVE the idea. Ever since I started gaming I drempt of this game. To the developers I hope you guys keep with the development of this game, you guys are definetly on too something here! Also as the Lead developer stated in the comments he has gained faith with all those that have bought this game for the generous fee of 40 dollars, this is reassuring and I am glad he stated that.\n\nAll in all I am excited to see where this goes and ill be happily playing every update while updating this review.\n\nThere is nothing \"butthurt\" about my review I am just warning people what I have seen and observed. When someone makes a game you dont critique the game you critique them in a way. That is THEIR hard work and artwork. I like to review the developers of games because you can really see their motives and if they have a true passion for the game because when it comes down to it its not about the money when your making a game (it does help dont get me wrong) but you have to be intrested in the game also it is just like studying in college for your major. If you dont like the subject you dont want to study.\n\nI hope you guys understand I am not \"butthurt\" about the game or the developers. I am excited for the game but in its current state it is a bit scary for \"investors\" to slap down 40 dollars for a game that may not live up to 40 dollars that is all.\n\nAll in all again I am excited to see where this game goes and I wish everyone the best.\n\n-Tanker", "timestamp_created": 1411342442, "timestamp_updated": 1412885354, "voted_up": false, "votes_up": 1007, "votes_funny": 0, "weighted_vote_score": "0.759162962436676025", "comment_count": 100, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1415660928, "developer_response": "We have responded with this information to the reviewer in the hopes that any confusion may be addressed and what is written here be re-evaluated in light of these facts.\n\nThe game has been extremely successful selling over 100,000 copies in the first month alone, so of course this game will be a complete stand alone finished product projected to reach final release in Q3 2015. It defies any logical reasoning why a person or company would not complete a project that has been this successful.\n\nA few seem to get confused and seem to think this is just to fund the mmo version. The confusion comes from some outdated information on our part as developers \"which is being corrected\", and the fact that this game Life is Feudal:Your Own utilizes and shares 90% of the code the MMO version will have. For some reason few seem to think because of this we will just abandon this game and develop the mmo. As I pointed out in the paragraph above this would defy logic and of course we will complete this game.\n\nThis will remain a feature complete stand alone game and the MMO will be a completely separate game. We actually expect many to fully enjoy this game and with full modding support we expect it to have a long life as a great 64 player version of Life is Feudal that will be around for many years to come.\n\nAs a bonus of purchasing this game you will receive a free permanent character in the MMO version of Life is Feudal as well which will have a free trial, but is a buy to play massive MMO holding a projected 10,000 players per server.\n\nThe bonus of both titles sharing 90% of the same codebase is we are literally working on both projects at once so of course based on the popularity of this 64 player version and the completion projected in Q3 2015 will allow us to apply the work done directly to the MMO version greatly speeding up development time and release of the MMO as well.\n\nThanks for taking the time to read,\n\nThe Dev Team"}, "93276500": {"recommendationid": "93276500", "author": {"steamid": "76561198133505895", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 30245, "playtime_last_two_weeks": 0, "playtime_at_review": 4051, "last_played": 1632620429}, "language": "english", "review": "The learning curve is hard. DO NOT PLAY THIS GAME BY YOURSELF!\nfind someone who can teach you or you're going to really want those $4 back lol. \nThe MMO is dead, and \"Your Own\" are your typical Ark : Survival concept servers. \nThe crafting is extremely intricate but rewarding once you finally build something like a shovel xD\nOnly 2 types of people play this. Roleplayers and Legacy PVP'ers (you will get beat down pretty hard). (Cause this is not a pick me up)\n\n", "timestamp_created": 1622959510, "timestamp_updated": 1625305006, "voted_up": false, "votes_up": 75, "votes_funny": 25, "weighted_vote_score": "0.758914351463317871", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "31637445": {"recommendationid": "31637445", "author": {"steamid": "76561198015467209", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 36269, "playtime_last_two_weeks": 2592, "playtime_at_review": 15343, "last_played": 1713800452}, "language": "english", "review": "The game play is fun. The PVP system is well balanced from what i've experienced. Crops grow at a fast enough pace when the day/night cycle is 3.\n\nHOWEVER...\n\nIn order to do anything in this game you need wood...\n\nQuality is what you need from everything...\n\nThey have seriously GIMPED the ability to actually farm your own trees. It takes you 9 IRL weeks to get Oak trees to max. So you know, thats stupid long. I want to enjoy playing the game, not waiting for the game to do things. I got it, you want us to farm the trees from the mainland, but screw that. \n\nHere is a way to fix this:\nFirst off, let us select day length and night length seperately. Maybe I want a server with only an hour of day time for 4 hours of night... or vise versa.\n\nNext, let the tree and plant growth be seperate settings. and let us change them. Yes, we're asking a lot here. But seriously... 9 weeks for a tree to grow? 3 weeks on the lowest setting? screw that. We are playing a game, but playing real life.\n\nFinally, is there ANY way you guys can figure out how to put a horse onto the trade cart? The trade cart is USELESS once you have a horse. I can tow 1200 slow as balls, or i can do 4-5 trips at 450 ish while on horse. There is NO benefit to using the cart.", "timestamp_created": 1494291762, "timestamp_updated": 1494291762, "voted_up": false, "votes_up": 88, "votes_funny": 9, "weighted_vote_score": "0.757369577884674072", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "22731097": {"recommendationid": "22731097", "author": {"steamid": "76561198039425988", "num_games_owned": 353, "num_reviews": 170, "playtime_forever": 11537, "playtime_last_two_weeks": 0, "playtime_at_review": 9760, "last_played": 1463150829}, "language": "english", "review": "Life is Feudal: Your Own Review \n8.5/10\n\nI bought this game last week as I wanted to play with friends, and had just tried ESO and it was not scratching my itch. I watched some review videos, and LIF caught my eye as something I would be into –after all, who doesn’t want to be a peasant and eek out an existence in a bleak wilderness setting? As long as my aspirations of Knighthood remained viable, there should be reason for optimism…or so I told myself.\n\nI hit the server with my buddy, Drek Stonebrow, and after several futile attempts to find each other, we finally hooked up –two disheveled figures in rags, hugging each other atop a bluff as night settled in. We marched to a location Drek had noticed on his way to me, and we settled in under the stars with our newly fashioned sleeping mats.\n\nOn the first day we spent several (Real) hours crafting primitive tools and experimenting with them. Yup this new shovel will lower and raise the terrain…oh wow, did I just spend 2 hours digging a ditch for the fun of it? Yes. That only took the crafting of five shovels.  Hey, how about this axe? It does chop down trees…oops, broke that too. Oh well no worries, I’ll quickly break off a few branches from this nearby oak, rustle up some plant fibers, tie it all in to this shapely piece of flint I discovered, and voila, I’ll have a new axe to play with. \n\nAnd although I know these activities aren’t for everyone, I found it thoroughly enjoyable.\n\nOver the next few days we hammered out several long sessions where we:\n1. Learned to fish and hunt\n2.  Built ourselves peasant hovels\n3. Gathered stone to pave a small road\n4. Raided our neighbors for their goods at night\n5. Whistled peasant tunes and looked at our feet as a Knight in full plate came to stare down upon us from his mount and enquired about recent robberies\n6. Created a guild and managed to talk three other friends into purchasing the game so that we could keep the Knight off our backs (Shout out to: Thulgar, Moe Poon, and Fung U)\n7. Booted one of our friends from our guild for turning on us -he now has his own property. We don’t ask how he keeps the Knight away, and we don’t want to know …on a side note we should have been suspicious with a name like Fung U\n8. Chopped wood, dragged wood , and piled wood for 20hrs (real …agonizing…hours). The pain of this was offset by the discovery of each craftable item we produced. Oh the look of pride on Drek’s face when he finally had his forge up and running. \n\nAnd then it all came to a crash two days ago with the release of a new update. For whatever reason, the server we were playing on hasn’t been online since. Fung and I tried to entertain ourselves by creating new characters and raiding on several other servers, but after numerous bans, we are left scratching our heads and feeling like we have been ousted from our homeland.\n\nWith nothing to do but start on a new server (Or create our own) we are left with the impression that Life is indeed futile. Despite the somewhat bad taste in our mouths, Drek remains optimistic as he claps me on the back and says:  “Damned if I am giving up. Somewhere out there, a knight is looking for a peasant to bully.”\n\n\n\nUPDATE:\nWe made our own server. Find us at 2NerdsRaging", "timestamp_created": 1462051883, "timestamp_updated": 1462144195, "voted_up": true, "votes_up": 59, "votes_funny": 54, "weighted_vote_score": "0.757277429103851318", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "13245495": {"recommendationid": "13245495", "author": {"steamid": "76561198013018573", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 8507, "playtime_last_two_weeks": 0, "playtime_at_review": 2719, "last_played": 1580161300}, "language": "english", "review": "Normally, I refuse to buy Early Release games for obvious reasons - it's an unfinished product. It usually has me asking, \"Why would I spend money on something that isn't finished with no guarantee for its release?\"\nEven as it stands in its current stage, it's a great game with plenty to do - and this is coming from a person who typically hates Sandbox genre games.\n\n\nPros:\n-More than enough to do\n-Great to play in groups\n-Feeling of accomplishment when you actually build something\n-Scale of map/construction\n-Logical and realistic sandbox:\n            -Survival mechanics\n            -Building mechanics\n\nCons:\n-Questionable developer choices when it comes to storage\n-Obvious bugs due to it being an early release\n-Harsh learning curve\n      -Not noob friendly\n\nI wouldn't recommend this game for people who want to play 20 minutes at a time or for younger people as it requires a bit more of a mature thought process. However, if you like the Mount & Blade series, it's similar to Persisent World Mod mixed with Minecraft. Mind you, this game is only the early release. The actual game will be a Massive Multiplayer Online with player driven politics and the world we be constantly changing based on real players' decisions. There are no NPCs, Quests, or any of the other typical things of an MMO - it truly is a sandbox.", "timestamp_created": 1417826910, "timestamp_updated": 1417826910, "voted_up": true, "votes_up": 53, "votes_funny": 0, "weighted_vote_score": "0.757204174995422363", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "42749780": {"recommendationid": "42749780", "author": {"steamid": "76561198113884765", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 2031, "playtime_last_two_weeks": 0, "playtime_at_review": 2026, "last_played": 1659803037}, "language": "english", "review": "All the time spent building and working is worth nothing - the server always disappears and  POOF  Game Over.   What a complete waste of money.\n\nI also have played the MMO of this game but not on Steam:  hundreds of hours sunk into this waste of a game.  Devs will not help you and I got tired of everyone being unhappy and quitting. Started out with a large guild and ended with not even a handful. \nLove the idea, but it is a soul-sucking experience.\n\nGoodbye ...glad to see Life is Feudal in the rearview mirror.", "timestamp_created": 1529094433, "timestamp_updated": 1529094433, "voted_up": false, "votes_up": 35, "votes_funny": 1, "weighted_vote_score": "0.755558907985687256", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "39407123": {"recommendationid": "39407123", "author": {"steamid": "76561198020733642", "num_games_owned": 0, "num_reviews": 35, "playtime_forever": 89, "playtime_last_two_weeks": 0, "playtime_at_review": 89, "last_played": 1516181884}, "language": "english", "review": "Instead of polishing this game to the potential it was supposed to have the Devs decide to split off the mmo aspect to release another unfinished game and make more money leaving those who bought this one to enjoy a product that is rather less than what was prommised and that honestly still feels completely unfinished. I can't recomend this game, if nothing else because you are essentially getting half a game with the other half being sold seperately as another product. Another product that I suspect will be left as unfinished as this one was.\n\n*Note* I origionally picked this game up in early access, got bored, and returned it. Came back and picked it up once it released hoping to find a fuller game only to find that it had not changed. Only then did I realise that the changes that had been talked about and that I was looking forward too were now being sold as a full seperate title leaving me with a newly purchased early access game pretending to be a final product with a Dev saying \"hey come over here and buy this other game to get what I know you really wanted\".", "timestamp_created": 1516171219, "timestamp_updated": 1516171981, "voted_up": false, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.755377411842346191", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "119729558": {"recommendationid": "119729558", "author": {"steamid": "76561198023977621", "num_games_owned": 0, "num_reviews": 49, "playtime_forever": 2662, "playtime_last_two_weeks": 0, "playtime_at_review": 2662, "last_played": 1604037086}, "language": "english", "review": "Abandonware - save your money.", "timestamp_created": 1659138049, "timestamp_updated": 1659138049, "voted_up": false, "votes_up": 31, "votes_funny": 1, "weighted_vote_score": "0.754707574844360352", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "16894939": {"recommendationid": "16894939", "author": {"steamid": "76561198058479837", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 27634, "playtime_last_two_weeks": 0, "playtime_at_review": 11358, "last_played": 1501560262}, "language": "english", "review": "First of all I would like to state that in comparing the reviews you should look at how many hours the player has spent. You will notice that most of the negative reviews have less than 100 hours in game. Many of which hardly spent more than 10 hours. A lot of the sudden negativity came since the game when on sale and all the kids bought it.\n\nI am not going to lie, to truly unlock the fun in this game you will need to be dedicated. This isn't a game that you play a few hours and be done with it. You also need to make friends or have friends play with you, as this game was not designed to be played solo.\n\nMake sure that if you intend to purchase this game that you have a decent computer. It is graphic and so it takes a lot of power.\n\nThe devs have been very active in releasing updates at least once a month. Sometimes with a minor patch in between because of some new bugs that suddenly appeared. In each update, they keep releasing new features.\n\nAs to the price of early access. To be honest I have seen a lot of early access games that aren't nearly as playable at this game. In fact I would dare to call this game LATE ALPHA as it has a lot of features already implemented and the devs do a pretty good job at testing before releasing so running into game breaking bugs is rare. I did purchase this game when it was on sale, however now knowing what I know and having played it a lot. I wouldnn't have mind paying $40 for this game.\n\nAS I STATED BEFORE. This game isn't for everyone. If you plan to play solo? Don't get it. If you don't plan to be dedicated? Don't get it. If you don't like Medieval time settings? Don't get it.\nELSE, GET IT.\n\n\n", "timestamp_created": 1436107811, "timestamp_updated": 1436107811, "voted_up": true, "votes_up": 109, "votes_funny": 13, "weighted_vote_score": "0.75454181432723999", "comment_count": 12, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "32753972": {"recommendationid": "32753972", "author": {"steamid": "76561198051260080", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 11081, "playtime_last_two_weeks": 0, "playtime_at_review": 7033, "last_played": 1501048058}, "language": "english", "review": "I recommend this game for these reasons:\n\n- Fun to play with friends\n\n- Good RPG skill system where you have stats, crafting, and combat skills that all require you to plan out what kind of person your character will be, and fit in with a village or kingdom.\n\n- They've fixed pretty much all of the bugs/glitches in the game that were present a while ago, (ive been playing this game again heavily recently and so far i havent come across any problems)\n\n- Find a good server that has an active community and you will find the game more enjoyable.\n\n- Graphics are really clean and look nice\n\nThere are some cons to the game but most of those are because the game was meant to be an actually community playstyle where you needed a good amount of people to provide dynamic interaction.\nExamples:\n\n- you will read tons of reviews about this game being \"boring\", \"gosh why does it take forever to do ANYTHING\" or \"it takes me 20 hours to make a pair of shoes\" well no shit, its medieval #1, 1 person does not make functioning village #2. This game isnt singleplayer, sure go ahead and test different skills out on your own or design your own keep/village/castle  with tools but make sure to play this game on a dedicated server. It took 3 of us in about a week of getting on each day and slowly but surely creating a base and building walls.\n\n- This is a different game than the 10,000 player Life is Feudal: MMO you have been hearing about. Go to the Life is Feudal website to see the dfference.\n\n- Its realistic enough that it takes actual time an effort to get to a point where you can enjoy high skills and better quality stuff, that's why its better to join a group or community in a server.\n\nOverall great game, and dont be fooled by the jesters that claim to have put enough time and attention to the game to warrant complaints.", "timestamp_created": 1498361840, "timestamp_updated": 1498361840, "voted_up": true, "votes_up": 50, "votes_funny": 2, "weighted_vote_score": "0.753714323043823242", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "54360377": {"recommendationid": "54360377", "author": {"steamid": "76561198180060606", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 1804, "playtime_last_two_weeks": 0, "playtime_at_review": 1804, "last_played": 1474748621}, "language": "english", "review": "for the love of whoever let us mod this game , mods can bring it back to life again .", "timestamp_created": 1564424458, "timestamp_updated": 1564424458, "voted_up": false, "votes_up": 39, "votes_funny": 2, "weighted_vote_score": "0.752269983291625977", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "24629376": {"recommendationid": "24629376", "author": {"steamid": "76561198115676429", "num_games_owned": 198, "num_reviews": 18, "playtime_forever": 1689, "playtime_last_two_weeks": 0, "playtime_at_review": 1513, "last_played": 1578594839}, "language": "english", "review": "My first life, in Life is Feudal: Your Own\n\nSpawned.\nWalked a bit.\nAte medieval cookies.\nSaw a guild in global chat, decided to look for them in the South.\nMet up with a wanderer called Thorbjorn, travelled with him to The South.\nWe got hungry and tried hunting a boar.\nIt rekt us, and I fell into a hole\nRelogged.\nDecided not to hunt the boar.\nMysterious man on horseback appeared.\nThen another appeared. He started rambling and calling us mortals.\nHis name was Reaper. He was asked me if I was strong, I said yes. We dueled and I died.\nReaper said return to him for gifts.\nI returned\nReaper gave us horses, armour, farming tools, weapons and food.\nMe and Thorbjorn made a camp not too far from Reaper's fortress.\nWe got raided by The Kingdom of the North. \nWe told Reaper's gang, they were on our side. Then we told the Kingdom of the South.\nThe South let us join, then we got free houses and I became a farmer.\n\nTo sum it up: Lots of beta cuck roleplay nerds play this.", "timestamp_created": 1469951361, "timestamp_updated": 1563706250, "voted_up": true, "votes_up": 75, "votes_funny": 36, "weighted_vote_score": "0.752217769622802734", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}}, "query_summary": {"num_reviews": 8, "review_score": 5, "review_score_desc": "Mixed", "total_positive": 3451, "total_negative": 2381, "total_reviews": 5832}, "cursors": {"AoIIPwCjDn+62+QE": "Mon Apr 22 23:42:06 2024"}}
