{"reviews": {"159093689": {"recommendationid": "159093689", "author": {"steamid": "76561198307598114", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 27121, "playtime_last_two_weeks": 0, "playtime_at_review": 26160, "last_played": 1710266397}, "language": "english", "review": "it is with a heavy heart that I must address the pervasive issue of hacking and cheating that plagues Deadside, tarnishing what could otherwise be a promising and immersive gaming experience. Deadside initially captured the attention of players with its expansive open-world environment and intense survival mechanics. However, the game's potential is overshadowed by the rampant spread of hacking and cheating, which has transformed what should be a thrilling struggle for survival into a frustrating and unfair ordeal.\n\nOne of the most glaring manifestations of hacking and cheating in Deadside is the prevalence of aimbots and wallhacks in player-versus-player (PvP) encounters. It is disheartening to witness skilled players being overshadowed by individuals who rely on automated aim assistance to gain an unfair advantage. The result is an unbalanced and demoralizing gameplay experience, where victory is not determined by skill or strategy, but by the ability to exploit illicit software.\n\nFurthermore, the integrity of Deadside's economy is undermined by players who engage in duping exploits and item manipulation. This not only devalues in-game currency and items but also disrupts the delicate balance of the game's economy, rendering legitimate gameplay progression meaningless. As a result, honest players are left feeling disillusioned and disenfranchised, with their hard-earned efforts overshadowed by the exploits of cheaters.\n\nDespite numerous reports from the community regarding hacking and cheating, the response from the developers has been disappointingly inadequate. While occasional ban waves may temporarily address the symptoms of the problem, the root causes remain largely unaddressed, allowing cheaters to resurface with impunity. This lack of decisive action only serves to embolden cheaters and perpetuate a toxic gaming environment where fair play is a rare commodity.\n\nIn conclusion, the pervasive presence of hacking and cheating in Deadside represents a significant blemish on an otherwise promising survival game. Unless urgent measures are taken to address this issue, the game risks losing its player base and tarnishing its reputation irreparably. As a fan of Deadside and the survival genre as a whole, I implore the developers to prioritize the fight against hacking and cheating, lest the integrity of the game continue to decay into oblivion.", "timestamp_created": 1708725128, "timestamp_updated": 1708725128, "voted_up": true, "votes_up": 67, "votes_funny": 5, "weighted_vote_score": "0.849685549736022949", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158353685": {"recommendationid": "158353685", "author": {"steamid": "76561198193487659", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 762, "playtime_last_two_weeks": 0, "playtime_at_review": 154, "last_played": 1708331428}, "language": "english", "review": "Why allow me to set up my own server but not let me just play the game in Single Player Local? By the way the Company that you guys advertise to do your Servers. G-Portal, awful service and they will not answer support tickets. Bought a Server to play on my own and server will not connect and they are ignoring my messages after I paid them for their service. A joke what you guys do to consumers.", "timestamp_created": 1707974986, "timestamp_updated": 1707974986, "voted_up": false, "votes_up": 115, "votes_funny": 14, "weighted_vote_score": "0.760373234748840332", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157383763": {"recommendationid": "157383763", "author": {"steamid": "76561198404347933", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 9773, "playtime_last_two_weeks": 548, "playtime_at_review": 4450, "last_played": 1712890214}, "language": "english", "review": "2.4k hours of Rust, 200+ SCUM, dozens on DayZ.  Like this one the best of them all.  Bots and missions fun as hell.  Good with friends or enemies but just as good alone.  Waiting on some more development.  Land vehicles would be welcome.  Boats work.  No complaints really enjoy it, really good game!", "timestamp_created": 1706849283, "timestamp_updated": 1706849283, "voted_up": true, "votes_up": 23, "votes_funny": 4, "weighted_vote_score": "0.736430525779724121", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158847459": {"recommendationid": "158847459", "author": {"steamid": "76561198097595374", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 14260, "playtime_last_two_weeks": 0, "playtime_at_review": 14260, "last_played": 1689639204}, "language": "english", "review": "As of 2/20/2024 your game has 2, yes 2 people streaming on twitch. Both of which have actually 0 viewers. After 4 years the entire game from pvp to pve feels clunky. You fools have managed to waste all your time expanding the map with the the only vehicle being boats...? Maybe focus on refining the core gameplay instead of expanding a wasteland. exploring a barren map is not fun which is why we the players have abandoned your game. Whoever is coming up with the ideas of what to focus your development time on needs to be removed. Players interacting/fighting at or over places of interest in a small map was why we all were playing. Now you have a giant empty map with a tiny server cap. wtf happened?", "timestamp_created": 1708473724, "timestamp_updated": 1708473724, "voted_up": false, "votes_up": 63, "votes_funny": 5, "weighted_vote_score": "0.695112228393554688", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159313166": {"recommendationid": "159313166", "author": {"steamid": "76561198119907225", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 4042, "playtime_last_two_weeks": 23, "playtime_at_review": 3309, "last_played": 1713172357}, "language": "english", "review": "\"Your connection to the host has been lost.\" and \"Easy anti cheat connection timed out\"\nUntil these two issues are fixed, this game is unplayable. 6 times I lost top loot because of these errors. Got disconnected from the game during a combat, connected back, no loot, no death marker, no body. Sad to admit the game developer does nothing to fix the issue and does not respond to the technical support forum posts.", "timestamp_created": 1708939936, "timestamp_updated": 1708939936, "voted_up": false, "votes_up": 13, "votes_funny": 2, "weighted_vote_score": "0.663640797138214111", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162633101": {"recommendationid": "162633101", "author": {"steamid": "76561198124898806", "num_games_owned": 152, "num_reviews": 2, "playtime_forever": 1584, "playtime_last_two_weeks": 4, "playtime_at_review": 1584, "last_played": 1712792517}, "language": "english", "review": "4 years later, still ass.", "timestamp_created": 1712792536, "timestamp_updated": 1712792536, "voted_up": false, "votes_up": 36, "votes_funny": 4, "weighted_vote_score": "0.651718199253082275", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159840914": {"recommendationid": "159840914", "author": {"steamid": "76561198084902050", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 44633, "playtime_last_two_weeks": 74, "playtime_at_review": 44446, "last_played": 1713553639}, "language": "english", "review": "as much as I would love to give this game 10/10 I cant...\n\nthe game had a big potential and I know very well that this game is in early stages but that doesn't change the fact that the Devs are lazy as shit. You have bugs that are just ridiculous, cheaters and a lot of them with cheats and softs and  the Devs dont give a shit, instead they put out a new EULA that is funny as hell... no bans what so ever. every fucking 300mb update needs a full wipe. BOTS are another story and when the devs said they fixed them now they are even worse. lock on to you in a milisecond and instant headshot. building bases is even worse. you build a 4 story base and you put a stairs in the wrong place ? sure let me just delete it ... devs are like fuck you you need to delete the whole base and start over .\nand now with this new update turns out everybody can just come and sleepover in your base :D yeah good luck with that ..\nthis is not even half of the problems .....3/10 max", "timestamp_created": 1709558302, "timestamp_updated": 1710063008, "voted_up": false, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.641820967197418213", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158118379": {"recommendationid": "158118379", "author": {"steamid": "76561197984434911", "num_games_owned": 40, "num_reviews": 2, "playtime_forever": 6163, "playtime_last_two_weeks": 3, "playtime_at_review": 2406, "last_played": 1713141662}, "language": "english", "review": "If  you like PVPVE you will like this. If you like going solo you can go on PVE servers only and then there is all the custom servers to. So there is always something for everyone.", "timestamp_created": 1707691870, "timestamp_updated": 1707691870, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.630240023136138916", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160862974": {"recommendationid": "160862974", "author": {"steamid": "76561198394766425", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 5771, "playtime_last_two_weeks": 539, "playtime_at_review": 4794, "last_played": 1713701614}, "language": "english", "review": "This ones a gem. Just an overall solid foundation for a survival-looter-shooter. It has all the basics I've been looking for and I'm excited to see where this one is going.\r\n\r\nOnly cons i have is a few things with the FPP character movement, it wobbles a little strange at times, when vaulting or climbing for example, but i can't say exactly what it is. And when sprinting while turning left or right, the way the character slows abruptly down once your at a certain angle, feels somewhat off and interrupting. I wonder if it would feel better when lowering the movement speed a bit more gradual?\r\n\r\nBut in general, this game feels really well balanced, AI is not clever, but they hit hard and can be quite dangerous, the respawn mechanics are fun and not too punishing, the map is beautiful to wonder through, pvp is also fun and keeps you on your toes, and seeing this is only version 0.11, i'm looking forward to all the upcoming stuff.\r\n\r\nI feel like the devs have a solid vision in mind, and they are doing a bloody legendary job on this game.\r\nCheers guys!\r\n", "timestamp_created": 1710786862, "timestamp_updated": 1710786862, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.62460625171661377", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161734355": {"recommendationid": "161734355", "author": {"steamid": "76561199096793895", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 39061, "playtime_last_two_weeks": 3569, "playtime_at_review": 34136, "last_played": 1713795293}, "language": "english", "review": "Cheater players game", "timestamp_created": 1711726494, "timestamp_updated": 1711726494, "voted_up": false, "votes_up": 18, "votes_funny": 1, "weighted_vote_score": "0.61663818359375", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161405453": {"recommendationid": "161405453", "author": {"steamid": "76561198076333001", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 5342, "playtime_last_two_weeks": 1628, "playtime_at_review": 1170, "last_played": 1713799985}, "language": "english", "review": "I truly feel this game is a hidden gem. Guns and ammo are common, but you need them to get food and water. You start by taking out scavs with whatever low tier gear you find (almost Immediately) then eventually snowball up to fortresses with soldiers and military grade weapons. AI is challenging but fair. Accuracy and damage is very realistic. Low tier AI will miss you a lot. Soldiers are another story. 3 to 4 hits from a good rifle will kill you even with the best armor. \n\nWhat I personally appreciate about Deadside is how quickly you get the things you need to actually ENJOY the game. Need a gun? Look in almost any structure and you'll find one with the required ammo right next to it. Need meds? Rip up the clothes of that guy you just shot in the face and heal without consequence. Need rations? Look around any town. Its that simple, which takes away that frustrating grind that comes along way too often in this genre where you spend almost all of your time farming an absurd amount of components just so you can hopefully craft the things you need to have an enjoyable experience. The survival aspect is pleasantly light and only really comes into play when maintaining, such as weapon upkeep or finding food and water. It makes it to where you play on any server for an hour and still have a lot of fun. If you have time to play longer, there are things to strive for. (better gear, better meds, a respectable ration stash). \n\nI'm not sure why some people have been so hard on the game in the past. Maybe it had some kinks at first that ruined some people's enthusiasm, but my experience so far has been extremely smooth. You can tell its not finished yet, but everything in game works fine. If you're looking for a well balanced survival/looter shooter where you're ready to party in 10 minutes or less, then look no further. I have no doubt that this game will be a huge success in the near future. Really looking forward to land vehicles.", "timestamp_created": 1711335745, "timestamp_updated": 1711340381, "voted_up": true, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.60824352502822876", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "163023360": {"recommendationid": "163023360", "author": {"steamid": "76561198111773181", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 1143, "playtime_last_two_weeks": 46, "playtime_at_review": 1143, "last_played": 1713323364}, "language": "english", "review": "I havent played this in ages, but decided to give it another shot.\nMy biggest gripe is if I sneak up on an NPC and kill them, they have no ammo. Not even any ammo for the gun you just looted off their corpse. I'm not sure how I'm supposed to keep up my ammo supply if I'm constantly killing NPCs. My tactic was to just kill one NPC, run away so the others split off and stop hunting me, loop around, take the dead guy's gun, kill another and repeat. It was exhausting and stupid.\nThen I found a helicopter crash about a mile out, NPCs were hardly even a pixel on my monitor. I go prone and try to sneak up and maybe snipe a few. Didnt matter, NPCs locked onto me and began shooting.. Even though I was in a bush, laying down, forever away and there was no way they could have seen me. There was no sneaking up, the AI just knew I was there.\nUninstalled, I dont plan on redownloading. Especially if the developers think \"Able to go prone and gun skins\" are a big update. That's a tiny update and a cash grab attached.", "timestamp_created": 1713323903, "timestamp_updated": 1713324022, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.566868245601654053", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162841275": {"recommendationid": "162841275", "author": {"steamid": "76561198063327594", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 8668, "playtime_last_two_weeks": 4490, "playtime_at_review": 5609, "last_played": 1713787081}, "language": "english", "review": "DLCs for the game in Early Access?\nCrappy skins, one of which is straight up male and female genitalias?\nDevs, are you insane?", "timestamp_created": 1713070254, "timestamp_updated": 1713070462, "voted_up": false, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.566644787788391113", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "163138516": {"recommendationid": "163138516", "author": {"steamid": "76561199048168864", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 608, "playtime_last_two_weeks": 34, "playtime_at_review": 608, "last_played": 1713489946}, "language": "english", "review": "ima put as much effort in this review as the devs do for this Dead end game \r\n\r\nafter years still little to no content \r\nno new vehicles,weapons,missions\r\n\r\nBut they did add weapon skins you have to pay irl $ for \r\nyou can even get a porn one. These devs are just after money at this point \r\n\r\nif you like this game go look at  SCUM 100X better and has actual development and plans for the future", "timestamp_created": 1713490529, "timestamp_updated": 1713490529, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.559686899185180664", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162634952": {"recommendationid": "162634952", "author": {"steamid": "76561198016928533", "num_games_owned": 0, "num_reviews": 33, "playtime_forever": 4846, "playtime_last_two_weeks": 0, "playtime_at_review": 4846, "last_played": 1703988313}, "language": "english", "review": "-Getting back into the game with my buddy\n-Go to show him where to refill his canteen mere feet from the edge of the south safe-zone\n-Were both brutally murdered by safe-zone camper armed with a .50cal\n-I proceed to call him out in all chat\n-an argument with SZ camper and other players (I assume they are all regulars on that server because they were *not* rolling together)\n-Server owner himself acknowledges my grievances, no action taken\n-Me and friend decide to spawn at the new big city(~20km away from where the incident occurred)\n-Run around for ~2 minutes or so\n-Sniped by .50cal\n-\"Was that far enough from safe zone for you\" -Safezone camper from 5 minutes prior\n\nThere is one first-person only server that occasionally fills to 50/50 and the amount of toxicity in chat and around the safe-zone i witnessed before i actually fell victim to it was absurd.\n\nYou're not cool for gatekeeping a game that peaks at 600 average players a month globally.", "timestamp_created": 1712795418, "timestamp_updated": 1712795418, "voted_up": false, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.557225286960601807", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160190859": {"recommendationid": "160190859", "author": {"steamid": "76561199021663081", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 989, "playtime_last_two_weeks": 0, "playtime_at_review": 233, "last_played": 1711150759}, "language": "english", "review": "easy fps for newbies and lots of fun with variety of things to do!", "timestamp_created": 1709998570, "timestamp_updated": 1709998570, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.548485398292541504", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162994006": {"recommendationid": "162994006", "author": {"steamid": "76561198038611831", "num_games_owned": 420, "num_reviews": 109, "playtime_forever": 458, "playtime_last_two_weeks": 0, "playtime_at_review": 458, "last_played": 1666463301}, "language": "english", "review": "Added weapon skins that one of the developers kids made in 20 minutes, and are charging $5 for them.", "timestamp_created": 1713283869, "timestamp_updated": 1713283869, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.547258555889129639", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159096801": {"recommendationid": "159096801", "author": {"steamid": "76561198989413468", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1652, "playtime_last_two_weeks": 42, "playtime_at_review": 1273, "last_played": 1713570761}, "language": "english", "review": "Really good game with great potential but AI are inconsistent and also there is a lack of vehicles , weapons/attachments and also map design if the developers wake up it might bring back the playerbase would recommend if you play with friends", "timestamp_created": 1708728019, "timestamp_updated": 1708728019, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.546972870826721191", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159357960": {"recommendationid": "159357960", "author": {"steamid": "76561199088046349", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 796, "playtime_last_two_weeks": 0, "playtime_at_review": 796, "last_played": 1708991386}, "language": "english", "review": "You can call this unfinished and keep giving yourself hope that this game will actually change, but after coming back multiple times just to find out that its in the same exact state it's been in I can finally make a review. This game is garbage. Play any other survival shooter. PvP is pointless. Only exists so you can ruin other players runs and steel their loot. 0 mission, tracking, assignment, urge, quest, or whatever you want to call it to kill pvp. Therefore it's a trolls paradise for short term dopamine rushes. Now when it comes to pve only, you run into the risk of other players just coming and stealing your loot  after having completed a quest. especially if you die and have to run back from another town. (That's another thing, this game is basically a running simulator) Ai are the worst ai I've seen in a game since the 2002. The fist halo has more competent alien ai. The first stalker has more competent ai. I'm not exaggerating either. THEY ARE AWFUL. So enjoyment of pve is nonexistent. Keep telling us more traversing is coming, i don't care. Give a kindergartner unreal engine and they'll figure out how to give you a car faster than these guys can. Feel free to cry in my comments. Thank you and please don't waste your time.", "timestamp_created": 1708992253, "timestamp_updated": 1708992253, "voted_up": false, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.546934366226196289", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161754457": {"recommendationid": "161754457", "author": {"steamid": "76561199101575775", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 200, "playtime_last_two_weeks": 0, "playtime_at_review": 197, "last_played": 1711745453}, "language": "english", "review": "yes its really nice grapihcs and performance , the game feels like scum/tarkov had a baby", "timestamp_created": 1711745077, "timestamp_updated": 1711745077, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.545305848121643066", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162957380": {"recommendationid": "162957380", "author": {"steamid": "76561198254391745", "num_games_owned": 708, "num_reviews": 30, "playtime_forever": 5160, "playtime_last_two_weeks": 296, "playtime_at_review": 4863, "last_played": 1713578916}, "language": "english", "review": "Give this game twenty years to be complete\r\nIt took them four years to add prone to the game\r\nso you can imagine", "timestamp_created": 1713224312, "timestamp_updated": 1713224312, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.539923965930938721", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158104905": {"recommendationid": "158104905", "author": {"steamid": "76561198197334858", "num_games_owned": 22, "num_reviews": 2, "playtime_forever": 6684, "playtime_last_two_weeks": 453, "playtime_at_review": 3775, "last_played": 1713651115}, "language": "english", "review": "kids version of tarkov but open world", "timestamp_created": 1707678942, "timestamp_updated": 1707678942, "voted_up": true, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.53885728120803833", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160842450": {"recommendationid": "160842450", "author": {"steamid": "76561197993026869", "num_games_owned": 0, "num_reviews": 51, "playtime_forever": 10413, "playtime_last_two_weeks": 4228, "playtime_at_review": 5591, "last_played": 1713799793}, "language": "english", "review": "Got this back in 2023 played for under a hour then refund it, but now after watching a few video and saw this for sale i said let's give this a try, this time i took my time not rushing to do mission and looting things first to get better gear now i'm liking this game and get the Supporter Pack DLC trust me. the gameplay is towards realism when it comes to shooting, survival is on the lite side eat food, drink water thats it, thing to do is pretty simple do the mission high tier better rewards solo or with other players. the game in its core is shooting and looting for better gear. ", "timestamp_created": 1710768085, "timestamp_updated": 1712483640, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.534239590167999268", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162883447": {"recommendationid": "162883447", "author": {"steamid": "76561198017721472", "num_games_owned": 36, "num_reviews": 8, "playtime_forever": 693, "playtime_last_two_weeks": 308, "playtime_at_review": 693, "last_played": 1713031656}, "language": "english", "review": "Love it. If any vehicle is added not just boats this game has big future.", "timestamp_created": 1713117766, "timestamp_updated": 1713117766, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.532517135143280029", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "163055266": {"recommendationid": "163055266", "author": {"steamid": "76561198978249496", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 355, "playtime_last_two_weeks": 26, "playtime_at_review": 355, "last_played": 1713371137}, "language": "english", "review": "6.5/10 stars\nneeds dedicated servers, vehicles and a single-player experience.\ngreat game. wanted something like day z but without zombies cause I'm tired of FPS survival games with zombies, monsters, the like.\n\nthis scratched that itch.\n\nstill in early access and very slow with development so its a little rough at times with basic mechanics, but with time i hope that goes away.", "timestamp_created": 1713373666, "timestamp_updated": 1713373818, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.531737744808197021", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162752548": {"recommendationid": "162752548", "author": {"steamid": "76561198012338360", "num_games_owned": 471, "num_reviews": 66, "playtime_forever": 3658, "playtime_last_two_weeks": 0, "playtime_at_review": 3658, "last_played": 1705371296}, "language": "english", "review": "Crazy disappointed that after 4 years we have been given nothing....\n\nYet for some reason before vehicles or anything meaningful for this game instead they decide to launch DLC aka weapon skins and we get the ability to go prone now.... thanks bro\n\nNo faith whatsoever for this game anymore.", "timestamp_created": 1712959914, "timestamp_updated": 1712959992, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.528720438480377197", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157148966": {"recommendationid": "157148966", "author": {"steamid": "76561199010461662", "num_games_owned": 24, "num_reviews": 7, "playtime_forever": 3628, "playtime_last_two_weeks": 0, "playtime_at_review": 3591, "last_played": 1706838336}, "language": "english", "review": "there is nothing to do in game after you do the very little missions they give you to do.", "timestamp_created": 1706566968, "timestamp_updated": 1706566968, "voted_up": false, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.528536021709442139", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162698141": {"recommendationid": "162698141", "author": {"steamid": "76561198803437139", "num_games_owned": 40, "num_reviews": 2, "playtime_forever": 1145, "playtime_last_two_weeks": 1145, "playtime_at_review": 575, "last_played": 1713148821}, "language": "english", "review": "Complete dogwater, Do not recommend anyone to play.", "timestamp_created": 1712887014, "timestamp_updated": 1712887014, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.526692628860473633", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157807392": {"recommendationid": "157807392", "author": {"steamid": "76561198325831624", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 539, "playtime_last_two_weeks": 0, "playtime_at_review": 539, "last_played": 1707340194}, "language": "english", "review": "After years of development, im sad to say this game has shown almost zero improvements. The AI, which accounts for a solid 80% of the game-play is just as janky and aim-bot like as a couple years ago. The loot makes dayz look filled to the brim, and the guns are floaty, movement is terrible, and this is all around terrible. Great concept of a tarkov meets dayz thing, awful implementation. Do not purchase.", "timestamp_created": 1707340498, "timestamp_updated": 1707340498, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.526506543159484863", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162925675": {"recommendationid": "162925675", "author": {"steamid": "76561198021344451", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 361, "playtime_last_two_weeks": 0, "playtime_at_review": 361, "last_played": 1705897773}, "language": "english", "review": "I had high hopes. 6 hours of playtime and I'm left still not knowing the mechanics of this game. Spawn, die instantly from someone halfway across the map, respawn, repeat. There was ZERO enjoyment.", "timestamp_created": 1713183526, "timestamp_updated": 1713183526, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525862038135528564", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159742033": {"recommendationid": "159742033", "author": {"steamid": "76561198039941582", "num_games_owned": 0, "num_reviews": 21, "playtime_forever": 30, "playtime_last_two_weeks": 0, "playtime_at_review": 30, "last_played": 1709440609}, "language": "english", "review": "Trash, have to close out steam and re start it every time for join server to work.", "timestamp_created": 1709440652, "timestamp_updated": 1709440652, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525862038135528564", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162820393": {"recommendationid": "162820393", "author": {"steamid": "76561198304737906", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 5860, "playtime_last_two_weeks": 0, "playtime_at_review": 5860, "last_played": 1701469355}, "language": "english", "review": "Deadside evolution: \n\nCrapgame→Walkingsimulator→Survivalgame→Monygrabgame→Sadgame→Deadgame", "timestamp_created": 1713041642, "timestamp_updated": 1713041642, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.525521218776702881", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161695043": {"recommendationid": "161695043", "author": {"steamid": "76561199123193576", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 1885, "playtime_last_two_weeks": 0, "playtime_at_review": 1885, "last_played": 1667440193}, "language": "english", "review": "games good, just boring as hell", "timestamp_created": 1711679964, "timestamp_updated": 1711679964, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.525521218776702881", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "163289692": {"recommendationid": "163289692", "author": {"steamid": "76561198142124476", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 89, "playtime_last_two_weeks": 89, "playtime_at_review": 68, "last_played": 1713679426}, "language": "english", "review": "but you cant punch, you have to find a wepon... i refunded", "timestamp_created": 1713678147, "timestamp_updated": 1713678147, "voted_up": false, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160958163": {"recommendationid": "160958163", "author": {"steamid": "76561199161232889", "num_games_owned": 53, "num_reviews": 29, "playtime_forever": 2000, "playtime_last_two_weeks": 0, "playtime_at_review": 870, "last_played": 1712326744}, "language": "english", "review": "good game but the fact the servers barely have players, lack of content, a damn well good walking simulator ill give it 5/10 wont recommend it. If ever, buy it when it's on sale.", "timestamp_created": 1710897890, "timestamp_updated": 1710897890, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159847978": {"recommendationid": "159847978", "author": {"steamid": "76561198044404009", "num_games_owned": 249, "num_reviews": 25, "playtime_forever": 1994, "playtime_last_two_weeks": 0, "playtime_at_review": 1994, "last_played": 1709565846}, "language": "english", "review": "This is just dreadful. I got this when it was first released onto steam, and yet playing it today feels like more of the same except the most lifeless awful awful awful awful awful awful awful awful", "timestamp_created": 1709566359, "timestamp_updated": 1709566359, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159838242": {"recommendationid": "159838242", "author": {"steamid": "76561198146187666", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 6635, "playtime_last_two_weeks": 0, "playtime_at_review": 6635, "last_played": 1703105617}, "language": "english", "review": "I really dont know what to say..\nWe have a 4 year old title which -to this day gets regular updates- still suffer from the exact same thing as the release version: its fuckin boring. \ngameplay loop is really just spawn -> get better guns -> do harder missions -> pvp sometimes -> win. \nbase raiding is there but feels trivial. base building is a fuckin torture with how long it takes and how boring it is. \nMap gets bigger and bigger but still feels very boring, no map puzzles (for hidden loot) no varied quests or missions that engage more people (current mission system is a joke.), every mission is just go there and blast a few bots and open a crate. (in contrary the convoy is pretty good, more of those please.) \nits labeled as a hardcore pvp and pve but the bots are SO bad. they cant use lean or cant go to cover, they just straight up go to you and shoot. (sometimes through 5-7 bushes) Thats not really something you can call \"hardcore\" they just feel like adds to annoy you and alert other players if u aggro them. \nbut to say some good things as well: gunplay and generally the guns are good, sound effects (both guns and ambient) are good, graphics is good as well. \n\nI dont recommend the game because: \n1. its already 4 years old and still feels incredibly boring and unfinished\n2. there are other titles that do this much better. \nEven the full version seems like something that would need additional content updates to make it content rich and fun.", "timestamp_created": 1709554864, "timestamp_updated": 1709590245, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160687372": {"recommendationid": "160687372", "author": {"steamid": "76561198013102630", "num_games_owned": 614, "num_reviews": 32, "playtime_forever": 114, "playtime_last_two_weeks": 0, "playtime_at_review": 114, "last_played": 1710536708}, "language": "english", "review": "Refunded after 116 minutes.\r\nI was hoping for something like DayZ but with bandits instead of zombies/infected. To me this is worse than DayZ in almost every aspect: the graphics, the sound, the oversimplified gameplay. In PvE you chase after airdrops or missions in hope of beating other players to that sweet juicy loot crate. Usually you're too late. PvP is the same but you get killed by cheaters.", "timestamp_created": 1710610617, "timestamp_updated": 1710610617, "voted_up": false, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.523796737194061279", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159594665": {"recommendationid": "159594665", "author": {"steamid": "76561199085472748", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 22, "playtime_last_two_weeks": 0, "playtime_at_review": 22, "last_played": 1709281732}, "language": "english", "review": "Horrible game, I expected way to much from the research I've done and it was not worth it at all. I even bought it went it was on sale and I still refunded it.  \" I WANT MY MONEY AND I NEED IT NOW \" - JG Wentworth", "timestamp_created": 1709282513, "timestamp_updated": 1709282513, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.523590624332427979", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "163322901": {"recommendationid": "163322901", "author": {"steamid": "76561198070510151", "num_games_owned": 518, "num_reviews": 23, "playtime_forever": 993, "playtime_last_two_weeks": 121, "playtime_at_review": 993, "last_played": 1713713692}, "language": "english", "review": "After all these years nothing major has changed, still same boring gameplay loop.", "timestamp_created": 1713714338, "timestamp_updated": 1713714338, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.52355504035949707", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159286892": {"recommendationid": "159286892", "author": {"steamid": "76561198306189590", "num_games_owned": 237, "num_reviews": 17, "playtime_forever": 5486, "playtime_last_two_weeks": 33, "playtime_at_review": 5453, "last_played": 1713062678}, "language": "english", "review": "Jogo é resumido em camper, literalmente, jogo que tem tudo p ter um pvp fluido so tem camper", "timestamp_created": 1708903000, "timestamp_updated": 1708903000, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523488402366638184", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157727917": {"recommendationid": "157727917", "author": {"steamid": "76561198366524188", "num_games_owned": 105, "num_reviews": 6, "playtime_forever": 8355, "playtime_last_two_weeks": 427, "playtime_at_review": 4347, "last_played": 1713800277}, "language": "english", "review": "great multiplayer game with missions loot you can sell and buy better guns\nthere are 4 difficulty types of missions and there are based on the strength of the enemy AI 1 star is the easiest and 5 star is the hardest with military armoured AI.\n", "timestamp_created": 1707241756, "timestamp_updated": 1707241756, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.52173912525177002", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159307743": {"recommendationid": "159307743", "author": {"steamid": "76561197971443714", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 2327, "playtime_last_two_weeks": 0, "playtime_at_review": 2327, "last_played": 1708930791}, "language": "english", "review": "pve, this is basically a running simulator. Honestly. I think this ai might be worse then arma 3. no vehicles other then rando boats that despawn.  laser ai. it's a dead game, move on. It's basically a shit running simulator to go get your gear before your body despawns. unintalled. Another whopping pile of garbage on steam. go figure", "timestamp_created": 1708931075, "timestamp_updated": 1708931075, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.52144467830657959", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159029235": {"recommendationid": "159029235", "author": {"steamid": "76561199086017073", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 2834, "playtime_last_two_weeks": 0, "playtime_at_review": 2834, "last_played": 1706846417}, "language": "english", "review": "About 50 hours in so far. Fun game and for 20 bucks it's a no brainer for me. The game is well optimized at this stage and will run well on most PC setups. Being early access, I'm excited to see and experience the game as it comes together in the way that Bad Pixel has planned and worked towards. Should be a fun ride! I feel like I've already gotten $20 worth of fun from it.", "timestamp_created": 1708664349, "timestamp_updated": 1708664349, "voted_up": true, "votes_up": 2, "votes_funny": 3, "weighted_vote_score": "0.5198555588722229", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161815635": {"recommendationid": "161815635", "author": {"steamid": "76561198099607084", "num_games_owned": 0, "num_reviews": 23, "playtime_forever": 1109, "playtime_last_two_weeks": 0, "playtime_at_review": 1109, "last_played": 1593364010}, "language": "english", "review": "Another case of: one time early access, always early access", "timestamp_created": 1711816464, "timestamp_updated": 1711816464, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.519698083400726318", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162220241": {"recommendationid": "162220241", "author": {"steamid": "76561198118855116", "num_games_owned": 185, "num_reviews": 4, "playtime_forever": 514, "playtime_last_two_weeks": 0, "playtime_at_review": 514, "last_played": 1712270863}, "language": "english", "review": "just bad", "timestamp_created": 1712270884, "timestamp_updated": 1712270884, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.518518567085266113", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158402395": {"recommendationid": "158402395", "author": {"steamid": "76561198002478280", "num_games_owned": 336, "num_reviews": 69, "playtime_forever": 8, "playtime_last_two_weeks": 0, "playtime_at_review": 8, "last_played": 1708032977}, "language": "english", "review": "The reviews must all be bought. This isn't even a game.\nJust a big empty map with what appears to be paid for assets not designed by the company.\nHonestly, this is trash. Gameplay does not match the vid.", "timestamp_created": 1708033047, "timestamp_updated": 1708033047, "voted_up": false, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.517436802387237549", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160849951": {"recommendationid": "160849951", "author": {"steamid": "76561198396295058", "num_games_owned": 79, "num_reviews": 10, "playtime_forever": 73, "playtime_last_two_weeks": 0, "playtime_at_review": 73, "last_played": 1710774971}, "language": "english", "review": "Worst game i ever played. People say its a combination of DayZ and Rust, and i agree. But its the worst parts of both games combined into the shittiest survival experience you can have.", "timestamp_created": 1710775184, "timestamp_updated": 1710775184, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.516129016876220703", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159328667": {"recommendationid": "159328667", "author": {"steamid": "76561199559153594", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 3006, "playtime_last_two_weeks": 1332, "playtime_at_review": 1659, "last_played": 1713800317}, "language": "english", "review": "its a great game to play with friends firsat couple of hrs i played had a bit of trouble finding food but then got the hang of it and figured out when an where there would be food an water in certain locations but would love to see some things fixed like the fact of having to reinvite friends to squads every time i log it if it was persistant i would love it more but as of right now its a good game", "timestamp_created": 1708959358, "timestamp_updated": 1708959358, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.516129016876220703", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158934133": {"recommendationid": "158934133", "author": {"steamid": "76561198822416864", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 989, "playtime_last_two_weeks": 0, "playtime_at_review": 436, "last_played": 1711773093}, "language": "english", "review": "FIX THE FUCKING AI FOR THE LOVE OF GOD\n", "timestamp_created": 1708563208, "timestamp_updated": 1708563208, "voted_up": false, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.515151500701904297", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160253143": {"recommendationid": "160253143", "author": {"steamid": "76561198209616332", "num_games_owned": 232, "num_reviews": 15, "playtime_forever": 555, "playtime_last_two_weeks": 0, "playtime_at_review": 555, "last_played": 1710068263}, "language": "english", "review": "THIS GAME IS MID AT BEST\n\nthe building is more bare bones than actual bare bones\nthe shooting makes me wanna drink\nCant see shit when its night\nthe missions are just packs of AI\nThe PVP is stale like old turd\nGun mods are plain white bread\nFew servers even have good folks on them if any\nplease its a bore. and not the good kind.", "timestamp_created": 1710068554, "timestamp_updated": 1710068554, "voted_up": false, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.512323558330535889", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159248670": {"recommendationid": "159248670", "author": {"steamid": "76561198138461766", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 3990, "playtime_last_two_weeks": 0, "playtime_at_review": 3899, "last_played": 1710078984}, "language": "english", "review": "the ai will rip you a new one from 500m away with no sightline all day long, this game sucks ass.", "timestamp_created": 1708872783, "timestamp_updated": 1708945904, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.512195110321044922", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162963773": {"recommendationid": "162963773", "author": {"steamid": "76561198059954456", "num_games_owned": 102, "num_reviews": 8, "playtime_forever": 6516, "playtime_last_two_weeks": 0, "playtime_at_review": 6516, "last_played": 1709098324}, "language": "english", "review": "Devs don't listen, game is boring af. Still no vehicles, yet they added new DLC skin with genitalia on it. What a joke of a dev team.", "timestamp_created": 1713235209, "timestamp_updated": 1713235209, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.510548532009124756", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160211422": {"recommendationid": "160211422", "author": {"steamid": "76561198103633207", "num_games_owned": 89, "num_reviews": 2, "playtime_forever": 5941, "playtime_last_two_weeks": 0, "playtime_at_review": 5482, "last_played": 1712391947}, "language": "english", "review": "I really love how you \"FIXED\" the AI. i have never had a game whos devs introduce the most abysmal AI i have ever fucking seen. barely expose yourself? have fun getting sniped by AI with an AK with no sight. you want your loot back? too bad the AI will fucking sit on your body, have fun. like What the fuck are these devs thinking. scrap your shitty AI already", "timestamp_created": 1710017342, "timestamp_updated": 1710017342, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.509714305400848389", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "163251135": {"recommendationid": "163251135", "author": {"steamid": "76561197980407759", "num_games_owned": 0, "num_reviews": 24, "playtime_forever": 8687, "playtime_last_two_weeks": 1822, "playtime_at_review": 8503, "last_played": 1713733031}, "language": "english", "review": "i have played this for over 100 hours - it is boring.  painfully boring. and frequently laggy, to the degree that 20 hours worth of work can be lost in a fraction of a second.", "timestamp_created": 1713632483, "timestamp_updated": 1713632483, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.506172835826873779", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "163192756": {"recommendationid": "163192756", "author": {"steamid": "76561198177945873", "num_games_owned": 83, "num_reviews": 15, "playtime_forever": 1792, "playtime_last_two_weeks": 0, "playtime_at_review": 1792, "last_played": 1702770467}, "language": "english", "review": "idk what the devs be doing, maybe too busy beating their meat while making phub skins. Its been like a year or two since cars were promised. Still not in the game, instead you get 5$ skins with a bunch of dicks and clits plastered on, I'd rather play duckside.", "timestamp_created": 1713561762, "timestamp_updated": 1713561762, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.506172835826873779", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158259376": {"recommendationid": "158259376", "author": {"steamid": "76561197971104671", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 748, "playtime_last_two_weeks": 0, "playtime_at_review": 748, "last_played": 1707845274}, "language": "english", "review": "Not many players...kinda clunky and cheap.", "timestamp_created": 1707860468, "timestamp_updated": 1707860468, "voted_up": false, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.505208373069763184", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157788701": {"recommendationid": "157788701", "author": {"steamid": "76561198179700209", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 361, "playtime_last_two_weeks": 0, "playtime_at_review": 361, "last_played": 1707321768}, "language": "english", "review": "Wish i could say the same as some people and say its fun but really it isn't in the current state still. In around 5 hours i got 0 hit reg on enemies standing still, enemies 100m away turning and tapping me twice through \"excellent protection\" Armour and helmet ( because making ai aimbots makes games hard derp\" Multiple times peaked out of cover slightly just to be teleported 5m that way right in the open for no reason. Can see why the playerbase is currently low and wont be taking over DayZ anytime soon. Do i think the game is capable of being a good title? Yes for sure, love the mission and event content, basebuilding is good for an early access title also.", "timestamp_created": 1707321979, "timestamp_updated": 1707321979, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.505208373069763184", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "163200871": {"recommendationid": "163200871", "author": {"steamid": "76561198048016756", "num_games_owned": 214, "num_reviews": 13, "playtime_forever": 22538, "playtime_last_two_weeks": 139, "playtime_at_review": 22479, "last_played": 1713633577}, "language": "english", "review": "used to be good until you couldnt get ammo off corpses, not it sucks! dont buy this dumb shit :D talking to you devs, fix it or watch your game die. ill gladly watch it die, you are the ones who makes the game more and more unplayable. how is it a fair combat trade to kill 4 people and NONE of them have any ammo replenishment? at that point it is only a loss of combat trade, I try to protect myself and im left with what? nothing thats what! just some BS fucking rags.. FIX IT!", "timestamp_created": 1713572378, "timestamp_updated": 1713572378, "voted_up": false, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.504761934280395508", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "163361429": {"recommendationid": "163361429", "author": {"steamid": "76561198020894107", "num_games_owned": 0, "num_reviews": 102, "playtime_forever": 173, "playtime_last_two_weeks": 0, "playtime_at_review": 173, "last_played": 1610087529}, "language": "english", "review": "deadside? more like L side. or maybe DeadL, since only hackers play it and the game is still ass after years of updates.", "timestamp_created": 1713759901, "timestamp_updated": 1713759901, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.504424750804901123", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162966669": {"recommendationid": "162966669", "author": {"steamid": "76561198085495821", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 1509, "playtime_last_two_weeks": 1148, "playtime_at_review": 1080, "last_played": 1713722370}, "language": "english", "review": "GREAT FUN !! but official servers very grindy as loot is hard to come by if this was a bit more rebalanced it woould be ausome but good job so far devs also if there was a singleplayer mode without the need of a server that would be amazing too", "timestamp_created": 1713240683, "timestamp_updated": 1713240683, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.504309535026550293", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157923351": {"recommendationid": "157923351", "author": {"steamid": "76561198346407629", "num_games_owned": 14, "num_reviews": 4, "playtime_forever": 13691, "playtime_last_two_weeks": 0, "playtime_at_review": 1328, "last_played": 1708603652}, "language": "english", "review": "this game is going in an awesome direction and shows promise to be top tier in the future. im excited to see what they do with it! Shout out to my man loaf too", "timestamp_created": 1707485613, "timestamp_updated": 1707485613, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.50294119119644165", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157845258": {"recommendationid": "157845258", "author": {"steamid": "76561198022471779", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1194, "playtime_last_two_weeks": 0, "playtime_at_review": 226, "last_played": 1708688791}, "language": "english", "review": "Love the game so far, haven't built anything yet but killing bots is hard. just wish your bodies didnt disappear when you die. got killed twice in the same spot and lost all my upgraded weapons that took me hours to get.", "timestamp_created": 1707395125, "timestamp_updated": 1707395125, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.50294119119644165", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157826501": {"recommendationid": "157826501", "author": {"steamid": "76561198070176665", "num_games_owned": 0, "num_reviews": 36, "playtime_forever": 378, "playtime_last_two_weeks": 0, "playtime_at_review": 130, "last_played": 1712377701}, "language": "english", "review": "Excellent game. \n\nIt truly has a lot of things to do, explore, complete etc. The graphics are beautiful, the gameplay is awesome, the shoot mechanics feel nice. Looting, shooting, with survival and building elements. It plays like Arma 3 would play in a post apocalyptic world. The AI is intuitive and will relentlessly follow you if you do not kill them. Its great, highly recommend it.", "timestamp_created": 1707368706, "timestamp_updated": 1707368706, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.50294119119644165", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157824214": {"recommendationid": "157824214", "author": {"steamid": "76561198983629987", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 4364, "playtime_last_two_weeks": 0, "playtime_at_review": 4272, "last_played": 1711348919}, "language": "english", "review": "AI claps... but very fun", "timestamp_created": 1707365052, "timestamp_updated": 1707365052, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.50294119119644165", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157772514": {"recommendationid": "157772514", "author": {"steamid": "76561198252521804", "num_games_owned": 14, "num_reviews": 4, "playtime_forever": 2956, "playtime_last_two_weeks": 92, "playtime_at_review": 2630, "last_played": 1712633462}, "language": "english", "review": "This game is incredible i would love to see ground vehicles prone animations and more buildings opened up and more jungle like areas on the map would be cool", "timestamp_created": 1707303716, "timestamp_updated": 1707303716, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.50294119119644165", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160038629": {"recommendationid": "160038629", "author": {"steamid": "76561198042419591", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 2952, "playtime_last_two_weeks": 0, "playtime_at_review": 2952, "last_played": 1709820749}, "language": "english", "review": "Constantly saying \"its in early access\" as an excuse for your game is tired.\n\nCouple things: \n\n1. The complete wipe is ridiculous. \n2. The game has no population; there might be a couple hundred players total. \n3. Those couple hundred players are D-bags. \n\nI only paid a few bucks, I got my money's worth but I'm dropping it.", "timestamp_created": 1709821137, "timestamp_updated": 1709821137, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.502251982688903809", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162792298": {"recommendationid": "162792298", "author": {"steamid": "76561197969235784", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 26077, "playtime_last_two_weeks": 0, "playtime_at_review": 26077, "last_played": 1708543574}, "language": "english", "review": "what started as a buggy promising game, turned into a buggy trashy cashgrab. not worth it, not even on sale.", "timestamp_created": 1713014125, "timestamp_updated": 1713014349, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502074718475341797", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162849978": {"recommendationid": "162849978", "author": {"steamid": "76561198048653821", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 89, "playtime_last_two_weeks": 0, "playtime_at_review": 89, "last_played": 1667636946}, "language": "english", "review": "When i played the game, it seemed like it could be cool. But I found it impossible to enjoy myself, at all, as I was constantly being gunned down by someone within minutes of spawning in the world. It made it difficult to even learn the mechanics of the game, or to even explore the world at all. I play DayZ quite often. So I'm no stranger to survival/pvp type games. But this game just felt like a gank-fest to me. I know some people like that sort of thing, but it wasn't for me. I like the survival elements just as much, if not more, than the actual pvp combat that goes with a game like DayZ. But in DayZ I can survive in the wilderness for many hours, or even days, without getting murdered by another player. Maybe i just had a run of bad luck in this game. But it just seemed like within 5 minutes of spawning I had someone ganking me, Like, I said, it just wasn't for me.", "timestamp_created": 1713082954, "timestamp_updated": 1713082954, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.50188678503036499", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162815869": {"recommendationid": "162815869", "author": {"steamid": "76561198182134634", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 2891, "playtime_last_two_weeks": 20, "playtime_at_review": 2891, "last_played": 1713036159}, "language": "english", "review": "the game had potential......until i realized it was another shitty dayz game , they use very similar assets , there are 400 empty houses, to big of a map compared to the speed that you run, bad physics, too buggy compared to the amount of time they had, kinda tired of all these open world survival games that just copying one another just for you to run to one city to the next after 1 hr just to die, its a money scam, the game will die, so the game you guys need to watch and support is rooted, made with UE5 , completely different, down to physics, assets, feel.....Deadside almost made it, sorry fellas", "timestamp_created": 1713036984, "timestamp_updated": 1713036984, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.50188678503036499", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162583419": {"recommendationid": "162583419", "author": {"steamid": "76561198355426658", "num_games_owned": 243, "num_reviews": 25, "playtime_forever": 1171, "playtime_last_two_weeks": 1058, "playtime_at_review": 882, "last_played": 1713756231}, "language": "english", "review": "this game is super fire tldr\nin reality this is a pretty fun game with not a whole lot of content but the interactions and weapons are fun to use so its okay. the npcs are ok, flawed a bit, but still fun to fight\nthey flank, push and rotate dynAmically\ndont usde cover tho.", "timestamp_created": 1712721556, "timestamp_updated": 1713369328, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.501302182674407959", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158191433": {"recommendationid": "158191433", "author": {"steamid": "76561199125817688", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 61768, "playtime_last_two_weeks": 760, "playtime_at_review": 59733, "last_played": 1713800383}, "language": "english", "review": "This game has improved it's action and graphics for a far more enjoyable game that make you want to come back and play again and again. The maps and game fixes have greatly improved along with the sounds being way more real life.", "timestamp_created": 1707779670, "timestamp_updated": 1707779670, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.500866472721099854", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158910742": {"recommendationid": "158910742", "author": {"steamid": "76561197989679471", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 48, "playtime_last_two_weeks": 0, "playtime_at_review": 48, "last_played": 1708540571}, "language": "english", "review": "Like day z but underdevelopped and boring", "timestamp_created": 1708540611, "timestamp_updated": 1708540611, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500744640827178955", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161299528": {"recommendationid": "161299528", "author": {"steamid": "76561198110172358", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 11373, "playtime_last_two_weeks": 133, "playtime_at_review": 8980, "last_played": 1712868226}, "language": "english", "review": "Currently, I do not recommend the game. Deadside promises an exhilarating blend of extraction shooter dynamics within a persistent open world that mixes PVP, PVE, and survival elements. However, while the gunplay stands out, several areas leave room for improvement:\n\n1. Endgame and Incentives: Deadside suffers from a glaring absence of endgame content, which diminishes its replay value. The gameplay loop lacks compelling incentives to keep players engaged over the long term, feeling somewhat unrewarding as hours progress.\n\n2. Traversal and AI Challenges: The game's reliance on extensive walking and running exacerbates the tedium, especially given the sparse options for faster travel. Boats sporadically appear but hardly mitigate the extensive downtime between actions. Additionally, the AI behavior doesn’t help, with enemies often acting in a predictable manner and lacking sophistication.\n\n3. Building and Customization: The building mechanics are not only slow and uninteresting but also offer minimal gameplay advantages, reducing motivation to invest time in constructing personalized spaces. This is compounded by a disappointing lack of diversity in weapon skins and gear customization, making it hard to personalize the visual experience.\n\n4. Mission Structure and NPC Diversity: The missions are too widely dispersed, requiring lengthy travel times that disrupt the game's pacing. The lack of diversity among NPCs and the absence of structured quests or objectives further strip away the sense of purpose and progression that could enhance the player's experience.\n\nConclusion: While Deadside delivers robust gunplay, it ultimately falls short in several key areas. The game needs significant enhancements in content variety, AI sophistication, and overall incentives to evolve beyond its current limitations and fully realize its ambitious survival shooter concept. For now, it remains a mixed bag—appealing perhaps for short bursts but lacking enough depth for sustained play.", "timestamp_created": 1711233604, "timestamp_updated": 1713127959, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159945734": {"recommendationid": "159945734", "author": {"steamid": "76561198009806737", "num_games_owned": 1240, "num_reviews": 45, "playtime_forever": 235, "playtime_last_two_weeks": 0, "playtime_at_review": 235, "last_played": 1709695181}, "language": "english", "review": "I wanted a DayZ clone that respected my time, and that was more grounded. No zombies, just PvPvE survival and looting. Deadside on the surface appears to be that and I'll probably keep playing it. So this isn't a \"this sucks\" Not Recommended, simply a \"probably not yet if ever\" one. \n\nCombat is barebones and doesn't feel particularly good. AI is braindead and has no voice acting, so they are audibly indistinguishable from players through walls. you'll pretty rapidly run out of fun, early game things to do that feel like progression-- at which point you'll probably wanna go tackle a mission. But early game ammo is a bit too scarce for the number of AI the game's missions throw at you, and healing items are not very effective. Trader payouts are miniscule and the traders don't buy resources, so you can't farm trees or the like to help fund gear early on-- meaning that death means you're back to running around looking in empty houses for poor quality pistols and the like; Your gear despawns in just a couple minutes. \n\nTo that point, I think the game is trying a bit *too* hard to copy DayZ's systems and the devs would do well to overhaul much of their plundered game design. Compared to DayZ, Deadside is a much faster paced game with more frequent combat, quicker acquisition of playermade spawnpoints (4 or 5 articles of clothing = a sleeping bag) and far more server-generated mission events: it doesn't make sense that the game still insists on the arduous and clunky parts of DayZ. \n\nLike I said, I plan to watch this game and hope it can become the more relaxed survival experience for when I don't feel like the effort and emotional investment Tarkov demands. So maybe I'll update this review down the line. But for now, I'd look elsewhere for your fix.", "timestamp_created": 1709696066, "timestamp_updated": 1709696147, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159527443": {"recommendationid": "159527443", "author": {"steamid": "76561198188063009", "num_games_owned": 70, "num_reviews": 4, "playtime_forever": 6082, "playtime_last_two_weeks": 0, "playtime_at_review": 2267, "last_played": 1711075102}, "language": "english", "review": "Duck Hunt, The Game.", "timestamp_created": 1709201079, "timestamp_updated": 1709201079, "voted_up": true, "votes_up": 1, "votes_funny": 2, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "85978198": {"recommendationid": "85978198", "author": {"steamid": "76561198965964611", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 445, "playtime_last_two_weeks": 0, "playtime_at_review": 445, "last_played": 1612491491}, "language": "english", "review": "Its like if you threw Tarkov, Rust, and DayZ in an oven and it smells good but isn't fully cooked yet", "timestamp_created": 1612492840, "timestamp_updated": 1612492906, "voted_up": true, "votes_up": 390, "votes_funny": 109, "weighted_vote_score": "0.962981045246124268", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "67929870": {"recommendationid": "67929870", "author": {"steamid": "76561198185459735", "num_games_owned": 116, "num_reviews": 22, "playtime_forever": 6813, "playtime_last_two_weeks": 0, "playtime_at_review": 411, "last_played": 1667569823}, "language": "english", "review": "we need the goddamn ANTICHEAT then its all good\n\nThe biggest thing that we need on the base building side is for the squad to access the base while the player that make the base is offline, it can be fixed by letting players to add a PASSWORD for the door so only the players that knows the password can open the door and have access to the base", "timestamp_created": 1587729611, "timestamp_updated": 1587849859, "voted_up": true, "votes_up": 251, "votes_funny": 18, "weighted_vote_score": "0.931887686252593994", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "81797691": {"recommendationid": "81797691", "author": {"steamid": "76561198150809354", "num_games_owned": 100, "num_reviews": 4, "playtime_forever": 6180, "playtime_last_two_weeks": 0, "playtime_at_review": 762, "last_played": 1712474986}, "language": "english", "review": "This game is if DayZ and EFT had a baby but they were related so the baby came out a little weird", "timestamp_created": 1607368354, "timestamp_updated": 1607368354, "voted_up": true, "votes_up": 325, "votes_funny": 462, "weighted_vote_score": "0.929984450340270996", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "96698033": {"recommendationid": "96698033", "author": {"steamid": "76561198000986396", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 1947, "playtime_last_two_weeks": 0, "playtime_at_review": 1483, "last_played": 1629772383}, "language": "english", "review": "I bought this game a while ago and was disappointed, and went back to DayZ.  The new update brought me back, as it's made it really enjoyable.    The server variation isn't massive, pretty much the same experience across the board, but here's the thing... I see it growing into a very popular game to rival other open map online survival games.      This is a personal perspective, but I find it more fulfilling than DayZ.      I'm a working man and don't get to dump entire weeks of time into media of any kind.     To die in DayZ, is a sledgehammer to the testicles.    To die in DeadSide, is a smack in the face.  (Which would you prefer?)    Gear isn't hard to come by, and the PVP is going to be far more interesting for this reason.    In Deadside, the group mechanics are solid, with integrated hud and map.   (No more hours of trying to find your mate, and using a pathetic smartphone app to keep track of yourself.)      Unlike DayZ, DeadSide is actually fun.    Because it's a game, and it realizes that well.     Realism is great, but there is a balance.   DeadSide has that balance locked down.  Realistic damage from weapons, fun and mostly reasonable AI, and better graphical scenarios.    No more getting sick for no reason, thumbing in rounds after every engagement, or starting off on some godforsaken coast starving when death inevitably happens, and random game crashes.         It's simple, humble, and casual.     I like it a lot.      It gives you the feeling of survival, without the pain.   If I wanted to feel the pains of genuine realistic survival, i'd go camping in real life.   Good Stuff here.", "timestamp_created": 1627746004, "timestamp_updated": 1627746004, "voted_up": true, "votes_up": 130, "votes_funny": 7, "weighted_vote_score": "0.913963198661804199", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "130805253": {"recommendationid": "130805253", "author": {"steamid": "76561199184277065", "num_games_owned": 64, "num_reviews": 3, "playtime_forever": 1692, "playtime_last_two_weeks": 0, "playtime_at_review": 1669, "last_played": 1704303032}, "language": "english", "review": "DayZ for people with jobs", "timestamp_created": 1673672063, "timestamp_updated": 1673672063, "voted_up": true, "votes_up": 174, "votes_funny": 44, "weighted_vote_score": "0.911392927169799805", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "70519236": {"recommendationid": "70519236", "author": {"steamid": "76561198830357225", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 1967, "playtime_last_two_weeks": 0, "playtime_at_review": 813, "last_played": 1638644652}, "language": "english", "review": "Update 12/1/2021\nGame is aight\n\n-------------------------------------------------------------------------------------------\n\nA game with a lot of potential but is killed by the people who run the servers. \n\nFor the overall experience, even after playing well over 5 servers, I'm going to use the Sweet Baby Wayne's server for reference. We had just bought the game, loaded in, and had went to go look at the safe zones. When we got to one, on the Sweet Baby Wayne server, we were harassed by admins and moderators for being \"poor\" and not having much supplies or gear. Again, we had JUST bought the game no more than 20 minutes prior. We didn't say anything back and let them talk their smack. We left and came back to the safe zone a second time to STILL be harassed by the admins and mods. Finally we spoke up and called them out for treating new players like that and called them \"tools\". No more than 10 seconds later, myself along with 4 friends were all banned from the server.\n\nWe thought.. \"Okay, it was just a bad server lets try another one\". Got on the new server, meanwhile trying to figure out the entire game and the clunky mechanics, and began farming. We had made our way to the next safe zone to sell some stuff. Spoke once in game chat, and the SAME ADMIN FROM THE LAST SERVER is the admin of THAT server as well. He heard my voice and said \"Oh I know who that is\" and banned my friends and I for LITERALLY no reason.\n\nThat was my experience on Deadside and it pushed my entire group away. Sucks I played just slightly longer than the refundable amount because I would have instantly returned the game. Shitty communities on games ruin the chances for games to grow.", "timestamp_created": 1591675977, "timestamp_updated": 1638410927, "voted_up": false, "votes_up": 2150, "votes_funny": 175, "weighted_vote_score": "0.911315679550170898", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "71786387": {"recommendationid": "71786387", "author": {"steamid": "76561198037805891", "num_games_owned": 235, "num_reviews": 17, "playtime_forever": 16877, "playtime_last_two_weeks": 0, "playtime_at_review": 12831, "last_played": 1625248092}, "language": "english", "review": "This game is great and I enjoy playing it with my friends. The combat is intense, anxious moments when you are about to engage, and the spoils of war that come after being victorious in battle. It's really a lot less stressful and grindy version of rust (no raiding). I also really like the gun play on this game. Feels more realistic and satisfying. \n\nBut why am I giving it a thumbs down?\n\nThe people who run the servers in this game. There are no official servers (yet) and the ones that do say \"official\" have admins playing on it. The admins have the power to spawn anything they want, teleport anywhere they want, and kick/ban whoever they want. My time in this game has been brought to a discouraging and heartbreaking end because I was recently banned in a server I was doing really well in. I was walking out a building and all of the sudden \"This account has been banned.\" I messaged their discord and I was banned in that too. I simply wanted a reason as to why I was banned and to this day I still do not know why.\n\nLet me first say that there are official servers in this game. However most official servers the ping is way too high for me to play or the servers are pretty dead due to the ping. That’s okay because I get the game is alpha and they don’t have the budget to hold 60 different servers but the official servers are very limited. Do watch out however because people can put “official” in their server names. The servers that seem very populated are the community servers and that’s why I chose to play in them. I have been in at least six different servers/discords trying to find a server to play on but it seems the most populated community servers got loser admins. Playing in a server with 35< can be pretty dry if you’re a PvP enthusiast.\n\nAnother server I was in had this admin group who would just play the damn game like normal. I don't know about yall but even though if admins say they aren't gonna abuse their powers, just know about 85% of the time they are lying. But they would just show up at missions and north mili with the best gear in the game and had no fear losing it whatsoever. Then somehow, they just have \"lots of dogtags\" to get themselves back into the fight really quick. Every single member with \"lots of dogtags.\" At this point, the game did not feel fair whatsoever and motivation to compete with these players was minimal. No matter how many times you kill them and take their loot, they can always get it back in two clicks of a mouse. I also want to add that I played this game before admins got the ability to spawn items. Playing against them before that update was a lot easier and I actually did not see them roam as much.\n\nThis game is great. but god please make some official servers run by mature adults. People get a little taste of power and don't know how to act. A friend of mine said \"Such a good game hindered by horrible people owning servers............ never played a game where i felt restricted in choosing servers with sh**ty owners.\" THE GAME PLAY IS GREAT! Moderators/admins are not. There are releasing so much cool stuff that I’m so excited for and they are continuing to fix the optimization as well. This game has a bright future no doubt but once we get some stable servers, I don’t feel safe playing as of right now. \n\n(Thank you to all who took the time to read my review)", "timestamp_created": 1593586377, "timestamp_updated": 1625183635, "voted_up": false, "votes_up": 428, "votes_funny": 6, "weighted_vote_score": "0.911166965961456299", "comment_count": 27, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "112940347": {"recommendationid": "112940347", "author": {"steamid": "76561199232753535", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 22346, "playtime_last_two_weeks": 0, "playtime_at_review": 20220, "last_played": 1687731749}, "language": "english", "review": "Me and my whole clan were banned from the devs discord for reporting hackers over and over until someone was forced to acknowledge us. When they finally did they lost their cool and banned our whole team. Official servers were plagued with a group of 5 blatant cheaters aimbotting anyone that didn't pay them for entry into a safezone. Every single day there is a blatant aimbotter hitting 1000m shots full auto.\n\nDevs are absolutely pathetic. Banned us for simply voicing frustration on discord.", "timestamp_created": 1648417859, "timestamp_updated": 1648417859, "voted_up": false, "votes_up": 693, "votes_funny": 44, "weighted_vote_score": "0.906293690204620361", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "68920163": {"recommendationid": "68920163", "author": {"steamid": "76561198125353474", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 5949, "playtime_last_two_weeks": 0, "playtime_at_review": 5564, "last_played": 1645647258}, "language": "english", "review": "I hate to say this (As the population lately seems to be a bunch of \"Yes-Men\")... but this game is actually headed the wrong direction. I noticed that the DEV's would block and completely disrespect people sharing their negative reviews on FB and Twitter. Commonly you would see a person post something like \"Why are the devs not listening to us and posting new weapons, but no new sights\". Immediately following would be some Yes Man insulting the person directly and acting like hes the victim as soon as he gets whiplash. I can understand the game being popular, as it has potential, and YES i know its new... but Developers should not be insulting people on FB and expecting nothing done back. DEVS; Fix your attitude, and stop suppressing peoples opinions on what they would like to see. SMH\n\n2/22/2022: I decided to come back to try to play this game again. Found out i was banned for my comment. The irony is heavy. They actually BANNED my account for calling out their comments on twitter and fb where they insulted their player-base. Im curious if this is something STEAM should be informed about. I don't necessarily care that they banned me from a game that the developers who created it tend to abuse their players, but.... banning those who write negative reviews is something i have yet to see until these guys.", "timestamp_created": 1589139524, "timestamp_updated": 1645643186, "voted_up": false, "votes_up": 3168, "votes_funny": 162, "weighted_vote_score": "0.899710416793823242", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "154117133": {"recommendationid": "154117133", "author": {"steamid": "76561198232866200", "num_games_owned": 0, "num_reviews": 89, "playtime_forever": 28769, "playtime_last_two_weeks": 0, "playtime_at_review": 28155, "last_played": 1703738274}, "language": "english", "review": "Dev team as of recently has been catering to roleplayers, haven't touched this game in about a year. They ban you from their discord for speaking your opinion and criticizing the game. They release roadmaps for the year but doesnt release the content within these roadmaps throughout the year, and in Loafs own words (one of the devs for this game) roadmaps are \"just ideas of what we want to add not things we are working on.\" I used to love this game, had the pleasure of running the most popular server with some amazing people for about a year before it shutting down. Hopefully one day there is better communication between the devs and the community, because at the moment the private testers in their own words are \"too scared to speak out about issues in the game\" as they believe they will lose their private tester permissions. \n\nTLDR; Dev team is surrounded by yes men, they ban opposing opinions, and give out false promises.", "timestamp_created": 1703234989, "timestamp_updated": 1703234989, "voted_up": false, "votes_up": 130, "votes_funny": 2, "weighted_vote_score": "0.89054340124130249", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "133095718": {"recommendationid": "133095718", "author": {"steamid": "76561198435695668", "num_games_owned": 84, "num_reviews": 1, "playtime_forever": 4615, "playtime_last_two_weeks": 0, "playtime_at_review": 1433, "last_played": 1711962213}, "language": "english", "review": "Please allow players to host own servers", "timestamp_created": 1676722685, "timestamp_updated": 1676722685, "voted_up": true, "votes_up": 116, "votes_funny": 1, "weighted_vote_score": "0.884748160839080811", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "74518693": {"recommendationid": "74518693", "author": {"steamid": "76561198065778313", "num_games_owned": 703, "num_reviews": 53, "playtime_forever": 5106, "playtime_last_two_weeks": 0, "playtime_at_review": 3778, "last_played": 1628603038}, "language": "english", "review": "Yes, 1 week in; unemployed and slammed 60+ hours into the game.\n\nIt's early access and lacking content and as a former Arma 2 DayZ vet this should tell you something, the game is quite polished in what it does have in comparison to other survival games that come out with features half cocked.\n\nI like it so much I bought a server to play on named AUS [NoD]\n\nI do find some issues with it but I know these issues are already raised and being addressed by the developers and they are doing a great job communicating with the public about such things.\n\nEdit: I'm still playing here and there, every update, I want vehicles and I think with that update being so close we may have a surge in player base.\nP.S. I've got a new server named:\nFPP/PvP/50 loot %/1.4x missions/starter pack/100k cash/packs/ - AUS / NZ / SEA - [NOD] Community\nGet 100k starter cash when you join!", "timestamp_created": 1597773770, "timestamp_updated": 1627248008, "voted_up": true, "votes_up": 92, "votes_funny": 6, "weighted_vote_score": "0.884149312973022461", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "120375263": {"recommendationid": "120375263", "author": {"steamid": "76561198930234198", "num_games_owned": 182, "num_reviews": 22, "playtime_forever": 962, "playtime_last_two_weeks": 0, "playtime_at_review": 962, "last_played": 1654400016}, "language": "english", "review": "If tarkov and dayz had a baby, but Walmart raised it.", "timestamp_created": 1660111031, "timestamp_updated": 1660111031, "voted_up": true, "votes_up": 84, "votes_funny": 84, "weighted_vote_score": "0.882355451583862305", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "67614540": {"recommendationid": "67614540", "author": {"steamid": "76561198019939796", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 11760, "playtime_last_two_weeks": 0, "playtime_at_review": 2863, "last_played": 1704013977}, "language": "english", "review": "World: The world is a great medium well balance world with small towns and some good POI’s with different tiers of loot. Some trees on the map still float about 1m above the ground, but I found only a few in the world (most on slope areas). About animals *see Survival Elements below.\n\nWeather: I think a weather system would have worked great, it will add to the atmosphere, at the moment it is always clear skies. The day/night cycle works well.\n\nIn game Map: The in game map is great, the function of adding multiple marker points on the map to track your user waypoinst/POI's are great, wish every game had it. \n\nThe character: The character looks great, the clothes are nice at the moment, when climbing over objects the character seems to stay on top of the object until you move forward and not just leaping over. You can climb through windows that are very nice for different room access if someone is already in a house building etc. You can set the FOV so that makes the First Person view easier to manage and with a free look button to view realistic angles by moving your neck. Biggest thing I miss in this game regarding the character is to prone (There is no prone), making stealth approaches very difficult. Jumping while running seems like you can’t jump far while running.\n\nSound: The world sound is nice, for example you can hear the humming noise of a Transmission Tower (Electricity Pylon). But there is an ambient noise that sounds like footsteps, and then you look around and see nothing, you can hear squirrels or small animals in the vegetation which seems realistic. The normal walking in game seems a little bit loud to sneak onto someone. Also making stealth approaches difficult.\n\nBase Building: The base building is still basic but I like it, I think in future updates the base building will be great. You need an axe, saw and hammer to start your build, I think that makes it a bit more realistic and with a team effort you will have a base in no time. (Make sure someone is on guard while you build).Biggest thing that needs to be done on the base building side is for the clan/squad to access the base while the clan/squad leader is offline. \n\nSurvival Elements: You can drink sodas and eat canned foods; I would like to see animals in the world. Maybe to hunt them, or have some fruit trees around to harvest from, it will make the survival aspect easier to manage than to go to the trader and keep on buying food and sodas, and here and there you can find soda and food in houses etc. The dam should be accessible for drinking, maybe have a water container to retrieve the water. (Well this is just a suggestion).\n\nThe NPC’s: They come in variety and some are more difficult than others, but I must say they are just perfect.\n\nThe Weapons: From Pistols, shotguns, sub machine guns, assault rifles to sniper rifles. A good variety with mod options, on the mod side I would like to see a hunting scope for some of the rifles, and some other new attachments. But we need to wait and see.\n\nThe missions: The missions are fun, they also come in different difficulty so that gives you a choice to approach it or not. I would like to see different scenarios of missions; maybe in the future they will add it.\n\nSafe Zone and Traders: There are two safe zones, each with two traders. One where you can buy weapons and gear and other one where you can buy food/soda, tools etc. You can sell looted items to buy new gear etc. There you can also talk to your enemies or friends about what happened in the field.\n\nThe Servers: I Personally think the players need access to the server files to host their own servers in the country they reside, playing on a ping of +-200ms with or against players with a ping of 10ms is just unfair but debateable. Not all countries have an Official Server, so consider before you buy, just in case it might be unplayable with excessive high ping. At the moment you need to rent a server but the server will still be hosted elsewhere. A lot of server lags at the moment but I saw the Developers are working on it. \n\nBuy it/don’t buy it: The game is still early access and has only been released on the 14th Arpil 2020, it is still very new. It is affordable and it comes with a support pack for information on the store page https://store.steampowered.com/app/895400/Deadside/\nI will say it is a must buy, the developers are working around the clock to fix the small bugs, they are very interactive with the players and they keep them up to date with what is happening. For a small developer group they have done very well and I think the launch was overwhelming and unsuspected. I see great things for this game. Edit: I am editing this part, on the release I felt that the developers are doing a good job, at the moment they are doing a good job by keeping a selective player base happy and content, on the other hand if you not close to a server you will experience a high ping and will battle to play due to rubberbanding.\n\nEdit: \"on the other hand if you not close to a server you will experience a high ping and will battle to play due to rubberbanding.\" I will have to say, I reinstalled this game after a couple of updates to see if the server issues are resolved, due to no local servers playing it makes it almost impossible. There is no change in ping which is understandable due to server location, but the rubberbanding is non existent, I do believe that when Tinybuild bought into Bad PIxel that they saw a lot of small things that can change, especially on the Server side of things. I am still hopeful for a local server but it is at least playable and the game that I was looking for.\n\n\nClosing Comment: I will update this review as we go along.\n\nPS. If I encounter and kill you, please forgive me as it is called Deadside for a reason.\n\nKeep safe and enjoy.", "timestamp_created": 1587288139, "timestamp_updated": 1662643216, "voted_up": true, "votes_up": 191, "votes_funny": 15, "weighted_vote_score": "0.881808996200561523", "comment_count": 11, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "69870482": {"recommendationid": "69870482", "author": {"steamid": "76561198048180520", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 5613, "playtime_last_two_weeks": 0, "playtime_at_review": 5582, "last_played": 1626747723}, "language": "english", "review": "Loved the game the first couple of days. I have been playing survival FPS games since WARZ, DAYZ, and early Rust. This game has a ton of promise and potential.\n\nHowever....\nJust like WarZ...\nHackers are the problem. Even after the installation of EZAnticheat (really??? you couldn't find a better anti-cheat??) This is the same anti-cheat that Dirty Bomb uses, which let hackers destroy the \"release\" of that game. Players are still obviously aim-botting and speed-hacking after a facebook message from the developers saying they banned over 400 hackers on public servers in one day.\n\nWill keep my eye on this game as it progresses, but until they actually fix the hacking (aim-botting, ESP, speed hacks, etc), i sadly cannot recommend this game as much fun as it has the potential to be.", "timestamp_created": 1590550163, "timestamp_updated": 1590550163, "voted_up": false, "votes_up": 192, "votes_funny": 5, "weighted_vote_score": "0.879868626594543457", "comment_count": 13, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "122675410": {"recommendationid": "122675410", "author": {"steamid": "76561198394270892", "num_games_owned": 160, "num_reviews": 4, "playtime_forever": 6335, "playtime_last_two_weeks": 0, "playtime_at_review": 4178, "last_played": 1688250711}, "language": "english", "review": "While I recommend the game I BEG the dev's to fix the audio. I can't think of a single reason why a cricket, squirrel, bird, etc should be louder than an assault rifle in my hands. Turning down the effects audio so you don't go deaf also makes it so you cant hear gunshots, kind of a hindrance in an FPS where you want to be able to hear the crunch of boots in the woods around you. I took off my headphones and could still hear the animals from across the room with a fan on full blast, And the game AT 25% IN-GAME VOLUME.", "timestamp_created": 1663923983, "timestamp_updated": 1663973136, "voted_up": true, "votes_up": 90, "votes_funny": 29, "weighted_vote_score": "0.877212464809417725", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "134201105": {"recommendationid": "134201105", "author": {"steamid": "76561198355578875", "num_games_owned": 294, "num_reviews": 5, "playtime_forever": 1651, "playtime_last_two_weeks": 0, "playtime_at_review": 1651, "last_played": 1650122468}, "language": "english", "review": "Been playing this game few times it was great at the start then i got bored of it because of lack of updates. One day i login into a account to see that i got banned manually by developers stating i was using cheats. Didnt even play for like a month my stats were terrible they denied to remove ban neither explain and show by what kind of proof they banned me, at the end they thretened to block my email or my steam from posting, terrible developers.", "timestamp_created": 1678132173, "timestamp_updated": 1678132173, "voted_up": false, "votes_up": 144, "votes_funny": 13, "weighted_vote_score": "0.87392723560333252", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "130645064": {"recommendationid": "130645064", "author": {"steamid": "76561198331314240", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 88439, "playtime_last_two_weeks": 0, "playtime_at_review": 88380, "last_played": 1709925199}, "language": "english", "review": "A once promising and flourishing game, it has unfortunately taken a turn for the worst since it has been taken over by Tiny Build. The previous team, Bad Pixel, developed a visually immaculate third/1st person option shooter survival set in modern post apocalyptic world with real world weaponry and gear. Unfortunately the small dev team (Bad Pixel) couldn't bring their full game to fruition on their own and signed the game over to Tiny Build who promised they shared the common vision and goals as the originators. Since the take over we've seen unpolished mechanics and game play make it's way into game play. For example, an update removed the option to purchase food in the safe zone in lieu of a canteen to assist with hydration, a key feature in survival games. The canteen is a single use item that cannot be filled in any of the bodies of water located on the map. A recoil pattern spray update was also implemented. Has anyone ever heard of a third person shooter with recoil pattern? How would/could this work? While there are many other issues regarding implementations, other pressing issues to discuss exist such as glitches. One of which is a crouch glitch where you crouch and wedge yourself under a overhanging rock or tree branch, log out, log in, and viola, you're now in another part of the map. Another such glitch is when you die from falling, being killed in air, or your body rolls down hill. When this occurs, you cannot loot your body and all those hours of looting are wasted. The last issue at hand is the lack of vehicles. This game is a running simulator so get ready to build up your finger dexterity! The dev team continues to promise the release of vehicles while missing road map release dates time after time with the promise that they're still working on it. Vehicles have actually been down graded to open platform boats and this is somehow supposed to be appeasing. I'm not saying this game is a complete loss but at this rate and with the lack of meaningful updates, it's looking that way. At the end of the day you can always try it out and get a refund. Good luck out there and have fun.", "timestamp_created": 1673453975, "timestamp_updated": 1673454084, "voted_up": false, "votes_up": 195, "votes_funny": 6, "weighted_vote_score": "0.873545825481414795", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "94782106": {"recommendationid": "94782106", "author": {"steamid": "76561198164881261", "num_games_owned": 501, "num_reviews": 19, "playtime_forever": 1753, "playtime_last_two_weeks": 0, "playtime_at_review": 1203, "last_played": 1625226226}, "language": "english", "review": "**LARGE POTENTIAL**\n          Info Dump\nPlays like Dayz movement/eating. Its no where close to having as many bugs. Gun play feels like Tarkov. AI are on the same level as Arma AI. Large diversity in AI difficulty. Base building is easy to do resembles Rust/Miscreated. There is very few options for customizing your base other than a couple chests and a spawn point. Balanced economy and great map. There are some movement glitches in the vast map but not too many. Very responsive Dev team that seems as though they care for the success of the game. Its still early accesses and there isn't tons of extra things to do, make, find. But it seems extremely promising. I would highly recommenced supporting the devs and giving this game a taste.", "timestamp_created": 1625111888, "timestamp_updated": 1625112280, "voted_up": true, "votes_up": 136, "votes_funny": 3, "weighted_vote_score": "0.872948050498962402", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "110365540": {"recommendationid": "110365540", "author": {"steamid": "76561199192683325", "num_games_owned": 162, "num_reviews": 1, "playtime_forever": 7770, "playtime_last_two_weeks": 0, "playtime_at_review": 1023, "last_played": 1669431979}, "language": "english", "review": "If you want to play Dayz or Tarkov but with less stress but still with an element of intensity, this is the game for you.", "timestamp_created": 1645026535, "timestamp_updated": 1645026535, "voted_up": true, "votes_up": 105, "votes_funny": 1, "weighted_vote_score": "0.870619058609008789", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "82907367": {"recommendationid": "82907367", "author": {"steamid": "76561198129201853", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 10158, "playtime_last_two_weeks": 0, "playtime_at_review": 2939, "last_played": 1704339176}, "language": "english", "review": "This game, aside from already being enjoyable, has a ton of future potential. The team working on it is small, but I see that changing as they further develop deadside. It's already gotten a decent amount of attention and the community is great.\n\nThis game has a beautiful open world,\nfantastic AI scavs to fight\nand intense and active pvp on any populated server.\nThe gun play is great,\nand it feels like a mix of rust and EFT. Both fantastic games in their own right.\n\nI only see good things for deadside's future. Worth the money to get now at it's current price.", "timestamp_created": 1608670722, "timestamp_updated": 1608670722, "voted_up": true, "votes_up": 75, "votes_funny": 4, "weighted_vote_score": "0.868340849876403809", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "79593651": {"recommendationid": "79593651", "author": {"steamid": "76561198063925137", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 5103, "playtime_last_two_weeks": 0, "playtime_at_review": 2462, "last_played": 1629403999}, "language": "english", "review": "PUBG Movement, H1Z1 Gameplay, Decent enough yet time consuming base building (hopefully raiding soon), DayZ environment and EFT scavs. Missions, airdrops, traders and lots of PvP. Definitely will see this game improve in the future.", "timestamp_created": 1605946358, "timestamp_updated": 1606781196, "voted_up": true, "votes_up": 95, "votes_funny": 1, "weighted_vote_score": "0.866139411926269531", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "137953355": {"recommendationid": "137953355", "author": {"steamid": "76561198006994505", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 3884, "playtime_last_two_weeks": 0, "playtime_at_review": 2116, "last_played": 1686966754}, "language": "english", "review": "Bought this game on a whim and couldn't be happier. Don't let the steam charts player count scare you away from this game. There are dedicated servers in this game that always have players in it.\n\nUnlike DayZ and Rust, you can find guns almost immediately when spawning in, in houses and shelters. So you aren't spending hours looking for a firearm, magazines, and ammo. Guns in this game spawn with ammo.\n\nThe game currently has two safe zones that you are able to enter and store some of your loot or even sell it to one of the two vendors. One vendor sells ammo, guns, and armor/clothing. The other vendor sells building/crafting supplies and food/meds.\n\nMy favorite thing about this game is that there are no OFFLINE RAIDS so you aren't glued to the game like Rust. Depending on the server, when you die you have a chance to drop a raid token and if someone pops the raid token within 5 mins of your death, it triggers your base to be open to be attacked and large general proximity of your base is shown on the map any everyone has ~60 mins to attack. Once the timer is up, you can no longer be raided unless you die and drop another raid token and someone pops it.", "timestamp_created": 1683474997, "timestamp_updated": 1683474997, "voted_up": true, "votes_up": 64, "votes_funny": 0, "weighted_vote_score": "0.865524470806121826", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "92716310": {"recommendationid": "92716310", "author": {"steamid": "76561198307488535", "num_games_owned": 161, "num_reviews": 12, "playtime_forever": 1503, "playtime_last_two_weeks": 0, "playtime_at_review": 1032, "last_played": 1709767967}, "language": "english", "review": "80% running 10% looting 10% action. Please add a bike or a car.", "timestamp_created": 1622186956, "timestamp_updated": 1622186956, "voted_up": true, "votes_up": 133, "votes_funny": 11, "weighted_vote_score": "0.863477945327758789", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "150151556": {"recommendationid": "150151556", "author": {"steamid": "76561198023762061", "num_games_owned": 212, "num_reviews": 2, "playtime_forever": 2590, "playtime_last_two_weeks": 0, "playtime_at_review": 2532, "last_played": 1700368134}, "language": "english", "review": "I played this game last year, and just came back to give it a try after i saw the news about some interesting updates.\nSadly, my thoughts remain the same: This game has potential, quite some, in my opinion, and does some things VERY well. \nBUT. All the good things are overshadowed by a single thing, that has ruined multiple times the experience for me and my friends. \nIt's not the animations, it's not the mouse weird acceleration thing going on that makes your aim go funky, it's not the graphics, it's not the boredom after just a few days and the repetitiveness of the gameplay... it's the AI. \nTHE. F*****G, AI. \nLet me explain: I stopped playing because we would get headshotted by a single enemy controller by the AI running in a field with an SMG and insta-killed. From 200+ meters. With TOP ARMOR. Multiple times.  So you have to respawn in the closest city, run back to your body to get your things back, only to find the bots evaporate you again, and again, and again. And each time you have to spawn further away, because spawns have a cooldown time. Fun, eh?\nSo we stopped playing out of frustration. \nThen we came back last week because they had \"Rebalanced the AI\", only to find they kinda did... but there's still a huge underlying issue with the way the devs program difficulty for the harder missions.\n\nTheir words:\" [i]Getting an instant 180 headshot by an AI using a Mosin is not the experience we are aiming to deliver, and we hope these changes will eliminate that problem\"[/i]\nI mean, yeah i have multiple videos of me getting evaporated by AIs doing a 180 turn and shooting me with spiderman's reaction time which was kinda bullcrap.\nNow? Well, now if you dare to pop your head out of cover you get shot and killed... in 2 shots. I mean, i agree the AI actually turns slower and reacts slower, but we're talking American Sniper's level of accuracy no matter the weapon they use and how far you are. I have videos of AI following me repositioning myself while running hidden from them: use 3rd person, run along a hill, a crest or a shore hidden from view and see how the AI's powerful x-ray eyes follow you wherever you go. \nOh, and if you dress yourself with a ghillie, set up a .cal50 on a hill and shoot enemies from 500m+, don't expect to live for more than a few seconds. They will kill you with their shoelaces.\n\nThis is not \"The Dark Souls of Survival FPSs\", this is lazy coding.\n\nI do not recommend this game, not until they change the way bots behave.", "timestamp_created": 1700022495, "timestamp_updated": 1700022495, "voted_up": false, "votes_up": 138, "votes_funny": 7, "weighted_vote_score": "0.860790252685546875", "comment_count": 11, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "67664315": {"recommendationid": "67664315", "author": {"steamid": "76561198053720206", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 4533, "playtime_last_two_weeks": 0, "playtime_at_review": 1008, "last_played": 1702868612}, "language": "english", "review": "The cheating problem on this game is insane. People running around at mach speed and aimbots, and forget trying to hide in foliage because everyone turns their settings to minimal for an advantage. Sad because it has so much potential.", "timestamp_created": 1587354440, "timestamp_updated": 1587354440, "voted_up": false, "votes_up": 635, "votes_funny": 72, "weighted_vote_score": "0.858537197113037109", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "125122958": {"recommendationid": "125122958", "author": {"steamid": "76561198010494652", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 37017, "playtime_last_two_weeks": 1695, "playtime_at_review": 27438, "last_played": 1713664170}, "language": "english", "review": "positive points...\nyou can hunt ducks , you can catch fish, you can kill wolves.\nyou can eat or sell the duck legs , you can eat or sell the fish, and can sell the wolf pelts.\nthere are 2 types of boats in the game that get better gas mileage than before but not much at all\ncompared to actual boats.\nnegative points...\nyou cant lock a boat and keep it like you can your base.\nyou can lock it but the lock is removed after you log out of the server for the night,\nand the locks are expensive.\n1) no point in posting negative comments in the deadside community. you will get banned... for being honest about the game allowing cheating by people who rent servers.\n2) you cant aim properly ( only 1 second to hold your breath before your character acts like a drunken sailor) and is incapable of aiming at any target.\n2.1) update , you can now hold your breath for 3 seconds.  IT REALLY HELPS BUT ITS NOT REALISTIC AT ALL.\n3) its gets really boring after a few days because you find that theres really nothing left to accomplish because theres nothing but repetition after you reach a certain point.\n4) if your suicidal then this arcade game would be right up your alley ... because all you seem to do is die , and die , and die over and over and over again so that may very well force you into being a survivalist and change your mind about suicide.\n5) that said it did get slightly better because now you can hunt ducks in the game and the ducks act normal unlike the disco dancing NPC's that jump up and down and dance back and forth and shoot you all the time while you cant even aim at anything if your moving at all.\nso at the moment I cant recomend this game even to drunk sailors who want to feel less drunk.\n\nits actually a shame that the devs or whoever is in charge havent put more work into this game because it\nhas a lot more potential than most survival games.", "timestamp_created": 1667855932, "timestamp_updated": 1711045263, "voted_up": false, "votes_up": 391, "votes_funny": 86, "weighted_vote_score": "0.857039451599121094", "comment_count": 27, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "129359656": {"recommendationid": "129359656", "author": {"steamid": "76561197960926563", "num_games_owned": 0, "num_reviews": 61, "playtime_forever": 1817, "playtime_last_two_weeks": 0, "playtime_at_review": 409, "last_played": 1675111962}, "language": "english", "review": "Bought DayZ, refunded DayZ, bought SCUM, refunded SCUM, bought Deadside, did not refund Deadside", "timestamp_created": 1672081270, "timestamp_updated": 1672081270, "voted_up": true, "votes_up": 362, "votes_funny": 60, "weighted_vote_score": "0.855118513107299805", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "81696502": {"recommendationid": "81696502", "author": {"steamid": "76561198028618265", "num_games_owned": 365, "num_reviews": 17, "playtime_forever": 6071, "playtime_last_two_weeks": 29, "playtime_at_review": 230, "last_played": 1713041012}, "language": "english", "review": "If DayZ, SCUM, and Tarkov had a baby. Except this baby has more PVE combat, and it isn't as hardcore.\n\nMy only complaint with this game so far is how it needs more content as well as polish (sounds, graphics, and UI). If the devs continue to update and put care into this game I could see it becoming a massive title.", "timestamp_created": 1607220262, "timestamp_updated": 1607220262, "voted_up": true, "votes_up": 76, "votes_funny": 5, "weighted_vote_score": "0.853048563003540039", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "116742800": {"recommendationid": "116742800", "author": {"steamid": "76561198105229483", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 1491, "playtime_last_two_weeks": 0, "playtime_at_review": 1161, "last_played": 1706485293}, "language": "english", "review": "I cannot recommend Deadside to anyone that is not fully aware that this game has very little content and has had a very slow development. There are no objectives besides PVP/PVE (AI Missions). The PVP is extremely rough with latency and missing mechanics for guns. The ability to abuse the spawn system (spawning very close to your dead body). There is also a rifle that is a one hit kill to any player at any distance and through any armor removing all possibility of defending yourself. The render distance for players is also very short. The base building is very basic, it takes one player approximately 30-min to have a moderate sized base with the max storage allowed. The AI have very limited pathing and is easily abused, but they also have very aggressive aiming with full-auto weapons that will kill you from over 100M away in a burst. There are no systems in place to stop players from abusing the Safe Zone. Over all this game has potential but it needs a lot of work and time put into it. If you want to help the development process and add your feedback then absolutely purchase and play but if you are looking for your new FPS/survival shooter I cannot recommend Deadside.", "timestamp_created": 1654815889, "timestamp_updated": 1654815889, "voted_up": false, "votes_up": 86, "votes_funny": 4, "weighted_vote_score": "0.853000223636627197", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "68128345": {"recommendationid": "68128345", "author": {"steamid": "76561197971797639", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 5990, "playtime_last_two_weeks": 0, "playtime_at_review": 1588, "last_played": 1702867730}, "language": "english", "review": "Lots of fun, lots of potential, great job Deadside devs on making another ArmA/Day-Z-like game that actually shows promise!\n\nPros:\n- Excellent art/graphics, you don't mind running all the time because the environments are so gorgeous\n- Stable, no crashes yet\n- Performs well on my dated gaming PC (i5 CPU, GTX 950, playing at 1080p)\n- Realistic gun-play feels like EFT or PUBG\n- Fun with friends\n- Challenging PVE in addition to PVP\n- Getting good loot to be competitive is not that difficult, its easy to bounce back from losing everything\n\nCons:\n- Still in Pre-Alpha/Alpha so there is a lot left to be desired (not much content yet)\n- Inventory controls are clunky and need refinement\n- Character creation options are extremely limited\n- Base building is very grindy and shallow in its current form", "timestamp_created": 1588005510, "timestamp_updated": 1588005510, "voted_up": true, "votes_up": 217, "votes_funny": 27, "weighted_vote_score": "0.850487887859344482", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "101056183": {"recommendationid": "101056183", "author": {"steamid": "76561197966256482", "num_games_owned": 25, "num_reviews": 5, "playtime_forever": 2726, "playtime_last_two_weeks": 0, "playtime_at_review": 1322, "last_played": 1634414620}, "language": "english", "review": "This game is if DayZ and EFT had a baby but they were related so the baby came out a little weird.", "timestamp_created": 1634246012, "timestamp_updated": 1634246012, "voted_up": true, "votes_up": 123, "votes_funny": 178, "weighted_vote_score": "0.848648726940155029", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "94472055": {"recommendationid": "94472055", "author": {"steamid": "76561198060867639", "num_games_owned": 0, "num_reviews": 30, "playtime_forever": 1305, "playtime_last_two_weeks": 0, "playtime_at_review": 1020, "last_played": 1625214147}, "language": "english", "review": "For the love of god add some vehicles to this game...........", "timestamp_created": 1624766165, "timestamp_updated": 1624766165, "voted_up": true, "votes_up": 113, "votes_funny": 9, "weighted_vote_score": "0.844625532627105713", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "95067824": {"recommendationid": "95067824", "author": {"steamid": "76561198144183699", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 727, "playtime_last_two_weeks": 0, "playtime_at_review": 224, "last_played": 1636061668}, "language": "english", "review": "I loved the game but I'm tired of running\nThis game needs vehicles\n", "timestamp_created": 1625438954, "timestamp_updated": 1625438954, "voted_up": true, "votes_up": 64, "votes_funny": 5, "weighted_vote_score": "0.841704487800598145", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "117508230": {"recommendationid": "117508230", "author": {"steamid": "76561197999441253", "num_games_owned": 538, "num_reviews": 26, "playtime_forever": 118, "playtime_last_two_weeks": 0, "playtime_at_review": 118, "last_played": 1625534397}, "language": "english", "review": "Good with friends.  I've not got any friends.", "timestamp_created": 1656068511, "timestamp_updated": 1656068511, "voted_up": true, "votes_up": 68, "votes_funny": 57, "weighted_vote_score": "0.839242458343505859", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "150322002": {"recommendationid": "150322002", "author": {"steamid": "76561198013648025", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 3336, "playtime_last_two_weeks": 0, "playtime_at_review": 3336, "last_played": 1695257875}, "language": "english", "review": "Uninstalled when official servers reset my gear & bank storage twice in 3mo but I will be back for the final build of this game in 2-3 years. I am very aware I may not be the target market being a Dad with a day job I cannot play a game that has errors that delete my time invested. You got my money now so show/prove to us your community that you respect our time and I will be back <3", "timestamp_created": 1700266501, "timestamp_updated": 1700266501, "voted_up": true, "votes_up": 72, "votes_funny": 4, "weighted_vote_score": "0.838148713111877441", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "119750093": {"recommendationid": "119750093", "author": {"steamid": "76561199026267152", "num_games_owned": 69, "num_reviews": 8, "playtime_forever": 1921, "playtime_last_two_weeks": 0, "playtime_at_review": 219, "last_played": 1666456809}, "language": "english", "review": "bots scare me more than real players", "timestamp_created": 1659171721, "timestamp_updated": 1659171970, "voted_up": true, "votes_up": 54, "votes_funny": 13, "weighted_vote_score": "0.835547864437103271", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "118976470": {"recommendationid": "118976470", "author": {"steamid": "76561198386984396", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 134, "playtime_last_two_weeks": 0, "playtime_at_review": 134, "last_played": 1654769682}, "language": "english", "review": "I really like this game, it has nice graphics and it's very easy to uninstall.\n", "timestamp_created": 1658090011, "timestamp_updated": 1658090011, "voted_up": true, "votes_up": 126, "votes_funny": 174, "weighted_vote_score": "0.835361957550048828", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "136475532": {"recommendationid": "136475532", "author": {"steamid": "76561198058087106", "num_games_owned": 130, "num_reviews": 11, "playtime_forever": 11500, "playtime_last_two_weeks": 0, "playtime_at_review": 11500, "last_played": 1666589242}, "language": "english", "review": "It's been almost a year since they teased transport and it still isn't here. Six months since the last update and they still haven't even removed christmas trees from the holiday event yet... Tells you all you need to know really. To add to that, this lack of action began to occur right after the devs were bought over by another company, in which the buyover was made to look like they hired new talent to speed up development. In their own words \"Accelerating the development of deadside\" But it's been anything but that and was simply them being bought. Add on top of that a discord community that's become an echo chamber due to the mods removing anyone that criticises. Game had potential, but it was squandered.", "timestamp_created": 1681140197, "timestamp_updated": 1681140197, "voted_up": false, "votes_up": 115, "votes_funny": 8, "weighted_vote_score": "0.83523094654083252", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "99860905": {"recommendationid": "99860905", "author": {"steamid": "76561199158586968", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 5985, "playtime_last_two_weeks": 0, "playtime_at_review": 1981, "last_played": 1674345353}, "language": "english", "review": "Deadside is a pretty controversial game in which people often overlook because of the game style and its similarity to other games. Currently I have 33 hours on the game, and below are some of the things I've experienced and learned in my time, granted not a lot of time but I'll try to explain and make it as clear as possible.\n- - - \nDeadside is a medium-fast paced survival game, where you spawn in as a character with little to no supplies, and your goal is to simply live for as long as possible. Sounds simple, right? Well, Deadside is fully open world with an already pretty large map, and has areas around the map that have Scav patrols or even Scav outposts, more commonly however are Scav missions, which all give you varying loot depending on their difficulty. Not only this but there is series of random events that are triggered for players to do, high risk high reward missions. However... there are some catches.\n------------\nTHE PROS: \n1. Surviving isn't impossible but is easily present.\n2. Weapons feel like weapons, not like toys.\n3. People can focus more on PvE then PvP and still get to use their firearms effectively, appealing to more then one audience.\n4. The community is fairly friendly, they're not perfect but from my interactions it's been fine.\n5. The game supports traders and limited \"vault\" storage at these traders, along with a money system for buying and selling items.\n6. Additionally with 5, the game supports the ability to trade items with other players, opening line to new possibilities for people who are not PvP gods.\n7. The game has a good focus between realism and arcade, running definitely is no stranger in this game; nor is it in any game that's open world survival. However, if you know where to go and stay in the same areas to sort of \"farm\" loot, you can minimize the running.\n8. Deadside supports base building as well, along with a teaming system too.\n9. Attachments for weapons are simple to understand and easy to use.\n10. In continuation of 9, the entire game is quite self-explanatory give you know basic survival games. The HUD is easy to understand and is straight forward, same with the inventory; managing to be even more simple.\n11. They even included skins in the game where if you looted a variant of a gun or vest, it could have a skin applied to it, increasing it's value as a \"collectible\" so to speak.\n12. For the most part I haven't seen any exploiters since I started playing either.\n13. Combat is actually fun to play through, and it feels rewarding to truly win a fight.\n14. There are plenty of community servers you can choose from to find out which one fits your playstyle best. (I played on Loaf's server in my 33 hours)\n-------------\nTHE CONS:\n1. The AI's aiming can be a bit of a hassle sometimes, and it can get annoying when fighting up to 15 scavs in a mission as a solo player, but the load is easier to bare with a team.\n2. Some buildings are not fully inside detailed nor are other buildings able to even entered, making it sometimes upsetting to die all because you couldn't open a door.\n3. Some settings are lacking in their ability, but others are fully changeable. There is leaning in the game, however it's a hold; not a toggle - and you can't change this setting.\n4. Respawning can be the most annoying part as it's hard to get back into an area you want to be in, the same goes with respawning right beside a patrol - which only happens every now and then.\n5. Parts of the map lack proper cover, making you easy targets to players and AI alike.\n6. There are guns in which are considerably more powerful, that being M99 and VSD (.50 cal and 7.62x54mmR snipers) which can one or two shot most players even with vests; which is controversial as they do seem balanced.\n7. There are no vehicles in the game, which can make running even more of a hassle if you spawned 3km away from your body, BUT there is an option to choose your spawn point if you have enough \"Rep\" points.\n- - - -\nThere are some honorable mentions that this game is not fully completed, it was also recently purchased to help increase the production of the game. It also (as of currently) has more overall upvotes then a game like DayZ does, although it has a fraction of the playerbase.\nIn the end Deadside is truly a good game, do I expect you to play it everyday? No, not even I do - but it is a good game to come back to and appreciate for it's potential in it's early phases.", "timestamp_created": 1632442985, "timestamp_updated": 1632442985, "voted_up": true, "votes_up": 51, "votes_funny": 0, "weighted_vote_score": "0.82986980676651001", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "71545251": {"recommendationid": "71545251", "author": {"steamid": "76561198043367520", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 3304, "playtime_last_two_weeks": 0, "playtime_at_review": 65, "last_played": 1647310215}, "language": "english", "review": "get into game\ngo to safezone\n\"get the fuck off my server you piece of shit, get the fuck out before we ban you this is OUR server\"\n\nwhat a great start to this game", "timestamp_created": 1593322216, "timestamp_updated": 1593322216, "voted_up": false, "votes_up": 842, "votes_funny": 247, "weighted_vote_score": "0.827570497989654541", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "85017490": {"recommendationid": "85017490", "author": {"steamid": "76561197965526227", "num_games_owned": 2282, "num_reviews": 114, "playtime_forever": 132, "playtime_last_two_weeks": 0, "playtime_at_review": 47, "last_played": 1612044386}, "language": "english", "review": "ok now deadside has pissed me off they removed my discussion because it was to hurtful lmfao  \n\nthere is nothing in this post this is not straight facts and you know it \n\nyou have killed the game\nless then 1k players a day\nwas the greed worth it? im curious\n\nits kinda funny because things like this\nhttps://twitter.com/DeadsideGame/status/1624007309079764995\nwouldn't happen with dedicated servers\n\ni see you pushing updates to the server files almost everyday last one being 12 hours ago.\ni made my review in early 2021\nits now literally 2023 this is a joke\n\nthe worst part about this is this game could have been in mine and my friends rotation for the last 2 years but instead you wanted to sell a partnership with the worst hosting company in the world you value your own players so little that you need to nickle and dime them over a server lmao\n\n\ndeleting criticism because it hurts your feelings is not ok and i really hope valve does something about this \n\n\nsmall edit i haven't played this game in 2 years i have however looked threw some community posts and noticed peoples issues \n-still massive cheating issue\n-devs ban or remove posts that criticize them\n-no updates in over 2 years\n-no server files\n-full of bugs \n-ai is horrible\n-no vehicles // i had to do a double take no vehicles in a game like this? lmao what \n-devs cashed out on tinybuild and now do next to nothing \n-cant go prone still \n\nafter reading threw about 100 reviews my god how this has any players is beyond me \n\noriginal review below \n\n\n\ntldr game okish g-portal hosting bad\n\nJust for the fact you have the audacity to force people to use a garbage hosting service like g-portal to host a server and tweak settings this game will die. and is dying. \nyou need to release the damn server files asap. no game that has done this sort of practice has EVER lasted. \nnot to mention even when i say oh well ill spend the money the ONLY SERVER near me is \"sold out\" \n\nplease for the love of god. treat your players with respect and release server hosting files. you clearly have them. its clearly unreal 4 its not hard to make them. stop acting like goofs.\n\nsince everyone thinks i hate the game. i don't. \ni think its an alright survival game with a much faster pace. \nmy issue is in the fact that companies think its ok to nickel and dime players after release or during early access in this case, i bought an online survival game. if you only wanna allow only \"OFFICIAL SERVERS\" sure ill know that going in. and i wont buy it. but allowing user hosted servers but only allowing ONE server host and not even releasing files for it? why? the only thing i can logically think of is drm. even then, hurting the players to stop the pirates is not the way.\n\n\nthe game also seems to have a cheater issue. for that i'd normally recommend private servers with strict whitelisting / apply / tools to prevent it but this game lacks any of that. so yeah. if cheaters get to bad just play pve i guess. its kinda crap.", "timestamp_created": 1611125398, "timestamp_updated": 1678124512, "voted_up": false, "votes_up": 300, "votes_funny": 26, "weighted_vote_score": "0.8221854567527771", "comment_count": 12, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "67422234": {"recommendationid": "67422234", "author": {"steamid": "76561197971020912", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 691, "playtime_last_two_weeks": 0, "playtime_at_review": 169, "last_played": 1587564232}, "language": "english", "review": "Spawned in, found a shotgun. \nSaw another player, told him I was friendly and gave him a pistol.\nOther player shoots me in the face and scavenges my corpse. \nSpawned in again, hear footsteps, guy almost knifes me from behind.\nSay I'm friendly, he thinks about it. \nAnother guys turns up with two shotguns, says he won't shoot. \nThe three of us team up, we get geared.\nProceed to kill on site and meet 2-3 different squads.\nGo to safe zone, pick a victim. Wait for him to leave.\nFollow him out, darkness setting in, can't see anything.\nLeads us into an ambush at a building site. Get gunned down. \nSpawn in again.\n\nThis game is awesome.", "timestamp_created": 1587031352, "timestamp_updated": 1587031352, "voted_up": true, "votes_up": 221, "votes_funny": 111, "weighted_vote_score": "0.820897519588470459", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "98354051": {"recommendationid": "98354051", "author": {"steamid": "76561197977768260", "num_games_owned": 0, "num_reviews": 51, "playtime_forever": 3287, "playtime_last_two_weeks": 0, "playtime_at_review": 3064, "last_played": 1710961760}, "language": "english", "review": "Good game with a very solid PvPvE loop behind it. The shootouts can get quite intense because shooting is actually hard in this game, especially when you try engaging in mid-range combat but only have a pistol. The reload animations deserve special credit and the scopes they implemented lately are great, too. However...\n\nThere was always a lot of walking involved. But the map gets bigger and bigger and yet there are only two safezones and no vehicles. \nI just organized my entire desk drawers while autorunning across the map. Heck, I am writing this review while autorunning in the background. But there are only so many drawers to organize and so many reviews to write. Hence, I unfortunately must say that this game is just a waste of time right now. Especially when you are a solo player.", "timestamp_created": 1630112988, "timestamp_updated": 1630113272, "voted_up": false, "votes_up": 107, "votes_funny": 30, "weighted_vote_score": "0.820352554321289063", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "88063722": {"recommendationid": "88063722", "author": {"steamid": "76561199070169386", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 54, "playtime_last_two_weeks": 0, "playtime_at_review": 54, "last_played": 1615106771}, "language": "english", "review": "if your an Aussie/new Zealander that wants to play this game, i don't recommend getting this game because the au server are dead and if you want to come across players and get into pvp your going to have to play american servers where you rubber band like crazy", "timestamp_created": 1615186492, "timestamp_updated": 1615186492, "voted_up": false, "votes_up": 170, "votes_funny": 18, "weighted_vote_score": "0.819841206073760986", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "72376216": {"recommendationid": "72376216", "author": {"steamid": "76561198038538371", "num_games_owned": 107, "num_reviews": 1, "playtime_forever": 12343, "playtime_last_two_weeks": 0, "playtime_at_review": 971, "last_played": 1688681526}, "language": "english", "review": "---{Graphics}---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ Paint.exe\n\n---{Gameplay}---\n☐ Very good\n☑ Good\n☐ It‘s just gameplay\n☐ Mehh\n☐ Starring at walls is better\n☐ Just don‘t\n\n---{Audio}---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ Earrape\n\n---{Audience}---\n☐ Kids\n☐ Teens\n☐ Adults\n☑ Human\n☐ Lizards\n\n---{PC Requirements}---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boiiiiii\n☐ Ask NASA if they have a spare computer\n\n---{Difficulity}---\n☐ Just press ‚A‘\n☐ Easy\n☐ Significant brain usage\n☑ Easy to learn / Hard to master\n☐ Difficult\n☐ Dark Souls\n\n---{Grind}---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isnt necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You‘ll need a second live for grinding\n\n---{Story}---\n☑ Story?\n☐ Text or Audio floating around\n☐ Average\n☐ Good\n☐ Lovely\n☐ It‘ll replace your life\n\n---{Game Time}---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{Price}---\n☐ It’s free!\n☐ Worth the price\n☑ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{Bugs}---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs", "timestamp_created": 1594312944, "timestamp_updated": 1594312944, "voted_up": true, "votes_up": 201, "votes_funny": 42, "weighted_vote_score": "0.815107285976409912", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "128660479": {"recommendationid": "128660479", "author": {"steamid": "76561198002627157", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 96111, "playtime_last_two_weeks": 2631, "playtime_at_review": 60054, "last_played": 1713713496}, "language": "english", "review": "What I like about this game is it gets a move on. No 2 to 3 hrs trying to find a pistol like other games. Has great potential as well.", "timestamp_created": 1671195488, "timestamp_updated": 1671195488, "voted_up": true, "votes_up": 61, "votes_funny": 4, "weighted_vote_score": "0.814710795879364014", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "67343178": {"recommendationid": "67343178", "author": {"steamid": "76561198065092727", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 727, "playtime_last_two_weeks": 0, "playtime_at_review": 243, "last_played": 1587215550}, "language": "english", "review": "My honest to god review of Deadside (Extremely critical)\n\nFirst and foremost I have to say, it's a lot of fun... But it does have it's downside, this reviews gonna be mostly positive and I want to help anyone here thinking of making the purchase decide whether it's right for them.\n\n- The first thing I LOVE is the Npc's in the game! Other games like SCUM are rather boring if the player base is low, NPC's give us a chance to get loot, items & weapons... Whilst giving us something to do when no players can be found (they could be offline, base building or just simply camping)\n**The npc's are rather terrible right now, with aimbot like aim (i haven't been killed by many but sometimes they do one tap from no where) Their movement is super average too and their \"intellegence\" isn't very intellegent.\n\n- MISSIONS: this is an absolute god send! So much fun to do, and the fact there is in-game events like Helicopter crashes & loot crates makes it so dynamic and a ton of fun to get around (the heli's and loot crates arent in game yet i dont think)\nMissions are what we've been looking for!!\n\n- The vendors makes an in-game currency so the grind now has a \"point\" - Rather than useless gear stashing, we now can get gear, loot players & take risks because the pay off could be BIG.\nThen the ability to buy other weapons is amazing.\n\nNow for the BAD. (My comments are taking in account for the fact it's EARLY game, my BIGGEST worry is these issues won't ever be fixed or be a priority because they have \"other focuses\")\n\n- AIMING is fucking horrible, clunky & really feels like im playing a playstation 2 game, it's 2020, the animations are poor. It's really bad and I REALLY hope they improve this.\n\n- Textures, no matter which way you swing it, the textures and graphics are very poor, SCUM is a competitor who TAKES THE CAKE. Creating stunning worlds, amazing textures & immersive graphics, this to me is VERY similar to DayZ which is OLD AF.\n\n- MOVEMENT: This is absolutely horrible, glitching everywhere on the screen, hitting random hit boxes through doorways, bouncing around houses & climbing stuff? Forget it. \n\n- EMPTY world: The locations are basically CABINS. Not any cities and when there is it's almost completely unaccessible, not being able to enter 90% of the buildings. And when there is a \"city\" it's absolutely poor designed, terrible layout & overall shite.\n\n- Running is too fast or something, players can sprint 100% sprint up a 90% incline hill and it's just a weird feeling.\n\n- AUDIO: As DrDisrespect would say \"WHERE IS THE AUDIO!?!?!?!?\" The amount of times ALREADY I've had some dude sprint behind me and shoot me and I heard NOTHING and if I heard something It did not sound like it was behind me.\n\n- The world: Again, it feels empty and very small amounts of \"towns\", you can run through open forests for a long ass time without seeing anything.\n\n- **Important** LOOT: Any PvP survival is RUINED in my opinion by lack of decent guns in the game, finding scopes/red dots etc, should be FAR easier to find as buying them from a VENDOR is a ridiculous price.\n\nOVERALL:\nThis game reminds me of a 2020 version of Arma 3 Exile or Wasteland... I've been enjoying it and I have HIGH hopes but they are silenced by the rememberence of most other games that promised big things and NEVER delivered, I'm afraid it'll be one of those games that just paints a pretty picture, delivers an early game & then just never does anything with it.\n\nFor the price $20 USD $28 AUD is NOTHING for a game & it's really worth giving it a go & finding out if you like it as honestly I've had a ton of fun on this already, lots of PvP and the missions add such a great element to it.\n\nI have high hopes and this game has buckets of potential, if you're willing to take a risk, jump right in, if not, sit it out & wait it out :)\n\nTheWizard, if you see me in game, say hi :)", "timestamp_created": 1586929128, "timestamp_updated": 1586929128, "voted_up": true, "votes_up": 124, "votes_funny": 8, "weighted_vote_score": "0.812584996223449707", "comment_count": 13, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "147677091": {"recommendationid": "147677091", "author": {"steamid": "76561198829390234", "num_games_owned": 95, "num_reviews": 3, "playtime_forever": 2162, "playtime_last_two_weeks": 0, "playtime_at_review": 1723, "last_played": 1697674223}, "language": "english", "review": "I'd give this game like 2.83/5 stars (3 seems too high)\n\nPros\nBullets actually matter it only takes a few (best part of the game)\nAi populated areas (kinda dumb kinda aimboty)\nMissions (can be easy-epic)\nNot too hard to obtain Loot once you get over the learning cure and pace\nOnline raids only (slow and steady)\n\nCons\nBe prepared to auto run for hours \"~\"key\nBase building exists but is very underdeveloped and time consuming\nStorage is highly limited \nSpawn locations are far from everything they need a bag system like rust\nOnly cars only a few boats on entire map\n\nOver all.. I play it occasionally just cause I own it already and I like that bullet damage is more realistic than say rust or cod but it's maybe like a $10 game cause your ganna die eventually and get in this loop of endless auto running. I've learned it's best to play this game by simply not giving a shit about Loot and only seeing it as a bonus if your lucky and just hit a few missions then getting off.\n\nI wrote this entire review while auto running to my base across the map cause I needed 6 sheets of scrap metal to build some chests and now I have to commit suicide because I'm dying of thirst and hunger then run back to may base area again grab my Loot and proceed to build. \n\nEndlessly autorunning. \nRecommend if it's on super sale only and you want to shoot more realistic bullets.", "timestamp_created": 1696507638, "timestamp_updated": 1696507638, "voted_up": true, "votes_up": 43, "votes_funny": 5, "weighted_vote_score": "0.811263859272003174", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "75038974": {"recommendationid": "75038974", "author": {"steamid": "76561198107191610", "num_games_owned": 213, "num_reviews": 15, "playtime_forever": 747, "playtime_last_two_weeks": 0, "playtime_at_review": 371, "last_played": 1624687589}, "language": "english", "review": "The game is good, but not enough to justify the price yet. The map is small, content is lacking, and the game has a lot of issues (all to be expected as it is in very early access). \n\nPros\n-The core game play and feel is great\n-Well optimized for early access\n-VOIP is always a good thing\n\nCons (Remember Early Access)\n-Crashes at terrible times\n-Small map (easy for enemies you kill to run back to where you killed them quickly)\n-Hit registration is worse than almost every shooter ive player R6 included.\n-Lacking lots of content (Kill AI and players, sell loot, rinse, and repeat.) Some quests but theyre very repetitive.\n\nOverall this game is on its way to be great, but just know that it isnt worth the price yet. Buying this game as of 8/27/2020 is basically very early testing stages where you donate to get early access. This game has a bright future, but as of now, its boring and buggy.", "timestamp_created": 1598592161, "timestamp_updated": 1598592161, "voted_up": true, "votes_up": 51, "votes_funny": 3, "weighted_vote_score": "0.810831427574157715", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "105468313": {"recommendationid": "105468313", "author": {"steamid": "76561198157512985", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 61543, "playtime_last_two_weeks": 0, "playtime_at_review": 61543, "last_played": 1626232158}, "language": "english", "review": "DO NOT BUY!!! OR IF YOU DID REFUND!!!!\nReasons:\n1. 1026 hours in game and they Ban you because of people with no skills mass reporting you.\n2. Game is dieng slowly, player base is going lower and lower daily. now there is less than 690 players globally in 100 different servers and going down all the time. https://steamcharts.com/app/895400 link for stats.\n3. Updates comes very slowly and usually when there is an update nothing really changes.\n4. In a good day server might be almoust full few hours of the day or mostly in nighttime. (European time) So if you want to play around 8am - 18.00 pm you hardly see any players only bots. \n5. Real cheaters can roam free without fear getting banned, Devs dont do shait about it and when you try to discuss about it in Discord they ban you there for talking about the real problems. \n6. Very toxic players \n7. Racism is cool in this game you can write chat what ever you want without getting penalty, beleive when i say anything.\nN-words flying all the time. \n8. Official servers there is no Admin support anykind and private server Admins usually protecs their little puppets who are clearly using cheats. UNITED GUNNERS Server is good example of this.\n9. If cheater gets banned usually hes back in few hours or maybe it takes 1 day.\n\nFew other reason.\n\n10. FPS drops in high pvp areas even with high end PC\n11. Hit Registery issues.\n12. Running simulator, no cars, no nothing. If you die in wrong place you need to run 10 min back to your body.\n13. alot of glitches, people can still steal your loot in base in small boxes.\n14. you can shoot through walls, if you know how. sometimes even through floors.\n15. Bots are fucked up, you get 1 shot to head even you have full gear (lvl3 helmet and armor). i am not saying they should make them easy but sometimes its impossible to see where bots is and he can see you.\n16. If you want to play this game Solo its not game for you unless you play PVE server. \n17. Constant Gun nerving, People are complaining about getting killed because someone has better weapon. (Grenade launcher and snipers for example.)\n18. Raid token that players drop wont always work. \n19. sometimes you drop raid token almoust every time even the change is like 10-20%\n20. building glitches, if you open door you are stuck and you need to log out and log back in.\n21. Teleport glitch. (You can teleport if you know how).\n22. No Step sound glitch on stairs and bunker.\n23. Raiding is way too easy. \n24. you get hackusate almoust everytime you kill someone.\n25. Nighttime you can change your graphics card settings to make it look like a day so you can easily kill players who think they are safe because of the nighttime.\nAlot of more Problems that will not be fixed never.\n\n\n", "timestamp_created": 1638976801, "timestamp_updated": 1638976801, "voted_up": false, "votes_up": 398, "votes_funny": 71, "weighted_vote_score": "0.810301542282104492", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "67308153": {"recommendationid": "67308153", "author": {"steamid": "76561198036161528", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 2081, "playtime_last_two_weeks": 0, "playtime_at_review": 317, "last_played": 1711770391}, "language": "english", "review": "About 5 hours in as I write this review. All the negative comments/reviews seem to be due to people not reading before they buy the game. The description clearly states what is currently available in the game and that it's a BASE GAME at the moment. It's between pre-alpha & alpha stages. There's a reason it's listed as Early Access.\n\nWith that being said, because I read what I was buying before clicking the buy button, I'm loving it so far. The graphics are smooth as butter on my PC, no lag spikes or horrible stuttering .. and for a game in the $30 range if you get the Supporter Pack, I'm definitely happy with the purchase.\n\nIt gives you the survival aspect of needing to approach areas slowly and cautiously, otherwise you make too much noise and alert any players/NPC's in the area and give them plenty of time to spot you and blow your head off. Looting at the moment does feel a bit clunky, but I can see this ironing out over time as they continue working on it.\n\nI'm excited to see what the game is going to have in store over the next 12-18 months that the devs estimate will be the ETA for the full release. If things continue to go the way I hope they do, it has the potential to hit the survival genre in a unique way!\n\n\nThings I'd love to see added in future updates:\n\n- Animals: The ability to hunt/fish, open areas are vast in this game and I would love to see wildlife roaming around to make it feel alive.\n\n- Secluded cabins/campsites/POI's: Being able to explore the wilderness and happen upon an abandoned hunting camp or a  cabin out in a wooded area would be a lot of fun and give players a reason to go out and explore every inch of the map.\n\n- More loot locations: I noticed that loot seems to be pretty static in it's spawning locations. I enter a building and know exactly where to look. Giving the loot spawning a more random spawning pattern would be ideal.\n\n- The ability to adjust brightness/gamma/contrast: I feel like the game looked a bit washed out at times (depending on the time of day as well). I love bright and vibrant worlds and would love to adjust that in-game.\n\n- Improved audio: When approaching a new town/building I always approach slowly and listen for the sounds of footsteps or branches rustling in the distance to help me just who/how many enemies are close by.\n\nI'll likely update this review as I put more hours in, but I can see incredible potential with this game and hope that updates are pushed through on a fairly quick and regular schedule.", "timestamp_created": 1586883276, "timestamp_updated": 1586883389, "voted_up": true, "votes_up": 126, "votes_funny": 9, "weighted_vote_score": "0.809934496879577637", "comment_count": 17, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "116487927": {"recommendationid": "116487927", "author": {"steamid": "76561198197879206", "num_games_owned": 178, "num_reviews": 10, "playtime_forever": 687, "playtime_last_two_weeks": 0, "playtime_at_review": 634, "last_played": 1667418500}, "language": "english", "review": "The game is in early access still even though its been out nearly 2 years and has recieved almost 20 million in funding. The game lacks content theres not much to do after about three hours of playing the missions are boring and theres no need to build a base in the game because of the safe zones however if you choose to do so it will take you hours to build a small base barely big enough for three players. Majority of the game is running for 10 minutes finding some ai killing them scavenging their clothes and selling them and then repeat. Also the ai are like aimbots and will shoot you from over 100 meters away even in the pitch black night. Theres no vehicles to move across the massive map and the only form of transportation is to travel between the two safe zones which costs a ridiculous amount of grinding. Overall the game isnt worth buying as you will run out of things to do after a few hours and the dev team seems to be taking a long time to push any content out which is one of the reasons the game dies and barely comes back when content comes out. Plus most updates are small and meaningless I regret spending 20 dollars on this game it should be 15 at most theres not enough content to justify the price as well as the lack of polish on existing content.", "timestamp_created": 1654371223, "timestamp_updated": 1654371223, "voted_up": false, "votes_up": 150, "votes_funny": 16, "weighted_vote_score": "0.807552874088287354", "comment_count": 14, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "72751522": {"recommendationid": "72751522", "author": {"steamid": "76561198040595047", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 4386, "playtime_last_two_weeks": 0, "playtime_at_review": 4157, "last_played": 1600886795}, "language": "english", "review": "Date 15th of July 2020 / 69h in the game / status: I stopped playing atm because of motivation (lack of content).\n\nGameplay is fun, you can die fast when not checking every other moment who is around (surprize it´s a pvp shooter -.-).\nAI is also fast and hard, they are dangerous! In general very few bullets take down an enemy, there is no forced weapon spread or unrealistic health/armor. If you can aim you can kill.\nThe gameplay is very close to the Arma-DayZ Mod and its follow-ups back in the days but runs smooth and bug free!\n\nIf you die all is gone if you can´t reach your corpse in time, but you can regear in 15 min to decent gear level. Even with easy to get starter equipment (shotgun) you can take down every enemy from close range with ease if you can approach unseen or rush them.\nIf you aren´t addicted to gear the recovery after a defeat is not that apocalyptic like in DayZ for example.\nThe survival aspect of the game is thin, eat & drink once in a while that´s it.\n\nAt the moment there is only normal open world PVP and PVE mission-running which is challenging but also always the same. Each mission is shown on the map for everyone and is a magnet for PVP. You rush in and kill all bots to spawn a big loot box which can be accessed by everyone around. Only the highest mission difficulty is worthwhile i never found good loot in lvl1 or lvl2 mission crates (Yes there is money and guns but you can gather money faster and way less difficult  by looting army bases or camps).   \n\nAs i wrote upfront i stopped playing for the moment due to a lack of content. Mission running is adrenaline enough to have fun now and then but not as the only source of activity. I will check in at least after each update out of curiosity and in hope to see the content grow. \n\nSome more ideas:\n\n- Mosin-K, why it is in the game when there is a full barrel Mosin? Replace one with a semi-auto SKS.\n- Make a seperate holster for the knife, no need to conflict with handgun slot.\n- Sights for handguns please (red-dot and/or holo, nothing fancy)\n- When there are 6xzoom sights in game we also need smoke grenades for counter\n- Let me airdrop from a chopper by parachute out of safezonebase for money!\n- Ghilliesuits or ghillie camo for helmets, guns, backpacks make my stack of rags and ropes useful! \n- Respawn for self build bases needed\n- Let me dig an underground base, there is not enough remote area to hide a above ground base AND have a worthwhile base location\n- Add the neutral bots/civilians as told in the game description\n- More diversity for random patrols (insane scavenger with a fireax, sniper team, starving civilians, ambushes, conflicts between civilians and looters, hungry wild dogs\n- Post-Apocalypse feeling isn´t there, the ambiente is to beautiful.\n- All buildings need interior and should be accessable\n- Base building is basically good, let me have more use and options for it  (lights, bed for health recovery, camo nets, more options for sandbags, a weapon rack which can be upgraded by dropping weapons to unlock a better starting gear(?))\n- Hidden stashes wich can be found by stumbling on treasure maps found in dead bodys\n- Guards at the outer perimeter of the safezones to cover entering and leaving players from campers which sit right outside the safezone. Who shoots first will be attacked by the guard.\n- Repair grenades, one of them is just a firecracker\n- Silencers, at least for the handguns\n- Bots need more random loot, they never drop bandages.\n- Cars should spawn bandages as well\n- Let me sell to other players by the locker, i would like to put some things on sale which aren´t available at the nps shops.\n\n", "timestamp_created": 1594845451, "timestamp_updated": 1594845451, "voted_up": true, "votes_up": 41, "votes_funny": 3, "weighted_vote_score": "0.805925548076629639", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "67595984": {"recommendationid": "67595984", "author": {"steamid": "76561198079700983", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 436, "playtime_last_two_weeks": 0, "playtime_at_review": 436, "last_played": 1587258125}, "language": "english", "review": "until cheaters are taken care of sadly this game is not playable. has potential, but needs this addressed first.", "timestamp_created": 1587259232, "timestamp_updated": 1587259232, "voted_up": false, "votes_up": 247, "votes_funny": 28, "weighted_vote_score": "0.805215537548065186", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "89168288": {"recommendationid": "89168288", "author": {"steamid": "76561198164651559", "num_games_owned": 116, "num_reviews": 11, "playtime_forever": 4058, "playtime_last_two_weeks": 0, "playtime_at_review": 682, "last_played": 1708390120}, "language": "english", "review": "As a long time DayZ player, this game really offers everything that a lot of people designed mods to attain.  It doesn't waste time with tertiary items like can openers or rifle magazines.  Instead, if you have the food, you can eat it; if you have the ammo, you can reload.  Meanwhile it still has functional bases, safe zones, traders, and random events.  The NPC scavs are integrated so seamlessly that at first I confused them for players.  Well worth the buy.", "timestamp_created": 1616833227, "timestamp_updated": 1616833227, "voted_up": true, "votes_up": 44, "votes_funny": 0, "weighted_vote_score": "0.804328501224517822", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "87786982": {"recommendationid": "87786982", "author": {"steamid": "76561198151387611", "num_games_owned": 207, "num_reviews": 3, "playtime_forever": 10205, "playtime_last_two_weeks": 0, "playtime_at_review": 649, "last_played": 1690727067}, "language": "english", "review": "Walking simulator 2021", "timestamp_created": 1614784962, "timestamp_updated": 1614784962, "voted_up": true, "votes_up": 82, "votes_funny": 44, "weighted_vote_score": "0.803132593631744385", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "68594581": {"recommendationid": "68594581", "author": {"steamid": "76561198097435721", "num_games_owned": 0, "num_reviews": 34, "playtime_forever": 1067, "playtime_last_two_weeks": 0, "playtime_at_review": 638, "last_played": 1618605968}, "language": "english", "review": "[h1] A Great Start For An Alpha [/h1]\n\nLet me be clear, this game is in alpha at the time I am writing this and I'm positive that the developers will fix many of the bugs stated as well as add many quality of life features.\n\n[u] My Personal Thoughts [/u]\n\nSomething that I immediately noticed when I first hopped into a server was how reminiscent this game is to Escape From Tarkov, another Russian-based game held in a fictional location and time period in which civilization has somewhat or totally collapsed. Many items from the backpack to the armor, the military barracks, many aspects have that Tarkov vibe. This makes sense since both games are being inspired or based off Russia. Another thing I noted was the Day Z vibe. The long stretches of nature with small, distantly-placed towns all create that atmosphere. Needless to say, the state of Day Z in its early access pales in comparison to this game--more on that later. The alpha state of the game shows great promise and developers who seem passionate about their work. Let's begin with some positives!\n\n[u] The Positives [/u]\n\nLet's begin with map design. Having an expansive map to explore can provide many players tons of enjoyment in their conquest for territory and/or their wayward spirits. However, a large map can begin to bring ailments to the game as well. Let us not forget the countless 30-seconds-to-explore caves Skyrim has through its massive world. The saying \"As big as an ocean but as deep as a puddle\" holds a lot of weight in open-world games. This game doesn't suffer from this greatly since it has many activities to do. My worry is that once they expand the map's boundaries, the game will succumb to this illness and be a walking simulator. Vehicles are hinted at since spark plugs can be found in game which means cars will most likely need it in order to run. This would help with the fear of a walking simulator but would not remedy it completely. As it stands right now, there is fairly enough content within the map to keep players motivated to keep conquering land and exploring while fending off the AI bandits and other players, for now.\n\nI'd like to address the activities the game provides next. With varying difficulties, missions are what drives the players in a server to converge on a place and come out of their hidey-holes and start getting loot. This, in conjunction with the ever-used airdrops and crash sites, offer enough reason for a player, or group, to risk their lives for gear and money. \n\nA survival game wouldn't be very survivaly without proper weapons to defend yourself, and this game provides a good amount of weapons, for an alpha, to players to tinker around with before finally settling on their preferred weapon. The gun-play seems alright and is nothing special, in my opinion. Bullets don't appear to have ballistics and disappear, [i] a la instance destroy [/i], which makes snipers feel odd but not totally useless. \n\nSafe Zones, and Traders, and Lockers, oh my! It is nice to have an area to breathe in where you can exchange your hard-earned loot for some cash. While the trader's HUD is simplistic, it isn't needlessly complex with countless sub-menus to confuse players. I also like the idea of reputation being a  separate currency obtained from dog tags (Tarkov, anyone?) which serves as a way to spawn somewhere you choose when you inevitably die.\n\nAnimation is pretty good and feels natural. I really do feel like my character is sluggishly thumpping on the ground when I'm wearing 100lbs of armor and weapons, topped with 40 cans of that sweet, sweet tomato soup from Campbe-, well whatever funny name they will come up with.\n\nOnto some negatives\n\n[u] The Negatives [/u]\n\nAudio. My god the audio. If you aren't crapping yourself to the sound of a woodpecker reminding you of Vietnam flashbacks, you are crapping yourself when yourself when a flurry of invisible birds just flap away at a moments notice. Right away, I noticed the lack of bass in the audio. None of the guns have a beefy sound which makes them sound very distant when shot in hand or up close. I've used the VSD a lot and, my gosh, when I fire it, it sounds like someone firing it 100 meters away. Even when someone shoots it 100 meters away, it sounds the exact same except slightly quieter. Not all guns are like this, namely the pistols. All of them sound fair in what caliber they are. But how is a 5.56x45 quieter than a 7.62x54r round? Unless they are subsonic rounds, that shouldn't be. I'm confident in saying that ALL of the pistols sound louder than the VSD. Audio is a heavy aspect that players rely on to pinpoint an enemies position. Without good audio, a player won't get the feeling that the gun they are using, like a sniper, can be heard miles away versus, say, a pistol. I really hope that in future updates that weapons will get two or maybe three kinds of audio: one loud audio when up close or in hands, another when heard from a distance or when coming inside a building, and another echoing throughout a large area when heard from afar.\n\nAnother issue I have is the food and soda (there is no water) in game. It isn't really clear which food is better apart from their price as their is no way for the player to know which food replenishes what. Not something game breaking but something that requires some tuning.\n\nAmmo is something else I'd like to discuss. Ammo should have different stacking caps depending on the caliber since all ammo stacks to 100. Carrying 100 rounds of 7.62x54R is a hell of a lot different than carrying 100 rounds of 7.62x25. They weigh different, they take up different amounts of space and should be adjusted to such. It doesn't have to be drastic (like in Unturned, another survival game) where the player is cumbered by rounds for only two mags, but it should be something the player has to decide which weapon is better: the one that does more damage but can only stack 40 rounds, or the gun that does less damage but can have 100 rounds.\n\nBugs. The plague that every game ever created has endured (I'm looking at you Fallout 76). This game doesn't have a lot of bugs despite being in alpha, there is a commendable amount of polish in this game that [i] some [/i] AAA studios don't do in a full-released game. However, a MAJOR bug does exist. There is some duplication glitch that allows players to duplicate items which ruins the progression system of the game. I've unintentionally duplicated my items when my teammate killed me and I killed him by swinging an axe at him while chopping a tree (don't ask how I did nor ask why I went to the same tree). I'm sure this will be fixed soon since this is a glaring bug which threatens the game's progression system.\n\nBuilding a base is fun with friends, but it is not fun when only one player in a group can build in their own claimed area and HAS to be on in order for other teammates to open doors and such. A small bug but a big inconvenience. \n\nThere are probably a lot more bugs and issues that I've experienced but hasn't come to mind in the time of writing this.\n\n[u] A Conclusion to a Word Wall [/u]\n\nOverall, I have high hopes for this game due to how fleshed out its early access is. While there are negative aspects that I mentioned above, I wouldn't consider it a deterring factor. Playing with friends is really fun and getting into the heat of combat makes for a thrilling experience. Here is to a promising survival game!", "timestamp_created": 1588656521, "timestamp_updated": 1588656521, "voted_up": true, "votes_up": 56, "votes_funny": 7, "weighted_vote_score": "0.80190509557723999", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "91598771": {"recommendationid": "91598771", "author": {"steamid": "76561198136456441", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 10015, "playtime_last_two_weeks": 273, "playtime_at_review": 4809, "last_played": 1713674071}, "language": "english", "review": "Awesome game, the Dev's really need to make a road map as to where the game is going, and get this next update out and ready. They are losing a lot of people due to lack of content.", "timestamp_created": 1620409300, "timestamp_updated": 1620409300, "voted_up": true, "votes_up": 40, "votes_funny": 1, "weighted_vote_score": "0.801671445369720459", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "79439462": {"recommendationid": "79439462", "author": {"steamid": "76561198149473551", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 4534, "playtime_last_two_weeks": 0, "playtime_at_review": 4316, "last_played": 1622957820}, "language": "english", "review": "I have taken some proper time to play this game and put some hours in. i have been playing since the day it came out so i feel i can make an honest judgment of the game. With that said here is my review. \n\nThe game itself fundamentally works pretty well. Spawn. Get loot. Grind for higher loot. Sell and repeat. While the game idea works good i think there could be more of an improvement made to the tier tables and how high tier loot is obtained and used. Once you are at the top of the food chain there isnt anything to do but go to the military bases back and forth to make money. The game runs pretty good but can get laggy sometimes with large bases and player counts at their max. The looting system could use some work in optomization and making looting more seamless. Bots seem to be in a good spot where you dont know if it is a player or not and i do like that element .Over all it is a good game for 20$ and i will continue to play it with upcoming updates. \n\nHOWEVER the developers are only a 3 man team! producing content will be slow and the flow of new things to do will be stagnant for a little bit, but i understand that. The game does have its bugs but they are being worked out with every update. Hiring more staff as the game develops will help with this but for the time being with only 3 developers it is very understandable and with what they have done i am impressed. with that said here are somethings i would like to see going forward.\n\nThings i would like to see going forward are:\nmeans of transportation besides walking\nmore incentive for high loot players to keep playing\na player to player market\nmore overlapping content like having to find a card in rust to go to oil things like that\nand finally a bigger map. getting bored of doing the same thing over and over.", "timestamp_created": 1605662208, "timestamp_updated": 1605662208, "voted_up": true, "votes_up": 38, "votes_funny": 2, "weighted_vote_score": "0.801536023616790771", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "67697289": {"recommendationid": "67697289", "author": {"steamid": "76561198257268991", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 1912, "playtime_last_two_weeks": 0, "playtime_at_review": 317, "last_played": 1700684136}, "language": "english", "review": "You like dayz? Tarkov? H1Z1 (When it first came out)? Then you'll love this game. People are as toxic on CSGO, the gun mechanics are fun, you do not have to search for magazines, yes there is a lot of loot.So that means guns are easy to find. Even tho you spawn with just a knife, you have a high chance of killing someone within 2 slices. There are tons of people accusing other people of hacking but I have yet to come across one. There are safe zones you can run to and sell stuff to traders. There are Scavs(AI) like in Tarkov that patrol in groups and are always spawning so the game never feels empty. The towns are small but I really don't mind it. The map may seem bare when you pull it up but there are towns and bases not shown on the map. The map is only 25km total, so where ever you spawn, you will not have to run for 15 mins to just die again and run even longer the next time, like DayZ. You will have to find food and drinks because it is survival based. You can also build bases which I have not tried yet but I am saving the materials. The only down side I think, is that the north dealers and the south dealers do not combine your inventory to one universal stash. There is also a kill feed and global talk which is always fun. I recommend it. The game is new so there will be updates. I believe this is going in the right direction.\n\ntl:dr\nI recommend it!!!!", "timestamp_created": 1587401789, "timestamp_updated": 1587401789, "voted_up": true, "votes_up": 116, "votes_funny": 12, "weighted_vote_score": "0.801527321338653564", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "93476606": {"recommendationid": "93476606", "author": {"steamid": "76561199100397330", "num_games_owned": 42, "num_reviews": 1, "playtime_forever": 1218, "playtime_last_two_weeks": 0, "playtime_at_review": 786, "last_played": 1656389214}, "language": "english", "review": "10/10 great game should definitely be on drugs though", "timestamp_created": 1623264916, "timestamp_updated": 1623264916, "voted_up": true, "votes_up": 92, "votes_funny": 35, "weighted_vote_score": "0.801278054714202881", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "120636982": {"recommendationid": "120636982", "author": {"steamid": "76561198081615117", "num_games_owned": 233, "num_reviews": 39, "playtime_forever": 15014, "playtime_last_two_weeks": 0, "playtime_at_review": 7712, "last_played": 1701711131}, "language": "english", "review": "--{Graphics}---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ Paint.exe\n\n---{Game-play}---\n☐ Very good\n☑ Good\n☐ It‘s just game-play\n☐ Mehh\n☐ Starring at walls is better\n☐ Just don‘t\n\n---{Audio}---\n☑ Eargasm\n☐ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ Earrape\n\n---{Audience}---\n☐ Kids\n☑ Teens\n☐ Adults\n☐ Human\n☐ Lizards\n\n---{PC Requirements}---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boiiiiii\n☐ Ask NASA if they have a spare computer\n\n---{Difficulty}---\n☐ Just press ‚A‘\n☐ Easy\n☑ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{Grind}---\n☐ Nothing to grind\n☐ Only if u care about leader-boards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You‘ll need a second live for grinding\n\n---{Story}---\n☑ Story?\n☐ Text or Audio floating around\n☐ Average\n☐ Good\n☐ Lovely\n☐ It‘ll replace your life\n\n---{Game Time}---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{Price}---\n☐ It’s free!\n☑Worth the price\n☐ If u have some spare money left\n☐ Wait for a sale or something\n☐ Not recommended\n☐ You could also just burn your money\n\n---{Bugs}---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bug\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10", "timestamp_created": 1660509779, "timestamp_updated": 1669145065, "voted_up": true, "votes_up": 75, "votes_funny": 10, "weighted_vote_score": "0.800345659255981445", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "139974302": {"recommendationid": "139974302", "author": {"steamid": "76561198061174845", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 4263, "playtime_last_two_weeks": 0, "playtime_at_review": 4263, "last_played": 1686619478}, "language": "english", "review": "Unless you never plan on taking breaks its a great game, but grind for 60 hours just to have your base despawn after a week is a real kick in the nuts. I love this game but I lost 60 hours of grinding(had a giant base with tons of loot) just because i took a little break and played some other games. Please devs change the time it takes bases to despawn, I have a life and a job I can't play it all the time.", "timestamp_created": 1686619915, "timestamp_updated": 1686619915, "voted_up": false, "votes_up": 145, "votes_funny": 17, "weighted_vote_score": "0.799728333950042725", "comment_count": 8, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "73449174": {"recommendationid": "73449174", "author": {"steamid": "76561198144410470", "num_games_owned": 176, "num_reviews": 36, "playtime_forever": 90, "playtime_last_two_weeks": 0, "playtime_at_review": 90, "last_played": 1595918466}, "language": "english", "review": "Getting to the point: It's good. Very good. I wouldn't pay $20 for the amount of content that's in the game currently, but I might come back when it's finished. \n\nClearly a lot of effort is being put into this experience. Well animated, fantastic ambient audio, good gun-play. etc. It's a labor of love, which you can tell from the devlogs and other content the developers release. I recommend supporting this project, and buying the game if you want.", "timestamp_created": 1595999475, "timestamp_updated": 1595999475, "voted_up": true, "votes_up": 44, "votes_funny": 0, "weighted_vote_score": "0.795123875141143799", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "98527276": {"recommendationid": "98527276", "author": {"steamid": "76561198157648216", "num_games_owned": 0, "num_reviews": 24, "playtime_forever": 3398, "playtime_last_two_weeks": 0, "playtime_at_review": 392, "last_played": 1705492723}, "language": "english", "review": "Deadside is, in short, a love-child between Rust, Tarkov, and DayZ. What all of those games fail to do, Deadside does it so incredibly right. It is in beta, but even so it is far more polished than most other games at this stage. I wholeheartedly recommend getting this game for cheap before it becomes a big hit and becomes more expensive. \n\nImagine Escape From Tarkov, but SCAVs are wandering all over the map. Instead of having to go do fetch quests, you can pick up quests just by entering an area. Once those quests are done, you are instantly rewarded with better loot that you can either equip or sell off. The trading system is there and I don't have many qualms about it. \n\nIf you're struggling to get food or water, unlike DayZ, you CAN go to the safe zone to purchase some of those. Think of the safe zone as your \"PMC Hideout\"; you can store items permanently there and you can talk with traders to get weapons, ammo, equipment, food, and more. If you want your own true hideout you can always build one. \n\nIf you aren't into PvP, you can go on PvE servers (in my experience, the people on PvE are really bros). PvE provides enough enemies that you can have some fun on your own. As you go into harder areas or into more difficult quests, the enemies can become more and more overwhelming. I don't think that there is a lack of enemies and I don't foresee a lack of engaging gameplay being a problem.\n\nBecause the game is in BETA, there are some issues. Enemies will spawn on top of you sometimes if you are in a city or town, and because of how large the map is you will start getting shot at before you even see enemies (granted, their aim is terrible at far range). The AI for bandits needs work; most of them charge out toward you and don't take defensive positions. That being said, there have been times where I have been genuinely impressed with the AI. In my first encounter with bandits, my friend and I both believed we had been attacked by players because of their maneuvering. However, there still needs to be a lot of work done to them given that they are at the core of gameplay. \n\nI do wish that there was more early weapon variety, but it is there and it does contribute to a sense of progression. I wish that there were better options for wound treatment such as EFT's medkit system. Finding the resources to make bandages can be a bit of a hassle at times, and I wish that you could create/carry a medkit with multiple uses. I think that something like this will be added in the future. Food and drinks are THERE but I think their spawns might need to be bumped up just a little bit.\n\nThe graphics for the game are actually very nice given the early state of the game. I would love to see some enhancements to the graphics, especially for visual clarity purposes. Some depth of field and changes to lighting would do a lot of favors. The trees in the game are truthfully awful looking but I never felt as though it detracted significantly from gameplay.\n\nOverall, I am more than excited to see where the developers take the game from here!", "timestamp_created": 1630354711, "timestamp_updated": 1630354711, "voted_up": true, "votes_up": 47, "votes_funny": 4, "weighted_vote_score": "0.794887006282806396", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "74891239": {"recommendationid": "74891239", "author": {"steamid": "76561198113493992", "num_games_owned": 0, "num_reviews": 42, "playtime_forever": 3264, "playtime_last_two_weeks": 0, "playtime_at_review": 2196, "last_played": 1658665206}, "language": "english", "review": "add cars/bikes and it would easily be the best survival game", "timestamp_created": 1598365613, "timestamp_updated": 1598365613, "voted_up": true, "votes_up": 68, "votes_funny": 3, "weighted_vote_score": "0.794449687004089355", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "102656906": {"recommendationid": "102656906", "author": {"steamid": "76561199124659776", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 1051, "playtime_last_two_weeks": 0, "playtime_at_review": 660, "last_played": 1698234328}, "language": "english", "review": "I recommend you wait and play this game in maybe 1 year from now Nov 2022. It's just simply too empty and \"dead\" to play Deadside. Hopefully the developers put in some work. \n\nPro's: \nGun Play\nAnimation\nChallenging Bots that flank you\n\nCon's:\nDead World\nRunning Simulator\nWeak Customization (Guns, Character)\nWeak Base Building\nWeak Survival Options\n\n\nLet's be real... after playing this game for a while, I gotta say that Deadside needs a serious increase of CONTENT. There's just simply not enough to do on the game and Deadside just can't compete content wise with other games like DayZ, SCUM, Rust, etc. \n\nWhat's the solution? Honestly... here me out. I think they should forget the DayZ clone and \"Tarkov the Fuck\" out of this game! Make Deadside darker, grittier, increase the bots in areas. Add more zones, some type of extract system, give us more guns and customization options. Add more locations, make a base system or something similar to Tarkov's (a place to store loot). Simply put... make an \"Open World\" Tarkov Game. \n\nIf the developers do that... this game will have a huge market of hungry players logging in all the time. Instead of empty servers or servers with a maximum of 10 players. \n\nSo please developers and rich people who bought the company recently... Tarkov the fuck out of Deadside!", "timestamp_created": 1636733249, "timestamp_updated": 1636733249, "voted_up": true, "votes_up": 90, "votes_funny": 2, "weighted_vote_score": "0.793814241886138916", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "112144597": {"recommendationid": "112144597", "author": {"steamid": "76561198061663106", "num_games_owned": 62, "num_reviews": 12, "playtime_forever": 2160, "playtime_last_two_weeks": 0, "playtime_at_review": 2135, "last_played": 1667784522}, "language": "english", "review": "500 meters one tap by an AI running sideways.", "timestamp_created": 1647215431, "timestamp_updated": 1647215431, "voted_up": false, "votes_up": 90, "votes_funny": 62, "weighted_vote_score": "0.793720424175262451", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "68354965": {"recommendationid": "68354965", "author": {"steamid": "76561198011999693", "num_games_owned": 223, "num_reviews": 35, "playtime_forever": 2806, "playtime_last_two_weeks": 0, "playtime_at_review": 993, "last_played": 1676482121}, "language": "english", "review": "For the DayZ, Escape from tarkov, scum and miscreated fans out there, GET THIS GAME. \n\nIt seriously already runs better than all of the above. The gun mechanics feel amazing, the npc's are pretty challenging at times and the world looks amazing. The devs aren't going to OTT in the survival aspect of the game (There will be no temperature system or diseases). \n\nSo if your after just a basic survival sandbox that keeps the objective nice and simple : Loot up, Kill npc's and players and clear missions. Then this is the game for you. \n\nOnly downside to the game currently is the sound design, Really hard to tell distances on gunshots and you can't seem to hear shots above 300-400m.", "timestamp_created": 1588327807, "timestamp_updated": 1588327807, "voted_up": true, "votes_up": 182, "votes_funny": 31, "weighted_vote_score": "0.791212737560272217", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "156716144": {"recommendationid": "156716144", "author": {"steamid": "76561199369736886", "num_games_owned": 69, "num_reviews": 14, "playtime_forever": 34044, "playtime_last_two_weeks": 744, "playtime_at_review": 27517, "last_played": 1713455954}, "language": "english", "review": "I currently have 450 hours in the game, and will continue to play. I have experience in Rust and Dayz and I can say this game has been my favorite out of all. The simplicity makes this game a better pick for anyone who don't have time to play 24/7. You cannot get raided unless you die to another online player, and even then there is a chance you won't drop a raid token. Once your raid token is popped, any other players in server have 1 hour to gather c4 and raid your base. It takes 1 c4 for any type of build to destroy. (Loot boxes are not lootable for others not assigned to base, only when raid is active of course.) There are many missions scattered around the map varying from easy to epic. There are also loot drops and convoys that give high tier military loot (weapons, attachments, and even better armor). There are also different places around the map that contain locked crates which can be opened with red keys found at heli crashes, dead NPC's clothing, or mission crates. Inside these locked crates are various types of guns with many different possible camos that can only be obtained by opening these crates. Loot obtained from missions, drops, etc. can be stored at any of the two safe zones located north and south of the map (Large green circles). Once loot storage is full, you can sell unwanted things to trader, or you can obtain a hammer, axe, nails, and wood and start building your base! Doors can be locked with code locks, and crates can be made to store loot. (8 crates max as of this update) There are many guides on the game as i cannot explain everything. This game has exceeded my expectations leading me to leave this giant review. I highly recommend giving this game a try as it goes on sale often, even though it is already a fantastic price for what the Devs have givin us!", "timestamp_created": 1706117167, "timestamp_updated": 1706117167, "voted_up": true, "votes_up": 42, "votes_funny": 1, "weighted_vote_score": "0.789507806301116943", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "123683250": {"recommendationid": "123683250", "author": {"steamid": "76561197960860132", "num_games_owned": 385, "num_reviews": 11, "playtime_forever": 733, "playtime_last_two_weeks": 0, "playtime_at_review": 366, "last_played": 1711122893}, "language": "english", "review": "Not been so disappointed in a game mechanic like Deadside for a while.\n\nTo put it simply I was quite enjoying this game until I found out when someone dies or a group dies they can just respawn in the village where they died and just run straight back. Not sure how the devs thought that was a good idea.\n\nIf the thought of another player being able to fight you 2-3 times before you finally stop them coming back annoys you don't play this game. I was trying to solo build a base and its near impossible. You need about 500 nails to build a 2x2 but ontop of that, if a person finds you mid build you may experience what I just had.\n\nYou kill a trio trying to fight you, they all respawn in the village 600m away, loot guns and come back to fight you again. Luckily you kill them all again but then they respawn in the village 700m away. Then unsurprisingly you die in the final wave.\n\nKeep in mind they were able to send 9 bodies to fight me in the span of 10 minutes. I wouldn't touch this game unless they added a mechanic where you aren't able to spawn where you just died.", "timestamp_created": 1665499781, "timestamp_updated": 1665499781, "voted_up": false, "votes_up": 88, "votes_funny": 4, "weighted_vote_score": "0.788310647010803223", "comment_count": 11, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "101747130": {"recommendationid": "101747130", "author": {"steamid": "76561198120683353", "num_games_owned": 92, "num_reviews": 37, "playtime_forever": 2333, "playtime_last_two_weeks": 0, "playtime_at_review": 2150, "last_played": 1666715350}, "language": "english", "review": "Average DayZ enjoyer:\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡠⠔⠒⠒⠒⠒⠒⠢⠤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⡰⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠑⢄⡀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⡸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠙⠄⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⢀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠃⠀⢠⠂⠀⠀⠘⡄⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⠈⢤⡀⢂⠀⢨⠀⢀⡠⠈⢣⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⢀⢀⡖⠒⠶⠤⠭⢽⣟⣗⠲⠖⠺⣖⣴⣆⡤⠤⠤⠼⡄⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠘⡈⠃⠀⠀⠀⠘⣺⡟⢻⠻⡆⠀⡏⠀⡸⣿⢿⢞⠄⡇⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⢣⡀⠤⡀⡀⡔⠉⣏⡿⠛⠓⠊⠁⠀⢎⠛⡗⡗⢳⡏⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⢱⠀⠨⡇⠃⠀⢻⠁⡔⢡⠒⢀⠀⠀⡅⢹⣿⢨⠇⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⢸⠀⠠⢼⠀⠀⡎⡜⠒⢀⠭⡖⡤⢭⣱⢸⢙⠆⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⡸⠀⠀⠸⢁⡀⠿⠈⠂⣿⣿⣿⣿⣿⡏⡍⡏⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⢀⠇⠀⠀⠀⠀⠸⢢⣫⢀⠘⣿⣿⡿⠏⣼⡏⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⣀⣠⠊⠀⣀⠎⠁⠀⠀⠀⠙⠳⢴⡦⡴⢶⣞⣁⣀⣀⡀⠀⠀⠀⠀⠀\n⠀⠐⠒⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⠀⢀⠤⠀⠀⠀⠀⠀⠀⠀⠈⠉⠀⠀⠀⠀\n\n\nAverage Deadside enjoyer:\n\n⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠛⠛⠛⠋⠉⠈⠉⠉⠉⠉⠛⠻⢿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⡿⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⢿⣿⣿⣿⣿\n⣿⣿⣿⣿⡏⣀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣤⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠙⢿⣿⣿\n⣿⣿⣿⢏⣴⣿⣷⠀⠀⠀⠀⠀⢾⣿⣿⣿⣿⣿⣿⡆⠀⠀⠀⠀⠀⠀⠀⠈⣿⣿\n⣿⣿⣟⣾⣿⡟⠁⠀⠀⠀⠀⠀⢀⣾⣿⣿⣿⣿⣿⣷⢢⠀⠀⠀⠀⠀⠀⠀⢸⣿\n⣿⣿⣿⣿⣟⠀⡴⠄⠀⠀⠀⠀⠀⠀⠙⠻⣿⣿⣿⣿⣷⣄⠀⠀⠀⠀⠀⠀⠀⣿\n⣿⣿⣿⠟⠻⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠶⢴⣿⣿⣿⣿⣿⣧⠀⠀⠀⠀⠀⠀⣿\n⣿⣁⡀⠀⠀⢰⢠⣦⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⣿⣿⣿⣿⣿⡄⠀⣴⣶⣿⡄⣿\n⣿⡋⠀⠀⠀⠎⢸⣿⡆⠀⠀⠀⠀⠀⠀⣴⣿⣿⣿⣿⣿⣿⣿⠗⢘⣿⣟⠛⠿⣼\n⣿⣿⠋⢀⡌⢰⣿⡿⢿⡀⠀⠀⠀⠀⠀⠙⠿⣿⣿⣿⣿⣿⡇⠀⢸⣿⣿⣧⢀⣼\n⣿⣿⣷⢻⠄⠘⠛⠋⠛⠃⠀⠀⠀⠀⠀⢿⣧⠈⠉⠙⠛⠋⠀⠀⠀⣿⣿⣿⣿⣿\n⣿⣿⣧⠀⠈⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠟⠀⠀⠀⠀⢀⢃⠀⠀⢸⣿⣿⣿⣿\n⣿⣿⡿⠀⠴⢗⣠⣤⣴⡶⠶⠖⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⡸⠀⣿⣿⣿⣿\n⣿⣿⣿⡀⢠⣾⣿⠏⠀⠠⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠛⠉⠀⣿⣿⣿⣿\n⣿⣿⣿⣧⠈⢹⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⣿\n⣿⣿⣿⣿⡄⠈⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣴⣾⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣧⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⣦⣄⣀⣀⣀⣀⠀⠀⠀⠀⠘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡄⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⠀⠀⠀⠙⣿⣿⡟⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⠀⠁⠀⠀⠹⣿⠃⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⡿⠛⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⢐⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⠿⠛⠉⠉⠁⠀⢻⣿⡇⠀⠀⠀⠀⠀⠀⢀⠈⣿⣿⡿⠉⠛⠛⠛⠉⠉\n⣿⡿⠋⠁⠀⠀⢀⣀⣠⡴⣸⣿⣇⡄⠀⠀⠀⠀⢀⡿⠄⠙⠛⠀⣀⣠⣤⣤⠄", "timestamp_created": 1635412182, "timestamp_updated": 1635412182, "voted_up": true, "votes_up": 149, "votes_funny": 86, "weighted_vote_score": "0.786665678024291992", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "80446819": {"recommendationid": "80446819", "author": {"steamid": "76561198017816478", "num_games_owned": 798, "num_reviews": 5, "playtime_forever": 49516, "playtime_last_two_weeks": 0, "playtime_at_review": 22969, "last_played": 1709112055}, "language": "english", "review": "This game has just the right touch of PvPvE. No zombies or mutants just scavs and players. The atmosphere is very immersive and can get very intense during the night cycle. The use of flashlights is risky but necessary sometimes. Building a structure is very much a grind, but worth the impressive end result. Running long distances is somewhat time consuming but worth it to get to loot and missions with a possible encounter with a scav patrol or even a group of players. The controls can be a bit clunky at times but nothing you can't get used to. Overall I feel that this is a solid game for what it is and it continues to improve.", "timestamp_created": 1606423022, "timestamp_updated": 1606423022, "voted_up": true, "votes_up": 39, "votes_funny": 0, "weighted_vote_score": "0.784201979637145996", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "67297213": {"recommendationid": "67297213", "author": {"steamid": "76561198164830109", "num_games_owned": 199, "num_reviews": 24, "playtime_forever": 2886, "playtime_last_two_weeks": 51, "playtime_at_review": 93, "last_played": 1712720338}, "language": "english", "review": "Ive put around 800 hours on miscreated, and was looking forward to this game. After only playing for an hour I've had some pretty great interactions and a couple squad wipes. This game has a ton of potential, I hope they work on it lots and update if frequently. GREAT START TO THE GAME.", "timestamp_created": 1586872883, "timestamp_updated": 1586872883, "voted_up": true, "votes_up": 90, "votes_funny": 9, "weighted_vote_score": "0.780623257160186768", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "67711602": {"recommendationid": "67711602", "author": {"steamid": "76561198043084724", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 3889, "playtime_last_two_weeks": 0, "playtime_at_review": 210, "last_played": 1624778850}, "language": "english", "review": "This is like DayZ and Tarkov had a super gay baby and i am totally about it", "timestamp_created": 1587420355, "timestamp_updated": 1587420355, "voted_up": true, "votes_up": 135, "votes_funny": 193, "weighted_vote_score": "0.77538001537322998", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "91234037": {"recommendationid": "91234037", "author": {"steamid": "76561197965043359", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 4627, "playtime_last_two_weeks": 0, "playtime_at_review": 3450, "last_played": 1651940998}, "language": "english", "review": "good running simulator.", "timestamp_created": 1619882151, "timestamp_updated": 1700612006, "voted_up": true, "votes_up": 48, "votes_funny": 41, "weighted_vote_score": "0.772833406925201416", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "110330162": {"recommendationid": "110330162", "author": {"steamid": "76561199019246878", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 11373, "playtime_last_two_weeks": 0, "playtime_at_review": 10052, "last_played": 1676433467}, "language": "english", "review": "I have had deadside since just after release and not much has changed. \nTheres a running joke among the very small player base that they should rename it to cross country running simulator 2020 because really theres only 5 hours of content but you spend 3 of that running across an empty map as there a no vehicles or transport. \nThe raiding mechanic sucks, building is clunky.\nThey have put in some work over time but only some, most of which has been spent fixing bugs that made it nearly unplayable early (weird aim jitters, bad hit reg, bad AI), all that has taken 2 years though which speaks to a larger problem in the industry. Dont support kickstarter style game development, youre doing a lot of their work for free.\nI dont recommend the game in the state its in unless youre a early access type of person, if your time is valuable wait until it is released full version before looking again.\nThey had a discord that they removed all the channels and have read only, theres not really anyway to interact with the community unless they have a reddit or something, and just today decided to make emojis instead of work on the things that matter. \nThe as i said small player base are also nearly the most unfriendly group of gamers i have come across (2k hrs in rust) so if you dont have friends to play with the harder missions are just too populated to do smoothly and a lot of time is spent trying to recover your body. They did just \"fix\" they spawn mechanic which reduces the longest runs but still CCRS2020.\nIt looks and plays really well (2080s) and should be a good game in the future if they can pull it all together. \nill come back in 6 months and add an update.\n", "timestamp_created": 1644973490, "timestamp_updated": 1644973490, "voted_up": false, "votes_up": 127, "votes_funny": 8, "weighted_vote_score": "0.772692680358886719", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "115090083": {"recommendationid": "115090083", "author": {"steamid": "76561198857667671", "num_games_owned": 48, "num_reviews": 15, "playtime_forever": 57455, "playtime_last_two_weeks": 0, "playtime_at_review": 27453, "last_played": 1683383989}, "language": "english", "review": "Spawned in, found a shotgun.\nSaw another player, told him I was friendly and gave him a pistol.\nOther player shoots me in the face and scavenges my corpse.\nSpawned in again, hear footsteps, guy almost knifes me from behind.\nSay I'm friendly, he thinks about it.\nAnother guys turns up with two shotguns, says he won't shoot.\nThe three of us team up, we get geared.\nProceed to kill on site and meet 2-3 different squads.\nGo to safe zone, pick a victim. Wait for him to leave.\nFollow him out, darkness setting in, can't see anything.\nLeads us into an ambush at a building site. Get gunned down.\nSpawn in again.\n\nThis game is awesome.", "timestamp_created": 1651926230, "timestamp_updated": 1651926230, "voted_up": true, "votes_up": 85, "votes_funny": 16, "weighted_vote_score": "0.771407067775726318", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "149003489": {"recommendationid": "149003489", "author": {"steamid": "76561199096831141", "num_games_owned": 0, "num_reviews": 60, "playtime_forever": 123, "playtime_last_two_weeks": 0, "playtime_at_review": 123, "last_played": 1698434535}, "language": "english", "review": "F---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☑ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☑ 7\n☐ 8\n☐ 9\n☐ 10\n\n\n", "timestamp_created": 1698439054, "timestamp_updated": 1698439054, "voted_up": true, "votes_up": 53, "votes_funny": 6, "weighted_vote_score": "0.771281301975250244", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "126416026": {"recommendationid": "126416026", "author": {"steamid": "76561197962117831", "num_games_owned": 199, "num_reviews": 11, "playtime_forever": 4688, "playtime_last_two_weeks": 0, "playtime_at_review": 2942, "last_played": 1688337744}, "language": "english", "review": "     The only way I can describe this game is to bring up other games. If you've ever played DayZ/SCUM/ArmA Exile/survival base-building game #34678, and cringe at the thought of how crippling emotionally it is when you lose all of your stuff, then this game might be the solution you've been looking for. It definitely was for me.\n\n     Deadside is an open world/basebuilding/survival game that trims all the fat off of the genre and leaves mostly just the fun parts of these games. Most major towns are respawn points, and you can craft and place down respawn beacons(with small limits like no  safezones) for yourself. Weapons are easy to come by. AI is cheesable even solo, and the map is big enough that you aren't getting smoked in the rear constantly by 16 yr old Tanner and his gaggle of fraternity fuckbois. The TTK(time to kill) is very short, almost Tarkov-esque without the non-pen bullet spongyness. A naked freshie with a shotgun can easily solo a 2-man group and even 3-man if they are occupied with mission AI.\n\n     Randomly generated missions keep you on that dopamine drip with \"lootboxes\" that drop good weapons/meds/food/building supplies. AI is laser accurate when they are military bots, but cover and peeking do a really good job of mitigating this. All in all most missions are soloable if you have experience with jiggle peeking and repositioning.\n\nYOU CAN NOT BE RAIDED WHILE OFFLINE (thank God)\n\n     Gone are the days of logging in to an empty base. When players kill you, there is a 20% chance you will drop a \"raid token\". This token will expire and can't be hoarded, but once activated will show the \"general\" location of your base on the map to all players and at that point becomes raidable. The only way to get raided is to die to other players and even then its only a 20% chance each time you die. You can however die, ragequit, and then wake up to an empty base b/c you werent there to defend, when they popped the token. (whoops, happened to me RIP first base)\n\n     Again, this is just DayZ/SCUM, but its actually fun. Downtime spent running and building are greatly minimized to keep you doing the fun stuff. You even get a run speed buff from being above 89 food/water!\n\n     The developers did a really good job of capturing that old ArmA Wasteland feeling, but making it way more accessible to \"gamer dads\" or people who don't want to stare at grass for 3 hours while running somewhere for a can of peaches.\n\n     This game makes open world survival actually fun, and capitalizes on making the player feel good about each gun they pick up, building piece they put down, and kill they bag. Nothing takes extraneous amounts of time. Death isn't a big deal. Hell, even losing your base isnt a big deal b/c you can solo missions with a shotgun that have the best loot as the reward.\n\n     A fun DayZ/SCUM that trims all the \"funk\" from the gameplay model, and focuses on getting the player into whats fun and important. Getting loot and killing players or AI.\n\nCONS\n-No zombies (a PRO for me honestly)\n-Gunplay can be wonky like holding breath after shift-sprinting too fast will cause you to re-enter \"walk\" \n   mode instead of just ADS'ing like you want it to.\n-AI can be bullshit but the harder ones are supposed to be b/c the loot is phenomenal.\n-This game is harsh on solos when it comes to PVP, but if you are good at PVP, it can be as much of an \n   adrenaline rush as Tarkov/DayZ fighting and winning against a 2-3 man group.\n-I wouldn't say the game \"needs more content\", b/c im having a blast playing it regardless, but it definitely \n   could use more guns/attachments/loot types/points of interest. The PVP is what I stay to play for, but I \n   would love to see a wider variety of tools to kill people and AI with.\n-Supporter pack gives skins which sends the wrong message to people. The game doesn't MTX skins at all. \n   The skins in game you can just paint onto your clothes using a workbench and it costs no materials at all, and there are default in-game camos that make more sense and are more concealing than the supporter pack ones.\n- The map doesn't let you zoom in far enough, so examining terrain features and building up close on your map is not even possible. Relying on third-party maps is a must if you want to know where the good loot spawns. This should really be addressed by the devs. I should be able to look at the map closely, see a group of buildings that aren't marked as a \"town\" or \"POI\" and realize I've found an unmarked area that might just be ripe for looting. You get robbed of the ability to use these skills by the unzoomable map that lacks alot of terrain detail.\n\n\nGreat game would recommend\n\n7/10, would push Tanner's shit in with my Mosin-Nagant while his homies watch all over again.\n\n\n\n\n\n\n", "timestamp_created": 1669225897, "timestamp_updated": 1669225897, "voted_up": true, "votes_up": 30, "votes_funny": 0, "weighted_vote_score": "0.771105170249938965", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "67474387": {"recommendationid": "67474387", "author": {"steamid": "76561198849873196", "num_games_owned": 0, "num_reviews": 68, "playtime_forever": 3072, "playtime_last_two_weeks": 0, "playtime_at_review": 165, "last_played": 1688351698}, "language": "english", "review": "EDIT : UPDATED REVIEW\n\nGame has no anticheat, no base raiding system. The game easily over-rewards those who've grinded the game for either tons of money, a mega base, or very strong gear that doesn't have any durability. Speed hackers galore, private servers are the way to play but at times when admins are offline, esp, aim hack, and speed hackers rule the server. They'll kill you for your hard earned gear or if you manage to kill them, they'll return with a gun an no-recoil you. Game is overall fun but will be easily be overtaken by the shitty cheater community if no counter-measures are put into place. If the devs don't hurry to fix this problem, it is likely that the legit-player playerbase will eventually leave to play some other pvp / survival genre that has an established anti-hack. Please devs, act quickly before it kills your game.\n\n\n(Following (1st) review based on the first 6 or so hours into the game)\n\n{ E A R L Y - A C C E S S     R E V I E W }\n\nOkay so based off first impression the game is a hybrid game, combining elements of Escape From Tarkov, where you grind for gear and are able to store it along with numerous 'scavs' scattered across the map, and DayZ, where it's survival based, open-world, with a need to eat and drink. Thankfully, the game is more sided toward Escape From Tarkov where as the gameplay is more pvp focused than DayZ. Sure there's a fair share of running around the map, but not equal to the large scale at which DayZ consisted of. For it's price-tag the game is worth, though still lacking some content. Game has a way to go, but if the devs consistently improve the game it'll have a bright future. The map includes two save zones that allow the player to store gear and buy/sell to traders. The game is kept interesting by having consistent spawns of Ai across the map that will try to instantly gun you to the ground. Furthermore there are missions with scaling difficulty that give late-game players a challenge or low-geared freshies a chance to come up on some fat lootables. Overall the movement is a bit clunky at the moment but does include a nifty vault feature which comes into use often. The map's buildings are quite barren and don't really include much furniture. The meta seems to be either hitting military bases and hauling loot back from areas that are a short distance from the two residing safe zones. The pvp is pretty fun, most players don't have armor. There is no durability for armor. There is no weight system. The guns seem to be pretty unbalances where as a shotgun has little spread and is typically able to one-shot players at an absurd range and for some reason an M4 out-guns an AK greatly. I believe the balances should be as so; The AK has more recoil but does more damage per shot / has slightly slower firerate vs. the M4 that is easier to control, and higher firerate. Weapon modding is super basic, only 3 reflex sight attachables and a flashlight. Can't store modded weapons to traders. Basebuilding is seemly balanced, not so sure about raiding. Overall for an early access release the game seems promising and if the devs work hard and listen to community opinion I believe this game will really flourish in due time.", "timestamp_created": 1587101113, "timestamp_updated": 1587400487, "voted_up": true, "votes_up": 75, "votes_funny": 7, "weighted_vote_score": "0.770778417587280273", "comment_count": 2, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "90457772": {"recommendationid": "90457772", "author": {"steamid": "76561197965118672", "num_games_owned": 612, "num_reviews": 14, "playtime_forever": 1021, "playtime_last_two_weeks": 0, "playtime_at_review": 806, "last_played": 1646938138}, "language": "english", "review": "The game has great potential.\nHowever, in the state the game is now, NPC's either 1-shot you or they shoot like Storm Troopers.\nThere is hardly anything to do in the game, other than running around looting.\nArmor gives little to no protection.\nGunplay is VERY arcade-ish.\n\nYou can only RENT a private server, there is no way to locally host one yourself. Devs do not listen to the community about releasing dedicated server files. Based on that, I personally would not recommend anyone to purchase this game until the developers start listening to the community.\n\nAs of now, I strongly advice towards looking elsewhere for a better experience.\nSCUM, DayZ, Escape from Tarkov to name a few games for a great experience.", "timestamp_created": 1618659454, "timestamp_updated": 1618660189, "voted_up": false, "votes_up": 41, "votes_funny": 3, "weighted_vote_score": "0.76766437292098999", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "118137486": {"recommendationid": "118137486", "author": {"steamid": "76561198086736744", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 586, "playtime_last_two_weeks": 0, "playtime_at_review": 201, "last_played": 1657994508}, "language": "english", "review": "Bought this and gifted 4 more friends. Great game, but we will definitely quit if vehicles don't come. Only thing that's holding this game back is that the game is 90% running and desperation for water.", "timestamp_created": 1656862929, "timestamp_updated": 1656862929, "voted_up": true, "votes_up": 31, "votes_funny": 3, "weighted_vote_score": "0.767097055912017822", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "131305346": {"recommendationid": "131305346", "author": {"steamid": "76561198372875840", "num_games_owned": 75, "num_reviews": 26, "playtime_forever": 2828, "playtime_last_two_weeks": 84, "playtime_at_review": 466, "last_played": 1713633866}, "language": "english", "review": "Do you like Tarkov?\nDo you like DayZ?\nDo you like SCUM?\n\nThen this is definitely worth if for you.\nIt feels like the younger disabled brother of Tarkov.\n10/10 Graphics\n9/10 AI\n8/10 Gameplay\n\n9.6/10 Game\nLove it, more updates.", "timestamp_created": 1674348235, "timestamp_updated": 1674348235, "voted_up": true, "votes_up": 56, "votes_funny": 20, "weighted_vote_score": "0.766417622566223145", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "151137339": {"recommendationid": "151137339", "author": {"steamid": "76561198263400853", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 11815, "playtime_last_two_weeks": 0, "playtime_at_review": 2794, "last_played": 1705078124}, "language": "english", "review": "F---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☑ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☑ 7\n☐ 8\n☐ 9\n☐ 10", "timestamp_created": 1700681877, "timestamp_updated": 1700681877, "voted_up": true, "votes_up": 64, "votes_funny": 9, "weighted_vote_score": "0.765573322772979736", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "68884955": {"recommendationid": "68884955", "author": {"steamid": "76561198027233051", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1666, "playtime_last_two_weeks": 0, "playtime_at_review": 1458, "last_played": 1677049487}, "language": "english", "review": "Give us a “Craft All” Button!! PLEASE", "timestamp_created": 1589088144, "timestamp_updated": 1589088144, "voted_up": true, "votes_up": 118, "votes_funny": 22, "weighted_vote_score": "0.765032351016998291", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "115862740": {"recommendationid": "115862740", "author": {"steamid": "76561198862891069", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 5035, "playtime_last_two_weeks": 1, "playtime_at_review": 1836, "last_played": 1712594116}, "language": "english", "review": "This is like dayz meets tarkov, its beutiful", "timestamp_created": 1653247371, "timestamp_updated": 1653247371, "voted_up": true, "votes_up": 41, "votes_funny": 0, "weighted_vote_score": "0.763861298561096191", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "68538803": {"recommendationid": "68538803", "author": {"steamid": "76561198106208251", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 61018, "playtime_last_two_weeks": 0, "playtime_at_review": 2843, "last_played": 1643966254}, "language": "english", "review": "This game bring my old memories of Just Survive H1Z1 :)", "timestamp_created": 1588576877, "timestamp_updated": 1588576877, "voted_up": true, "votes_up": 72, "votes_funny": 5, "weighted_vote_score": "0.763625383377075195", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "70879295": {"recommendationid": "70879295", "author": {"steamid": "76561198931180956", "num_games_owned": 39, "num_reviews": 3, "playtime_forever": 5536, "playtime_last_two_weeks": 0, "playtime_at_review": 643, "last_played": 1607251276}, "language": "english", "review": "Pretty decent game overall, the only real complaint that i have are that the AI are spot on and very rarely miss.  If you can get the jump on them by sneaking then you have a pretty good shot.  But if they get the jump on you, you are pretty much done for.  A pistol should not be able to hit at over 150m away is all I am saying.  Overall very good game for being early access!", "timestamp_created": 1592306839, "timestamp_updated": 1592306839, "voted_up": true, "votes_up": 32, "votes_funny": 3, "weighted_vote_score": "0.763350367546081543", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "139630411": {"recommendationid": "139630411", "author": {"steamid": "76561198961627518", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 18357, "playtime_last_two_weeks": 0, "playtime_at_review": 15760, "last_played": 1708578881}, "language": "english", "review": "DayZ without Zombies,\nTarkov without extraction;\nThis is the best game I've played recently", "timestamp_created": 1686043615, "timestamp_updated": 1686043615, "voted_up": true, "votes_up": 76, "votes_funny": 4, "weighted_vote_score": "0.762468934059143066", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "106406320": {"recommendationid": "106406320", "author": {"steamid": "76561198256167593", "num_games_owned": 207, "num_reviews": 5, "playtime_forever": 577, "playtime_last_two_weeks": 0, "playtime_at_review": 496, "last_played": 1640504207}, "language": "english", "review": "running simulator", "timestamp_created": 1640327773, "timestamp_updated": 1640327773, "voted_up": true, "votes_up": 40, "votes_funny": 19, "weighted_vote_score": "0.761941134929656982", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "93399608": {"recommendationid": "93399608", "author": {"steamid": "76561198291744743", "num_games_owned": 136, "num_reviews": 34, "playtime_forever": 630, "playtime_last_two_weeks": 0, "playtime_at_review": 615, "last_played": 1629277584}, "language": "english", "review": "Escape from tarkov but without the same level of annoyance when u die", "timestamp_created": 1623144948, "timestamp_updated": 1623144948, "voted_up": true, "votes_up": 76, "votes_funny": 12, "weighted_vote_score": "0.758729457855224609", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "93482533": {"recommendationid": "93482533", "author": {"steamid": "76561198278986542", "num_games_owned": 204, "num_reviews": 34, "playtime_forever": 1356, "playtime_last_two_weeks": 0, "playtime_at_review": 1285, "last_played": 1628485588}, "language": "english", "review": "game sucks it was good for like 1 week when it came out but now its garbage\n-victor", "timestamp_created": 1623273040, "timestamp_updated": 1644701873, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.758137047290802002", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "137234619": {"recommendationid": "137234619", "author": {"steamid": "76561198866034838", "num_games_owned": 0, "num_reviews": 38, "playtime_forever": 78702, "playtime_last_two_weeks": 0, "playtime_at_review": 78702, "last_played": 1666963301}, "language": "english", "review": "Don't waste your money on this game - even if it's on sale. It had massive potential in the beginning and was really enjoyable. I have over 1,300 hours in it, but I can't be bothered to play it anymore. Many of Deadside's inherent problems have already been mentioned by other reviewers and the occasional streamer, so I won't waste time repeating them. \n\nThe development speed is glacial. There are fundamental problems with Deadside that the devs either cannot or will not fix and this has resulted in a rapidly dwindling player base. \n\nIf you dare be honest about the state of the game in the Steam discussions, a belligerent dev will send you a sarcastic message and ban you from the discussion. You have been warned!!!", "timestamp_created": 1682354956, "timestamp_updated": 1682354956, "voted_up": false, "votes_up": 80, "votes_funny": 5, "weighted_vote_score": "0.757544636726379395", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "92292562": {"recommendationid": "92292562", "author": {"steamid": "76561198133737009", "num_games_owned": 131, "num_reviews": 9, "playtime_forever": 494, "playtime_last_two_weeks": 0, "playtime_at_review": 412, "last_played": 1661767600}, "language": "english", "review": "for the love of god devs just add a nice little bike or scooter or somthing thats faster than running", "timestamp_created": 1621492763, "timestamp_updated": 1621492763, "voted_up": true, "votes_up": 38, "votes_funny": 5, "weighted_vote_score": "0.75677335262298584", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "151228570": {"recommendationid": "151228570", "author": {"steamid": "76561198012622110", "num_games_owned": 932, "num_reviews": 45, "playtime_forever": 4547, "playtime_last_two_weeks": 21, "playtime_at_review": 4235, "last_played": 1712515356}, "language": "english", "review": "I think this game is really good as it stands and is easily worth the money the devs are asking for. However I do think its got a decent way to go before it becomes a proper finished survival game.\n\nNow the main selling point to me with this game is it very similar to \"DayZ\" but without so much of the boring survival stuff. \nThis game offers a similar experience to \"DayZ\" but lets you get guns and gear fairly quickly with the added benefit of AI bots roaming around to keep things interesting along with being a source for loot. This game also had no zombies which is a plus for me as in my opinion \"DayZ\" zombies are terrible and something like \"Scum\" offers a better all round survival experience when compared to \"DayZ\".\n\nNow in terms of improvements I think the missions really need improving with more variety. Basically the missions as they stand is go into an area and kill all the bots to get a reward. While I think this is a good starting point it gets boring fast in my opinion. The convoys were a cool idea but I find nobody bothers to try and steal the loot therefore it doesn't work too great in practice. Perhaps adding objectives to some of the missions making them harder would work better if done properly. Also im not a fan of the respawn system. Basically when you die you can choose which town you want to spawn in which means when you kill a player they just spawn 100m or so away and instantly come back. I would much prefer random imo. \n\nOkay some others things I would like to see to make this the perfect game is more points of interest in the current map ( Not expanding as the map has plenty of free space at the moment ). Making cities and towns more useful such as adding a police station and hospital as a place for basic guns, armour and an easy way to get medical supplies which is very difficult atm. Also perhaps having an NPC which gives some basic quests for money or items would be cool. An example of a quest could be goto \"Stepnoe\" find a golden watch and bring it back here. This would also promote going to towns and cities along with increasing PVP in these areas. Some sort of weather system would also be greatly practised adding much variety and sounds to the environment making it feel more real and immersive.\n\nAnyway thanks for reading this lengthy recommendation / review for this game.\n\nOverall if you like the look of the game just buy it.", "timestamp_created": 1700710447, "timestamp_updated": 1700964648, "voted_up": true, "votes_up": 31, "votes_funny": 0, "weighted_vote_score": "0.756581604480743408", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "123764358": {"recommendationid": "123764358", "author": {"steamid": "76561198353352288", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 40140, "playtime_last_two_weeks": 0, "playtime_at_review": 26871, "last_played": 1708894978}, "language": "english", "review": "This was a really good game until the 0,4.0 update. The few previous updates started its decline. Originally they stated the reason they did not include zombies into the game was because they did not want it to be too much like DayZ. Well, with the last 3 updates the game has become more and more like DayZ. I really liked this game for it's differences from DayZ. Now, it seems as if the fun is leaving the game. The survival mechanics and re-do of the base building have made the game an endless grind instead of the \"easy to jump into game\" that it was. My hopes are that enough of the players who do not like the changes speak up and the devs listen. But, I cannot recommend this game at this time.", "timestamp_created": 1665657556, "timestamp_updated": 1665657556, "voted_up": false, "votes_up": 42, "votes_funny": 0, "weighted_vote_score": "0.755589962005615234", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}}, "query_summary": {"num_reviews": 76, "review_score": 6, "review_score_desc": "Mostly Positive", "total_positive": 12419, "total_negative": 3739, "total_reviews": 16158}, "cursors": {"AoIIPwAAAHOhxuAE": "Mon Apr 22 23:41:54 2024"}}
