{"reviews": {"158589151": {"recommendationid": "158589151", "author": {"steamid": "76561198069989538", "num_games_owned": 0, "num_reviews": 23, "playtime_forever": 118, "playtime_last_two_weeks": 0, "playtime_at_review": 118, "last_played": 1708224088}, "language": "english", "review": "This game has a lot of gathering and crafting that is probably unnecessary so I would not recommend this game to people who don't like those things, but the game is fun in shorter bursts. The combat isn't amazing but it is serviceable and if you get the timing of enemy attacks down, none of the early enemies are difficult that I've encountered so far.\n\nIt would be a great mobile game or Steamdeck game to play on the train or bus as you can save pretty much anytime. It's nice they added a 2nd player option for people who have friends or loved ones.", "timestamp_created": 1708224618, "timestamp_updated": 1708224618, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.563492059707641602", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "162682155": {"recommendationid": "162682155", "author": {"steamid": "76561198014065808", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 395, "playtime_last_two_weeks": 395, "playtime_at_review": 286, "last_played": 1712980447}, "language": "english", "review": "Kinda like don't starve but way more chill.", "timestamp_created": 1712864740, "timestamp_updated": 1712864740, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161683661": {"recommendationid": "161683661", "author": {"steamid": "76561198078682251", "num_games_owned": 574, "num_reviews": 17, "playtime_forever": 4907, "playtime_last_two_weeks": 1, "playtime_at_review": 4889, "last_played": 1713315898}, "language": "english", "review": "This will keep you occupied for days!! I got it for all my friends who enjoyed Borderlands.  \n\nGreat game on Steamdeck.", "timestamp_created": 1711665926, "timestamp_updated": 1711665926, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161183337": {"recommendationid": "161183337", "author": {"steamid": "76561198038280130", "num_games_owned": 455, "num_reviews": 36, "playtime_forever": 524, "playtime_last_two_weeks": 0, "playtime_at_review": 449, "last_played": 1711468202}, "language": "english", "review": "Fun drinking game idea:\r\nTake a shot every time sacks are mentioned", "timestamp_created": 1711134660, "timestamp_updated": 1711134660, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.522058844566345215", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "20660576": {"recommendationid": "20660576", "author": {"steamid": "76561198028566318", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 5130, "playtime_last_two_weeks": 0, "playtime_at_review": 2887, "last_played": 1527792202}, "language": "english", "review": "16+ hours on one save and I haven't even made it out of the first biome. IT'S SO BIIIIIG. Here's what I have so far..may revise later.\n\nPros:\n- Surprisingly responsive dev team for only being 3 people\n- You won't starve to death or go insane (in the game..don't forget to take breaks)\n- No permadeath, items are easily recoverable from your graaaave\n- Teleportation system for fast travel around the massive maps\n- The infinite auto-managing inventory is GREAT \n- Hilarious and creative dialog/item/npc names compliment the bright vibrant world really well\n- RNG stats on your gear and ability to recycle/recraft them\n- The synching to my phone and tablet (Android) has been flawless\n-  Combat is fun, scales well and is balanced as you explore and craft\n- SO MANY ITEMS\n-  Baconweed\n\nCons\n- Can only track one item recipe at a time\n- Wish there were more hotkeys\n- No controller support (yet?)\n- Pets can be leveled up but other than that are just kind of “set it and forget it.” Wish there was more to do with them.\n- I’m trying to come up with something else but…I love this game\n\nThe Butterscotch guys went through quite a journey to launch this game. With their plans to combine all of their games under one universe, I’m happy to support them.  They plan on releasing a world creator/workshop thing AND add even more content if all goes well.  People have issues with the split PC/mobile pricing and extensive (and logical) responses have been made.  Basically, they consider this a $20 game and I’ve enjoyed playing it on both platforms.\n\nEdit: yet?", "timestamp_created": 1453386306, "timestamp_updated": 1453530135, "voted_up": true, "votes_up": 279, "votes_funny": 23, "weighted_vote_score": "0.952640056610107422", "comment_count": 15, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "32107664": {"recommendationid": "32107664", "author": {"steamid": "76561197994596601", "num_games_owned": 1316, "num_reviews": 13, "playtime_forever": 5184, "playtime_last_two_weeks": 0, "playtime_at_review": 4147, "last_played": 1498439476}, "language": "english", "review": "This game has been on my wishlist ever since I heard of the premise and especially after seeing the documentary on the making of this game.  My only concerns were that some reviews said it was basically a mobile game and was best played on mobile.\n\nThese concerns almost made me skip the recent Humble Bundle middle tier it was in but I took a leap of faith and I am so glad that I did.  I know the mobile version is probably good since Butterscotch is primarily a mobile developer but the PC version is top-notch as well.  It works great with both K&M and controller and looks glorious on my 4K 42\" monitor.\n\nThis is not a roguelike survival craft-em-up.  Rather, it is a RPG-lite craft-em-up with quests and a storyline.  You probably won't get as much replayability with it as much as those roguelike survival games, but I tend to drop those games after the first death or so.   Not so with this one.  The structured quests are always driving me towards my next goal instead of pottering around aimlessly.\n\nCrashlands - the game I would also be proud of if it was the last game I ever created.", "timestamp_created": 1496325606, "timestamp_updated": 1496407052, "voted_up": true, "votes_up": 110, "votes_funny": 1, "weighted_vote_score": "0.899303734302520752", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "74031485": {"recommendationid": "74031485", "author": {"steamid": "76561198132503739", "num_games_owned": 602, "num_reviews": 549, "playtime_forever": 4426, "playtime_last_two_weeks": 0, "playtime_at_review": 4426, "last_played": 1596891221}, "language": "english", "review": "[b]My playtime:[/b] 73.8h (based on steam, 100% achievement)\n[b]Grindy Achievement(s):[/b] Yes (~3 achievements).\n[b]Optional Achievement(s):[/b] Yes (~29 achievements).\n[b]Difficult Achievement(s):[/b] Yes (~2 achievements).\n\n[h1]Intro[/h1]\n[i]Crashlands[/i] is a game where you have to gather resources, kill enemies, and craft items to defeat bosses.\n\n[b]Pros:[/b]\n- 4 difficulties\n- 3 game modes\n- Unique bosses\n- You can finish quests in any order that you want\n- A lot of craftable items, including the ones used for decoration purposes\n- Pets with different abilities\n\n[b]Cons:[/b]\n- Gear crafting is luck-based\n- Sometimes the game might feel too grindy\n- Too many gadgets and devices to choose from\n- Hardcore mode beats the point of the game\n- You need to wait for minutes to craft or hours to wait for a resource to respawn\n- Auto-lock tends to lose target\n\n[h1]Should you buy this game?[/h1]\n[b]Yes.[/b]\n[i]If you like games where you have to gather resources, kill enemies, and craft things, this is your game. The game has some difficult achievements in the hardcore mode though so you might want to reconsider if you aim for 100% completion.[/i]\n\n------------------------------------------------------------------------------------------\n[h1]In-Depth Review[/h1]\n\n[h1]Graphics[/h1]\nThe designs are simple and clean. Most enemies are cute-looking and everything looks comical. I also liked the pet evolution screen that looked like [i]Pokémon[/i], although it's executed differently.\n\n[h1]Story[/h1]\nThe game has a unique storytelling. Instead of taking everything seriously, everyone talks nonchalantly and jokes around - even to the final boss. There were times when I had to reread the conversation twice though; sometimes it's kinda hard to get what they were talking about.\n\n[h1]The game[/h1]\n[b]Modes[/b]\nThe game has 3 game modes: story, hardcore, and creative. Story mode is the standard game where you will get an actual story and quests. Both hardcore and creative mode will be unlocked after you reach a certain point in the story mode.\n\nHardcore, on the other hand, is a story mode without quests and extra life. Yes, you have to restart the game if you accidentally die from an enemy. Since there is no story in this mode, I found that the recipe gathering took too much time. The perma-death also made the mode to be frustrating; it seems that it beats the purpose of the game where you have to take your time to craft the ultimate gear and explore the map.\n\nCreative mode isn't an actual game. It's more dedicated to those who want to get... creative. You have unlimited resources and no objective. You can either build your dream home base or draw something from the floor tiles or... anything.\n\n[b]Exploration[/b]\nThe game focuses on resource-gathering and exploration. You'll be thrown in a land, gather some resources, and craft new items from the said resources. The game has a very vast map and it's almost impossible to uncover everything. I was even surprised that the game ran smoothly even though I had revealed a lot of portion of the map; it only took longer to wait when I opened a map or traveled to a different land.\n\nThe game has 3 lands to explore. Each land has a unique theme, quests, crafted items - everything. It's as if you're playing the same game 3 different times before you finished the actual game.\n\n[b]Crafting[/b]\nYou can craft pieces of equipment, tools to gather better resources, and even decoration items that serve no purpose except to make your base looks better. Crafting becomes vital in the game if you want to do almost anything because you can only obtain most items by crafting.\n\nAlthough you can craft some items at the start, some items require a recipe to craft. In story mode, these recipes are dropped either from gathering resources, killing enemies or bosses, or completing quests. You will have all recipes from the start in creative mode and you can get the recipes from all but the latter in hardcore mode.\n\nCrafting takes time. There are some items where you have to wait for a few minutes to craft. I felt like I was playing a Facebook game because of this. Luckily, you don't need to wait that long in hardcore mode and you can also do other things while you wait.\n\n[b]Resource Gathering[/b]\nResource gathering takes time, especially if you don't know where to look for an item. The game might have a feature to track how many items that you need, but the game fails to tell you where you can get the said item. Even if you know where to get it, it might still take some time to gather since some items are not common in the land. There are even some resources that take hours to respawn.\n\n[b]Battles[/b]\nApart from resources that you can pick up, there are times where you have to battle enemies to gather resources. Some enemies are easy to beat, some might kill you if you're not careful. Each enemy has unique attack patterns and since you only have melee attack at the beginning of the game, you have to do your best to hit the enemy while dodging their attacks that are indicated by red marks.\n\nEnemies have a lot of variants of the same type. A higher variant will sometimes drop an egg that you can hatch and keep as your pet. There are also evolved variants that will drop some essences that you can use to evolve your pet. However, I found that the egg drop rate is very low, especially in the latter part of the game.\n\n[b]Equipment[/b]\nYou can only level up by switching gear. However, crafting gears are RNG-based; there are different qualities and bonus stats that will only be revealed after you craft them. Saving and loading become vital if you don't want to gather the resources again to get the best gear.\n\nThe game also has other items called gadgets and devices that you can place in your hotkey to use. These items have different effects - from hitting the enemy from a long distance to making you invulnerable for a few seconds. However, I found that there were too many of them and most of them were useless since you only need to get ranged items to kill end game enemies. I never bothered to test new items after I filled all of my hotkeys with the ranged ones.\n\n[b]Bosses[/b]\nThe game has 11 bosses with different attack patterns and element types. You also can't outgear the bosses in the hardest difficulty so you need to learn the attack pattern properly to finish the fight. Since it's risky to melee most bosses, I found that I ended up hitting all bosses with items in my hotkey slots from afar until they die. However, sometimes the auto-lock loses its target that I had to spam click on the bosses whenever I could to make sure that I didn't lose the target.\n\n[b]Difficulty[/b]\nThe game offers 4 difficulties that you can choose before you start the game. I played the game in the hardest difficulty and I didn't have any problem with it. The monsters take a long time to kill though; it might even take minutes to kill a stronger monster than your level. You also can die in 1 hit by an enemy that is weaker than you.\n\n[b]Length[/b]\nIt took me 55h to finish the game in story mode and an extra 4h to obtain all of the grindy achievements. The rest of my playtime is spent in finishing hardcore mode, which might take longer or faster based on your skill.\n\n[h1]Conclusion[/h1]\nIt's a game where you can do a lot of things to craft and kill enemies. The game has a lot of unique bosses and vast maps to explore.\n\n[quote][url=https://store.steampowered.com/curator/23741321]Follow our curator page[b] Alexander's Club Curations[/b], if you like and want to see more reviews like this one.[/url][/quote]", "timestamp_created": 1596982760, "timestamp_updated": 1597079932, "voted_up": true, "votes_up": 118, "votes_funny": 2, "weighted_vote_score": "0.86672365665435791", "comment_count": 4, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "20671382": {"recommendationid": "20671382", "author": {"steamid": "76561197993156502", "num_games_owned": 8385, "num_reviews": 197, "playtime_forever": 3309, "playtime_last_two_weeks": 0, "playtime_at_review": 307, "last_played": 1667970966}, "language": "english", "review": "I wasn't sure what to expect from this game.\nWhatever it was I was expecting, this game FAR EXCEEDED my expectations.\nThis game is fun. It oozes a special something, and it just makes me happy.\n\nYou can tell this game was made by people who love games. \nIt respects your time. There's no level grinding. There are generous teleport pads across the open world, and you can teleport to any of them at any time (once you've discovered each one).\nYou have infinite inventory, so you never have to worry about managing what to collect or not-collect. You want to just collect everything.\n\nThe game lets you play however you want, at your own pace.\nThere's no penalty for dying. You WILL die. You will drop some of your items when you die.\nSimply go back to where you died, and you instantly pick them all up again. You move on.\n\nThis game is about enjoying the world that has been created by the team at Butterscotch Shenanigans. \nThe story seems really large, with many side-quests. It's all open world, so you can complete anything at any pace you want, and any order.\n\nThe game just feels good. \nI also recommend picking up the mobile version of the game. Your save will automatically sync between both versions of the game, so you can always play wherever you go. That's another sign of a game developer who truly cares and respects the player! \n\nIf you're looking for a game to get lost in, this is the game to be playing.", "timestamp_created": 1453429055, "timestamp_updated": 1453429055, "voted_up": true, "votes_up": 85, "votes_funny": 3, "weighted_vote_score": "0.830816805362701416", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "50284427": {"recommendationid": "50284427", "author": {"steamid": "76561198037517236", "num_games_owned": 0, "num_reviews": 74, "playtime_forever": 1927, "playtime_last_two_weeks": 0, "playtime_at_review": 416, "last_played": 1557295017}, "language": "english", "review": "I've been jonesing for a decent survival game for a while, and I will say this one hits the spot. Others have compared it to Don't Starve and gameplay-wise, I suppose it could be like that a little. You play Flux, a space trucker whose ship was destroyed by a sinister floating head. To get back at the floating head and get off the planet you're stranded on, you'll have to gather resources and help out the natives in what is very clearly a comedic romp through an alien world.\n\nI never enjoyed Don't Starve because of its soul-crushing difficulty, and I wasn't readily attracted to a game with similar playstyle, but Butterscotch Shenanigans does a great job with their trailers, and since it was on sale for $5, I decided to give it a try. Mainly, I've been sold on the fact that I don't feel punished for simply wandering around aimlessly, smashing resources and treasure chests along the way. Your inventory is limitless, but craftable items can often cost a lot of resources, so plan to chop at everything you run across on the inevitable chance that you'll need it to craft something later.\n\nPets can be earned and upgraded to be more effective in combat. I love the Pokemon reference in-game when they're evolved. Enemies also don't seem to target pets, which can be a double-edged sword if yours does AoE (Are of Effect) damage, pulling an entire herd of Wompits down on your head.\n\nCrafting recipes are unlocked through quests and harvesting resources. It's always exciting to work your way through a forest only to have a random logtree drop a new recipe. There are also teleporters EVERYWHERE. Alongside the infinite inventory, this is one of my favorite features. It's annoying to have to jog back and forth between your home and whatever wilderness you were in because you need to craft more health potions.\n\nIt might sound like a casual experience, but it definitely has its challenges. I've died five times as of the writing of this review, mostly due to underestimating the power of the enemies. But death doesn't feel soul-crushing--it feels like a lesson learned. If a herd of Wompits stomps you into a bloody pool, maybe don't take on a whole herd next time.\n\nThere are definitely some areas where I think the game could be improved, though. Enemies spawn in thick clusters which can quickly overwhelm you when you meant to only fight one or two at a time. You earn perks in-game and I've earned a few, but I couldn't even tell you what they are because they go by the screen so fast, and there's no obvious way to review them afterwards. The data screen is also severely lacking, and I want to go a bit more into that.\n\nWith an infinite inventory, there is no place where you can quickly review the items you have. For example, if I am trying to make sure I have enough sticks to make something that requires them, I either need to have that item already on my tracker (which can only track one recipe at a time, BTW), or go all the way back home and check the recipe in the crafting station. It would have been nice to have this feature in the data panel, along with the list of perks unlocked, and maybe even a catalog of unlocked recipes. Anything to reduce the amount of unnecessary trips to my home base.\n\nAnyway, that doesn't stop me from playing and enjoying the game. Flux has a jaunty little skip while she roams the land chopping up the baddies and harvesting their parts for equipment. Her back and forth with the NPCs can also be really funny at times. I recommend it for anyone who likes exploring, active combat, and collecting things in their games, with a dash of humor to top it off.", "timestamp_created": 1556035786, "timestamp_updated": 1556035786, "voted_up": true, "votes_up": 45, "votes_funny": 1, "weighted_vote_score": "0.823992013931274414", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "20673984": {"recommendationid": "20673984", "author": {"steamid": "76561198004098028", "num_games_owned": 3814, "num_reviews": 42, "playtime_forever": 5735, "playtime_last_two_weeks": 0, "playtime_at_review": 5125, "last_played": 1528684571}, "language": "english", "review": "Crashlands rocks.\n\nI tested this for around 60 hours before release and can say that the game delivers on it's promise.  The sorta isometric view seems to make everyone mention Don't Starve (damn it.  I just did it.) I see it.  Crafting, weird creatures, item drops, etc...  It's all there.  But the games are very different.  Don't Starve is a grim bizarre survival game that will murder you often as you discover your randomly generated tale.  Crashlands has a scripted story that pulls you through the colorful, randomly generated terrain of three biomes as a super powered interplanetary delivery person. The whole \"kill, pick up drops, craft materials, become more badass\" loop is super tight. I've spent way too many late nights scouring the savannah for one more essence to give me one more shot at making an epic weapon.  There is some dark compulsive magic at work here.\n\nThe actual combat is interesting because it works well on a tablet or on a PC, and it seems right at home on both devices.  That's cool.  The pc feels comfortable in the whole Torchlight/Diablo format and the approach works well on tablets as well, which I found really surprising.  \n\nCrafting is super with the infinite no-fuss-no-muss-none-of-this-stupid-encumberment system.   The Butterscotch Shenanighans crafting slot machine is one of the games best features, and finally getting a great weapon or embiggening a pet is super satisfying.  \n\nI love games with pets, and the whole raising, fighting and embiggening of pets is a great addtion.  Pro tip:  If you're as terrible as I am, you can make your pets pretty powerful and let them do most of the work.\n\nThe story is funny and warped and weird and emotional and exciting.  If for some reason you don't like having fun, ignore the story and get back to hitting things really hard.  The game won't penalize you.  If laughing hurts your soul, the gameplay will pull you through.\n\nThis is a really good game.  Just buy it.\n", "timestamp_created": 1453444667, "timestamp_updated": 1453444667, "voted_up": true, "votes_up": 49, "votes_funny": 3, "weighted_vote_score": "0.820301949977874756", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "20732848": {"recommendationid": "20732848", "author": {"steamid": "76561198082249063", "num_games_owned": 662, "num_reviews": 54, "playtime_forever": 1311, "playtime_last_two_weeks": 0, "playtime_at_review": 1146, "last_played": 1588805024}, "language": "english", "review": "[b]**[u] Key was provided by developer for review purposes\t[/u]**[/b]\n[b]Review will continue to be updated as I play through the game[/b] \n\n[h1]Crashlands [/h1] \n\nCrashlands is a humorous and well-done large world RPG set on an alien landscape. Combing elements of survival, story, and humor to create an amazing title. I will add a TL;DR at the end.\n\n[h1]Gameplay[/h1] \n\nYou are Flux and you are handling a urgent delivery with your robotic companion Juicebox. Your ship is destroyed by quite the purple head thingy... yeah.  You are now stranded on an alien planet and have to try and establish communication again and survive on the planet with its hostile environment.\n\nThe controls within this game are fairly simple using the mouse to either click and you will move there or hold it and you character will move where your mouse is. Crashlands also utilizes the A S D F and C V buttons as quick buttons, the A S D F buttons can be changed to quickly use your items while the C and V buttons are for your wonderfully murderous pet. The game mechanic is done well and I can see how easily it is converted to its mobile counterpart. Crashlands has a large amount of customizable floors and walls with useless furniture to behold. The game does a nice job of guiding you through everything and learning the game with rather comedic moments with Flux and Juicebox whether it be between themselves or the non-hostile inhabitants of the planet. The combat mechanic in the game is very fun as it requires you to be intelligent about you approach with every creature you see, which wants to kill you.... which is almost the entire planet. This game also removes the hassle of having to manage you inventory because apparently you have black hole pockets, just don't question it and be happy. Other than the expected do quest, get gear, and farm stuff mechanics you would expect of an RPG you can also rip the eggs from the creatures you kill and then raise their baby to murder their past brethren, overall very nice as long as you don't think too much on how STWOMPY (My personal Wombit) killed over 100 of his own kind already along with other creatures (so proud). The only problem is having to go back to old areas to remove bits of black so I can see the whole map, as it's quite the long process.\n\n[h1]Graphics/Sounds[/h1] \n\nThe graphics are cartoonish and more innocent than anything else. They are polished and very smooth and the evolution screen while you evolve your pet is quite majestic to watch. The music is alright and the sounds match the creature well.\n\n[h1]Pros/Cons [/h1] \n\n[b]Pros [/b] \n\n+ Great survival element\n+ Good amount of customization\n+ Large game allowing you to play for hours on end \n+ Cross-platform saves\n\n[b]Cons [/b] \n\n- Annoying to have to go back to previous areas of the map to fill it out without black areas\n- Moments where a crafting recipe I was tracking is replaced by a quest item track when I talk for the quest (slightly annoying, perhaps an option to not automatically change the tracked recipe?)\n- Grinding is existent and prevalent within the game\n\n[h1]Suggestions [/h1] \n\nThese are my personal suggestions that I feel would improve the game.\n\n- With the editor major update (when it is released) there should be an option to create custom player models and creature models to help create a true sense of freedom through customization in the update. \n- If the created creature is hostile the ability to select its attack patten would be amazing\n- Workshop for maps and mods with the large scale update\n- Ability to have \"Vanity items\" meaning that you could be waring one item for stats, but you can use another item that you prefer visually to be seen on you\n- Ability to see pet stats. To be able to see stats such as growth (Ex 26/100 and when it is evolved #/300), damage, and unique attack chance.\n- Future Co-op feature \n\n[h1]Final thoughts [/h1] \n\nI played Don't Starve and it was nice, but it wasn't my cup of tea. Crashlands however dragged me in and keeps me there. The game is fun and even though it is meant more for a mobile platform with its control scheme it does not take away from its value as a game in itself. It's a challenging game and makes you a bit more alert as you try not to get stomped out of existence. I love Flux and her attitude along with Juicebox and I think this game is something I could easily recommend to those who like Don't Starve but want something different and a bit more lighthearted. Also the trailer is just perfect.\n\n[h1]TL;DR [/h1] \n\nThe game is a more lighthearted version of Don't Starve and is able to keep you in a way Don't Starve couldn't. The game has mobile controls but it really doesn't hurt the game as a whole. There is a large amount of customization and the RPG element is great. This allows for the game to be a large, more open world, RPG survival game. It's actually cool that the main character is a female and the interactions she has between the non-hostile inhabitants of the alien planet, or her robotic companion Juicebox are very humorous at points. There are not many issues I am able to find as I play through the game. The only issues I see people having is that there is a grinding element to the game and that there are times on the map where you have to move to previous areas to have a fully exposed map without any black spots. I would definitely recommend this to people who want a different take on the Don't Starve survival technique or simply want to try something new and love an RPG element with customization.\n\n\n[i]If you liked this review or want to see more recommended games, be sure to follow our curator group: [url=http://steamcommunity.com/groups/Original_Curators_Group#curation]Follow Original Curator Group[/url][/i]", "timestamp_created": 1453664006, "timestamp_updated": 1455560497, "voted_up": true, "votes_up": 139, "votes_funny": 7, "weighted_vote_score": "0.812813103199005127", "comment_count": 15, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "32662183": {"recommendationid": "32662183", "author": {"steamid": "76561198164485757", "num_games_owned": 623, "num_reviews": 12, "playtime_forever": 226, "playtime_last_two_weeks": 0, "playtime_at_review": 124, "last_played": 1529818821}, "language": "english", "review": "(+)\n- Nice crafting system\n- Funny story\n- Nice sound effect\n- Nice and colourful graphics\n\n(-)\n- Grinding time will get longer as you progress, I don't recommend this for unpatient players", "timestamp_created": 1498186915, "timestamp_updated": 1498187008, "voted_up": true, "votes_up": 72, "votes_funny": 1, "weighted_vote_score": "0.811048626899719238", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "142457044": {"recommendationid": "142457044", "author": {"steamid": "76561197971396287", "num_games_owned": 0, "num_reviews": 36, "playtime_forever": 658, "playtime_last_two_weeks": 0, "playtime_at_review": 645, "last_played": 1689884890}, "language": "english", "review": "With the caveat that I only paid $3, it is worth the money, but man, is this game a needless grind. If I give one tip, don't explore, just go straight to your objectives or straight to the resources you need. The game uses procedural generation in real time, and exploration doesn't have many meaningful awards.\n\nUpdate: I'd be doing a disservice not to mention that this game *does* have some pretty imaginative designs and humorous writing. It runs relatively stable (only death so far was due to getting stuck in terrain and unable to unstick myself while in combat), has competently implemented systems and mechanics, and combat is alright, mixing what I would call Don't Starve's 2d presentation & combat with Final Fantasy 14's \"Echo\" mechanic where you can see what attacks are coming to assist dodging, which feels slick.\n\nThe main issue I have is everything takes 2x - 5x longer than it really ought to. Travel is a huge bore. Enemy attack patterns are one to two different modes, with tougher enemies taking minutes to kill through the same patterns. The bosses I've encounted so far do have interesting bullet-hell style mechanics.\n\nAgain, competently implemented, but not an enjoyable grind.", "timestamp_created": 1689844863, "timestamp_updated": 1689849907, "voted_up": true, "votes_up": 30, "votes_funny": 0, "weighted_vote_score": "0.78909224271774292", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "48794156": {"recommendationid": "48794156", "author": {"steamid": "76561197969749884", "num_games_owned": 2459, "num_reviews": 1422, "playtime_forever": 29539, "playtime_last_two_weeks": 0, "playtime_at_review": 4585, "last_played": 1549442860}, "language": "english", "review": "Crashlands is basically best described as Don't Starved meets Castle Crashers on acid.\n\nHuge world to explore, bazillions of critters to slay, lots of stuff to build and quite a hefty difficulty to not die is the mix you'll be getting in this bag and oh boy it is fun indeed.\n\nI was actually more than pleasantly surprised about the sheer amount of content in here. The humour is great, the art design is, well, it is what it is, in a good way and you just keep killing, collecting and crafting nonstop until to the conclusion of the game, which is quite far ahead.\n\nThe difficulty curve is good too.", "timestamp_created": 1549443469, "timestamp_updated": 1549443469, "voted_up": true, "votes_up": 34, "votes_funny": 0, "weighted_vote_score": "0.785436570644378662", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "21069911": {"recommendationid": "21069911", "author": {"steamid": "76561197996955022", "num_games_owned": 0, "num_reviews": 24, "playtime_forever": 1329, "playtime_last_two_weeks": 0, "playtime_at_review": 1030, "last_played": 1498192662}, "language": "english", "review": "I have 355 games in my Steam library at the time of this review and this will be my first review- because I feel compelled to boost the rating of this game.\n\nIncredibly well designed and executed game.  I loved Don't Starve and didn't realize there was anything wrong with it until I played this game and realized they fixed a lot of things about Don't Starve.  I was going to start listing the specific things that are great about this game, but there literally aren't any things I can think of that aren't perfect.", "timestamp_created": 1455000414, "timestamp_updated": 1455000459, "voted_up": true, "votes_up": 46, "votes_funny": 0, "weighted_vote_score": "0.775685131549835205", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "36687004": {"recommendationid": "36687004", "author": {"steamid": "76561198105877801", "num_games_owned": 728, "num_reviews": 234, "playtime_forever": 3151, "playtime_last_two_weeks": 0, "playtime_at_review": 3151, "last_played": 1511312801}, "language": "english", "review": "What stuck with me about the game:\n\n- Boss battles are fun\n- Humor is good\n- It's grindy as hell\n- You move like a turtle on a map that's giant\n- Combat is mostly fun \n- Health is useless, as you will get one shot most of the time\n- Clear lack of assistance in quests in terms of what the hell is the thing I need to build and where can I do that\n\nThe grindinness and the slow movespeed killed the enjoyment for me. However, I would still recommend it because the game is more good than not and you can see a lot of effort and affection went into it.\n", "timestamp_created": 1511316793, "timestamp_updated": 1511316793, "voted_up": true, "votes_up": 27, "votes_funny": 0, "weighted_vote_score": "0.769371688365936279", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "24155698": {"recommendationid": "24155698", "author": {"steamid": "76561198066290628", "num_games_owned": 0, "num_reviews": 32, "playtime_forever": 1201, "playtime_last_two_weeks": 0, "playtime_at_review": 1201, "last_played": 1467892557}, "language": "english", "review": "[h1] Highlights [/h1]\n\n+* Terrific pet system\n+* Vast, unique locations \n+* Plenty of content \n\n\n[h1] Positives [/h1]\n\n+ Nice, catchy music \n+ Less is more in terms of combat \n\n\n[h1] Negatives [/h1]\n\n- Too much delegation \n- Became repetitive especially the crafting system\n- Most quests feel more or less the same \n\n\n[h1] Concerns [/h1]\n\n-* Repetitive nature of the game caused me to drop it after 20 hours \n\n\n\n[h1] Consensus [/h1]\n\nCrashlands is a good game in any right and many would say it's even an improvement over Don't Starve which is an obvious source of inspiration for the game. But unfortunately, Crashlands just couldn't retain my interest for long enough and as much as I would have loved to finish the game it started to feel like a chore, so I'm afraid I just cannot reccomend this game personally, but for those that do enjoy it, play on. \n\n\n[h1] 6/10 [/h1]", "timestamp_created": 1467892994, "timestamp_updated": 1468015998, "voted_up": false, "votes_up": 40, "votes_funny": 0, "weighted_vote_score": "0.763085365295410156", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "33194359": {"recommendationid": "33194359", "author": {"steamid": "76561198048166412", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 37, "playtime_last_two_weeks": 0, "playtime_at_review": 12, "last_played": 1555763157}, "language": "english", "review": "Do Russian please. I think many people will support me, as translating each quest too long and not convenient!", "timestamp_created": 1499104185, "timestamp_updated": 1499104185, "voted_up": true, "votes_up": 41, "votes_funny": 3, "weighted_vote_score": "0.760794460773468018", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "48393709": {"recommendationid": "48393709", "author": {"steamid": "76561198015674650", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 164, "playtime_last_two_weeks": 0, "playtime_at_review": 164, "last_played": 1547777486}, "language": "english", "review": "This rating is based solely on the 2 player coop aspect of the game. Nothing more.\n\nI purchased this game because a friend and I were looking for a couch coop game. This looked right up our alley. However, upon playing for a couple hours I noticed this isn't a true 2 player coop game but instead a 1 player game with a 2 player sidekick. Let me explain.\n\nThe 1st player can craft, battle, die, equip and do everything in the game as it should be. However, the 2nd player can only battle and pickup items. He cannot partake in anything else especially crafting and equipping items to increase attack and defence. Also 2nd player cannot die but instead gets stunned. So the 2nd player has no fear of death, cannot equip anything, cannot craft...let's just say the second player has a long list of things he cannot do. In other words you're a side kick with limited functionality.\n\nI could see how this might be a good thing if you have a younger brother or sister who just wants to hang out with their older sibling and you don't want them causing problems. But if you have two serious gammers who want a piece of the action and all its glory this won't happen with this type of 2 player coop.\n\nIf Butterscotch Shenanigans changes the way the 2nd player partakes in the game, allowing for items to be equipped, giving the option for the second player to craft items and actually have a life bar and can die, I could see this being a great coop game. But as it stands it's childsplay.", "timestamp_created": 1547779328, "timestamp_updated": 1547779328, "voted_up": false, "votes_up": 61, "votes_funny": 2, "weighted_vote_score": "0.756773650646209717", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "46955617": {"recommendationid": "46955617", "author": {"steamid": "76561197995731156", "num_games_owned": 4359, "num_reviews": 3, "playtime_forever": 277, "playtime_last_two_weeks": 0, "playtime_at_review": 277, "last_played": 1519562190}, "language": "english", "review": "A Sandbox with a lotta heart, Crashlands places you as Flux with her trusty companion Juicebox on a mission to deliver a package.\n\nGameplay consists of collecting crafting ingredients, completing quests, exploring the world, battling beasts, taming pets & fishing. It's a blast and filled with a lot of light-hearted silliness.\n\nIf I have any complaints, it's that combat can be kinda tough, even on easier difficulty settings. I would've liked a more casual setting.\n\nI'd also strongly recommend checking out the documentry about the making of the game on youtube, too. It's quite a story, as one of the developers battled cancer throughit's development.", "timestamp_created": 1543166868, "timestamp_updated": 1543166868, "voted_up": true, "votes_up": 23, "votes_funny": 1, "weighted_vote_score": "0.750437438488006592", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "41705194": {"recommendationid": "41705194", "author": {"steamid": "76561197999088296", "num_games_owned": 509, "num_reviews": 27, "playtime_forever": 771, "playtime_last_two_weeks": 0, "playtime_at_review": 419, "last_played": 1642454479}, "language": "english", "review": "This game is awesome but after about 6-8 hours it becomes grindy. If this game had multiplayer I'd be playing it non-stop.", "timestamp_created": 1524772291, "timestamp_updated": 1524772291, "voted_up": true, "votes_up": 32, "votes_funny": 0, "weighted_vote_score": "0.748311638832092285", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "22991304": {"recommendationid": "22991304", "author": {"steamid": "76561198045047577", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 7543, "playtime_last_two_weeks": 0, "playtime_at_review": 7154, "last_played": 1632149149}, "language": "english", "review": "I really appreciate that the developers made this game to be fun, rather than a management nightmare.\n\n[h1]Two things I don't like in this genre: Starvation.  Limited inventory.  Neither of these is an issue here.[/h1]\n\nI generally don't buy a game for the writing, but I really love the writing here.\n\nEverything about this game says, \"These developers wanted to make something that's actually fun to play.\"  And they nailed it.\n\nSure, the mobile version is the same as the PC (minus the key bindings being displayed in the UI overlay).  That's not a problem.  The game is a solid hunk of enjoyment on either platform.\n\nAdded bonus: I have the most common form of color vision deficiency (deuteranomaly / deuteranopia, depending on severity), and their setting for that nicely turns the red target markers for enemy fire into blue ones, which contrast very well with the target markers for my pet.\n\nQuest / Crafting RPG, where all your stats come from stuff you make (if you include your pet in stuff you make).  Great writing.  No annoying maintenance work.\n\nBuy it.\n\nHeck, buy it for your phone, too.  You can link the two through their website, though I haven't done that.  But I did buy it for both platforms.", "timestamp_created": 1463284489, "timestamp_updated": 1481118854, "voted_up": true, "votes_up": 28, "votes_funny": 1, "weighted_vote_score": "0.74782562255859375", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "20699542": {"recommendationid": "20699542", "author": {"steamid": "76561197978610292", "num_games_owned": 0, "num_reviews": 66, "playtime_forever": 721, "playtime_last_two_weeks": 0, "playtime_at_review": 638, "last_played": 1486152655}, "language": "english", "review": "[i]\"Mix Battle Block Theater's humor, gathering in the spirit of Don't Starve and crafting designed by twisted minds.\nAdd to that bits of action rpg with the job of a space courrier expert in fixing alien environments/neighbouring problems... and you have Crashlands !\"[/i]\n\n\n\n[h1]Plot:[/h1]\nYour ship was destroyed during an urgent delivery, you play as Flux, a courrier who needs to return home as fast as possible if she wants to keep his job. But first, from noting but with the help of your fellow \"Juicebox\" you will have to gather, kill, figure out a way to leave the crazy alien planet you where forced to land on.\nAnd kick the ass of the dude who smashed your ship.... this is gonna be a long trip.\n\n\n[h1]Layout:[/h1]\nColorfull with a day / night cycle and many biomes, the game knows how to be appealing and varied. Flux, your hero, walks like a dummy and indeed (she admits himself) she has no elbows and knees. Monsters are cute creatures and i have to mention their offsprings to tame, a great addition.\nAll pieces of armor, weaponry are visible on Flux and effects of passiv and actif effects are nice.\nAlso enemies have hundreds of attacks that use various and pretty sprites.\nOnly different version of enemies doesn't change much except in size and subbtle shades of their respective colors.\n\nTo sum up Crashland is a pretty game:  designed like a comic where creatures and characters are enough ridiculous to be loved at first sight. Environments are very nice and the world is huge.\n\n\n\n[h1]Music and Effects:[/h1]\nMusic is quiet but very good. Slow paced, it makes the adventure much like a walk in an alien park than something.\nI really liked the yoghurt speech of characters and overall effects. Music and effects never bother you. For a game that will catch you during hundred of hours  it's a very good thing.\n\n\n[h1]Controls:[/h1]\nMaybe the most complicate thing to talk about especially because of the cross-platform feature.\nDesigned to be played on a tablet, on pc you only move/interact with your mouse and use few keys as menu/quickslots shortcuts. Simple enough, many tasks are automatic like building walls/floors in your bases, cutting or picking up item where you just need to clic one time. Also items have no durability so coupled with the clever self-managing inventory, it spare you millions of clics.\nBut in combat it's another story. Because of lack of movement keys, especially in the hardest difficulties, you will die alot due to miss clic on ressources or bad timed attacks. \nAlso consider that monsters always have attacks with area of effect so you can imagine how tight it can be. I want to mention the fact that all menus are excellents, crafting is easy and clear, map is perfectly clear too, also you can teleport at anytime to your base and other points of interrest.  Dialogues of quests and even datas about every monster you encounter are stored in a nice compendium.\n\nThe overall is very good and very easy to handle. Only combats can be tricky sometimes. \n\n\n[h1]Gameplay:[/h1]\nCrashlands takes from many games and does a great mix with its own personnality. \n\nYou will [u]farm, kill and grind during hours[/u] to get the required gear for every zone you will explore. Especially on Hard and Insane difficulties !\nVery soon you will need to be organized and cultivate restorativ plants, ressources and in general collect/gather everything. This aspect of the game is very important because every pieces of equipement you craft has a random chance to get one of the 5 qualities that varies from basic in white to epic in orange.\nThis difference is also in passiv armor and weapon effects that can trigger amazing bonuses like health leech or even berserker mod where your attacking speed increases.\n\nSo quite often (again in very high difficulties) you will be forced to farm and craft again and again sames items to be able to maximize your stats. Maybe another weak element of the game that should have been turned into a system where you can add more components during crafting and increase chances to get better qualities. You can still recycle your old gear to get some materials.\n\n[u]Combat[/u] is of course a huge part in the grinding imposed by the game. I was surprised by how vicious animals can be.\nI started in insane mode and to be honest i got owned so many times with different attack paterns, aggro or even the look of enemies, that i just felt a bit disguted. With very unaccurate controls for movements, many times i had to dodge attacks and instead Flux went to cut a bush/tree/ect....\nSo quickly i had to prepare fields and organize my ressources to aggro correct monsters and time my attacks/movements/ skills accordingly. Especially if you consider that every enemies have attacks with area of effects and marked radius/attack paterns shown on the ground. Note that depending of difficulty levels you will or won't be able to outmatch bosses with your equipement, making every boss fights epic... so indeed \"there will be something for everyone\".\n\nYou can also accept [u]quests[/u] from native aliens or  Juicebox (the robotic companion). Even if the tasks are often basics, it brings funny dialogues and many ways to expend your knowledge of the lore and crafting receipes. The more you take quests, the more you venture further on the planet. And it's a good thing because it brings some kind of \"direction\" in a game where the world and possibilities are enormous. Sometimes you can get receipes from enemies or ressources, making exploring and farming much more enjoyable. During night time new monsters appear giving you other receipes and challenges!\n\nAlso [u]dialogues[/u] are a delight, totally in the mood of Battle Block Theater, Crashlands brings a fresh air. Punning all the time and makes you laugh with weird situations. Nothing is serious and it's where the game shines above many.\n\n\n[h1]Life span:[/h1]\nCrashland is a long and interresting game. But be ware, you must be prepared to do some tasks often as what you can do in a game like Don't Starve but in a \"friendlier\" way. The only thing that might lack is a local or internet co-op mod.\nChallenge is decent and again there will be ways to play for everyones.\n\n\n[h1]Fun/Stress aspect:[/h1]\nEven if it can be difficult nothing is punishing or too important to bother you. You just enjoy and have choice to do things the way you want and at anytime. As an exemple, your base never gets raided or as promoted (and it's totally justified) your inventory manages itself. Even dying is not so hard because you just loose few items to forces you to walk a bit (the monster that killed you despawn leaving you chances to get your stuff).\nAlso you can teleport to your base and important locations at anytime and you don't need to feed, rest, ect your character. Food only serves to heal when you don't have passiv restorative effects on your armor or weapons.\n\nThe game and will only stress you because of movements with mouse during combats and forces you to do again an again what could have been easier... let's say more intuitive.\n\nCrashland is still amazingly funny and entertaining !\n\n\n\n\n[h1]TO CONCLUDE:[/h1]\n\nI've posted that this game was the one i was waiting for this year.\nAnd indeed, Crashlands is the gem i was waiting for. Balanced and easy to pick up on every aspects (expect movement with the mouse ARGH). Crashland is a good addition to a genre that stays a bit too serious and even punishing sometimes. A great part of the game is about grinding but quests, dialogues and possibilities are excellent.\nBuilding a house has never been so easy, taming beasts is interresting, fights are tight enough to makes you come back again and again. Crafting is deep and funny. The game is beautifull and ridiculous enough to surprise you at every encounter.\n\nAllready a classic.", "timestamp_created": 1453551879, "timestamp_updated": 1453623977, "voted_up": true, "votes_up": 34, "votes_funny": 4, "weighted_vote_score": "0.7369803786277771", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "28559854": {"recommendationid": "28559854", "author": {"steamid": "76561198068149445", "num_games_owned": 0, "num_reviews": 84, "playtime_forever": 36946, "playtime_last_two_weeks": 0, "playtime_at_review": 11902, "last_played": 1696800944}, "language": "english", "review": "This is a short and sweet review. If you like Don't Starve imagine it with unlimited inventory, quests, and rewards for reaching objectives or goals. Not to mention if you are on the go it sync's both achievements and gameplay flawlessly with your BScotchID login.", "timestamp_created": 1482497044, "timestamp_updated": 1531002713, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.732165992259979248", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "73479679": {"recommendationid": "73479679", "author": {"steamid": "76561198871898130", "num_games_owned": 730, "num_reviews": 95, "playtime_forever": 1244, "playtime_last_two_weeks": 0, "playtime_at_review": 883, "last_played": 1631904069}, "language": "english", "review": "Hey... Yeah... I'm gonna need a Crashlands 2. right now. Thanks.", "timestamp_created": 1596050770, "timestamp_updated": 1596050770, "voted_up": true, "votes_up": 27, "votes_funny": 8, "weighted_vote_score": "0.726077914237976074", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "28805580": {"recommendationid": "28805580", "author": {"steamid": "76561198216293485", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 25090, "playtime_last_two_weeks": 0, "last_played": 1675883887}, "language": "english", "review": "When I first saw this game, I thought it looked good. It had crafting, unlimited inventory space and the art style was quite appealing to me. It was a pleasant surprise to discover that I enjoyed this game a lot more than I expected. Not only it delivered a nice gameplay experience it's also packed with heavy doses of humor in every corner of the game, it's hilarious. In a few words this game is brilliant and silly fun. \n\nThe only setback I found was the walking speed of the main character. Since it's a crafting game you have to spend tons of time walking and collecting ingredients. With time, this experience can become a bit tiresome due to the slow walking speed. It was nice to discover that there are Face Huggers (from the Alien franchise) which can poison you and increase your walking speed considerably. Unfortunately, they're exclusive to the Bawg. Although a greater speed could make exploring and collecting more fun, I'm afraid it would break the game characteristic difficulty.\n\nThe game is hard, especially on insane mode, but oh it is so much fun. I have died hundreds of times and can't stop playing it. You can even craft a monument to your tenacity with all the gravestones you leave behind.\n\nNeedless to say, I Fell in love with the developer studio immediately. They have other games for android and iOS, go give them a try, they're free and are packed with the same humor and silly fun that you experience on Crashlands.", "timestamp_created": 1483047031, "timestamp_updated": 1483047031, "voted_up": true, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.725760936737060547", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "26960479": {"recommendationid": "26960479", "author": {"steamid": "76561197968497728", "num_games_owned": 1737, "num_reviews": 176, "playtime_forever": 1078, "playtime_last_two_weeks": 0, "playtime_at_review": 869, "last_played": 1455399049}, "language": "english", "review": "When I went into this game I didnt know what to expect.  I bought it for completely different reasons, than I buy any of my games.  I bought it simply because the story of one of its developers motivated me to do it and I wanted to support him.\n\nThis game is a mix of a crafting game and an RPG.  In summary its a lot of fun.  The story has its twists and funny remarks but it gets you going.  Specially if you are into crafting.  This game is the borderlands of crafting.  You can craft some really weird shit.\n\nThe cast of characters is interesting and engaging, specially the \"hero\" and his pet.  The world feels alive and engaging.  The ending is pretty spectacular for the type of game it is.\n\nGo buy it, you wont regret it.", "timestamp_created": 1479947205, "timestamp_updated": 1479947205, "voted_up": true, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.724077761173248291", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "56736463": {"recommendationid": "56736463", "author": {"steamid": "76561198030495389", "num_games_owned": 780, "num_reviews": 64, "playtime_forever": 5227, "playtime_last_two_weeks": 0, "playtime_at_review": 4943, "last_played": 1573542035}, "language": "english", "review": "This was one of the games in my backlog for forever. I had played it for 10 minutes and didn't understand the movement or what I was getting myself into.. Fast forward a year later, I'm playing this for 3-4 hours at a time, stacking quests, farming to max out gear, experimenting with different builds, farming materials, farming materials, farming materials, never running out of things to do. It's like comedic sci-fi Don't Starve with a great storyline.", "timestamp_created": 1573186756, "timestamp_updated": 1573186756, "voted_up": true, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.718207478523254395", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "67870515": {"recommendationid": "67870515", "author": {"steamid": "76561198066483596", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 4166, "playtime_last_two_weeks": 0, "playtime_at_review": 3961, "last_played": 1587880276}, "language": "english", "review": "This was going to be a positive review at <50 hours but the game has just gone for far too long, and at this point it just feels like work.  In dollars per hour terms the value is there, but I'm starting to feel like I'm wasting my life playing this.\n\nIt was interesting enough to begin with but then the patterns start to repeat.  When I thought I was getting near to the end there's a new map, the sprites have been replaced but it's the same thing again with higher numbers for the stats.  Then it happens again, but by this time I'm invested in finishing the game so I plod on, traipsing across miles of tundra searching for 30 pink ninkynonks so I can craft  a few pinkyponks and advance the story a bit.  Skipping all the dialogue because who cares anymore?  If there's another map after this one's over I don't know what I'll do.\n\nIf you're like me and won't stop until the game is finished, maybe it's best not to start.", "timestamp_created": 1587643007, "timestamp_updated": 1587643007, "voted_up": false, "votes_up": 105, "votes_funny": 23, "weighted_vote_score": "0.716934740543365479", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "32040644": {"recommendationid": "32040644", "author": {"steamid": "76561198158113684", "num_games_owned": 0, "num_reviews": 69, "playtime_forever": 3699, "playtime_last_two_weeks": 0, "playtime_at_review": 3699, "last_played": 1496334551}, "language": "english", "review": "This game definitely won't be for everyone. However, if you enjoy old school grindy point-and-click ARPGs, you're in luck! Personally I am finding it a lot of fun.\n\nThe core gameplay consists of exploring each biome, taking quests, grinding kills and harvesting resources to build ever-better crafting stations. Each monster has its own attack style with a special attack every so often, so combat revolves around basically having to learn how best to tackle each one.\n\nWhilst superficially the game bears some resemblance to Don't Starve, it is far more casual and forgiving. This may or may not appeal, depending on what you prefer. In Crashlands, death is not the end but rather a minor inconvenience; you respawn at your base, and get to retrieve your lost resources by visiting the site of your death.\n\nThe game has a very charming art style, a great soundtrack, and I find the dialogue funny and quirky. I can see why others might not enjoy it, though.\n\nCrashlands has more content than I was anticipating; at the time of writing I have played about 45 hours and have just reached the 3rd biome, so I think I'll easily hit 60 before I'm done with the main plot arc.However, I would say that the repetitive combat mechanics and the fact that each biome is visually new but is basically a remix of the previous in terms of mechanics is starting to lose its novelty at this stage - I thought after the Bawg that'd be the end of the game and I was just about ready for a finale, so a whole other biome was a surprise!\n\nOverall, if like me you enjoy ARPGs and don't mind stylised cartoony graphics, this game will give you hours of grindy fun. However, if you don't like the genre or find you prefer you games more with a darker, more serious setting and tone, then it's probably best to steer clear.", "timestamp_created": 1496061288, "timestamp_updated": 1496061367, "voted_up": true, "votes_up": 18, "votes_funny": 1, "weighted_vote_score": "0.715734779834747314", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "41137446": {"recommendationid": "41137446", "author": {"steamid": "76561197986937538", "num_games_owned": 767, "num_reviews": 16, "playtime_forever": 1857, "playtime_last_two_weeks": 0, "playtime_at_review": 1299, "last_played": 1521947155}, "language": "english", "review": "Pros:\n\n+ Cute Design\n+ Unique Asthetic\n+ Legitametly Funny\n+ Likeable Female Protaganist (Not a Mary Sue)\n+ Addictive Gameplay\n+ Base Building is actually fun and easy\n+ The \"Feel\" is responsive, everything you do, regardless of how small, feels like an accomplishment\n\nCons:\n\n- There are some parts that definetly feel like a grind\n- Some mechanics seem to be left unexplained\n- There are some quality of life improvements that could be made, for example, being able to access your recipes anywhere and being able to keep a secondary weapon always equipped (perhaps being able to assign it to the right mouse button, which as far as I know is not used in game)\n- Some graphics seem low res, which can certainly detract from an otherwise beautiful game\n- Areas are too samey, with little to no landmarks to make them interesting\n\nSummary: Very fun game, good mechanics, art and music, though suffers from issue with grinding, quality of life improvements, and repetive enviroments.\n\nOverall, I would recommend the game.", "timestamp_created": 1522353811, "timestamp_updated": 1522353811, "voted_up": true, "votes_up": 26, "votes_funny": 1, "weighted_vote_score": "0.71466982364654541", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "21473190": {"recommendationid": "21473190", "author": {"steamid": "76561198042913113", "num_games_owned": 0, "num_reviews": 283, "playtime_forever": 47, "playtime_last_two_weeks": 0, "playtime_at_review": 47, "last_played": 1456593040}, "language": "english", "review": "[b]Don't be fooled by the playtime, I've logged tens of hours on Android for this game.[/b]\n\n[h1]TL:DR You'd be hard pressed to find a game as rewarding and well-made as this one. [/h1]\n\n[b]There's crafting, survival, cooking, fishing, building, questing, and plenty else to do in this game. Crashlands is REALLY good, and each of its mechanics is so well done, you'll wonder why other developers hadn't thought to do it this way.[/b]\n\nFor the full review, I'm going to break things down by mechanics and features. New players will also be able to learn some useful tips about the game, by reading this.\n\nSo, let's start with:\n\n[b]Storyline and Gameplay[/b]\n\nFor starters, this game is pretty funny. It doesn't take itself seriously, and has jokes and humour littered througout. The thing is, it's all quite well done, and creates an enjoyable world to explore and discover. The characters you'll meet are often silly and entertaining, but not in any way that breaks immersion. Overall, it's very well done, and by doing the storyline quests and side quests, you unlock more recipes and ingredients to use to make your character even stronger. \n\n[b]Crafting[/b]\n\nThe crafting system in the game is very well done. There are different crafting stations for different tiers of equipment and tools. There are a lot of similarities between this system and Starbound, however this one ups that by offering ideas that make it easier to craft. One of my favourite features of crafting is the ability to track a recipe. Click \"Track\" then you'll see what ingredients you'll need to craft that item. As you collect the ingredients, you'll see how much you have, and how much you still need, in order to make that item. \n\nRecipes are another fun aspect of the game as you start with a bunch when you make a new station. You can also get new recipes from finishing quests. My favourite feature, however, is that you can get epic and legendary recipes from resource drops, mob drops, and fishing. It's very rewarding to kill an enemy and suddenly see a recipe box pop out. It could be anything from a new piece of furnature for your house to a legendary blueprint for a piece of equipment. \n\nCrafting is this games' killer app, and it really is killer.\n\n[b]Exploration and Map[/b]\n\nExploration in Crashlands is very similar to Don't Starve. You start at your pod, and as you travel further out, your map gets filled in, block by block. \nThe further away you get, the more interesting (read:dreadly) the enemies become. Then again, the greater the risk, the greater the reward. There are lots of interesting places to discover, and NPC locations are littered everywhere, which results in gaining new quests, learning more about the planet you've crashed on, and of course, more recipes and lot. \n\nIt also helps that the art style in Crashlands is wonderfully colourful, with lots of glowy things that light up the world in a myriad of colours. Exploration is FUN FUN FUN in Crashlands.\n\n[b]Cooking and Fishing[/b]\n\nAt a certain point in the game, you're going to gain access to a hearth for cooking, and later, a fishing rod for fishing. \n\nUnlike a lot of games that have fishing spots randomly appear in different places, fishing spots are permanent in Crashlands. That means you can place signs (assuming you've crafted some) at any spots you find, and come back to them every two hours. At one point, I was using signs to label sites on the map, but eventually the game one upped that by giving me a recipe for an item that creates fishing spots in any body of water I choose. \n\nLet me remind you, fishing spots are pemanent, so these items were a Godsend, as fishing is not only very rewarding, it's also very enjoyable. Add to that the fact that you can also gain legendary items and recipes from fishing, and you have a system that will keep you coming back for more. \n\nFishing spot cooldowns will continue to count down, even when you're not playing the game, so long as you haven't left the game paused. Pausing the game and leaving it, unfortunately, also pauses timers. Bummer for sure, but this can be avoided by simply exiting the game when you walk away from it. The game saves everything automatically, so you won't lose anything by doing so.\n\nAs for cooking, when you use the hearth, you'll have a bunch of recipes for potions. Potions provide health, speed, resistences, etc. There are all sorts of boosts and benefits from potions, so you'll want to pursue that, when the hearth comes available. \n\nQuick tip: There's a quest, not long after you get the hearth, that'll allow you to make really good health potions out of fish and stone. If you have a rod and a hearth, but not this recipe? Do some quests, it's worth it... so worth it.\n\n[b]Building[/b]\n\nBuilding is another great feature in this game. It's extremely simple to get some building supplies, then activate build mode which will allow you to click (or tap) anywhere on the screen to place that item. \nAdditionally, each building type is seperated into function. Floors have their own section, so it's easy to select that item set, choose a floor type, and just start pasting those floor tiles down the way you want. \nVegetation (farming... yes, this game TOTALLY has farming) is another section, and you can plant your seeds, and place potted plants which can both be harvested after a 15 minute cooldown. \n\nAgain, cooldowns will continue to count down while you're out of the game, so be sure to check back on your farms, from time to time. \n\n[b]Animal Taming[/b]\n\nHere is perhaps one of my favourite features of Crashlands, you can have pets! Pets serve two features. First, you can feed your pets to harvest resources from them. These resources can be used in certain recipes, and often come in really handy. \nThe second function, and perhaps the most important, you can take one of your pets out with you while you explore. They'll fight for you, while they keep you company. Additionally, they're invincible, so you don't need to worry about them getting killed by other baddies. They also don't need to be fed to stay aline, feeding is only something you do when you want to... milk them... \n\nHow about one more awesome point of keeping animals... Well, you can also unlock recipes for items that will cause your animals to permanently evolve into larger and more powerful versions. Each animal has multiple stages of growth, each one making them bigger, stronger, and look cooler, each time. \n\nYou should get an egg drop for each enemy type, shortly after you've crafted a station that can make that animal's nest. \n\nKeeping animals is absolutely worth it, in this game.\n\n[b]Looting and Inventory[/b]\n\nThere's loot... lots and lots of loot. When you kill creatures, fish, harvest resources, etc, you'll get showerd with items and materials. The key point here is that there is not traditional inventory with a sprawling list of things you have and don't have. The inventory system manages all of that for you, and there is NO LIMIT TO INVENTORY SPACE. As you pick things up, they will scroll by discreetly on the left, along with a number in brackets which indicates how many you have in total. \n\nThe inventory system in Crashlands is another one of those features that makes you wonder why it has taken so long for a developer to think of it. It's clean, efficient, simple to figure out, and cuts out all the mess of traditional inventory spaces.\n\nAs mentioned before, all enemies, resource points, and fishing have a chance of dropping some epic items, so there will be a lot of \"OMG That's AWESOME\" moments in your adventures with Crashlands. \n\n[b]Summary[/b]\n\nSeems I'm at the word limit for this review, so let me just sum it up by saying, Crashlands is one hell of a good game. It aces its presentation, mechanics, sense of rewarding, and enjoyment. If you haven't purchased it yet, do yourself a favour and get in on the fun.", "timestamp_created": 1456488604, "timestamp_updated": 1456488632, "voted_up": true, "votes_up": 36, "votes_funny": 3, "weighted_vote_score": "0.7129097580909729", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "50254417": {"recommendationid": "50254417", "author": {"steamid": "76561198080387397", "num_games_owned": 1287, "num_reviews": 70, "playtime_forever": 6555, "playtime_last_two_weeks": 0, "playtime_at_review": 6427, "last_played": 1558294126}, "language": "english", "review": "This game is amazing, with actually funny dialog and tons of content; gameplay-wise, it's what I wanted Don't Starve to be. Played through twice so far, once on explorer story mode and once on challenger story mode. My only criticism is that I would love to reuse the death direction indicator to track anything on the map; it would have saved me the hours spent circling around basically every destination.", "timestamp_created": 1555866878, "timestamp_updated": 1555866878, "voted_up": true, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.711217522621154785", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "42287404": {"recommendationid": "42287404", "author": {"steamid": "76561198064814693", "num_games_owned": 0, "num_reviews": 34, "playtime_forever": 2675, "playtime_last_two_weeks": 0, "playtime_at_review": 2675, "last_played": 1527358521}, "language": "english", "review": "People aren't wrong when they call this game grindy, but I found it very satisfying. \n\nIt's got witty writing, tons of stuff to gather, build, craft and unlock and the progress feels very satisfying.", "timestamp_created": 1527358628, "timestamp_updated": 1527358628, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.706923604011535645", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "29425603": {"recommendationid": "29425603", "author": {"steamid": "76561198047017985", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 1853, "playtime_last_two_weeks": 0, "playtime_at_review": 1244, "last_played": 1485878556}, "language": "english", "review": "like Don't Starve but:\n\n- No Survival\n+ Pets\n+ More Battles\n+ More RPG\n+ More Quest and Story\n+ More Equipment\n+ More Jokesssssss\n+ More Crafting\n+ No Inventory Management\n+ Sync with mobile version seamlessly\n", "timestamp_created": 1485102363, "timestamp_updated": 1485102363, "voted_up": true, "votes_up": 18, "votes_funny": 5, "weighted_vote_score": "0.705797851085662842", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "27485082": {"recommendationid": "27485082", "author": {"steamid": "76561197966446818", "num_games_owned": 0, "num_reviews": 87, "playtime_forever": 5775, "playtime_last_two_weeks": 0, "playtime_at_review": 3501, "last_played": 1493994232}, "language": "english", "review": "It reminds me of a sci-fi version of 'Don't Starve' -  Very similar mechanics, but without a lot of the tedium like inventory management.  May be because it's also a mobile game, so they did away with a lot of the extra button/menus.  And it's truly cross-compatible.  I play it on my PC, got to go to the bathroom, bring the tablet or cell phone and play it there.  The game keeps everything sync'd up.\n\nLoving it so far.\n\nEdit:  Wow, this game is amazing and with the addition of WASD and Gamepad support it's even better.  Thank you!\n\nAnd now the ability to re-roll weapons/stats is amazing. Perfect, thanks again.  I've played for 48 hours and have just started the 3rd biome.  The story and environment is good enough to keep the game from getting stale, in my opinion.  Sometimes I don't want anything intense or punishing, I have plenty of roguelikes for that, and this game is just a great title to play and advance in while progressing through a great story.\n\n\nIt's like \"Don't Starve\" but not depressed.", "timestamp_created": 1480089517, "timestamp_updated": 1481045018, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.69088512659072876", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "20659395": {"recommendationid": "20659395", "author": {"steamid": "76561198016432675", "num_games_owned": 1509, "num_reviews": 484, "playtime_forever": 835, "playtime_last_two_weeks": 0, "playtime_at_review": 835, "last_played": 1453350743}, "language": "english", "review": "[b] Target Audience: [/b] [I]  Diablo like players [/i]\t\n\n[u] Summary: [/u]\nCrashlands starts out of the gate with a good sense of humor, and takes you on an adventure that I enjoyed despite some of my problems with it. The game is very basic in the action RPG genre, and it shows some of its mobile elements (as the game is also available on mobile devices) with some of the control elements and mouse drive controls. With that said, the combat can give a challenge with its sorta give and take gameplay, and it's complemented by a crafting system that has some depth to it. It's a game that took elements that I normally don't enjoy, like “home building” systems, and made them enjoyable for me. It's got a good sense of humor with its small jabs and wit here and there, and the game comes together well as an overall package to deliver a fun experience. I've got 10+ hours in it, but I've seemingly only scratched the surface, as while the game can get repetitive, it definitely delivers on the content in terms of items to collect and craft. Whether it be on Steam or on the mobile platform (if you have something like a Galaxy Tablet, it definitely works well there) (and there's cross platform play), Crashlands is a fun time all around, and is best suited for the kind of adventuring player that wants to take in the sights, and enjoy the trek along the way. \n\n[b]  Video Review: https://youtu.be/VfIkIobolnA[/b]\n\n[u] Lists: [/u]\n[b]+:[/b]\n[list]\n[*] The game is a sum of it's parts. Every element of the game, even the elements that I find to be negatives, work well together to make the game a sum of its parts. Picture a set of gears working together to power something. That's this game. \n[*] Building system is very easy to use and easy to rearrange things with. Very straight to the point, and gets the job done without over complication.\n[*] Like the crafting system, especially with the weapons element. Multiple attempts makes sense for weapons and armors due to rewards of higher calibur weapons. Gives reasons to recraft and recraft.\n[*] Boss encounter and high amounts of enemies in one area definitely bring a strong impact. Surprisingly difficult at times, even at the normal difficulty. \n[*] Pets actually make a reasonable difference in battle, especially the bigger ones. They aren't just there for show. \n[*] There's a lot to do. You can spend a lot of time just exploring to get more items to craft with, and finding new schematics and what not. Those wanting to just get lost in minecraft like elements will enjoy themselves here. \n[*] Game's combat does have a sorta fencing like style to it, and can be challenging in some aspects. Simple, and straight forward, but it works despite its flaws.\n[*] Like the fact that there's cloud saves that works cross platform. Those wanting to do both will enjoy the fact that this seems pretty straight forward.\n[*] Sense of humor that knows the power of subtle touch, and not banging you over the head with the joke. It's obvious the developers had fun creating this game from the ground up, and it shows with the execution. Little things like the big baddie showing up out of nowhere to zap the tree I was about to chop down made things a bit more interesting. \n[*] Great aesthetic. Enemy designs are nice and actually feel a little fresh compared to other games in the genre, and yet still have some familiar aspects to them. Good color choices as well. \n[*] Like the items that were designed to collect items via bombs. Smart. \n[*] Performance is there. Never dropped under 60 FPS under normal conditions, and even when my machine was doing other significant tasks, it held on to it then too. The machine is up there in terms of specs, but still was surprised. \n[/list]\n\n[b]-:[/b]\n[list]\n[*] Game suffers in control areas, most likely due to its mobile counterpart. It will take some adjusting, especially in tight gameplay areas where its easy to click on something in the middle of battle. \n[*] Would want to see some better menus and quest tracking. Having some information on the main screen about your next objective would have been appreciated. Some hints on where to get certain materials will go over some players heads.\n[*] Wanted more hotkeys honestly. Understand the simplicity and the mobile portion, but 4 hotkeys made switching things in and out for easy a little bit more trouble some that it was worth. Especially with the fact that you can't switch items in battle.\n[*] Game will get repetitive for some, as while there are things to change it up, combat will be against a lot of the same enemies early, and there's fetch quests. Some map legend elements would have helped this.\n[*] The map implementation can be very annoying, as your natural reaction is to click to drag the map, only to have you teleport to the nearest teleporter.\n[*] Those looking to have their hand held in terms of what to do with quests and items to find will not enjoy elements of this game. Reading quests information and looking at items to determine what you need to is required. \n[*] Would have liked to see the options menu be available from the pause menu, as opposed to only via the title screen.\n[*] On a side note, it reminds me how badly I am at interior design.\n[/list]\n\n[b] If you want more reviews/information regarding games I've reviewed, visit my curator. [url=https://store.steampowered.com/curator/6861768/]Dragnix Curator [/url][/b]", "timestamp_created": 1453381259, "timestamp_updated": 1610649071, "voted_up": true, "votes_up": 64, "votes_funny": 7, "weighted_vote_score": "0.69065403938293457", "comment_count": 4, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "20659783": {"recommendationid": "20659783", "author": {"steamid": "76561197983534069", "num_games_owned": 880, "num_reviews": 10, "playtime_forever": 1831, "playtime_last_two_weeks": 0, "playtime_at_review": 948, "last_played": 1480653635}, "language": "english", "review": "Crashlands is some of the most genuine fun that I've had with an adventure / exploration game in a very long time. Definitely gives me the feelies that I had as a kid playing something like the original Zelda. Tons of personality and attention to detail. Absolutely love the soundtrack as well. \n\nCan't wait to sink my teeth into even more Crashlands.", "timestamp_created": 1453382871, "timestamp_updated": 1453382889, "voted_up": true, "votes_up": 34, "votes_funny": 2, "weighted_vote_score": "0.690091550350189209", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "137243536": {"recommendationid": "137243536", "author": {"steamid": "76561198857647860", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 172, "playtime_last_two_weeks": 0, "playtime_at_review": 172, "last_played": 1682286157}, "language": "english", "review": "Great start and potential that quickly goes downhill. Way too repetitive. Too much grinding with very little reward. \n\nThe story looked like fun in the first 30m but I quickly lost interest as I kept doing the same thing over and over again. It's not clear what  the main story line quests are and what are just side quests. Which is important because the side quests are not very rewarding. Running around for 10-20m collecting material to craft something for the quest to finally receive a decorative item !? (the wombat statue)\n\nThe crafting is a bit soulless. There are many items that seem to be decorative only (pillow, flowerpots, balls, lamps etc) or just an iteration of the same thing (sword level 1, 2, 3, 4...). You have things like wooden walls, but nothing attacks your home ever. \n\nThe terrain is also a bit boring, looks like random generated, but there's little variation, basically all flat, not much other than creatures and material spread around randomly, the farther you go, the tougher and better.\n\nAfter just 2h I could not care less if these folks got stuck on that planet forever... :) Luckily I bough this on a sale.", "timestamp_created": 1682367699, "timestamp_updated": 1682367699, "voted_up": false, "votes_up": 34, "votes_funny": 5, "weighted_vote_score": "0.687678039073944092", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "136721923": {"recommendationid": "136721923", "author": {"steamid": "76561198001151065", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 2185, "playtime_last_two_weeks": 0, "playtime_at_review": 2185, "last_played": 1647376919}, "language": "english", "review": "Yes. A million times yes. Just buy it if you haven't.\n\nPositives\n-Inventory. It's rare that I get to say this, but I love Crashland's inventory system because... well, you don't have to manage it. Acquired materials are simply tracked. Inventory management is basically just restricted to equipment, and this is fine.\n-Combat. Challenging combat with a relatively simple interaction loop makes for generally enjoyable combat. Death is expected, but it's trivial to run back and grab your stuff. The monsters are super interesting and in no way feel contrived.\n-Story. Although there isn't a TON to the story, it's humorous, and it drives the player's motives. Expect to chuckle a lot and feel a general sense of forward motion. The protagonist is hilarious, the antagonist is hilarious, your assistant is hilarious, every NPC you meet is hilarious.\n-Crafting. Tiered crafting systems basically depend on style, and boy does this game have a lot of style. Every time you move up a tier feels good -- what weird, gross things do I get to make now? The sheer amount of crafting stations is mitigated by the fact that you'll WANT to know what comes next.\n-Graphics. The graphics are stylistic and neat. You won't see anything like these graphics elsewhere, and they're gross and enthralling and great. Can't get enough of it.\n-Environment. There are three distinct worlds, and they're all a lot of fun to explore, complete with their own creatures, materials, inhabitants, and quests.\n-Platform. I LOVE THE FACT that I can sit at my computer and play, save it to the cloud, then jump in bed and play the same world on my phone.\n\nNegatives\n-Uhh... nothing. I mean, I guess if I had to pick one thing, I wish the game were longer. Yeah... that's it.", "timestamp_created": 1681536995, "timestamp_updated": 1681536995, "voted_up": true, "votes_up": 19, "votes_funny": 3, "weighted_vote_score": "0.687592506408691406", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "122285505": {"recommendationid": "122285505", "author": {"steamid": "76561197966550596", "num_games_owned": 1129, "num_reviews": 153, "playtime_forever": 2195, "playtime_last_two_weeks": 0, "playtime_at_review": 174, "last_played": 1663874449}, "language": "english", "review": "Crashlands isn't a bad game, I just can't recommend it personally. It looks nice, it's funny, and I really like the idea of merging casual crafting with exploration and ARPG elements. The problem is that each of those three things is super shallow in Crashlands and WAY too drawn out. Even though it shares a lot of similarities with Don't Starve this is extremely not that game. There's no sense of urgency and no survival elements. This essentially boils down to there never being any tension when exploring and no reason to really build anything other than what's needed for quests. I like that there's combat but it's VERY simple with extremely basic enemies. You can move and attack and that's about it. And the idea of rolling random rarities on equipment you craft is cool but it ends up just forcing you to grind for more materials so you can craft things over and over again to get a good roll which just plain isn't fun. On top of that exploration is never rewarding. It's just the same randomly generated landscape bits filled with the same enemies for what feels like miles. I've yet to find anything truly unique or weird or interesting in the world. You just sort of pick a direction and walk until you get bored.\n\nUltimately there's nothing about Crashlands that doesn't work. It's a well made game but it just feels like every mechanic was put in there to drag things out as long as possible. It just does nothing to hold my attention or make me think putting 40+ hours into will be worthwhile.", "timestamp_created": 1663264115, "timestamp_updated": 1663264115, "voted_up": false, "votes_up": 18, "votes_funny": 2, "weighted_vote_score": "0.686489462852478027", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "76090200": {"recommendationid": "76090200", "author": {"steamid": "76561198005611507", "num_games_owned": 4415, "num_reviews": 149, "playtime_forever": 914, "playtime_last_two_weeks": 0, "playtime_at_review": 791, "last_played": 1600382931}, "language": "english", "review": "Fun little crafting game, similar to Don't Starve but no food mechanics.", "timestamp_created": 1600292345, "timestamp_updated": 1600292345, "voted_up": true, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.684555411338806152", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "45227130": {"recommendationid": "45227130", "author": {"steamid": "76561198305445778", "num_games_owned": 58, "num_reviews": 12, "playtime_forever": 2349, "playtime_last_two_weeks": 0, "playtime_at_review": 2235, "last_played": 1548768408}, "language": "english", "review": "Not gonna lie, this game is super grindy but also fun at the same time. The game offers over 40+ hrs of content so i highly recommend it.", "timestamp_created": 1539320716, "timestamp_updated": 1539320716, "voted_up": true, "votes_up": 16, "votes_funny": 1, "weighted_vote_score": "0.684536218643188477", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "76939335": {"recommendationid": "76939335", "author": {"steamid": "76561198307832415", "num_games_owned": 4481, "num_reviews": 70, "playtime_forever": 4596, "playtime_last_two_weeks": 0, "playtime_at_review": 4596, "last_played": 1566729843}, "language": "english", "review": "Let me start by saying I have played and enjoyed every single game that Butterscotch Shenanigans has ever released up until levelhead. I haven't gotten around to that one yet thanks to an epic backlog (that i know will never be complete). These guys are really great developers though. The story of the company is pretty inspiring if you ever get around to checking them out.  \n\nWith that said, this is the best survival/crafting/action rpg I've ever played. It's like Don't Starve except everything that annoyed you from DS has been removed and replaced. Your companion is a robotic moving cargo carrier so item storage is not an issue and instead of just struggling to survive as long as possible you are looking for new enemies to kill to get better equipment or searching a new biome for a new resource. The entire game is set up to be very user friendly. If you have it on mobile you can link your Butterscotch ID and switch seamlessly from your pc to you phone and it has perfect controller support. Overall 9/10. If it had vehicles it would be 10/10.", "timestamp_created": 1601684072, "timestamp_updated": 1601684072, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.683880031108856201", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "28225005": {"recommendationid": "28225005", "author": {"steamid": "76561197977549587", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 791, "playtime_last_two_weeks": 0, "playtime_at_review": 200, "last_played": 1663245376}, "language": "english", "review": "Having played this game for... I don't know, 30 hours on mobile? I LOVE it. It's definitely better on PC though.\n\nEssentially, you crash land on a planet. It's point-and-click movement similar to Diablo or Torchlight, and you simply click on enemies once to start attacking repeatedly until they're dead. You can't do this for long though, because they WILL attack and probably kill you, so after one or two attacks you need to run away to dodge an attack, and then run back to whack them again a few times.\n\nThe RPG/Stat upgrade system goes like this (and it's very similar to Don't Starve in some respects): Gather a whole lot of Wood/grass. Build a workstation. That workstation gives you blueprints for a Helmet, Gloves, Body armour, and a weapon, sometimes even a pickaxe or saw for gathering. You also get furniture to build, as well as the next Workstation you need. \n\nYou go out and gather the required ingredients from dead enemies and the environment, come back, make your armour and weapons, and you're now a bit stronger. If you remake them, you have a chance of getting a better version (common, uncommon, rare etc.) with better stats, so re-making items can be worthwhile if you have the resources spare. Eventually, you make your next Bench, and the cycle continues all over again.\n\nYou also have missions. Lots of missions. It's virtually impossible to explore the whole world unless you really really don't have anything better to do. It's huge. And there are multiple \"worlds\" each. This is a LONG game. Missions usually include killing something, making something, or fetching something. Surprisingly, it actually is a lot of fun. \n\nYour weapons are all Melee, but you can get quick-use items, like a poison dart blower, something that makes you move faster, etc. and they're all on cooldowns so you can't spam them. You also craft explosives and potions with varying effects. If you're lazy (and you will eventually become lazy) you can make a garden with your most commonly needed ingredients (cutting down trees gives you seeds which you can then plant and repeatedly harvest). This is handy for making potions, of which you will need thousands.\n\nI realise this is more of an explanation of the game rather than a review, but you really have to try this game to understand its brilliance. It is just SO fun you have no idea. Don't hesitate to buy it - I bought it twice, and on PC the mouse movement is so much quicker and precise, plus a big screen means you can see more terrain.\n\nFor what it is, I give this game an 8.5/10.", "timestamp_created": 1481054689, "timestamp_updated": 1481054689, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.680152773857116699", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "20881455": {"recommendationid": "20881455", "author": {"steamid": "76561198047406784", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 1619, "playtime_last_two_weeks": 0, "playtime_at_review": 1092, "last_played": 1530340373}, "language": "english", "review": "Has a funny story, a crap load of stuff to kill, collect, and craft. Love how everything you pick up it has use later on in the game as you play.", "timestamp_created": 1454274330, "timestamp_updated": 1454274330, "voted_up": true, "votes_up": 18, "votes_funny": 6, "weighted_vote_score": "0.678433775901794434", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "20758578": {"recommendationid": "20758578", "author": {"steamid": "76561197998752254", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 1392, "playtime_last_two_weeks": 0, "playtime_at_review": 1276, "last_played": 1455754537}, "language": "english", "review": "Things I love:  Roguelikes\nThings I love:  Hitting stuff with a sword FOREVER\nThings I love:  Weird humor\nThings I love: Exploration games\nThings I love:  Crafting\n\nBasically, this game is incredible.  Butterscotch Shenanigans have managed to snag the best parts of roguelikes, of exploration/crafting games and of diablocore hack-n-slash while simultaneously ironing out the headaches:  teleport pads, retrievable inventory on death, trackable recipes and a dozen plus a hundred other goodies make this a refreshing and rewarding experience.\n\nThe Coster brothers have a bit of an idiosyncratic sense of humor about them, and the dialog, art and story in the game all work together to provide plenty of character and laughter.  Just wait til you get to the second biome.\n\nIf you are reading this review then you've already committed enough time to thinking about the game, JUST BUY IT ALREADY.", "timestamp_created": 1453774537, "timestamp_updated": 1453774537, "voted_up": true, "votes_up": 36, "votes_funny": 5, "weighted_vote_score": "0.674796223640441895", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23280616": {"recommendationid": "23280616", "author": {"steamid": "76561198004419232", "num_games_owned": 177, "num_reviews": 65, "playtime_forever": 5140, "playtime_last_two_weeks": 0, "playtime_at_review": 4077, "last_played": 1613339362}, "language": "english", "review": "[b]You might like if:[/b] You think a Don't Starve / Terraria mash-up is a brilliant idea. Or if you've never heard of those games... You want to unashamedly wander the wilderness, beating things up.\n\nThey have Baconweed\n\nTHEY HAVE FREAKING BACONWEED\n\nIt's like a weed... but it's made of bacon\n\nOk, I appreciate that did very little in selling the game to you. But what it does tell you is how seriously Butterscotch Shenanigans takes their game...\n\nAnswer: Not very\n\nWhat we have here is the aim to take out everthing tedious from world-sprawling RPG's... and just make them all about [i]fun[/i]. So the guys blasphemously ripped out many of staples we're sick of... Letting us focus on the important things: Beating up the local wildlife and collecting stuff to make bigger stuff to beat up bigger local wildlife. So we no longer have to manage an unweildy inventory and angrily raid about 50 chests for that 1 item we know we picked up somewhere, but likely left in an outpost in God-knows-where (yay). The map is littered with teleporters that let us hop around the place on a whim (yay). And if you die, you can just go back, pick up your stuff and carry on (yay)\n\nOn the surface, this might seem worrying. By removing all this, does it leave a rather shallow game? Not really. What it ultimately does is make it exceptionally approachable and give you the freedom to muck about and just... enjoy it. Seriously, I could just mill about the Savannah for ages - it was just so relaxing. That's not to say it's easy (you will die... a lot), but it's laid back and easy to dip into.\n\nThe only real weak point is the armour crafting. Basically, your kit will randomly have special effects when you craft them (poisoning, going berserk, resisting damage...) - but it cannot be carried over when you upgrade. This sucks big time, as you'll repeatedly end up with Excellent Level kit... then have to forge like 30 items of the next level in the hope that one of them will actually have bonuses worth upgrading to. And you're forced to upgrade A LOT (the enemies scale quite dramatically). It ironically adds a lot of tedium to a game hell-bent on removing it. It's frustrating and can detract from the enjoyment - but there is at least enough enjoyment to be had to mitigate it to a degree.\n\nOther than that though, it's great fun! The combat is reminiscent of the old Mega Drive platformers: Studying the attack patterns and finding the sequences to best get a hit in. The pets are an inspired (and fun) addition and the writing is utterly wonderful. It's cheeky, playful and there are tons of laugh-out-loud moments to be had. The characters are brilliant and the item descriptions equally funny. The end is charmingly sweet and rounds it off perfectly.\n\nAll I can echo is the same thing I said to my partner smack-bang during my first boss fight: \"Holy crap this game is so cool!\" - (then buying her a copy immediately after)\n\nLittle tip... pay attention to the names (especially the Polari) - They snuck in a lot more jokes than meets the eye...", "timestamp_created": 1464556744, "timestamp_updated": 1491149596, "voted_up": true, "votes_up": 72, "votes_funny": 65, "weighted_vote_score": "0.67073369026184082", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "20659527": {"recommendationid": "20659527", "author": {"steamid": "76561198022611454", "num_games_owned": 212, "num_reviews": 1, "playtime_forever": 13418, "playtime_last_two_weeks": 0, "playtime_at_review": 8138, "last_played": 1499588316}, "language": "english", "review": "Best and most sassy award 2016 Crashlands in a unique game with a wicked sense of humor you won't find anywhere else. Between awesome quests and hilarious dialogue there's hours of entertainment waiting to be found. Sam's art style is fantastic, and if you haven't heard the backstory to how this game came to be, track it down and find out. You won't be disappointed and a lot of this nonsense will make some semblance of sense. Cannot recommend this enough. Fantastic Job, Bscotch Bros!", "timestamp_created": 1453381838, "timestamp_updated": 1453381838, "voted_up": true, "votes_up": 56, "votes_funny": 10, "weighted_vote_score": "0.66885298490524292", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "45951003": {"recommendationid": "45951003", "author": {"steamid": "76561198020755818", "num_games_owned": 3073, "num_reviews": 4, "playtime_forever": 420, "playtime_last_two_weeks": 0, "playtime_at_review": 236, "last_played": 1550899000}, "language": "english", "review": "I play this more on iPad, but I love how I can swap my game over to PC. The devs keep adding to the game, including permadeath and couch co-op now. Play gets repetitive, but sometimes I want to pick something up that's mindless fun.", "timestamp_created": 1542826001, "timestamp_updated": 1542851480, "voted_up": true, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.667033493518829346", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "35622094": {"recommendationid": "35622094", "author": {"steamid": "76561198106810465", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 8837, "playtime_last_two_weeks": 0, "playtime_at_review": 8557, "last_played": 1607719353}, "language": "english", "review": "Amazing game, the story is hilarious and the infinite inventory makes exploring so much better. \nLatest update implemented all the weapons in every workbench and the all feel so different it's amazing!\nFinished the game 3 times now (normal, hard and insane) really nice to come back to the game once in a while. Now they added hardcore mode YODO (You Only Die Once), really cool to play and nice because you're not slowed down by the story (because it isn't there). \nAlso there is creative mode but I don't really spend time in there. \nWASD- control is really nice inplemented, but before that was implemented only using the mouse worked fine too.\nOverall amazing game and can't wait for their other releases. \nAlso the extra quest you get for playing their other games makes it even more fun! :)\nNow with Couch Co-op Really excited to try it :D", "timestamp_created": 1507655953, "timestamp_updated": 1543085419, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.661636292934417725", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "41040215": {"recommendationid": "41040215", "author": {"steamid": "76561198055357312", "num_games_owned": 0, "num_reviews": 47, "playtime_forever": 1984, "playtime_last_two_weeks": 0, "playtime_at_review": 1368, "last_played": 1686678387}, "language": "english", "review": "Good game with a tongue-in-cheek story, but you need to like grinding for better gear to enjoy this.\nComplete story and side missions, build a house, own and battle with pets, fish, grind for better and better gear..\n\nI feel like there needs to be something outside of the story to keep me playing / wanting to grind, like being able to play/battle with friends. Also there's no real point in having a house, would be cool if there was a threat to your house and being able to place defenses, to add a layer to the game and make it more of a survival feel.\n\nRecommended when on sale.\n\nEDIT: with the addition of a hardcore mode from the 1.3 COMBOver update, the game deserves another review. Hardcore mode has quicker and cheaper crafting, minimal story dialogue and along with making the grind quicker makes it much more worthwhile because you only have one life and when you die the save is deleted. This makes better gear and picking your battles even more important. The only catch is you have to unlock the mode by progressing through the story to a certain point. The other QoL patches in the update are also a welcome addition.", "timestamp_created": 1521979111, "timestamp_updated": 1530936957, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.661516308784484863", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "20761188": {"recommendationid": "20761188", "author": {"steamid": "76561198070325925", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1333, "playtime_last_two_weeks": 0, "playtime_at_review": 660, "last_played": 1645650698}, "language": "english", "review": "i will say it like i told my friend when i first started playing it(and put 9 hours into the first test run before i could rip myself away from it)\n\nthis is the dont starve i always wanted... (no no hunger/sanity bars to worry about ..exactly) \n\ncrashlands... this was a must buy for me being a fan of crafting adbenture games though i dident expect it to be so addictive... \n\ncrafting is fun exploreing and gathering to unlock new recipes completeing side quests to unlock more (tons of side quests) got a river to cross? pop into build mode and lay some floors problem solved no more inpassable omg gotta come back later maybe forgetting that chest on the tiny iseland moments.... progression dosent feel slow or stale surprizing again and when you do progress its noticable when you dawn your new tier or gear (randomly generated bonus' +lightening damage +resistance +godlike???) the random stat boosters on gear is a interesting concept could give you godlike gear or gear thats worse then your current gear even crafting random legendary gear its pretty rewarding and interesting...\n\ncombats not just wack that dude while standing there .. you have to move or get whomped and die fast .. this is interesting too because you can tackle much harder enemies and still have a chance to live aslong as you avion their attack lines (wich are shown  as red squars circles or lines on the ground) combat can be as easy or challangeing as you want depending on your style of play....\n\noverall first impression is if your a fan of the genre this is a great addition to your library fun addicting and aparently has quite a bit more then it apears to have on the surface (30-100 hours of play time from what i have read)\n\nhighly reccomended", "timestamp_created": 1453790872, "timestamp_updated": 1453790872, "voted_up": true, "votes_up": 20, "votes_funny": 3, "weighted_vote_score": "0.660315394401550293", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "54445454": {"recommendationid": "54445454", "author": {"steamid": "76561198028200093", "num_games_owned": 1181, "num_reviews": 100, "playtime_forever": 1705, "playtime_last_two_weeks": 0, "playtime_at_review": 1320, "last_played": 1564959719}, "language": "english", "review": "the biggest crime this game made is being dull.\n\nso i got this game on sale thinking hey it's a survival/building kinda game. i enjoy these sure i'll get it!\nstart up the game. great titlesong listened too it for like 20minutes before i even started playing.\ndisapointed only good song in the entire game. shame really.\n\nanyway, so i started playing and it seemed fine at 1st. a few hours in i get anoyed by the combat system. your character is pure melee. i'm fine with melee but sadly it's really really bad. its the point and click kinda melee the stuff you used 20 years ago. \ntoo be in melee range is like standing on top of your enemy and guess where you don't want to be? right on top of the cnts.\n\nyour character walks on a snails phase and with how far the camera is zoomed out it makes it feel even slower. your forced to spec into movement speed to feel like youre going somewhere. 20+ hours with a few speed equipment and i still feel slow af.\nwith the amount of walking around you have to do you really need to move faster. not this snails phase.\n\nbase building is pointless as multiple times throughout the game you will have to change zones and well all the old stuff becomes pointless. the rare times you go back to previous zones i can count on 1 hand. \n\nthe quests are vague af and the game hides your resources from you. so you never know what you have. some items are really vague. when an npc asks you to get something while you havnt come across said item yet. and chances are it's one of the pet items. welp good luck on that.\n\nthere is allot of equipment/armor but hell just skip over all of them and go for the last tier of each zone. saves you time, resources and a headache trying to get decent stat rolls.\n\ndon't bother trying to max a pet early on as some of them are rather trash. i ended up settling on the artillery slime thingie. whatever its called. it had good aoe coverage and overlaping damage rolls. works good mid to late game for its damage potential.\nfrom what i can tell it's damage is relevant to your own damage.\n\nwhich brings me to the next point. weapons. 3 weapon types. sword, axe, hammer. each with their own setup. sword is low damage high attack speed. while hammer is slow hitting high attack damage. ok fine cool. but your consumable items or utility items scale off of weapon damage. . . so using the hammer becomes a pretty no brainer. \n\nmoving on too the utility. once you pick up the re-activatable utility items you basically have no use for consumable bombs anymore. like why would you care for something u use once if you can get something that u can keep using.\n\ngathering becomes a chore, farming becomes a chore, fighting enemies becomes a chore, quests in this game are a chore.\nhell i'm only playing at this point to finish story. ain't bothering with the achievements. \"play on x dificulty\" yea sorry the game isn't good enough. if anything it's really bad.\n\na few things they can massively change the game around is \n\n- increase character movement speed. \n  yes there are items for it, yes there are stats for it. but 5% isn't going to do much for you.\n- change the combat system to weapon swing/stab kind of system.\n\n- better quest UI.", "timestamp_created": 1564874055, "timestamp_updated": 1564874055, "voted_up": false, "votes_up": 42, "votes_funny": 7, "weighted_vote_score": "0.658392965793609619", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23606086": {"recommendationid": "23606086", "author": {"steamid": "76561197993400926", "num_games_owned": 0, "num_reviews": 64, "playtime_forever": 317, "playtime_last_two_weeks": 0, "playtime_at_review": 317, "last_played": 1466125259}, "language": "english", "review": "Surpising amount of worth comes from this seemingly small game.\n\nThink Don't Starve, without the starve part. Add a dash of bacon, maybe a pinch of unicorn farts, and a large dose of goofy sci-fi. Absolutely nonsensical sci-fi and good lord does it revel in its ridiculousness. This game was probably as fun to make as it is to play and that is a rare thing in today's market.\n\nIf you're still on the fence due to the $15 price tag then I would suggest buying the mobile game for $5. Not only is it the same game, if you like it enough, you can then buy it on the PC as well. Your game will be cloud-saved so you can enjoy the same playthrough on both platforms. Really a lot of bang for your buck!\n\n...Obviously I've never played this game at work in the bathroom.", "timestamp_created": 1466125442, "timestamp_updated": 1466125442, "voted_up": true, "votes_up": 20, "votes_funny": 8, "weighted_vote_score": "0.655364990234375", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "44439154": {"recommendationid": "44439154", "author": {"steamid": "76561198118541508", "num_games_owned": 324, "num_reviews": 7, "playtime_forever": 1355, "playtime_last_two_weeks": 0, "playtime_at_review": 1352, "last_played": 1541738607}, "language": "english", "review": "[h1]Summary[/h1]\nIn crashlands, you play as a space trucker on a route to deliver space packages. A bad guy stops you and steals your packages, destroying your ship in the process. Your task is to find said bad guy to take your packages back and deliver them to their recipients. This involves resource gathering, monster hunting, animal taming, lots of crafting and extremely simple to use building mechanics.\n\n[h1]Gameplay[/h1]\nThe game is pretty simple, kill monsters and explore to collect resources. Use those resources to craft more advanced equipment and build a prettier house. Then use that equipment to kill more monsters. Along the whole way, you'll find a tonne of quest givers with sometimes complex, sometimes hard and sometimes just downright strange requests. Despite the gameplay being simple it always seems to keep sucking me back in.\n\n[h1]Graphics[/h1]\nThe game is entirely 2d with very charming and well made graphics. Every weapon, tool, piece of armour, enemy or NPC is made very creatively and are pleasant to look at. I particularly like the creatures in the game, every one of them is very unique.\n\n[h1]Mechanics[/h1]\nHaving mentioned the enemies being unique in looks, they're also very unique in their attacking patterns. Whenever you encounter a new enemy type, you have to learn how to avoid their attacks and defeat them. This keeps up the challenge when entering new areas of the world. Besides that, everything in this game is just easy to use. The inventory completely manages itself, meaning you won't have to sort through the huge amounts of resource types in the game. The crafting is extremely easy to use and keeps crafting while you're away from the workbench. This is a particularly good feature in my opinion, since I get frustrated from sitting and watching an item craft timer go down. Finally, the building is amazingly simple to use and very quick to open.\n\n[h1]Conclusion[/h1]\nMy final thoughts on this game are highly positive. From what I hear, I'm not even half way through the game and I've enjoyed every second of it. The game runs smoothly, looks amazing and is just perfectly executed. In addition, the developers are still updating the game occasionally. The exact same game is also on mobile, along with a cloud save to synchronise your save games across PC and mobile. Meaning you can really play this game anywhere (especially with a Nintendo Switch version coming out soon.)\n\nI 100% recommend this game to anyone who doesn't mind a little bit of crafting/hunting grinding.\n\n[quote]If you would like to see more reviews like this, check out my curator page over [B][URL=https://steamcommunity.com/groups/aagcurator#curation] here.[/URL][/B][/quote]", "timestamp_created": 1535529442, "timestamp_updated": 1536201167, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.654585897922515869", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "31573893": {"recommendationid": "31573893", "author": {"steamid": "76561198025557930", "num_games_owned": 1368, "num_reviews": 103, "playtime_forever": 220, "playtime_last_two_weeks": 0, "playtime_at_review": 220, "last_played": 1494048755}, "language": "english", "review": "Seems interesting at first, but the real gameplay gets repetitive real quick.\n\nThe whole game is like this;\nYou start with basic craft station and schema and then-\n1.Talk to NPC and accept quests\n2.Craft weapon, armor, tool to complete quests which is pretty much:\n- Killing mobs\n- Craft something\n- Killing mobs and craft something\n3.Unlock new craft station, schema, and new quests\n4.Repeat\n\nExploration is just finding enemy, ingredent, and warp pad to unlock fast travel spot.\nThere's nothing interesting to see.\n\nCombat is repetitive. Click to attack, click to walk, upgrade stats as you progress.\nDifferent between best weapon and worst weapon is number, and maybe some effect like stats boost or poison.\n\nMaybe you'll enjoy reading funny dialog but that's it.", "timestamp_created": 1494050366, "timestamp_updated": 1494050435, "voted_up": false, "votes_up": 48, "votes_funny": 0, "weighted_vote_score": "0.654066622257232666", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "153435207": {"recommendationid": "153435207", "author": {"steamid": "76561198028238590", "num_games_owned": 0, "num_reviews": 29, "playtime_forever": 4172, "playtime_last_two_weeks": 0, "playtime_at_review": 4172, "last_played": 1708987908}, "language": "english", "review": "I have played this game on mobile for most likely 2000 hours. HELP", "timestamp_created": 1702378325, "timestamp_updated": 1712174912, "voted_up": true, "votes_up": 9, "votes_funny": 1, "weighted_vote_score": "0.652192234992980957", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "51256525": {"recommendationid": "51256525", "author": {"steamid": "76561198085709146", "num_games_owned": 3030, "num_reviews": 27, "playtime_forever": 2320, "playtime_last_two_weeks": 0, "playtime_at_review": 2320, "last_played": 1560531290}, "language": "english", "review": "It's one of those games that make you wish that Steam had a more complex grading system rather than the binary one. Crashlands is a game that reminds many (including myself) of Don't Starve. In my opinion it is to Don't Starve, what American remakes are to European original films. It's goofier and more flashy, but in the process loses the idea of what makes the original so genius.\n\n[h1] Gameplay [/h1]\n\nCrashlands drops you into an alien world, where you need to craft and help the locals to retrieve the packages lost during the crash landing. You have to scavenge and hunt mobs for materials that allow you to craft better gear and challenge harder mobs. It's actually fun for the first few hours, until you notice, this is it, that's basically the whole game. Just grind to craft another workstation, another weapon, another armour. It might have been okay as one of the possible activities, but it gets really old when it's the only activity available. And you have to do it a lot. There are 35 levels of equipment and they increment in twos. This means, the same gameplay loop has to be repeated around 17 times, that's at least 10 times too many. It's also possible to 'domesticate' pets, until you notice, that it's basically another part of the crafting system as the domesticated pets create materials which you'll need to create your weapons and armours with. It doesn't really help that the design of most of the gear is rather uninspiring. You can have the same sword/axe/helmet/etc. every 2 levels. I mean, it looks different, but the only actual difference is that it deals a bit more damage than the same item of the lower tier and a bit less damage than the item of the next tier. Only the gadgets and devices are a small breath of fresh air, at least some of them offer interesting, new mechanics.\n\nAnother gameplay element that's gravely underdeveloped is base building. There are possibilities of building furniture, plants and some other random stuff, but they (mostly) serve no purpose. You can just put them around if you feel like it, but there isn't really any good reason to do so. The only things that are actually needed are workstations, which allow you to craft better and better gear (there's like 20 of them) and pets nest. The rest of furniture might as well not exist.\n\nThe enemies are nicely designed in terms of their looks and attack patterns, however, they all suffer from one major problem - bullet sponging. Most of the time you'll find yourself slapping the enemies with your ineffective weapon for mediocre damage and just running around to not get hit. When you get better weapons, you'll move on to other enemies which will have the same spongey feeling to them. On the other hand enemies attacks welcome you to the world of hurt. Most special enemies will deal enough damage to one-shot you. There are many defensive stats, but at some point you'll probably notice, that the most important one is indeed the HP, that lets you survive the one hit and quickly heal up, the rest probably matters, but there isn't any in-game explanation of what do they exactly do. Like what does 20% toughness do? Does it decrease the physical damage by 20%? More? Less? Does it mean 100% toughness makes you invulnerable to physical damage? Who knows...\n\nEnemies' attacks usually give you a lot of time to dodge, but it's unfortunately balanced with the speed your character is moving. By far one of the most frustrating things about Crashlands is the fact that most of the time you're literally crawling through the world. Being able to activate the 'turbo mode' helps a bit, but you can't have 100% uptime on it, so that sucks. Something like a Don't Starve's 'Walking stick' would be a great help to the game - that is an item that allows you to walk really fast outside of combat, but has to be switched to a weapon during combat, so it would still not be that easy to dodge the attacks.\n\nThere are also some minor bugs in the game, where quests aren't properly marked on the map or your teleporting doesn't work the first time you click (happens A LOT). Not that big of a deal in the end, but it does show the lack of polish of the game.\n\n[h1] Story and Quests [/h1]\n\nThe story initially got me interested. It was a bit goofy, a bit crazy but it held up. I was following it rather closely until the end of Savannah, the first act. After that though, I was a bit underwhelmed with the game mechanics and just felt like finishing it up for the sake of being done with it, reading just a part here and there to still know what's going on. Reaching the last level, Tundra, I was so worn out I would just skip every dialogue ASAP. It didn't matter anyway and it did feel stretched just for the sake of having three acts.\n\nThis might have been different if the quests were a bit more creative, but unfortunately they aren't. 90% of the quests will be your typical 'kill this/gather that/talk to someone'. As I mentioned before, it might be interesting enough for the first act, but after that you'll find just skipping most of the dialogues and then checking your quests screen for the item that you actually need to gather up to finish the quest.\n\n[h1] Graphics [/h1]\n\nFor me the strongest asset of this game. Crashlands looks neat. It's colourful and it feels alive. Even though most of your gear does the same, it looks differently, based on the materials that were used in the crafting process. The enemies and allies look a bit (positively) weird, which fits the goofy, alien theme of the game. The animations are fluid, damage indicators clear and you can easily spot all the materials as they have their distinctive looks.\n\nMy only complaint here would be the lack of possibility (at least I haven't found it) to disable screenshake. I always turn it off in any game I play, and I found it as annoying in Crashlands as in any other game.\n\n[h1] Sound and Music [/h1]\n\nI actually liked the music of the game of the game and I think I had it on for most part of the game. It was nothing to write home about, but it also didn't get on my nerves, which is important, as the game is about 30 hours long and you'll be hearing lots of it on repeat.\n\nThe sounds were mostly well chosen. Enemy sounds were fitting, 'juicy' sounds were 'juicy' enough. No complaints there.\n\nOn the other hand, the person who decided to put the 'thumping' tree in the game, should really re-evaluate how it impacts the playthrough. Hearing that annoying sound for 'roughly' the 8 hours you spend in the last act was stuff of nightmares.\n\n[h1] Overall [/h1]\n\nCrashlands does some things good, it does most things mediocre and a few things - plain bad. It is even a great game up until the point where you notice you've basically seen everything and still have around 20 hours of grind left. If it took 10 hours to complete, this review would probably even be a positive one. It's just, that the game is stretched to almost 30 hours, but the content is just not there anymore past the first act. I mean, you'll see new monsters and the story progresses, but it doesn't feel different enough to justify it.\n\nIf I were to describe Crashlands in one word it would be 'uninspired'. The gameplay design just doesn't change one thing and you simply can't have players doing the same for almost 30 hours, it's boring and frankly, quite tiring. The only thing I could think of after I've beaten the final boss was the LoTR's 'It's over, it's done', I was happy to finally finish it and I know, I won't be coming back.", "timestamp_created": 1560692732, "timestamp_updated": 1560692742, "voted_up": false, "votes_up": 19, "votes_funny": 1, "weighted_vote_score": "0.652040481567382813", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "92620054": {"recommendationid": "92620054", "author": {"steamid": "76561198151757651", "num_games_owned": 223, "num_reviews": 9, "playtime_forever": 3456, "playtime_last_two_weeks": 0, "playtime_at_review": 1739, "last_played": 1623322109}, "language": "english", "review": "I used to play this game when I was 12 and when I found out years later that it was on pc I bought it instantly. \nIt's a nice game with a fun story. It's alot of resource farming and it can get boring if you don't like that but overall nice game!", "timestamp_created": 1622031196, "timestamp_updated": 1622031196, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.64772188663482666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "21134678": {"recommendationid": "21134678", "author": {"steamid": "76561198152138811", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 1504, "playtime_last_two_weeks": 0, "playtime_at_review": 880, "last_played": 1511101257}, "language": "english", "review": "Dear Bscotch,\nThis Game is wonderfull. When you play you just want to play till the end and have the best equipment, which is harder to get than you think. The power of enemies is godd balanced, which makes you feel smetimes too strong and sometimes to weak, but thats normal. All in All the game is beautifull, really thought through and wants me to play other of your games.\n\nFranky", "timestamp_created": 1455219441, "timestamp_updated": 1455219441, "voted_up": true, "votes_up": 15, "votes_funny": 1, "weighted_vote_score": "0.643485903739929199", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "141324666": {"recommendationid": "141324666", "author": {"steamid": "76561198045009736", "num_games_owned": 0, "num_reviews": 38, "playtime_forever": 2240, "playtime_last_two_weeks": 0, "playtime_at_review": 2240, "last_played": 1688506180}, "language": "english", "review": "Fun crafting game with the best selling point. UNLIMITED INVENTORY!", "timestamp_created": 1688506254, "timestamp_updated": 1688506254, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.642785966396331787", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "31908969": {"recommendationid": "31908969", "author": {"steamid": "76561197993172547", "num_games_owned": 927, "num_reviews": 45, "playtime_forever": 2908, "playtime_last_two_weeks": 0, "playtime_at_review": 2908, "last_played": 1495167892}, "language": "english", "review": "I never imagined I would put nearly 50 hours into this game, especially considering how simple and repetitive the actual gameplay loop is. Make workstation -> find/earn recipes for it -> craft gear -> learn to make new workstation -> repeat! You're constantly replacing weapons and armor you might have made only minutes ago. You can build a base, but it's not at all necessary since you can carry anything and everything with you. There is a lot of grinding for crafting materials, so much so that you'll never stop smacking every plant and plucking every do-dad you walk past in a vast, procedurally-generated world that feels more like a chaotic soup of bizarre flora, fauna, and terrain types than a fully-realized place. Even the combat is simple and boils down to learning basic attack patterns and \"staying out of the poop\" while your invincible, embiggened pet does much of the work.\n\nThose sound like complaints, right? They actually aren't. The quirky-yet-charming characters drive you and the story along at a brisk clip, and I enjoyed them and the genuinely funny writing so much that the simplicity of the gameplay itself never once bothered me. All the individual pieces fit together in just the right way to keep the experience fresh and fun from start to finish.", "timestamp_created": 1495492881, "timestamp_updated": 1495492881, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.642682075500488281", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "25589050": {"recommendationid": "25589050", "author": {"steamid": "76561198150699219", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 1767, "playtime_last_two_weeks": 0, "playtime_at_review": 988, "last_played": 1571521959}, "language": "english", "review": "The good\n\nThe game has a wonderful pet system and you can evolve them into killing death machines.You can even bring them to boss fights which is freaking great.Unlimited inventory is a pretty neat idea as the highlight of the game is all about collecting and crafting.Decent writing and the puns arent too bad either.Art style is fantastic.Performance is great.Crafting is awesome.I loved the recipes and was meaningful\n\nThe Bad\n\nCombat is mixed bag for me as higher enemies can one shot you if u fail to register your mouse click.Collecting 100ish of the same item is not exciting.Game doesnt tell you what to do in the early stages.I wish this game had a multiplayer.No mod support as no fan made contents are not allowed accourding to terms and conditions\n\nThe Ugly\n\nQuests are vague and no way of knowing if its a main quest or a side quest.The biggest issue is that these quest are to be completed to move further as they reward you with essential tools which are required to progress further.\n\nFinal Verdict\n\nMake sure you like crafting and collecting.Thats the entire premise of the game .For me I enjoy this kind of game.Therefore I recommend it", "timestamp_created": 1474299042, "timestamp_updated": 1474299099, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.640277862548828125", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "32012752": {"recommendationid": "32012752", "author": {"steamid": "76561198042181437", "num_games_owned": 219, "num_reviews": 21, "playtime_forever": 1264, "playtime_last_two_weeks": 0, "playtime_at_review": 427, "last_played": 1567633682}, "language": "english", "review": "The promo videos sold this game. 100%.  Then I had fun playing it.  No regerts.", "timestamp_created": 1495951727, "timestamp_updated": 1495951727, "voted_up": true, "votes_up": 18, "votes_funny": 2, "weighted_vote_score": "0.640275299549102783", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "29917674": {"recommendationid": "29917674", "author": {"steamid": "76561197998138780", "num_games_owned": 2222, "num_reviews": 14, "playtime_forever": 730, "playtime_last_two_weeks": 0, "playtime_at_review": 339, "last_played": 1543880400}, "language": "english", "review": "Sorry for my english in advance I hope you’ll understand this review :)\n\nFirst of all I would like to thanks the developpers for their great job ! I did play so far more than 4 hours on android and I was extremly curious about the cross platform feature. By being an achievement hunter on steam I was actually nicely surprised that steam achievements were bringed accross steam platform from android, you just need your Butterscotch account. By the way this is the first time I see achievements sync, well done !\nLet’s talk about the game itself, well:\n-\tIf you are craving about crafting\n-\tif you can’t contain yourself from defeating enemies\n-\tif you can’t stop being more powerfull\n-\tif explore is your 6th sense\nthis game was made for you !\nI really have nothing more to tell you about this game, it is fun and I really enjoying it + you could continue to play on your tablet, phone and every platform contain the exact same game with everything cloud sync !\n", "timestamp_created": 1487066863, "timestamp_updated": 1487066863, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.640005886554718018", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "20938400": {"recommendationid": "20938400", "author": {"steamid": "76561198075458676", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 121, "playtime_last_two_weeks": 0, "playtime_at_review": 119, "last_played": 1459818878}, "language": "english", "review": "Only played for a little bit, but this is already one of my new favorite games to play!! Can't wait to pump a thousand hours into you <3 However WE NEED MULTIPLAYER!!!!!", "timestamp_created": 1454531083, "timestamp_updated": 1454531083, "voted_up": true, "votes_up": 14, "votes_funny": 1, "weighted_vote_score": "0.638558685779571533", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "28334753": {"recommendationid": "28334753", "author": {"steamid": "76561198018351517", "num_games_owned": 0, "num_reviews": 57, "playtime_forever": 3365, "playtime_last_two_weeks": 0, "playtime_at_review": 3365, "last_played": 1481521697}, "language": "english", "review": "Awesome farming game. Like don't starve but without the rogue like element. So you won't lose ur progress and have to start from scratch when you die.\n\nThe addition of the juice to change your gear made this game so much better.\n\nPros\n- Great gear upgrade mechanics\n- The telegraphed action RPG\n- The humor (RIP bubbles)\n- The pet upgrade and passive buff system \n- No tedious inventory management\n- Aesthetics (colorful and positive)\n- Crafting and farming a well done\n\nCon \n- The farming is not for everyone", "timestamp_created": 1481584151, "timestamp_updated": 1481584151, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.636069238185882568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "48881908": {"recommendationid": "48881908", "author": {"steamid": "76561197963795678", "num_games_owned": 0, "num_reviews": 23, "playtime_forever": 3943, "playtime_last_two_weeks": 0, "playtime_at_review": 3932, "last_played": 1592104624}, "language": "english", "review": "I really enjoyed this game. The writing was hilarious. I wish they would have continued to add DLC for this. I am really surprised they didn't. Butterscotch Shenanigans keep up the good work! Your trailers sucked me into this game, they were fantastic!", "timestamp_created": 1549741945, "timestamp_updated": 1549741945, "voted_up": true, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.636042296886444092", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "84330867": {"recommendationid": "84330867", "author": {"steamid": "76561197969062133", "num_games_owned": 2118, "num_reviews": 1268, "playtime_forever": 1515, "playtime_last_two_weeks": 0, "playtime_at_review": 1515, "last_played": 1610158913}, "language": "english", "review": "So this is a really cute top down crafting game, kind of like Don't Starve without the survival elements, about a space courier who has crashlanded on a planet and is trying to escape in order to finish her delivery. My issue is that it is really drawn out and grindy. You will spend hours collecting resources to base build and equip yourself, and then do it all over again when you reach the next tier of equipment, and again, and again, and again, and THEN you'll find yourself in a whole new biome and repeat the process yet again. If you don't mind the grind it's a casual crafting game, but the grind was too much for me.", "timestamp_created": 1610159849, "timestamp_updated": 1610159849, "voted_up": false, "votes_up": 14, "votes_funny": 2, "weighted_vote_score": "0.6354789137840271", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "20740584": {"recommendationid": "20740584", "author": {"steamid": "76561198058642444", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 1157, "playtime_last_two_weeks": 0, "playtime_at_review": 1157, "last_played": 1453849296}, "language": "english", "review": "I just played this game for 600+ minutes straight. I don't only feel ashamed, I feel like a loser. It's been awhile since a game made me feel that way.", "timestamp_created": 1453696370, "timestamp_updated": 1453696370, "voted_up": true, "votes_up": 25, "votes_funny": 44, "weighted_vote_score": "0.633999049663543701", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "20869036": {"recommendationid": "20869036", "author": {"steamid": "76561198117570096", "num_games_owned": 157, "num_reviews": 12, "playtime_forever": 806, "playtime_last_two_weeks": 0, "playtime_at_review": 728, "last_played": 1455685858}, "language": "english", "review": "Overall good game.\n-Pros-\n>Cool story\n>Has stupidly funny humor\n>Artwork is neat\n>Combat system is good\n>Crafting has a good system\n>Unlimited inventory space!\n>Good building system\n>HUGE map\n-Cons-\n>Hard to start out\n>15$ is a fair price but I think 10$ would be a better price for this game\n>Quests are sometimes confusing", "timestamp_created": 1454236853, "timestamp_updated": 1454237121, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.63341677188873291", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "20680130": {"recommendationid": "20680130", "author": {"steamid": "76561197972091018", "num_games_owned": 1561, "num_reviews": 67, "playtime_forever": 1411, "playtime_last_two_weeks": 0, "playtime_at_review": 874, "last_played": 1599699789}, "language": "english", "review": "[h1]CrRAaaAASSsSHHLaaaAANNDDSS!!![/h1]\n\n[list]\n[*]Like Don't Starve without the starving.\n[*]Like Terarria without the inventory management, and terarring.\n[*]Like Diablo had a three-way with Saturday Morning Cartoons and Bill Burr.\n[*]Like MMOs and MOBAs scheduled a meeting about fun, strategic combat.\n[*]Like Monster Hunter with the crafting of armor using their monster (private) parts.\n[/list]\n\n[h1]TOTALLY TRUE STATS, FACTS, AND SHIZAMS:[/h1]\n\n[list]\n[*]Has over 1 billions of play time.\n[*]17 gazillion schematics, blueprints, recipes, potions, buffs.\n[*]Randomly generated equipment stats, item rarity... and maps.\n[*]Maps so big, they're immune to \"Yo Mama\" jokes!\n[*]One mouse button is all you REALLY need (throw out that grody controller)!\n[*]Incubate and care for DEATH DEALING PETS WHO OBEY YOUR EVERY COMMAND! MUHAHAHAHAHAHHAHAHAHAHAHAHAHAAH\n[/list]\n\n1100/10 Burn it into your eyeballs now!", "timestamp_created": 1453475839, "timestamp_updated": 1453575154, "voted_up": true, "votes_up": 47, "votes_funny": 131, "weighted_vote_score": "0.632432699203491211", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23754645": {"recommendationid": "23754645", "author": {"steamid": "76561198004521833", "num_games_owned": 810, "num_reviews": 38, "playtime_forever": 351, "playtime_last_two_weeks": 0, "playtime_at_review": 351, "last_played": 1453758815}, "language": "english", "review": "I'm not recommending this game because after the first few levels of tools/weapons, it just gets extremely repetitive.  There's no real advancement ever happening, you just explore in a gradually wider radius around your crashed ship and your weapons get marginally better to be able to handle the stronger enemies further out.  It'd moderately fun at first, but does not last long.", "timestamp_created": 1466771808, "timestamp_updated": 1466771808, "voted_up": false, "votes_up": 29, "votes_funny": 2, "weighted_vote_score": "0.632428824901580811", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "25241853": {"recommendationid": "25241853", "author": {"steamid": "76561197976407034", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 2779, "playtime_last_two_weeks": 0, "playtime_at_review": 2779, "last_played": 1457119259}, "language": "english", "review": "This game is well worth the money. A crafting system that makes sense. Missions that are clear. Rewarding gameplay. HOURS of content. The crafting is a big part of the game, usually you do missions for recipes or blueprints. Enemies and areas scale, but you can always warp back and whip enemies that griefed you before. Boss battles are fair and rewarding. The amount of time you can put into this game while it refreshes itself with new areas and recipes/blueprints and a fresh story make this game one you should not overlook. The fact its on mobile should not turn you away. Its a FULL game.", "timestamp_created": 1472527867, "timestamp_updated": 1472527867, "voted_up": true, "votes_up": 9, "votes_funny": 1, "weighted_vote_score": "0.629179954528808594", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "33563951": {"recommendationid": "33563951", "author": {"steamid": "76561198100307923", "num_games_owned": 190, "num_reviews": 45, "playtime_forever": 2992, "playtime_last_two_weeks": 0, "playtime_at_review": 2021, "last_played": 1563566759}, "language": "english", "review": "Crashlands is incredibly fun game!\nIt's just as awesome as trailer shows.\n\nCrashlands is a game about crafting. Craft Tool A to be able to gather from Resource B, which is a required to craft Weapon C and with it, you can kill Boss E to complete Quest F - and so on. It's extremely enjoyable cycle.\n\nMany games I've played show everything they have to offer in the first hour. \nI've been playing Crashlands for 30+ hours and I keep finding new stuff and even new mechanics.\nThat's why it's impossible to stop playing Crashlands - it stays fresh.\n\nMany games I've played had a lot of things just copied from other games of the same genre.\nHealth potions, iron swords, fireball spells, dragons, etc.\nCrashlands have none of those things, everything - items, locations, NPC's - is unique to the game, and everything has wacky names.\nThat's why it's impossible to stop playing Crashlands - it's filled with original things to discover.\n\nMany games I've played are too easy or too hard.\nDark Souls/random retro platformers will kill you hundreds of times just for a bit of excitement when you actually succeed.\nSkyrim/random casual AAA games will shower you in rewards, that doesn't matter because they are too easy.\nCrashlands has a perfect balance between too hard and too easy. \nIt's challenging, but do-able, even in higher difficulty settings.\nThat's why it's impossible to stop playing Crashlands - it has many challenges that you'll really want to overcome.\n\nThere's base building, farming, legendary time-stopping items, fishing, savagery, GIANT AXES, alien frogs, treasure chests, bosses, great soundtrack, and so much more.\n\nSo yeah, if you're tired of looking for a satisfying game, get this one, because - give me your full attention - Crashlands is that AWESOME GAME you always wanted.\n\nIf you are Minecraft-like game fan, I don't even know how you don't have this game yet.\nGet it. Now.\n\n[b]TL;DR:[/b] \"Add to Cart\" button is up there, you can't miss it. It's a steal for a full price.", "timestamp_created": 1500137892, "timestamp_updated": 1500137892, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.627872169017791748", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "24575784": {"recommendationid": "24575784", "author": {"steamid": "76561198179974283", "num_games_owned": 0, "num_reviews": 47, "playtime_forever": 2175, "playtime_last_two_weeks": 0, "playtime_at_review": 992, "last_played": 1558620124}, "language": "english", "review": "Before I knew it five hours had passed is I think all I need to say about this game.\n\nTo be more specific though... it kind of feels like it reinvents the wheel when it comes to crafting/building RPG games. In a good way. There's very little in the way of tedious wait times when things are crafting and the recipes are usually simple enough not to have a whole ton of things you need to build to build things you need to build things with. If that makes sense. It's fast in other words so you can get back to smashing things.\n\nCombat is slightly more complicated than it seems with each enemy having unique attack patterns that you need to learn to avoid. However realistically I found that since most of the big enemies could kill me outright in one or two hits dancing around them trying to get hits in is just too risky most of the time. Even a small enemy attacks so fast they can catch you off guard or between healing item cooldowns and wipe you out.\n\nThe best option seems to be to just aggro as much stuff as possible with ranged attacks and let your trusty one legged rhino-cow-thing AOE stomp everything into oblivion whilst you carry on mining stuff or chopping wood whilst dodging attacks. This is pretty hilarious to watch and somehow never really gets old. The only problem is said trusty rhino-cow isn't so trusty as to continue attacking the swarm of cosmic monstrosities following you unless you keep throwing in the odd ranged attack to keep his interest. If he kills his target he'll just run back to you and ignore the other dozen critters until you attack something too. I feel this was done deliberately to stop easy farming by just letting the pet do all the work but it can make things awkward as it is often near impossible to actually get an attack in whilst giant land-squids, butterflys and rhinos are doing their best to separate your brains from your skull.\n\nOne big issue I continually had is the pathfinding. Click to move games are never my favourite but after a few minutes of instinctively trying to WASD my way around the place I had become quite comfortable with it. Until I clicked inside the house only for my character to run headfirst into a wall for ten seconds. Try to cross any land dotted with water and it's even worse requiring constant clicks right in front of you just to keep him from trying to drown himself. This can be even more awkward in combat when you try to use a ranged attack only for him to run directly into melee range because there just happened to be a small bush blocking the shot. In a game with mouse only control the pathfinding really could do with being a bit better than this.\n\nHaving WASD as the item bar seems like a clever middle finger to traditional keyboard controls however having access to just four items can be a little limited and detrimental to the game. Two of those slots have to be taken by the wrench and blowpipe ranged weapons for practicality and the other two have to be taken by the basic food items at the moment since the cooldown is so high on them and the amount they heal so low. All the nice bomb recipes I've found are too dangerous to use until I get better healing items. I found a recipe for a HP potion but it is quite costly and currently heals more health than I actually have... and presumably will also be on a 30 second cooldown.\n\nThat said there isn't really any penalty to dying, true to the quick paced nature of the game. You can just teleport immediately after respawning to a nearby portal and are rarely more than 30 seconds away from recovering all your stuff. Whilst it may seem a little weird to totally remove any fear of death like this it really just serves to make the game more enjoyable. I can't count the amount of times in Terraria, Minecraft or similar that I've spent an hour grinding resources only to get killed by something stupid and rush back as quickly as possible to get my gear only to find it gone. In at least half of those innumerous situations I've just quit the game and got bored of it for the day.\n\nThe infinite inventory and lack of hours spent sorting through chests and juggling resources around also serves well to focus this game on actual gameplay and not a shelf stacking simulator. All of these things make it feel like a far more casual and basic game but they also make it more about action. The game is also pretty funny with great dialogue however it does concern me that it is very linear so far so I don't know that it will have anywhere near as much replay value as similar games. That said, after five hours I don't appear to have even glimpsed the end so all in all it is well worth the £10.", "timestamp_created": 1469715298, "timestamp_updated": 1469715298, "voted_up": true, "votes_up": 7, "votes_funny": 4, "weighted_vote_score": "0.626118302345275879", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "29129575": {"recommendationid": "29129575", "author": {"steamid": "76561198151063636", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 1446, "playtime_last_two_weeks": 0, "playtime_at_review": 1390, "last_played": 1523218653}, "language": "english", "review": "CRRRASSSSHHHHLLAAANNNNDDDSSS!!!\n\n+Amazing Inventory system \n\n+RPG Elements on point \n\n+Building a base couldn't be easier\n\n+Farming very well done \n\n+Amazing DEVVSS\n\n+CROSSPLATFORMINESS \n\nEVERYTHING ABOUT THIS GAME IS AMAZING!!! (Didn't list all the amazing things about it for that very reason)\n\n10/10 Reccomend gettting on Google play or App store as well on STEAM!!!", "timestamp_created": 1483917789, "timestamp_updated": 1483917789, "voted_up": true, "votes_up": 8, "votes_funny": 2, "weighted_vote_score": "0.625190138816833496", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "137423572": {"recommendationid": "137423572", "author": {"steamid": "76561199406729387", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 583, "playtime_last_two_weeks": 0, "playtime_at_review": 452, "last_played": 1682957590}, "language": "english", "review": "imbouttabus", "timestamp_created": 1682692124, "timestamp_updated": 1682692124, "voted_up": true, "votes_up": 10, "votes_funny": 3, "weighted_vote_score": "0.623635470867156982", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "32848500": {"recommendationid": "32848500", "author": {"steamid": "76561198006343795", "num_games_owned": 2161, "num_reviews": 34, "playtime_forever": 409, "playtime_last_two_weeks": 0, "playtime_at_review": 409, "last_played": 1498679825}, "language": "english", "review": "I love the fact that I can play mobile and PC version simultaneously on the same save file! I hope that Crashlands source code will be added to the next Humble Game Maker Bundle.", "timestamp_created": 1498556337, "timestamp_updated": 1498556337, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.62253260612487793", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "31663825": {"recommendationid": "31663825", "author": {"steamid": "76561198036143228", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 1004, "playtime_last_two_weeks": 0, "playtime_at_review": 961, "last_played": 1494417008}, "language": "english", "review": "While appealing visually the core gameplay loop is exremely repetitive, the items you unlock don't really change things up and in order to progress the game requires you to grind for materials.\nThe boss fights are ok, but due to there being no real dodging move it tends to be a case of running around them while you pet deals dammage and ocasionally chugging a bomb at them. \nWith some tuning this game could have been a blast but in it's current state i would not recommened it, it's just too much of a drag.", "timestamp_created": 1494417581, "timestamp_updated": 1494417581, "voted_up": false, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.622228384017944336", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "32432500": {"recommendationid": "32432500", "author": {"steamid": "76561197992459465", "num_games_owned": 1043, "num_reviews": 173, "playtime_forever": 3274, "playtime_last_two_weeks": 0, "playtime_at_review": 1944, "last_played": 1498263676}, "language": "english", "review": "It's a mix between loot driven games like Diablo, Path of Exile or Victor Vran and (don't laugh) Factorio. If you are only interested in killing monsters for loot you should better stick to 'real' ARPGs. The same goes for people who just love to gather resources and build stuff: Go and buy Factorio. This game is not entirely open world since the progress is driven by quests. You cannot opt out of them because they yield schematics required to build better stuff.\n\nThis game is really repetitive and I have no idea why I keep playing it. It literally steals time, I swear. I said to myself I'd stop but it never worked out so far. When I think I'm finally done I start pondering about building a better base of operations which in turn needs more or different materials ... it just never ends.", "timestamp_created": 1497525339, "timestamp_updated": 1497525339, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.622220039367675781", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "32833972": {"recommendationid": "32833972", "author": {"steamid": "76561198099291328", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 5295, "playtime_last_two_weeks": 0, "playtime_at_review": 1871, "last_played": 1623120547}, "language": "english", "review": "I don't recommend this game yet without some changes to mid/end game material.\n\nThe first act of the game is really fun and addicting. However, the game becomes very repetitve; fast. Each new section you get to is basically the same play style and crafting recipes just with a different skin. The monster fighting patterns evolve in difficulty which I did enjoy though it just wasn't quite enough to motivate me to the end. \n\nThe game dialoge and story are really entertaining though, so if you can get over the constant repitition that may be worth it.", "timestamp_created": 1498517986, "timestamp_updated": 1498517986, "voted_up": false, "votes_up": 30, "votes_funny": 1, "weighted_vote_score": "0.621708393096923828", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "50178861": {"recommendationid": "50178861", "author": {"steamid": "76561198132370289", "num_games_owned": 0, "num_reviews": 32, "playtime_forever": 8461, "playtime_last_two_weeks": 0, "playtime_at_review": 5639, "last_played": 1577492868}, "language": "english", "review": "This game is so much fun. There's crafting, base building, fetch quests and smashing beasties with all sorts of smashing tools. There's also a story too, a fun one. I am on yet another playthrough. Well worth the money even not on sale.", "timestamp_created": 1555528755, "timestamp_updated": 1555528755, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.618296504020690918", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "39956703": {"recommendationid": "39956703", "author": {"steamid": "76561197986553417", "num_games_owned": 850, "num_reviews": 70, "playtime_forever": 2467, "playtime_last_two_weeks": 0, "playtime_at_review": 1905, "last_played": 1526971469}, "language": "english", "review": "Crashlands is a really fun game in an environment similar to Don't Starve.  The major difference is the focus on completing quests to craft newer and better gear.\n\nYou start out as an intergalactic delivery service.  One thing leads to another and your ship has crashed on an unknown planet.  With the help of your sidekick, Juicebox, you explore the planet and its inhabitants who need your help.  Questing is mostly an excuse to move the game along, but crafting is where this game shines.  Craft everything from armor and weapons to walls, floors, and numerous decorations for your house.\n\nNumerous creatures abound in this strange world, and they all want to kill you.  Defeating them is a matter of recognizing each creature's pattern so you can dodge their attack.  Occasionally, you'll also pick up random rewards while you collect the different plants and animals.   Every so often you'll run into a miniboss that will put your skills to the test.  By the end of the game you will (hopefully) be able to get your ship repaired and get your packages delivered.", "timestamp_created": 1518194156, "timestamp_updated": 1518194156, "voted_up": true, "votes_up": 9, "votes_funny": 1, "weighted_vote_score": "0.617787301540374756", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "50242780": {"recommendationid": "50242780", "author": {"steamid": "76561198452787099", "num_games_owned": 8, "num_reviews": 3, "playtime_forever": 470, "playtime_last_two_weeks": 0, "playtime_at_review": 239, "last_played": 1556465461}, "language": "english", "review": "I really like this game. The progression is great like at 1 point you're getting destroyed then you get some new armor and you can take the enemies on again and win. It does take skills to dodge and avoid getting hit so its not just grind for some items then instantly destroy the enemy.", "timestamp_created": 1555811134, "timestamp_updated": 1555811134, "voted_up": true, "votes_up": 9, "votes_funny": 1, "weighted_vote_score": "0.617734730243682861", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "24380630": {"recommendationid": "24380630", "author": {"steamid": "76561198095312505", "num_games_owned": 298, "num_reviews": 4, "playtime_forever": 1340, "playtime_last_two_weeks": 0, "playtime_at_review": 1132, "last_played": 1564481314}, "language": "english", "review": "For a $15 dollar game it offers a lot of enjoyment fun and not much to be desired.  I would definitely recommend this to anyone looking to get the most enjoyment for their money. However, I suggest you get it on the mobile (I put around 50 hrs into it on there) as it is then only $5, and get the PC version if you truly enjoy it.  Buying mobile first doesn't matter as you can transfer your save through the built in cloud saving. The game can be grindy at times but it compenstates by allowing you to hold infinite items and not have to manage your inventory.  I find the combat to be intuitive and fun while sometimes still posing a challenge.  Yet even if you die, it's not a problem.  When you die you drop some recently collected resources and a gravestone marking the location.  To retrieve the items you just have to walk near them.  Crafting armor and weapons can be annoying as the game relies upon a random quality when you craft so you could grind to get the materiels but then get a white, the lowest teir. Yet you can salvage the armor or weapons to regain some materials.  However the game has very few flaws and is very enjoyable as a casual freeroam rpg with a great story and a plethora of quests to explore.", "timestamp_created": 1468796053, "timestamp_updated": 1479964715, "voted_up": true, "votes_up": 9, "votes_funny": 1, "weighted_vote_score": "0.617336690425872803", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "24148328": {"recommendationid": "24148328", "author": {"steamid": "76561197974132451", "num_games_owned": 458, "num_reviews": 53, "playtime_forever": 1275, "playtime_last_two_weeks": 0, "playtime_at_review": 1275, "last_played": 1468016721}, "language": "english", "review": "I really am enjoying this. \nYou play as two robots trying to fulfill their instructions; deliver three packages. \nTheir ship runs afoul of a powerful god-like head-thing and they *crash land* on the nearby planet.  \n\nIts kind of like Don't Starve but much better. \nLike a top-down Terraria with quests and a story line. \n\nIt has that open world aspect where you can simply walk in one direction and eventually encounter tougher and tougher wildlife. When you do this and discover a whole landscape of natural resources your aren’t equipped to harvest- well it just scratches that resource-gathering itch.\n\nEquipment progression feels good and combat can be challenging until you start abusing patterns.  It's still challenging, but rewarding when you take down something much more difficult than you are \"geared\" for.\n \nThe inclusion of ubiquitous teleport pads for easy jumps deeper into, and out-of, explored territory makes the gameplay never really feel artificially extended. \n\nWhen you find yourself mindlessly harvesting one more bacon flower you don't even need you will relax and remember that inventory management is non-existent. I haven’t reached a cap of anything yet and your inventory manages itself. You can pick up everything.\n\n10/10", "timestamp_created": 1467859002, "timestamp_updated": 1467859206, "voted_up": true, "votes_up": 13, "votes_funny": 1, "weighted_vote_score": "0.616879165172576904", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "62085653": {"recommendationid": "62085653", "author": {"steamid": "76561198062494366", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 2780, "playtime_last_two_weeks": 0, "playtime_at_review": 2780, "last_played": 1579440300}, "language": "english", "review": "I wish they make something more like that or crashlands 2 maybee??!! :)", "timestamp_created": 1579440355, "timestamp_updated": 1579440355, "voted_up": true, "votes_up": 11, "votes_funny": 3, "weighted_vote_score": "0.616010069847106934", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "29024535": {"recommendationid": "29024535", "author": {"steamid": "76561198021117687", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 682, "playtime_last_two_weeks": 0, "playtime_at_review": 570, "last_played": 1497900792}, "language": "english", "review": "I usually don't post a review but I am a father of two young boys and we are always looking for games that we can enjoy together. This game fits that description perfectly. I can walk away and let them play and know they aren't going to be seeing any junk or hearing any cursing. The game itself is also amazing and something that I would play on my own yet its simple enough for them to understand and enjoy. This is currently our favorite game to play together and probably will be for some time. 10/10", "timestamp_created": 1483587076, "timestamp_updated": 1483587076, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.61538463830947876", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "38289549": {"recommendationid": "38289549", "author": {"steamid": "76561198114182164", "num_games_owned": 294, "num_reviews": 7, "playtime_forever": 3147, "playtime_last_two_weeks": 0, "playtime_at_review": 2911, "last_played": 1606609391}, "language": "english", "review": "After playing it for while and also not playing it for a while, I can say this game is definitely worth trying out if you like the look of it.\n\nBought it for the trailers, didn't refund it for the hours of joy and entertainment\n\nI need to replay this game again soon", "timestamp_created": 1513203589, "timestamp_updated": 1606407175, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.615319609642028809", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "49682436": {"recommendationid": "49682436", "author": {"steamid": "76561197987967350", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 1129, "playtime_last_two_weeks": 0, "playtime_at_review": 1129, "last_played": 1553132850}, "language": "english", "review": "I wish I could give this a neutral review.\n\nIn general I like Crashlands. The art stile is nice, the mechanics are ok and the jokes are corny, but funny. But - and this is a big BUT for me: It drags on waaay too long. And not for the good reasons - you know, like actual story or world progression. No - it is just a pure Grindfest. After 18 hours it already begins to drag on forever and gets way to repetitive. You kill stuff, craft your next tier crafting station, grind materials, craft your new gear (armor + weapons) and so on and so on and on...\nThere are barely any new mechanics introduced in all of this. \n\nThis game has 3 terrain types / worlds you need to conquer to finish the game and gamelength - wise I have the feeling it should have ended after the first one.\n\nI will probably never finsish this - just too boring after a while for my taste.\n\nJust keep in mind, that I had a lot of fun the first 15 hours or so.\n\nSo if you are into grinding and long drawn out games, then grab it.\nIf you are more into short condensed experiences and do not have as much freetime at your hand as some other people - stay away from it.", "timestamp_created": 1553205167, "timestamp_updated": 1553205167, "voted_up": false, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.613622486591339111", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "34083828": {"recommendationid": "34083828", "author": {"steamid": "76561197981103834", "num_games_owned": 1190, "num_reviews": 13, "playtime_forever": 3791, "playtime_last_two_weeks": 0, "playtime_at_review": 3751, "last_played": 1496626597}, "language": "english", "review": "Harvest stuff -> upgrade equipment -> kill things (harvest living things) -> upgrade equipment -> repeat.  I found the cycle in this game to be very well spaced out and even though it can be reduced to the above, it was enjoyable throughout.  My advice for completionists:  Skip hard mode and play on Insane first, it's more fun and it only requires one play through this way. \nBattles will often consist of you dodging everything while your pet does the damage.  You will have to get a shot in every once in a while to keep your pet aggro'd.  On insane, this is more intense and fun than it sounds.  Getting the mega gong is probably the last achievement, though I recommend getting it before finishing the game so you have the weapon for the final fight.  Figure out what stuff you need to build fishing holes and bombs in each zone and harvest those items whenever possible.  Don't worry about farming for the gongs until near or after the end of the game when you get the pet and the items that improve fishing.", "timestamp_created": 1502119538, "timestamp_updated": 1502119538, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.61300426721572876", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "27888426": {"recommendationid": "27888426", "author": {"steamid": "76561198010281285", "num_games_owned": 230, "num_reviews": 1, "playtime_forever": 4117, "playtime_last_two_weeks": 0, "playtime_at_review": 3283, "last_played": 1483490883}, "language": "english", "review": "Crashlands is a combat-survival-crafting game, but with an absurd sense of humour, and a serviceable story to keep you involved (yay, quests). You play as a female space transport pilot who crash lands on an alien planet. So you are trying to get home, but in the meantime you have to survive using only the resources you gather in order to make armour, weapons, tools, and workstations for crafting with. One of my favourite features is the automatic inventory management, it just makes carrying a bajillion resources so, so, easy.\n\nYou can also domesticate the local wildlife and have alien pets that fight with you in combat.\n\nIn conclusion, if you like silly things with silly names, this game is for you.", "timestamp_created": 1480282601, "timestamp_updated": 1480282601, "voted_up": true, "votes_up": 7, "votes_funny": 2, "weighted_vote_score": "0.611276507377624512", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "28726121": {"recommendationid": "28726121", "author": {"steamid": "76561198123015457", "num_games_owned": 915, "num_reviews": 1, "playtime_forever": 2306, "playtime_last_two_weeks": 0, "playtime_at_review": 2105, "last_played": 1698616297}, "language": "english", "review": "Absolute blast! I really have nothing negative to say about the game. After I installed this game, I played it for 3 days in a row, 8 hours at a time. I've even tried to find the \"end\" of the map in the first area and literally couldn't find it. Definitely tons of value.\n\n+ Excellent crafting system\n+ Controls are tight and simplistic\n+ Has good humor\n+ Areas/Biomes are unique and stylized\n", "timestamp_created": 1482871276, "timestamp_updated": 1482871276, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.610157132148742676", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "34450046": {"recommendationid": "34450046", "author": {"steamid": "76561198099841240", "num_games_owned": 2347, "num_reviews": 27, "playtime_forever": 3115, "playtime_last_two_weeks": 0, "playtime_at_review": 2313, "last_played": 1588313768}, "language": "english", "review": "⭐⭐⭐⭐⭐ A Must-Play Gem! ⭐⭐⭐⭐⭐\n\nIntro:\nI'm thrilled to share my thoughts on Crashlands, a game that has captured my heart and gaming hours like no other. Across Steam, my iPad, and Android, I've invested in this masterpiece across multiple platforms, and the value it delivers is beyond compare. The convenience of seamless cloud saves between my PC and mobile devices is a game-changer.\n\nGameplay:\nCrashlands unfolds an expansive open-world canvas where adventure knows no bounds. The enchanting crafting system and endearing pet companions are standout features that truly set it apart. The game maintains a refreshing sense of lightheartedness, allowing it to effortlessly forge a special place in my gaming collection.\n\nCustomization:\nWhat drew me further into Crashlands is its crafting system – a delightful blend of resource gathering, inventive crafting, and watching your creations breathe life into the virtual world. This addictive mechanic adds layers of depth, ensuring I'm immersed for countless hours on end.\n\nRecommendation:\nI wholeheartedly recommend Crashlands to every gaming enthusiast out there. If the game were priced at $20, it would still stand tall as a remarkable investment. The voluminous hours of gameplay it offers are staggering. I've joyfully clocked around 50 hours on Steam alone, matched by an equally significant journey across my mobile devices.\n\nValue and Conclusion:\nCrashlands, when juxtaposed with its price, is nothing short of a marvel. Its price-to-value ratio is unbeatable, delivering rich gameplay experiences that elevate it beyond mere entertainment. This game isn't just about the hours spent; it's about the joy those hours bring. Dive in, and prepare for an adventure of a lifetime.", "timestamp_created": 1503537108, "timestamp_updated": 1693780853, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.609857022762298584", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "78139502": {"recommendationid": "78139502", "author": {"steamid": "76561198340059414", "num_games_owned": 1138, "num_reviews": 202, "playtime_forever": 233, "playtime_last_two_weeks": 0, "playtime_at_review": 146, "last_played": 1607242221}, "language": "english", "review": "---{Graphics}---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{Gameplay}---\n☑ Very good\n☐ Good\n☐ It‘s just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{Audio}---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{Audience}---\n☐ Kids\n☐ Teens\n☐ Adults\n☑ All\n\n---{PC Requirements}---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{Difficulity}---\n☐ Just press 'W'\n☐ Easy\n☐ Significant brain usage\n☑ Easy to learn / Hard to master\n☐ Difficult\n☐ Dark Souls\n\n---{Grind}---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isnt necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You‘ll need a second live for grinding\n\n---{Story}---\n☐ No Story\n☐ Some lore\n☐ Average\n☑ Good\n☐ Lovely\n☐ It‘ll replace your life\n\n---{Game Time}---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{Price}---\n☐ It’s free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{Bugs}---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{?/10}---\n☐1\n☐2\n☐3\n☐4\n☐5\n☐6\n☐7\n☐8\n☐9\n☑10", "timestamp_created": 1603643135, "timestamp_updated": 1603643135, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.606092274188995361", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "37972915": {"recommendationid": "37972915", "author": {"steamid": "76561198018029347", "num_games_owned": 0, "num_reviews": 195, "playtime_forever": 3400, "playtime_last_two_weeks": 0, "playtime_at_review": 2759, "last_played": 1532178592}, "language": "english", "review": "One of the best mining and crafting in the market.\n\nGameplay : Imagine Diablo with style from DON'T STARVE and add mining and crafting elements. The game is fun and addictive.\n\nThe biome will become a bit monotonous and grindy after a while but The story (is funny) and quests help alot to give you motivations, so you won't get bored fast. Also there are tons of items to craft, will give you lots to do. You will get more than the given price.\n\nOne thing to NOTE: this game is more of Action game with crafting elements rather than pure crafting survival game. The difficulties progression spikes fast, almost every enemy you find from the beginning can kill you in one or two hits. Even after you level up your gears, sometimes the low level enemies can still kill you in one hit. But after you learn their pattern, the game is not that difficult. The patterns are easy to learn and dodge. The game almost become more like SCHMUP with bullet hell like style action game, but its fun and addictive.\n\nRecommended if you like mining and crafting game.", "timestamp_created": 1512122944, "timestamp_updated": 1512405280, "voted_up": true, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.605869293212890625", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "54819185": {"recommendationid": "54819185", "author": {"steamid": "76561198799403828", "num_games_owned": 48, "num_reviews": 7, "playtime_forever": 7949, "playtime_last_two_weeks": 1, "playtime_at_review": 7138, "last_played": 1713037259}, "language": "english", "review": "ive basically completed this game, unlocked 2 of the secret quests, and all i need to do for now is YOLO Ludicrous, this is a beautiful game and worth the 15$, even the story is fun, i don't want this review to be too long so just get the game.\n\nEDIT: That time one you ask one of the developers how to beat hardcore ludicrous and they just say don't", "timestamp_created": 1566855560, "timestamp_updated": 1595625747, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.604937136173248291", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "30893575": {"recommendationid": "30893575", "author": {"steamid": "76561198159081912", "num_games_owned": 545, "num_reviews": 11, "playtime_forever": 2530, "playtime_last_two_weeks": 0, "playtime_at_review": 2519, "last_played": 1491320527}, "language": "english", "review": "Since there's enough reviews about the gameplay and such for this one, I'll just say one thing:\n\nIf you're one of those people that skip dialouges (which I also do sometimes if that game didnt really have dialogues worthy of reading that actually affects gameplay.. it does get boring if the only thing they say is 'get x of this or kill y of that' when you can read the same thing from the quest window), DO NOT skip the dialogues.\n\nIf you're skipping the dialouges, you're playing this game wrong.\n\nAnd that's for the game review, and now for the review on the Devs, since that's something that's less common.\n\nI've been with the games BSS(butterscotch shennanigans) been making over the years on the mobile games market, and they've made fun games similar to crashlands... and those older games actually make some cameo appearances on each other, or are related in some way. (for example, those two space dudes that gets shot down after trying to deliver the packages you got back... comes back from one of the BSS's earlier games about those two same dudes trying to make it to space when everyone else said they wont..and apparanty they did make it from what i see in crashlands, and got a good paying job as a result too :D) or towelfight2 which seems to be the game that shows what happened in the past in the worlds of other games (yes, Lord Harik (or was that his name) and his monocle dates back to this game).\n\nThese guys been making great games, and finally made their biggest one yet.. and on PC platform, even through the hardships they had (congrats on pulling though cancer, and i mean the literal diesease, not what most people reference to when they rage quit or something) and seeing BSS as the devs was enough for me to buy this game instantly. That's the kind of reputation they hold to me, and I dont regret buying the game, or any other future games they make.\n\n\nThat being said, the only thing I wish for them is developing a game where it supports, and is designed with multiplayer in mind..", "timestamp_created": 1491112201, "timestamp_updated": 1491112201, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.604542732238769531", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23686632": {"recommendationid": "23686632", "author": {"steamid": "76561197961345929", "num_games_owned": 272, "num_reviews": 14, "playtime_forever": 2581, "playtime_last_two_weeks": 0, "playtime_at_review": 2581, "last_played": 1479992696}, "language": "english", "review": "An absolutely fantastic game. I spent quite a few hours on it, and went back a few times to play a few more hours. Customize something, get a new pet, try a stupid build, whatever. And I'm pretty sure I'll eventually restart a whole game from scratch. It doesn't look like much at first sight, maybe some Don't Starve clone but honestly... The resemblance totally disappears as soon as you get it. It has some Diablo, some Don't Starve, some elements from old school RPGs, and the humor is so fundamentally retarded it becomes brilliant.\n\nFor those who like well-designed and wonky adventure games and have 40-ish hours in front of them, it's a safe bet.", "timestamp_created": 1466520149, "timestamp_updated": 1466520149, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.601953804492950439", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "20707623": {"recommendationid": "20707623", "author": {"steamid": "76561198054085795", "num_games_owned": 0, "num_reviews": 35, "playtime_forever": 1333, "playtime_last_two_weeks": 0, "playtime_at_review": 1217, "last_played": 1456332564}, "language": "english", "review": "As of writing this I have just entered the second biome, and so far Crashlands is charming and very addictive.\nThe combat, while sometimes repetetive, is full of quirky items and attack patterns that will keep you on your toes.\nThe music is great so far, with enough variety that I'm not opting for my own soundtrack yet.\nThe crafting and building aspects are very well done and easy to use.\nFor the price, I'm very pleased.", "timestamp_created": 1453575352, "timestamp_updated": 1453575352, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.600538074970245361", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "142446661": {"recommendationid": "142446661", "author": {"steamid": "76561199017972637", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 366, "playtime_last_two_weeks": 0, "playtime_at_review": 215, "last_played": 1690919956}, "language": "english", "review": "I remember playing this in elementary school and getting really into it. Saw it on the front page of steam today for $3 so I picked it up, and I'm so glad I did. To me, this game is a classic. Super chill gameplay, really easy to pass hours with.", "timestamp_created": 1689826507, "timestamp_updated": 1689826507, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.600411951541900635", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "54684689": {"recommendationid": "54684689", "author": {"steamid": "76561198122737137", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 2578, "playtime_last_two_weeks": 0, "playtime_at_review": 1497, "last_played": 1566879206}, "language": "english", "review": "WHERE HAS THIS GAME BEEN ALL MY LIFE?!!", "timestamp_created": 1566146291, "timestamp_updated": 1566146291, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.598255276679992676", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}}, "query_summary": {"num_reviews": 4, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 1547, "total_negative": 255, "total_reviews": 1802}, "cursors": {"AoIIPwWlqXnm7uYE": "Mon Apr 22 23:49:29 2024"}}
