{"reviews": {"157519508": {"recommendationid": "157519508", "author": {"steamid": "76561198125612546", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1652, "playtime_last_two_weeks": 0, "playtime_at_review": 1652, "last_played": 1705623441}, "language": "english", "review": "The decay rate in this game is horrible!  How does a concrete base decay in 1 day?  Talk about making you not want to play.  I worked for days building up resources and levels to get to where I could make a decent base with a generator, then skipped 1 day for work. Imagine my surprise when I logged back in and it was all gone!  I won't be playing this or suggesting it until they fix their decay rates.", "timestamp_created": 1706990296, "timestamp_updated": 1706990296, "voted_up": false, "votes_up": 315, "votes_funny": 18, "weighted_vote_score": "0.932623863220214844", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157743429": {"recommendationid": "157743429", "author": {"steamid": "76561198029291868", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 3142, "playtime_last_two_weeks": 0, "playtime_at_review": 3142, "last_played": 1706828128}, "language": "english", "review": "If you have a lot of time, can be on everyday and have plenty of friends or a clan then you will be fine. However if you cant then this game is not for you. So many toxic players, that seem to be impossible to kill, will just come and destroy everything just because. You then spend hours re building for it all to happen again.", "timestamp_created": 1707261027, "timestamp_updated": 1707261027, "voted_up": false, "votes_up": 38, "votes_funny": 1, "weighted_vote_score": "0.750410020351409912", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157126306": {"recommendationid": "157126306", "author": {"steamid": "76561198387964066", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 7886, "playtime_last_two_weeks": 0, "playtime_at_review": 5518, "last_played": 1707849435}, "language": "english", "review": "Survival games is what I play, I've played just about all of them. This game is a cross between Rust and Icarus.  I \nplay by myself and since the game is new there is bugs,,,,yes,,,,but they are fixing them. I really like that you have to work so hard to get what you want. If you don't like that then play with settings.", "timestamp_created": 1706542445, "timestamp_updated": 1706542445, "voted_up": true, "votes_up": 25, "votes_funny": 2, "weighted_vote_score": "0.73343425989151001", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161672568": {"recommendationid": "161672568", "author": {"steamid": "76561198094670524", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 36114, "playtime_last_two_weeks": 17, "playtime_at_review": 34100, "last_played": 1713374241}, "language": "english", "review": "This game had such great potential early on.  \r\nUnfortunately, the developers didn't listen to the players... At all.  \r\nWe asked for NA specific servers to limit the amount of foreign exploiters and they did nothing.   \r\n\r\nHere we are, less than a year after game launch and there's less people online than some High School graduating classes.  \r\n\r\nMost servers are 0/80 players.  \r\nMost buildings have decayed to nothing, returning the wood, the straw, the stone back to the Earth.\r\nThe servers look as though they were never touched at all.  \r\n\r\nI imagine the hardware in which the game servers run, sit in a cold closet, desolate, alone, and untouched.\r\nThe office buildings that was once bustling with SW Devs, sits a skeleton crew, trying to brainstorm fresh ideas to rejuvenate the game and bring profitability back to company. \r\n\r\n....and the great idea they came up with, the idea that would save the game, the company, and bring players back to build upon the fresh terrain once again..... That idea was to update the way the fishing villages look and to incorporate a \"Universal Server Storage System\". \r\n\r\nNone of the things we asked for. \r\nNone of the things we begged for. \r\nJust another fumble by management which helps the last bunch of remaining players to find the exit. \r\n\r\nIf you are thinking of buying this game, don't. \r\nIt won't be long before the plug is pulled out of the back of that last remaining game server and those untouched terrains that once sat beautiful compounds, go dark.", "timestamp_created": 1711654141, "timestamp_updated": 1711654141, "voted_up": false, "votes_up": 41, "votes_funny": 9, "weighted_vote_score": "0.702404022216796875", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157696074": {"recommendationid": "157696074", "author": {"steamid": "76561198344106031", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 22771, "playtime_last_two_weeks": 0, "playtime_at_review": 22771, "last_played": 1707198337}, "language": "english", "review": "I liked this game a lot in the beginning. It was fun to play with friends, but it doesn't hold attention long. It had a lot of potential in the beginning. Sadly, my oldest child couldn't even make it past the login screen because of latency... not on their side. While in game I constantly heard from other players with similar issues. The game won't delete \"sleeping\" players from the geography... EVER. But you can't be gone from the game longer than a week/ week and a half or all of your stuff will decay and be gone. If they are going to take away all your stuff, house, etc... why not pop your body off the map and force you to respawn at one of the starting spots when you do log back in? The developers continue to work on things that don't, imo, help make what they have more enjoyable... instead opting to work on things that make it a different game than it was when I started. The one I liked and wanted to recommend to people. It's simply just a waste of time now.", "timestamp_created": 1707198809, "timestamp_updated": 1707198809, "voted_up": false, "votes_up": 32, "votes_funny": 1, "weighted_vote_score": "0.708102047443389893", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159092748": {"recommendationid": "159092748", "author": {"steamid": "76561198817032994", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1029, "playtime_last_two_weeks": 0, "playtime_at_review": 1029, "last_played": 1708723011}, "language": "english", "review": "this has a lot of potential but currently has some really game breaking bugs.\r\n\r\nI have to say that the Environment is gorgeous, weather and lightning is among the best ive seen in a game of this type, mountains and rocks dont look out of place, the map is nicely laid out and its a pleasure to explore and water behaves like water, you can swim and everything and it looks great\r\n\r\nThe AI on the other hand, apart from the animals is terrible - have seen NPC's run through solid objects and shoot you through walls, mountains ect.  Also doesn't matter what you use, Spears, Fists, Bullets - they all do the same damage, actually its easier to kill an NPC with your bare hands then to use a gun.\r\n\r\nBase building is meh at best and to be honest, there's no real point in building one if you're playing solo because without joining a PVP server there's no threat and NPC's don't wander and animals don't attack unless you hit those first, you're not pitted against the environment either.\r\n\r\nQuests arent thought out at all, you unlock a table or item in the tech tree and you're given quest is to make that item, even if you dont need it. apart from one quest that does bring a raid but you have to unlock the item and then you're given a quest to build and activate it.\r\n\r\nyou do have access to vehicles but good luck trying to get them to move, or turn or climb a slight incline\r\n\r\nthe game does have positives, you do have immediate access to ore and materials from the get go but you need so much of it that its just a grind, everything re-spawns as soon as you log in so you never have to travel far to collect anything.\r\n\r\nfor me, definitely not worth the money and you'll be done after an hour or two out of frustration or boredom", "timestamp_created": 1708724206, "timestamp_updated": 1708724206, "voted_up": false, "votes_up": 16, "votes_funny": 1, "weighted_vote_score": "0.703315496444702148", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158022049": {"recommendationid": "158022049", "author": {"steamid": "76561199075812063", "num_games_owned": 69, "num_reviews": 2, "playtime_forever": 300, "playtime_last_two_weeks": 0, "playtime_at_review": 300, "last_played": 1699308329}, "language": "english", "review": "chinese gangbang", "timestamp_created": 1707593176, "timestamp_updated": 1707593176, "voted_up": false, "votes_up": 16, "votes_funny": 5, "weighted_vote_score": "0.650721132755279541", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157839948": {"recommendationid": "157839948", "author": {"steamid": "76561197982158165", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 2112, "playtime_last_two_weeks": 0, "playtime_at_review": 997, "last_played": 1708329584}, "language": "english", "review": "After 16 hours of PVE, do note I don't like PVP. Rather play solo / with friends on a private server without having to pay an additional amount on top of the base game (Still hate the devs of Icarus for this).\n\nNote to devs; \n- Please give us the ability to disable the quest tracker on screen. Honestly, I don't need it filling up that much of my screen, I want to see my ammo rather than \"Craft a ...\".\n- Please give us a block function (unless I missed it, but I haven't found a way to be able to block?).\n- Make beds give the option to skip time in Solo Play. Like in Green Hell, everyone in the server needs to sleep in order to skip time could work and not mess with the \"Core\" of the day/night cycle that you guys seem to have in mind. No one is awake for 4 weeks in a row? Alternativly, give option in Admin tools to change time?\n\nThe good imo;\n- Base building is quite extensive and very fun to do.\n- (auto)snap works really well!\n- Building manual electronics incl. splitters etc is an awesome idea!\n- Map is very big and diverse. More smaller villages would be nice. In between a \"Town\" and a single house.\n- Love the upgrade idea, of both Player based and knowledge based.\n- Option to Wave attacke' is awesome, all though, would be fun that smaller groups try to attack your base. Like 1-8, depending on your own level. Deadside I.E. has these roaming groups, build to close to the road, they spot your base and attack.\n- In overal the sound quality is good, but lacks in depth.\n- Enemies aren't trained soldiers, they actually miss sometimes. Something I find lacking in most Survival games. I.E. Deadside, every shot is a headshot 9/10.\n- Server options are very extensive, even for solo play. You can almost tweak anything, great idea!\n- Mining and chopping trees has a good time ratio, not endless chopping up trees in several parts to get a few wood. 4 chops and off to the next tree. Less time-grinding.\n- No weight system. Just annoying in games that are focussed on building.\n- Give instructions to turrets is great!\n- No lame weather system. Standing in a house in Icarus at a storm, hammering away for 10-15 minutes or putting out fires, just so your base survives was one of the worst ideas I've ever seen. Especially since it happened like every day... Go out, come back, base destroyed... Please keep the weather as it is!\n- Game has a lot of potential if the less good things are addressed. \n\nThe not so good.\n- I get a steady 40-60 FPS on Icarus on Ultra, and to it looks to me the textures are higher detailed. On the Front I get a steady-ish 20-30 fps with a lot of drops back to 8-10, while nothing significant seems to be happening. No fires, no building collapses. I'm just walking or cutting down a tree. So some optimization needs to be done it seems.\n- A.I. isn't terrible, but could be way, way better in time. Sometimes I get to sit on a cliff side and Headshot enemies in a row while no one responds to a single gunshot. Other times 1 or 2 \"wake up\" and decide to fire back. Other times everyone comes at me as if they are on some narcotics.\n- The range that A.I. sees you could be better, make them stand on \"alert\" I.E. move towards you. Now they just stand there, 30m away, decide to turn away from you and go stand somewhere else, staring at a cliff side while in a post apocalyptic world, everyone should be considered a threat?\n- Lack of \"crazies\". some zombie/ghouls could easily fit in. There are massive dudes already in the game. Why not add some loonies that charge you without a reason. Give the game more depth and less player decision based events. Chopping a tree, thinking your safe and get swamped by 4 loonies with axes I.E.\n- A.I. lacks sounds, animals hardly make their presence known. Either they don't see you and wonder around aimlessly or they spot you and attack without a warning. \n- Boars are friendly creatures? Have you ever encountered a wild boar in real life? Eagles attack without remorse? Should be the other way around.\n- More ambient sounds would be nice. The music is very nice, but get's old quite fast imo. Ambient sounds makes people trim down music and enjoy the surroundings.\n- Can't seem to build over water? Nothing beats a lake-house where you can fish or get your nets from the water and easily drink. Placing supports under water doesn't seem to be working in any way. Yet, you can build over a road appearantly.\n- As said before, more roaming A.I. Make them less static, let a few groups wander around in a path. Makes more forced encounters and travelling a whole lot more interesting and suspenseful. Especially at night.\n- Followers don't pop up and don't seem to do anything at I.E. a forge, still have to do everything manually?\n- Lacks the option to move \"Stuff\", workbenches, generators, forges, chests etc. You have to destroy them, rebuild them in order to place somewhere else. Give the option to just move them?\n- Gun play seems a bit sluggish imo. Could be more fluid.", "timestamp_created": 1707388946, "timestamp_updated": 1707389745, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.643110752105712891", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160632983": {"recommendationid": "160632983", "author": {"steamid": "76561198088187578", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 17619, "playtime_last_two_weeks": 0, "playtime_at_review": 17615, "last_played": 1711926071}, "language": "english", "review": "As you can see from my hours this game is fun. But in it's current state I cannot recommend it. It's so full of cheaters from russia and china. I have been wiped 3 times on 3 different servers. All when I have not been on, had loads of base defence and had my becon set for the times I could be on. If they fix it I will change my review. Until then stay far away.", "timestamp_created": 1710557775, "timestamp_updated": 1710557775, "voted_up": false, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.621201157569885254", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161453055": {"recommendationid": "161453055", "author": {"steamid": "76561198404032518", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 47, "playtime_last_two_weeks": 0, "playtime_at_review": 47, "last_played": 1711392480}, "language": "english", "review": "crafting is very clunky, and the combat is awful. I wouldn't even play this game if it was free.", "timestamp_created": 1711393511, "timestamp_updated": 1711393511, "voted_up": false, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.598274469375610352", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162877061": {"recommendationid": "162877061", "author": {"steamid": "76561197970374084", "num_games_owned": 594, "num_reviews": 37, "playtime_forever": 1844, "playtime_last_two_weeks": 0, "playtime_at_review": 1844, "last_played": 1706199543}, "language": "english", "review": "It´s just boring. And the amount of crafting benches you need is stupid!  The bases have to be huge to be able to have all the crafting available. It´s badly optimized, it´s grindy as all hell, and yes i know it´s a survival crafting game but this is just dumb.\nI would stay away from this game atm. It´s just not a good game", "timestamp_created": 1713111791, "timestamp_updated": 1713111791, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.589981436729431152", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160509476": {"recommendationid": "160509476", "author": {"steamid": "76561198175853613", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 39928, "playtime_last_two_weeks": 4393, "playtime_at_review": 27542, "last_played": 1713696464}, "language": "english", "review": "I didn't want to leave a bad review about this game, but the developers themselves forced me to do it.\r\nThe game is simply terribly optimized; instead of doing optimization, they simply add useless content to the game.\r\nI filed a complaint 10 days ago and that the server is not playable and still I have not received any response and the server still has not been fixed.\r\nFor those who are thinking about whether to buy this game, I advise you to think again if you have time to waste it in this game, since the developers can’t even ban people for cheating.\r\nIf you want to waste your time, if you want to waste your energy and nerves, then I recommend this game to you; you will waste your time in it as uselessly as possible!", "timestamp_created": 1710420943, "timestamp_updated": 1710420943, "voted_up": false, "votes_up": 15, "votes_funny": 2, "weighted_vote_score": "0.58795619010925293", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157245925": {"recommendationid": "157245925", "author": {"steamid": "76561197977189539", "num_games_owned": 110, "num_reviews": 2, "playtime_forever": 58111, "playtime_last_two_weeks": 0, "playtime_at_review": 44174, "last_played": 1709295214}, "language": "english", "review": "Game had potential but the devs don't care about the game. They stopped communicating with the community or listening to feedback and essentially destroyed the player base, updates are generally downgrades full of game breaking bugs, last i checked they were down to less than 500 players playing the game...considering 3 months ago there were 19,500 that I think says enough. I wouldn't give them anymore money until they come correct with the money they have already swindled from the first wave of players.", "timestamp_created": 1706692712, "timestamp_updated": 1706692712, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.582013964653015137", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158350643": {"recommendationid": "158350643", "author": {"steamid": "76561198211309580", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 896, "playtime_last_two_weeks": 0, "playtime_at_review": 896, "last_played": 1701681906}, "language": "english", "review": "[b]Fun game but:[/b] [i]it has it's issues,  The decay rate is a big one; I come from games like Ark & Conan where structures last more than just a few days. If you're on a PvE server, expect to see a bunch of sleeping bodies wherever you plan on building, simply cause players may have set up a base there, left for two days and as soon as they return, half if not their entire base has auto decayed.[/i]\n\n[i]If I wanted to rebuild my base every two or three days then I'd go play PvP solo & just get used to getting wiped until I can pick up on some guerrilla tactics.[/i]\n\n[i]If you're one of the players who caught it during the discount then it's an ok purchase and there are tons of things to do and build as you progress, you can see some of that in the trailers. \nLike in Ark, you pick up blueprints and decent things from these strange spaceship drops which are colored in a similar way to Ark's white, green, purple, yellow & red drops. In my honest opinion, this game is best enjoyed with friends. If you expect to come from a game like ark to this, it's a whole different ballgame, coming to learn about what may seem like a bit of a steep learning curve but Ark has that once you get into boss fights to unlock tek and so on.[/i]\n\n[b]Would I recommend purchasing The front?[/b]\n[b][i]To be completely honest, it's worth giving the game a shot but I'll always recommend playing with friends even if you're on a PvE server.[/i][/b]", "timestamp_created": 1707971130, "timestamp_updated": 1707971130, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.581787645816802979", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "163086959": {"recommendationid": "163086959", "author": {"steamid": "76561199662714004", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 10370, "playtime_last_two_weeks": 7850, "playtime_at_review": 10370, "last_played": 1713084682}, "language": "english", "review": "Playing alone is a bit boring. I need a few friends", "timestamp_created": 1713422316, "timestamp_updated": 1713422316, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.571655213832855225", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157153307": {"recommendationid": "157153307", "author": {"steamid": "76561198029431443", "num_games_owned": 0, "num_reviews": 23, "playtime_forever": 806, "playtime_last_two_weeks": 0, "playtime_at_review": 803, "last_played": 1706825357}, "language": "english", "review": "If you like survival games AS A GROUP this would be cool, but I am playing alone and it seems the only way to do that is on my own dedicated server which means I have admin rights. One such admin right is teleportation anywhere on the map. Now that i know about that, I cannot not use it. So if I were playing with a group it would be an amazing game, but alone it's not so fun.", "timestamp_created": 1706572845, "timestamp_updated": 1706572845, "voted_up": true, "votes_up": 6, "votes_funny": 2, "weighted_vote_score": "0.568200469017028809", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157099135": {"recommendationid": "157099135", "author": {"steamid": "76561198022693328", "num_games_owned": 416, "num_reviews": 41, "playtime_forever": 1755, "playtime_last_two_weeks": 0, "playtime_at_review": 1755, "last_played": 1702431989}, "language": "english", "review": "   This game is a jack of all trades but a master of none basically. It was addicting up to a point but just didn't have the depth that I was hoping for. Better games came along since its release and I've moved on with little motivation to return. As someone who heavily grinds in games and finds it somewhat enjoyable this one felt particularly punishing. Some materials for crafting you have to travel all over the map the distance makes that a chore. Also some are hidden behind enemy npcs which is cool but often times far more aggravating to deal with just to mine some nodes not really worth the effort.  Also the npc taming system sucks it just screams how to waste time in a game rather than logical didn't much care for it. \n\n I think the game needs to shift direction to stay relevant as it's got to get ambitious to stand out. I don't personally see this game in it's current update schedule regaining any players in the future. As it looks it's just spiraling downward in popularity their are some very big games coming next few months that will further dwindle this games players. Hoping the developers will wakeup and do something to the game to warrant people / me  returning.", "timestamp_created": 1706506761, "timestamp_updated": 1706506761, "voted_up": false, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.56751561164855957", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157410936": {"recommendationid": "157410936", "author": {"steamid": "76561199118510410", "num_games_owned": 729, "num_reviews": 360, "playtime_forever": 45678, "playtime_last_two_weeks": 0, "playtime_at_review": 26260, "last_played": 1709170669}, "language": "english", "review": "hope to optimize it as soon as possible", "timestamp_created": 1706883140, "timestamp_updated": 1706883140, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.566626548767089844", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158475659": {"recommendationid": "158475659", "author": {"steamid": "76561198244685218", "num_games_owned": 130, "num_reviews": 1, "playtime_forever": 5196, "playtime_last_two_weeks": 0, "playtime_at_review": 2792, "last_played": 1708702475}, "language": "english", "review": "wait a few months for them to fix bugs and update. you'll spend 90% of your time farming, smelting, crafting because everything takes forever and cost alot. and maybe 10% enjoying the game. also the servers suck.", "timestamp_created": 1708118312, "timestamp_updated": 1708118312, "voted_up": false, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.565062403678894043", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157854142": {"recommendationid": "157854142", "author": {"steamid": "76561198061316498", "num_games_owned": 330, "num_reviews": 23, "playtime_forever": 103, "playtime_last_two_weeks": 0, "playtime_at_review": 103, "last_played": 1700848531}, "language": "english", "review": "Clunky broken mess", "timestamp_created": 1707403551, "timestamp_updated": 1707403551, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.563492059707641602", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158558051": {"recommendationid": "158558051", "author": {"steamid": "76561199148640551", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 11482, "playtime_last_two_weeks": 0, "playtime_at_review": 11482, "last_played": 1707685274}, "language": "english", "review": "The game has a ton of potential. It is far along the path as it is. It isn't really Minecraft. It isn't quite 7 Days to Die.  Finding flat ground is still problematic. I like being in control of when hordes attack.", "timestamp_created": 1708200306, "timestamp_updated": 1708200306, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.5625", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162223303": {"recommendationid": "162223303", "author": {"steamid": "76561198124151942", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 429, "playtime_last_two_weeks": 0, "playtime_at_review": 304, "last_played": 1712352647}, "language": "english", "review": "definitely has potential, but needs a lot more balancing to be a fun survival game", "timestamp_created": 1712274924, "timestamp_updated": 1712274924, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.557296395301818848", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162941599": {"recommendationid": "162941599", "author": {"steamid": "76561198189323797", "num_games_owned": 0, "num_reviews": 17, "playtime_forever": 11765, "playtime_last_two_weeks": 0, "playtime_at_review": 11765, "last_played": 1703806676}, "language": "english", "review": "Played for quite some time as solo and on multiplayer.   I like the game in the beginning but it fell short quite quickly.   I like survival but you spend 90% of the time grinding for goods rather than playing a game,   If it's gonna be a game there has to be purpose to it other than gathering resources.", "timestamp_created": 1713203163, "timestamp_updated": 1713203163, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.55252915620803833", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157243629": {"recommendationid": "157243629", "author": {"steamid": "76561198339450362", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 2583, "playtime_last_two_weeks": 0, "playtime_at_review": 2583, "last_played": 1706626222}, "language": "english", "review": "I've played about 40 hours and I'm getting burn out already due to the gameplay loop.  It's loads of fun initially, exploring the levelling up, however I now find it more like a chore and whilst I don't mind games with a grindy nature (Valheim for example) I do find that this game gets somewhat tedious.  \n\nI'm currently level 40-something and in what I'd describe as mid game lull, where every bit of progression feels tiresome.  I should be building and crafting things at this point, but honestly, I don't enjoy the building mechanics and find the combining of materials frustrating.  Endlessly looking in chests for the mats you need gets old quickly.\n\nThen there's the graphics and performance.  I'm running a 4080 at 3440x1440 and it drops below 60fps frequently, other times it's up near 200fps, so the transition between the two extremes is noticeable to the point I've had to limit it in-game to 60fps.  \n\nChanging graphic fidelity options makes no difference at all, so this is purely an optimisation issue, which considering the game runs on UE4 is bad.  The world itself doesn't look amazing either, I get triple the FPS and more on RDR2, which by comparison looks like they were made a decade apart.\n\nThen there is DLSS.  There's the option to enable it, however it does absolutely nothing whatsoever, enable it and the AA doesn't change, nor does the FPS.  It's clearly not working, so I'm not even sure if it's just there as a placeholder or what.\n\nAll in all, there are some brilliant mechanics to this game, however I'm not enjoying the building or crafting so far, it's tedious and the graphics and performance are both a let down.  The game has a lot of potential. so I'll see where it goes and review again if I can be bothered to keep playing it, but 40 hours in and I'm pretty much bored of it.", "timestamp_created": 1706689004, "timestamp_updated": 1706689004, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.545454561710357666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158199012": {"recommendationid": "158199012", "author": {"steamid": "76561198133016394", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 213, "playtime_last_two_weeks": 0, "playtime_at_review": 213, "last_played": 1707789601}, "language": "english", "review": "ITS BASICALLY RUST, BUT WITH HELLA BUGS. I COULD ALMOST ENJOY IT IF THE MECHANICS WOULD WORK RIGHT. I TRIED TO GIVE IT A GOOD CHANCE, PUT JUST ENOUGH TIME IN TO NOT GET MY REFUND.", "timestamp_created": 1707789728, "timestamp_updated": 1707789728, "voted_up": false, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.543703675270080566", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158535967": {"recommendationid": "158535967", "author": {"steamid": "76561198016783268", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 2402, "playtime_last_two_weeks": 0, "playtime_at_review": 2400, "last_played": 1708345460}, "language": "english", "review": "This is one of the worst survival games I have ever tried. You can't even one shot a low level npc with a bolt rifle. Why do I need a 8x scope? To snipe a npc? After that he is still running around and harder to snipe. The vehicle mechanics is so bad. It feels like a game from the 80's. Why even add them to the game if they are so bad? Its making the game even worse. I can't even run over enemy npc's? What? Even the npc feels like a game from Atari. No, I'm not wasting another minute on this. I keep asking myself with everything I do, why do I do this? For nothing. I don't want cars, they are bad. I don't wan't helicopters, they bounce of the ground when I try to crash them or hit a building. Even with early access. These mechanics will just carry over to final. A bad start.  Not recommended.", "timestamp_created": 1708181932, "timestamp_updated": 1708182567, "voted_up": false, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.543203949928283691", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158598233": {"recommendationid": "158598233", "author": {"steamid": "76561197996709676", "num_games_owned": 95, "num_reviews": 6, "playtime_forever": 12495, "playtime_last_two_weeks": 0, "playtime_at_review": 9479, "last_played": 1709400375}, "language": "english", "review": "I will say this. normally I dont like to grind in games but for some reason I do love the grind in this. now having said that. there are allot of very bad bugs that will hopefully be fixed soon. I know this is early access and is constantly getting updates. I am only playing with some friends on pve and we are having fun just making our bases and getting ready to go after bosses and good gear.", "timestamp_created": 1708233675, "timestamp_updated": 1708233675, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.541666686534881592", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157366869": {"recommendationid": "157366869", "author": {"steamid": "76561198002584419", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1038, "playtime_last_two_weeks": 0, "playtime_at_review": 1038, "last_played": 1697329024}, "language": "english", "review": "Boring. Broken. And now Dead.\nI wanted to play the game in the screenshots and trailer vids. The reality did not live up to the hype.", "timestamp_created": 1706828488, "timestamp_updated": 1706828488, "voted_up": false, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.540183305740356445", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158061504": {"recommendationid": "158061504", "author": {"steamid": "76561198298586270", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 521, "playtime_last_two_weeks": 0, "playtime_at_review": 521, "last_played": 1707594085}, "language": "english", "review": "I am a huge survival game fan but couldn't get more than just over 8 hours into this.  The world may look great but the AI are really REALLY bad, everything about them. Loot and looting system feels lacklustre and unrewarding.", "timestamp_created": 1707640096, "timestamp_updated": 1707640096, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.539923965930938721", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162806274": {"recommendationid": "162806274", "author": {"steamid": "76561198030163938", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 54367, "playtime_last_two_weeks": 0, "playtime_at_review": 54367, "last_played": 1709310008}, "language": "english", "review": "The devs stopped listening to the community.  They only do optimization updates when there is so many things wrong and broken with this game.  If you want a game thats never gonna fix the core problems and have a dev team that doesnt communicate or even fix the actual things that are plaguing the game then this is the game for you.  Its a complete shit show.  PVP needs balanced.  The turrets need balanced.  You can still make your name invisible where if you dont know how to do it you will be at a disadvantage in PVP because your name will be visible to the other players while the ones with blank names you wont be able to actually see.  The only viable weapons to use is the Stryker Shotgun and the Sniper.  The Stryker with the Choke and Green Ammo is the most broken gun in the game and has been since day 1 and yet nothing has been done.  Do what you will with this information.", "timestamp_created": 1713027567, "timestamp_updated": 1713027567, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.538461565971374512", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158291137": {"recommendationid": "158291137", "author": {"steamid": "76561197980643190", "num_games_owned": 439, "num_reviews": 54, "playtime_forever": 46, "playtime_last_two_weeks": 0, "playtime_at_review": 46, "last_played": 1703237286}, "language": "english", "review": "its just a reskinned ark.", "timestamp_created": 1707903293, "timestamp_updated": 1707903293, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.538263857364654541", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159414186": {"recommendationid": "159414186", "author": {"steamid": "76561198400163146", "num_games_owned": 56, "num_reviews": 4, "playtime_forever": 322, "playtime_last_two_weeks": 0, "playtime_at_review": 322, "last_played": 1698350949}, "language": "english", "review": "This game would be great if it was the year 1999. \n\nLooks awful and has awful combat.", "timestamp_created": 1709064691, "timestamp_updated": 1709064691, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.536045670509338379", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162594121": {"recommendationid": "162594121", "author": {"steamid": "76561198077299240", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 2409, "playtime_last_two_weeks": 0, "playtime_at_review": 2409, "last_played": 1712496940}, "language": "english", "review": "Tried the Single Player route and while it has kept my interest and provided value for money I have moved on because it has very little depth.", "timestamp_created": 1712742671, "timestamp_updated": 1712742671, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.534251987934112549", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160366216": {"recommendationid": "160366216", "author": {"steamid": "76561197963386603", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 49843, "playtime_last_two_weeks": 0, "playtime_at_review": 49843, "last_played": 1710212938}, "language": "english", "review": "game as potential but is full of chinese and russians hackers , devs dont do anything they grabed the money and never listen to comunity dead game", "timestamp_created": 1710213009, "timestamp_updated": 1710213009, "voted_up": false, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.53406071662902832", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162907100": {"recommendationid": "162907100", "author": {"steamid": "76561198141216129", "num_games_owned": 256, "num_reviews": 89, "playtime_forever": 714, "playtime_last_two_weeks": 0, "playtime_at_review": 714, "last_played": 1703130263}, "language": "english", "review": "It looked cool but after so long you realize its not that good. I wanted to like it but with how the updates are and the player count this game will be abandoned soon if not already.", "timestamp_created": 1713147510, "timestamp_updated": 1713147510, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.532404780387878418", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160402599": {"recommendationid": "160402599", "author": {"steamid": "76561197996829067", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 12969, "playtime_last_two_weeks": 81, "playtime_at_review": 12354, "last_played": 1713516811}, "language": "english", "review": "i had fun for a short time but due to chinese hackers it went bad pretty quickly\nppl walking through mountains under ground  and untargeteble by your defenses and more \nthis game is being brutaly murdered by some very sad (chinese) lowlifes\n\nlots of potential beautiful maps but dead as a doornail\nsingleplay is the only way you can play this without having to deal with these guys\n but thats not why i bought it anyway\n\nso...\nto sum up\n\nsteer clear of this game, do not buy it", "timestamp_created": 1710267061, "timestamp_updated": 1710267061, "voted_up": false, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.532293975353240967", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157616385": {"recommendationid": "157616385", "author": {"steamid": "76561198844503277", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 3225, "playtime_last_two_weeks": 0, "playtime_at_review": 2092, "last_played": 1707936715}, "language": "english", "review": "Survival game - learn a lot of what to harvest in nature to produce / build/ craft what you need. Still need some work on mechanics / vehicle  movement.", "timestamp_created": 1707092302, "timestamp_updated": 1707092302, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.531062126159667969", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162854179": {"recommendationid": "162854179", "author": {"steamid": "76561198811549044", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 27762, "playtime_last_two_weeks": 3526, "playtime_at_review": 24601, "last_played": 1713730137}, "language": "english", "review": "nice", "timestamp_created": 1713088118, "timestamp_updated": 1713088118, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.529004514217376709", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158060367": {"recommendationid": "158060367", "author": {"steamid": "76561197996725227", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 5415, "playtime_last_two_weeks": 0, "playtime_at_review": 5415, "last_played": 1707325556}, "language": "english", "review": "Not good. Boring and buggy glitchy and very weird controls with vehicles.\nSorry, but I would say otherwise but I just can't.\nDon't let the many items and many craftable things fool ya.\nIt's just a copy of other games and looks a bit nicer but many things in here don't even make sense.\nBlueprints for example, you only can use them when you are at the level where you can craft them. Pretty lame. Stuff just dissapear when logging in again etc etc. Sorry dev's, this is a NO GO.", "timestamp_created": 1707638598, "timestamp_updated": 1707638598, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.528985500335693359", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161821793": {"recommendationid": "161821793", "author": {"steamid": "76561197968407109", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 2362, "playtime_last_two_weeks": 0, "playtime_at_review": 2261, "last_played": 1711840841}, "language": "english", "review": "I played with a friend on a custom server just us, and the basebuilding, level system, and technology system was quite fun and impactful to interact wiht. The game is basically heavily inspired by Ark, with some other survival based elements. Vehicles are a pretty big addition. \r\nI found it fun and enjoyable, although it lacks some of the depth. A common complaint I see that is reasonable is that the AI is pretty stupid. They are, its true. It doesn't mean they aren't challenging however, as some of them can drop you in a second or two if you aren't careful. Its one of those games where health scales up dramatically and some enemies feel like bullet sponges, but its not /terrible/ if you have upgraded gear.", "timestamp_created": 1711822055, "timestamp_updated": 1711822055, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.527297556400299072", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159411526": {"recommendationid": "159411526", "author": {"steamid": "76561198048957859", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 3850, "playtime_last_two_weeks": 0, "playtime_at_review": 3850, "last_played": 1706587990}, "language": "english", "review": "Build the very small house hiding in forest but \"CHINESE\" player can hunt me everywhere im supspect they use CHEAT", "timestamp_created": 1709061734, "timestamp_updated": 1709061734, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.527272701263427734", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162577168": {"recommendationid": "162577168", "author": {"steamid": "76561197970560363", "num_games_owned": 0, "num_reviews": 37, "playtime_forever": 455, "playtime_last_two_weeks": 23, "playtime_at_review": 455, "last_played": 1712709632}, "language": "english", "review": "Alright, the game videos look cool. However, there is no way to save the game when you exit. You are always going to lose some of your work to the 300 second lag between auto saves which you cannot see. \"Shift + G\" and \"~\" do not work as ways to save the game. So you stand around for five minutes to be sure your work is saved. I spent seven hours in this game, got to level 23, and came back after several weeks and my base was gone. World of Warcraft was auto-saving at exit in 2004. Why can't this game? It is broken so do not waste your money on this dog. Give it a year or two and see if the devs pull their heads out of their asses. My bet is that they will release this as is just like Fallout 76 and Starfield. Both of which are crumby games just like this one", "timestamp_created": 1712711099, "timestamp_updated": 1712711099, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.525076508522033691", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162649615": {"recommendationid": "162649615", "author": {"steamid": "76561198151245659", "num_games_owned": 0, "num_reviews": 40, "playtime_forever": 36167, "playtime_last_two_weeks": 2, "playtime_at_review": 36167, "last_played": 1712820738}, "language": "english", "review": "Im sorry to have to be so blunt but the dev team dropped the ball by focusing on pvp instead of pve. It showed when the lack of players caused the cheater filled pvp population to collapse, and it showed in pve by the sheer lack of content; and the available content feeling like a buggy, broken, empty mess that feels like an asset flip now that all is said and done (for me). Also forcing people to log on in such short amounts of time even on pve left me feeling like a hostage. Now that my base was destroyed due to me full time real life responsibilities, it feels like a weight has lifted off my shoulders, and i cant help but feel a genuine sense of relief to have one less unnecessarily meaningless responsibility gnawing at the back of my head, and the space on my pc back of course. Only play this if you have a ton of free time, and enjoy grinding just to grind for sake of grinding with no reason or tangible or enjoyable endgame in sight other than GRIND GRIND GRIND and when you think you have enough materials realize that you only grinded 10 percent of what you needed to grind and are gonna have spend day of the same endless grind grind grind while you grind during your grind while you wait for things to respawn so you cant continue to sleepwalk around just grinding grinding grinding grinding grinding grinding grinding grinding grinding grinding grinding grinding grinding grinding grinding grinding grinding grinding grinding grinding grinding", "timestamp_created": 1712821844, "timestamp_updated": 1712821844, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160798761": {"recommendationid": "160798761", "author": {"steamid": "76561198930010387", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 420, "playtime_last_two_weeks": 0, "playtime_at_review": 420, "last_played": 1710478435}, "language": "english", "review": "Game still needs some work when it comes to fighting mechanics. Certain weapons do not do any damage until 2nd or 3rd attacks. Neat idea of a game, just needs to work out the kinks.", "timestamp_created": 1710709744, "timestamp_updated": 1710709744, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160497413": {"recommendationid": "160497413", "author": {"steamid": "76561199152578865", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 3217, "playtime_last_two_weeks": 0, "playtime_at_review": 3217, "last_played": 1705296110}, "language": "english", "review": "i see potential in this EA survival game.", "timestamp_created": 1710402433, "timestamp_updated": 1710402433, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158792611": {"recommendationid": "158792611", "author": {"steamid": "76561198109423308", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 35684, "playtime_last_two_weeks": 0, "playtime_at_review": 29210, "last_played": 1712097018}, "language": "english", "review": "Check Youtube videos about hackers and exploits in this game before you buy it. After building and farming 500+ hours been raided by hackers that DEVS completely ignore tickets about... And now we have 2/80 online on the Servers. Worth time and money even for PVE, it might take you 3-4 days to build your base from scrach, and that's the whole content... Don't think so :)", "timestamp_created": 1708422331, "timestamp_updated": 1711905323, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161646048": {"recommendationid": "161646048", "author": {"steamid": "76561199590997541", "num_games_owned": 19, "num_reviews": 3, "playtime_forever": 2396, "playtime_last_two_weeks": 0, "playtime_at_review": 1501, "last_played": 1711679580}, "language": "english", "review": "♥♥♥♥♥ ♥♥♥♥! only thing this game contains is everything!", "timestamp_created": 1711627128, "timestamp_updated": 1711627128, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.522264838218688965", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161246176": {"recommendationid": "161246176", "author": {"steamid": "76561198138287810", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 50263, "playtime_last_two_weeks": 0, "playtime_at_review": 50256, "last_played": 1711321611}, "language": "english", "review": "Don't bother, game is broken, exploits are abused and nothing done. Developers are letting it all roam free. Save your money and get something different.\nToxic chat, racist players.   \nBroken mechanics that are not getting fixed or even talked about.\nGame has gone backwards with each update.", "timestamp_created": 1711192402, "timestamp_updated": 1711261798, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.521945953369140625", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159873427": {"recommendationid": "159873427", "author": {"steamid": "76561199221966534", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 803, "playtime_last_two_weeks": 0, "playtime_at_review": 128, "last_played": 1712099080}, "language": "english", "review": "would love to play the game but cant!!!! all official pvp server pings are 500 and are unplayable some pve and dedicated server under 250 is playable!! wish i cant get some help on how to fix the problem..", "timestamp_created": 1709596571, "timestamp_updated": 1709596571, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.52173912525177002", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157668127": {"recommendationid": "157668127", "author": {"steamid": "76561198864759386", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 806, "playtime_last_two_weeks": 0, "playtime_at_review": 627, "last_played": 1707413130}, "language": "english", "review": "It is full of bugs and lags as if they need to work a lot on the game even on G-portal server it lags badly and drops frame near to 0 so for that amount of money you can play other games with better quality", "timestamp_created": 1707160863, "timestamp_updated": 1707160863, "voted_up": false, "votes_up": 6, "votes_funny": 3, "weighted_vote_score": "0.52173912525177002", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161599351": {"recommendationid": "161599351", "author": {"steamid": "76561198083149972", "num_games_owned": 397, "num_reviews": 8, "playtime_forever": 61, "playtime_last_two_weeks": 0, "playtime_at_review": 61, "last_played": 1711563589}, "language": "english", "review": "TL:DR cool concept, janky asf", "timestamp_created": 1711563919, "timestamp_updated": 1711563919, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.520433604717254639", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160124315": {"recommendationid": "160124315", "author": {"steamid": "76561198065766675", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 3643, "playtime_last_two_weeks": 0, "playtime_at_review": 3643, "last_played": 1698872148}, "language": "english", "review": "this is pve rust but the pve is janky af lol", "timestamp_created": 1709924677, "timestamp_updated": 1709924677, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.519999980926513672", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159866102": {"recommendationid": "159866102", "author": {"steamid": "76561197961656707", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 102797, "playtime_last_two_weeks": 0, "playtime_at_review": 102797, "last_played": 1709154378}, "language": "english", "review": "Game was fun in the beginning, even playing with friends, but around the time you get to metal buildings it takes an insane amount of resources to do anything. Alot of afk miner time spent and such, love the idea, the implemenation not so much like others have said its like ark/rust but doesnt really have the attention holding factor of either.\n\nWish i could do a maybe for recommend but honestly i give the game a 6/10\n\nWould also say i played on a pve server and my server wasnt infiltrated by cheaters/hackers so it was a fun experience", "timestamp_created": 1709586910, "timestamp_updated": 1709586910, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.519999980926513672", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158198791": {"recommendationid": "158198791", "author": {"steamid": "76561197985611562", "num_games_owned": 356, "num_reviews": 6, "playtime_forever": 3706, "playtime_last_two_weeks": 1, "playtime_at_review": 3651, "last_played": 1713604208}, "language": "english", "review": "Grate game; just not enough players on the North America servers", "timestamp_created": 1707789433, "timestamp_updated": 1707789433, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.518750011920928955", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160509054": {"recommendationid": "160509054", "author": {"steamid": "76561198142530097", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 2615, "playtime_last_two_weeks": 0, "playtime_at_review": 2615, "last_played": 1710374606}, "language": "english", "review": "If you want to play this game for official pvp just dont bother dont even get it, they need to sort there so little dead servers out, EU server is just Chinese players who offline raid you every night. like most games that come out of china the chinese player community just destroys it for anyone else... single player is not so bad but just gets boring i would recommend other games over this until they sort it out and the EU servers are actually bloody EU", "timestamp_created": 1710420455, "timestamp_updated": 1710420455, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.51815563440322876", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157833899": {"recommendationid": "157833899", "author": {"steamid": "76561198100075230", "num_games_owned": 70, "num_reviews": 4, "playtime_forever": 798, "playtime_last_two_weeks": 0, "playtime_at_review": 431, "last_played": 1707404422}, "language": "english", "review": "EARLY ACCESS ! It's Alpha right now, so all the individuals complaining about things not working should Google the meaning of Early Access! From what I see, the game has amazing potential. It combines elements from various survival games like Rust, DayZ, Icarus and  many other great games. After 1 or 2 years, this game will undoubtedly be one of the top games!", "timestamp_created": 1707380741, "timestamp_updated": 1707380741, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.517587959766387939", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157536307": {"recommendationid": "157536307", "author": {"steamid": "76561199454577043", "num_games_owned": 77, "num_reviews": 2, "playtime_forever": 402, "playtime_last_two_weeks": 0, "playtime_at_review": 402, "last_played": 1707007619}, "language": "english", "review": "Needs AI optimization, all AI just stand there and barely strike. Servers advertise 60 ping but get to 250+ steady ping. Needs to be more simple, too much going on and its hard to get a start. Devs please fix lag and AI issues. 3 star game, great content, but can get overwhelming, great concept for a game tho, so I'll still keep playing.", "timestamp_created": 1707007787, "timestamp_updated": 1707007787, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.517235040664672852", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157867035": {"recommendationid": "157867035", "author": {"steamid": "76561197969302422", "num_games_owned": 780, "num_reviews": 70, "playtime_forever": 1504, "playtime_last_two_weeks": 0, "playtime_at_review": 1504, "last_played": 1698865464}, "language": "english", "review": "I have enjoyed what little I have played on this game, I see a lot of negative reviews citing toxic players... but umm... why do you play on public servers and then blame the game for the players? PVP attracts toxic players period.  Every game I've played that does PVE ONLY has helpful friendly players.  ALL PVP have toxic players it's why you find 90% of players on private servers and not on the public servers..this one is no different.  So if you remove all the dumb players for playing on public servers and expecting people to be kind in a pvp game, and view only the real negative you can have a better understanding of what to expect.  This game has a lot of ups and downs but some people don't do well playing EA game so if you aren't an EA player then DON'T buy until it's out of ea and you see reviews on the finished product", "timestamp_created": 1707413784, "timestamp_updated": 1707414082, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.516114473342895508", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157727359": {"recommendationid": "157727359", "author": {"steamid": "76561197994119276", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 204, "playtime_last_two_weeks": 0, "playtime_at_review": 204, "last_played": 1699668716}, "language": "english", "review": "The game is incredibly boring. It is bland and feels like any other open world survival craft game out there.", "timestamp_created": 1707241110, "timestamp_updated": 1707241110, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.5158730149269104", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157681699": {"recommendationid": "157681699", "author": {"steamid": "76561199252065492", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 445, "playtime_last_two_weeks": 0, "playtime_at_review": 323, "last_played": 1708312722}, "language": "english", "review": "kind of buggy at times but over all a great game and very entertaining", "timestamp_created": 1707176440, "timestamp_updated": 1707176440, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.513513505458831787", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157453911": {"recommendationid": "157453911", "author": {"steamid": "76561199216456480", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 570, "playtime_last_two_weeks": 0, "playtime_at_review": 307, "last_played": 1708569717}, "language": "english", "review": "Good graphics, would recommend but not with low end computer. few glitches and patches and sometimes big updates. Genre: Survival, Modern, Driving, Building. Not so fun in singleplayer but so fun in multiplayer.", "timestamp_created": 1706924150, "timestamp_updated": 1706924150, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.513513505458831787", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161893130": {"recommendationid": "161893130", "author": {"steamid": "76561198031677267", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 97000, "playtime_last_two_weeks": 5730, "playtime_at_review": 88030, "last_played": 1713797771}, "language": "english", "review": "The game is so full of cheaters that its dead. Its got a lot of potential but I would have to say that it has died from cheaters. Don't buy, don't waste you time.", "timestamp_created": 1711902584, "timestamp_updated": 1711902584, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.51009058952331543", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160686037": {"recommendationid": "160686037", "author": {"steamid": "76561198043762794", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 16, "playtime_last_two_weeks": 0, "playtime_at_review": 16, "last_played": 1710609494}, "language": "english", "review": "fair play the game play is NOTHING like the trailer, very laggy, glitching all over the place .\ndo not buy it wait to see if the updates keep coming otherwise this game is DEAD!!!", "timestamp_created": 1710609578, "timestamp_updated": 1710609578, "voted_up": false, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.509989321231842041", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160017824": {"recommendationid": "160017824", "author": {"steamid": "76561198042675041", "num_games_owned": 383, "num_reviews": 6, "playtime_forever": 22490, "playtime_last_two_weeks": 0, "playtime_at_review": 22490, "last_played": 1709789791}, "language": "english", "review": "ide give the game a 5/10 stars due to the server lag issues.\r\ntaking into consideration the last time i played (7 months ago) there were alredy tickets open for the server lag and the thing causing it was all the persisting bodies of the players all over the map and the game attempting to load sed player and there inventory even when there not there causing the connection to be unstable impacts of this issue are>\r\nwhen flying your helo will lag back and fourth or up and down making impossable 75% of the time to land with out blowing up the expensive helos or even crashing vehicles into objects like trees and rocks as the cars trucks and tanks are lagging alll over the place when driven.\r\nthe combat making it hard to kit enemys with guns or bows as they tend to be 20 feet behind you then freeze in place for a second then the next there on you beating you to death.\r\n\r\nthe other issue is the ammount of cheaters on BOTH pvp and pve servers. tho there isnt any player damage against other players there is an issue with players cheating stats and other things making it hard to farm stuff for lower levels as the cheaters hit it all as soon as there up or duplicating ammo and other things and constently raiding dungeons making it impossable for player at the point to hit sed dungeons.\r\n\r\nthe added bosses. unless you have a group of atleast 6 friends good luck. there impossable to do solo the tank mini bosses will aimbot you at extreme distinces witch verry little chance to run away or live they need to make the bosses a raid so when your withing a distince of sed boss its toned down or up in difficulty depending on how many people are attacking them.\r\n\r\nother than those issues as far as i can tell the game plays great and verry addicting but untill those issues are fixed i have to leave a 5/10 and recomend players wait untill those issues are fixed befor spending money on the game", "timestamp_created": 1709790317, "timestamp_updated": 1709790317, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.506696403026580811", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157670419": {"recommendationid": "157670419", "author": {"steamid": "76561198035966135", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 1144, "playtime_last_two_weeks": 0, "playtime_at_review": 1144, "last_played": 1697328874}, "language": "english", "review": "too buggy and developers wont fix known bugs\n", "timestamp_created": 1707163550, "timestamp_updated": 1707163550, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.505629599094390869", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157945515": {"recommendationid": "157945515", "author": {"steamid": "76561199215077159", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 20705, "playtime_last_two_weeks": 0, "playtime_at_review": 19346, "last_played": 1707754705}, "language": "english", "review": "GOOD GRINDING GAME", "timestamp_created": 1707508218, "timestamp_updated": 1707508218, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.505162835121154785", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "163098301": {"recommendationid": "163098301", "author": {"steamid": "76561199663897056", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 6713, "playtime_last_two_weeks": 6740, "playtime_at_review": 6713, "last_played": 1713084678}, "language": "english", "review": "Fun, I hope it can be continuously updated", "timestamp_created": 1713441123, "timestamp_updated": 1713441123, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.504166603088378906", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159200681": {"recommendationid": "159200681", "author": {"steamid": "76561198803479568", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 106, "playtime_last_two_weeks": 0, "playtime_at_review": 106, "last_played": 1708823885}, "language": "english", "review": "Wow. What a horrible game. Just too many things wrong with it to go on about it.", "timestamp_created": 1708824055, "timestamp_updated": 1708824055, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.503937005996704102", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161315305": {"recommendationid": "161315305", "author": {"steamid": "76561197999325563", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 70989, "playtime_last_two_weeks": 0, "playtime_at_review": 70758, "last_played": 1712289711}, "language": "english", "review": "Game is full of bugs and exploiters save your money", "timestamp_created": 1711249794, "timestamp_updated": 1711249794, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.503816783428192139", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162646364": {"recommendationid": "162646364", "author": {"steamid": "76561198336759345", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 5384, "playtime_last_two_weeks": 0, "playtime_at_review": 5384, "last_played": 1704942327}, "language": "english", "review": "Too grindy, play rust, at least it feels fun to play", "timestamp_created": 1712815188, "timestamp_updated": 1712815188, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.501396656036376953", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157225315": {"recommendationid": "157225315", "author": {"steamid": "76561197970090565", "num_games_owned": 478, "num_reviews": 56, "playtime_forever": 392, "playtime_last_two_weeks": 0, "playtime_at_review": 392, "last_played": 1706031975}, "language": "english", "review": "Unfortunately, the game is unplayable. The DLSS, which the developers added to the game, doesn't work (or simply has no effect). The performance is terrible, and the game looks like it was released at least a decade ago. Crafting is a tedious process - constant moving of resources from one place to another...\n\nI hope that during the game's development, the creators will address the most frequently reported issues...\n\nBut will it not be too late to patch the game when players are already drifting away...?", "timestamp_created": 1706661921, "timestamp_updated": 1706661921, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.501062512397766113", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159366649": {"recommendationid": "159366649", "author": {"steamid": "76561198107353472", "num_games_owned": 149, "num_reviews": 4, "playtime_forever": 46, "playtime_last_two_weeks": 0, "playtime_at_review": 46, "last_played": 1709003670}, "language": "english", "review": "The game is bad. Im in love with 7 days to die and when I saw this I thought this would be close to a take on that which from the trailer is defiantly is in the ballpark. This being said you feel like you can hit things twice as far as you can, like you have to shove your face in trees to cut them down. This also goes into combat which feels bad because you cant fluidly swing at someone and back away to dodge their hit as consistently as your health bar would like you to. I can say if you want to experience something like this game just go play 7 days to die. Its better by a landslide.", "timestamp_created": 1709004042, "timestamp_updated": 1709004042, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157854431": {"recommendationid": "157854431", "author": {"steamid": "76561198034364518", "num_games_owned": 0, "num_reviews": 29, "playtime_forever": 32, "playtime_last_two_weeks": 0, "playtime_at_review": 32, "last_played": 1707403414}, "language": "english", "review": "Field of view settings do not match actual numbers. 80 fov is like 40, 120 fov is like 80.", "timestamp_created": 1707403724, "timestamp_updated": 1707403724, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157727672": {"recommendationid": "157727672", "author": {"steamid": "76561198071854182", "num_games_owned": 0, "num_reviews": 27, "playtime_forever": 290, "playtime_last_two_weeks": 0, "playtime_at_review": 226, "last_played": 1707293061}, "language": "english", "review": "Games got good ideas, just needs a bit more work on it, optimization as well is a big thing, major issue currently actually ALONGSIDE THE DECAY SYSTEM, currently if you dont play for a WEEK a literal WEEK in a half or so YOU LOSE YOUR BASE/EVERYTHING ON THAT SERVER, THIS IS TERRIBLE FOR YOUR PLAYERBASE's RETENTION.\n(people have lives man, dont want to treat this game like a job) This is rn a \"must log in or lose progress\" chore which currently as this system stands, IT IS BAD. Fix this immediately, as you can see in others reviews, people hate the way this system is currently. \n\nAtleast let us like have a higher cap of materials able to be placed in the thing that protects your base from PVP/Decay (autorepairs via using materials stored in this thing, i forgot the name, Space something,its basically a TC with more uses) just let us put like atleast 1K materials in there so we can extend the time we dont have to be afraid of losing progress if we just dont want to play one day...\n\nHowever i think more PvE content would be nice as games like this really lack at that, some people dont want to just PvP,spawn,die, repeat, however this game does have a lot of unique ways to prevent PvP and looting and interestingly i think they could expand on a lot of features, however first how about the random NPC traders that are just randomly around the map? Fix those and make those look like they are meant to be placed in the spots they are, and also have more life to them, maybe voice lines or QUESTS from them and i believe this game could be great competitor to Rust, they need more fixes and such first tho, but GAME IS NEW so another year or so i fully expect this game to be packed and features nearly complete for their Launch out of Early Access eventually, however i think the UI needs INSANE work, map UI, not being able to use mouse scroll wheel to swap between items in quickslots, or use it for really anything actually? Weird, but game really does have good ideas and uniqueness to it however i think they need to fix a lot first, and optimize the game for the masses before doing more Marketing via streamers/content creators, also personally i think they could do good unique fun PvE content, with Bosses, Raids, the whole 9..... However some people just love to PvP and thats fine but understand new content benefits both parties of players who enjoy both PvP and PvE content, and i think this game could use a GIANT PvE AI/and NPC rework like PLEASE I beg you rework the AI of Enemies to not just walk straight to you, and actually do things other then just run towards you and auto attack like a basic UE5 model.... come on guys, love shows and a lot of the places in the map feel left out and left in the cold (some spots literally have stretched textures, like across a mountain in the grass area, just like brother come on) so i think this game is great however a lot of fixes and features need to come and more communication with the playerbase via socials like steam and twitter/x is amazing for updating us on whats to come and whats IN THE WORKS as well, so we know what to adjust ahead of time or what to ask for changes for or if the playerbase sees a rising issue before the devs do, things like that.\n\n5.7/10 game currently however give it a few feature updates and optimization (like major optimization) and this game could easily compare to Rust, if not surpass it in fun factor in a lot of ways (RPG elements via skills, could expand on this too, and the MANY unique \"wacky\" items and vehicles and weapons you can get in this game, set it apart from the rest) So as long as they continue that route, should be in a good place within a few months/year or two time.\n\nPlayer base is apparently Toxic but like you play survival games what do you expect hugs and kisses? \nYou SHOULD know what you get with these kinda games, base campers, sh*t talkers, and Xbox 2010 MW2 lobby chat simulators, it is what it is.", "timestamp_created": 1707241482, "timestamp_updated": 1707242091, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "150553385": {"recommendationid": "150553385", "author": {"steamid": "76561197970883509", "num_games_owned": 0, "num_reviews": 50, "playtime_forever": 6, "playtime_last_two_weeks": 0, "playtime_at_review": 6, "last_played": 1700580392}, "language": "english", "review": "Update: Change is coming! We did this, folks :)\n\nhttps://steamcommunity.com/games/2285150/announcements/detail/3899617007501078392\n\n\n\n--- original review follows ---\n\nThis game should NOT be allowed on Steam!\n\nThe game immediately requires one to install a Kernel-level anti-cheat called \"ACE\", aka the \"Sguard\" service. One can't even stay in the main menu for longer than a few seconds without agreeing to install this. \"ACE\" is made by Chinese company Tencent. Unlike with other games, this requirement is NOT disclosed on the store page!!\n\nThe anti-cheat software's updates can not be realistically controlled by the game maker, it has a data protection document that is very light on details, and is hilariously self-referential. It is in no way compliant with data protection laws in the EU or most of US. Running at Kernel level, the Chinese maker of \"ACE\" could potentially (i.e. hypothetically) push any future functionality to one's PC, to potentially spy on any communication, steal data or currency, or manipulate any file. It might also contain potential security holes, potentially allowing malicious actors full access to the PC.\n\nThis is in principle no different from things like Easy Anti-Cheat, BattlEye and friends, but this is Chinese-made and therefore outside of any Western jurisdiction.\n\nI really wanted to try the game, but this is a no-go. Refunding.\n\n---\nEdit: an ammendment to respond to some of the comments\n\nI want to respond to one point people make. I am under no illusion that other companies have the same potential means, and similar incentives, to spy on me as well. In fact, I have a healthy skepticism against non-Chinese corporate conglomerates as well. You could consider me a bit of an activist and also the fool who actually reads the data protection clauses.\n\nAt the end of the day, every one of us has to decide where we fall on the spectrum between living without technology in in a cave, and reaping the benefits of technology. Yes, I, too, use some social media. But I try to wage benefits against cost carefully.\n\nMake no mistake: \"I have nothing to hide\" is laziness at best, and harmful ignorance at worst. Every one of you has something to hide. Consider this: Do you want every private conversation, every medical record, every party picture, every single one of the little lies we tell others or ourselves dragged into public? That stuff increasingly happens on your hard disks, and saying that you \"got nothing to hide\" is just foolish.\n\nEven if you trust Tencent (or Google, or Facebook) - which in itself is a silly statement, \"trusting\" an abstracted entity, there are so many cases of Kernel-level software opening up exploits then abused by hackers. With access to a machine, they can encrypt your data, take over your accounts (yes, maybe your precious Steam account). And it's not just people getting your data that's already there. As an IT professional, I have been asked, many years ago, to plant criminal material on a compromised machine, to frame someone. Of course I didn't, but people should know the extend of what's technically imaginable.\n\nSo, if you're truly prepared to give a random stranger full, utter CONTROL over your digital existence, tell me you got nothing to hide. Until then, this review aims to do no more, and no less, than to tell you what the game makers were supposed to tell you, but neglected: They are helping another company to potential, full control over your machine, but unlike many other Steam shop pages, this one did not proactively tell you about that fact. And unlike many others, this product (the anti-cheat) does not even appear to make a pledge to grant you the rights established by GDPR/DSGVO (for the EU citizens among you).\n\nNo more needs to be said.\n\nOP out.", "timestamp_created": 1700581385, "timestamp_updated": 1702394890, "voted_up": false, "votes_up": 6306, "votes_funny": 145, "weighted_vote_score": "0.942542493343353271", "comment_count": 333, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1701143575, "developer_response": "Thank you for the suggestions and feedback. We are switching the anti-cheat software very soon."}, "151589316": {"recommendationid": "151589316", "author": {"steamid": "76561198043716604", "num_games_owned": 316, "num_reviews": 24, "playtime_forever": 1192, "playtime_last_two_weeks": 0, "playtime_at_review": 1192, "last_played": 1700703710}, "language": "english", "review": "needs to change its anti cheat engine, don't buy or install (ACE/sguard DOES NOT UNINSTALL WITH THE GAME) or else you're going to have a hard time rooting out what may likely turn into malware later on.\n\n12/1 devs announced a switch to a different anticheat. if they pick something a little less toxic, i'll be switching to positive :D\n\n3/20/2024 - hey sorry it's taken me so long, but hell yeah thanks for showing you do care and l isten, that'll go a long way. Good fucking game now that'll only get better.", "timestamp_created": 1700835822, "timestamp_updated": 1710938462, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.934512495994567871", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1703144021, "developer_response": "We have switched to EAC as our anti-cheat system."}, "148363427": {"recommendationid": "148363427", "author": {"steamid": "76561198213231748", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 3481, "playtime_last_two_weeks": 0, "playtime_at_review": 3317, "last_played": 1697857863}, "language": "english", "review": "Cheaters. Already uninstalled.  I could get past the server issues and incomplete feel of the game. Its new and early access, but cheaters.  Spent days progressing only to have someone invisible fly through our base and take everything from our chests right in front of us. Multiple times. Nothing we could do.  Not worth the time.", "timestamp_created": 1697502640, "timestamp_updated": 1697502640, "voted_up": false, "votes_up": 587, "votes_funny": 34, "weighted_vote_score": "0.919600605964660645", "comment_count": 19, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148378507": {"recommendationid": "148378507", "author": {"steamid": "76561198101997334", "num_games_owned": 180, "num_reviews": 10, "playtime_forever": 3707, "playtime_last_two_weeks": 0, "playtime_at_review": 499, "last_played": 1699501463}, "language": "english", "review": "Don't play PvP and you'll have a great time.", "timestamp_created": 1697536445, "timestamp_updated": 1697536445, "voted_up": true, "votes_up": 209, "votes_funny": 13, "weighted_vote_score": "0.913751602172851563", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "149022654": {"recommendationid": "149022654", "author": {"steamid": "76561198053303069", "num_games_owned": 618, "num_reviews": 148, "playtime_forever": 4986, "playtime_last_two_weeks": 0, "playtime_at_review": 1137, "last_played": 1704594550}, "language": "english", "review": "they released the banlist and over half the names were in chinese", "timestamp_created": 1698466143, "timestamp_updated": 1698904789, "voted_up": true, "votes_up": 548, "votes_funny": 202, "weighted_vote_score": "0.908351123332977295", "comment_count": 16, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148336732": {"recommendationid": "148336732", "author": {"steamid": "76561198099504491", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 1033, "playtime_last_two_weeks": 0, "playtime_at_review": 296, "last_played": 1697585029}, "language": "english", "review": "Game is barely released and already got hackers and cheaters. It's fun unless you've got hackers on the server. \nSome guys are teleporting across the whole map destroying your territory flag and opening your chests and steal your stuff.\n\nI can't understand it. They glitch into your base, steal your weapons and everything.. What are they gonna do with them? Raid a base? Hahahahahaha xD\n\nPlay in private servers. I'll give it a thumbs down because it seems like it's really easy to bypass their anti-cheat until they tweak it.\n", "timestamp_created": 1697466486, "timestamp_updated": 1697466486, "voted_up": false, "votes_up": 272, "votes_funny": 17, "weighted_vote_score": "0.906213045120239258", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148334112": {"recommendationid": "148334112", "author": {"steamid": "76561198174776507", "num_games_owned": 75, "num_reviews": 5, "playtime_forever": 11625, "playtime_last_two_weeks": 0, "playtime_at_review": 3882, "last_played": 1699195217}, "language": "english", "review": "I might reconsider my review after the first wipe, but there's a prevalent issue with cheaters, particularly from the Chinese player base, in Front the game. Despite playing on Server 2450 for 67 hours, the experience has been marred by instances of unfair gameplay. Even with the 3-hour window for PvP raiding, we were subjected to an offline raid at 6 am. This raid involved players simply walking up to our Beacon, deleting it, and looting our chests, bypassing the benches. It's disheartening to invest time in a game when it feels like the development team is not addressing the cheater problem effectively. Their solution of adding more 80-man servers doesn't seem to deter cheaters, as there's still a significant presence of them without a robust anti-cheat system in place.", "timestamp_created": 1697462990, "timestamp_updated": 1697462990, "voted_up": false, "votes_up": 418, "votes_funny": 16, "weighted_vote_score": "0.899382591247558594", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "153311791": {"recommendationid": "153311791", "author": {"steamid": "76561198019431686", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 26425, "playtime_last_two_weeks": 0, "playtime_at_review": 26425, "last_played": 1702224375}, "language": "english", "review": "I really, really wanted to like this game. I've played 440 hours now with a revolving selection of teammates across 9 different NA PvP fresh wipes. I've tested and mathed a lot of stuff, and could probably answer any question you have about the game in its current state. I know the absolute fastest ways to level, how much damage every weapon and vehicle deals to various targets, all the raid mechanics, etc.\n\nBut unfortunately, right now I have to put the game down and ask you not to give the devs your money - force them to instead confront the rampant balance issues and glitches that are keeping this game from being great. Here's a selection off the top of my head:\n[list]\n[*] [strike]Placing signboards gives 20 xp. This one simple trick means what should take you at least several days of hard grinding can be done in a matter of hours. And once you understand how important progression is in this game (it has HUGE effects on your harvest rate and combat ability), you'll know how broken this truly is.[/strike] Edit: FINALLY they fixed this.\n[*] All raiding is based around turrets - they can shoot down most raiding projectiles, so raiders have to play intelligently to work around this, either draining turrets, approaching with smokes, etc. And there's meant to be counter play there for the defender. Plus, there's the cost of defensive and offensive ammo to consider. Sounds interesting, right? But if the raiders simply set up devastator turrets of their own on the edge of your claim, they will completely shut your ability to defend by 1-shoting you whenever you peak. Then they will place tamed rocket NPCs, who fire free ammo. And neither of these things will be intercepted by your turrets.\n[*] Most of your play session revolves around your base, be it farming Ether Shards, Blueprints, Oil, or Explosives - you'll spend most of your time at home. When you do go out to get talent books or hit mines, you'll be in and out so fast that there's no time for organic open world PvP interactions. And once you've progressed in your tools and talents, you'll get so much material from a single mine run that you barely ever need to go. The map is also 2x the size of your standard Rust map, with 1/3 the pop. Nearly everyone I've gotten interested in this game has left due to a lack of organic open-world pvp.\n[*] By a week after launch, most mines will be covered in turrets, because players can build right next to them. This means the first hour of server launch is a massive rush to grab territory, with beacons that are incredibly cheap and so strong that you'd only ever raid them by glitching a very strong NPC into attacking them for you.\n[/list]\n\nNow you might say \"well, it is EA, give them time and they will fix these things.\" But I'd ask you to take a look at their discord, at how long these issues have been noted by their players, and then compare that with the content of their patches and development announcements. While I think the mods do a good job at filtering feedback up, whoever is running this company is clearly out of touch.\n\n[b]TLDR: I'm going to come back to this game in 6 months or so, and maybe they will have addressed these issues. But from what I've seen so far, I'm not expecting much. And I ask you to seriously consider if these developers deserve your money. Don't fall into the trap of playing this game > 2 hours and then being unable to refund. Take a look through the bugs and suggestions threads in their discord first.[/b]\n\n-----\n\nEdit: I wanted to respond to something I'm seeing frequently in the replies to this review - \"How can you play so many hours and still give it a bad review? Don't you feel like you got your money's worth?\"\n\nFirst of all, I know most people have more self-control than me and put less than a few hundred hours into their games. But take a look at my profile - I've put over 10k hours into various survival games, 4.6k into Rust alone. 400 hours is not a lot, for me, for something that has the potential to be my next main game. It is, however, just enough time to reach peak PvP meta and understand how the game is competitively played, and my discoveries there are the basis for my negative review.\n\nSecond, \"is it worth my money?\" is not the only question to consider when making a purchase. Most games are very cheap per hour played. But gamers don't have infinite time to play them all, so we have to pick and choose on factors besides cost. \"Do they deserve my money\" is an important question too, one that I think we should ask ourselves more these days as EA money-grabs run rampant over our gaming world. While I'm not saying this game is a cash grab, I do think the developers need to feel more pressure to actually understand and improve how their game is played at the competitive level.", "timestamp_created": 1702226968, "timestamp_updated": 1704132134, "voted_up": false, "votes_up": 589, "votes_funny": 30, "weighted_vote_score": "0.897499203681945801", "comment_count": 48, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148151137": {"recommendationid": "148151137", "author": {"steamid": "76561197960462111", "num_games_owned": 361, "num_reviews": 12, "playtime_forever": 4571, "playtime_last_two_weeks": 0, "playtime_at_review": 505, "last_played": 1700266116}, "language": "english", "review": "I don't get the negative reviews.  As a day 1 early access game, this is really solid.  Ark and Rust  and 7Days all wrapped together and better on day 1 than any of them were.\n\nYes, there are AI problems and yes they need to tweak the graphic settings for some resolutions, and yes, they're missing keyboard customization, but those are all short term issues.\n\nYou can build tanks and helicopters and turrets.  There is a complex weapon system with attachments and with quality from normal to legendary.  There are customizations for your tools.  There's a tech tree and a traits system.\n\nThe bones are all here for a really good game, we just need to give it time - and they have time... like I said... early access.\n\nIt's worth $20 without a doubt right now, and it'll just get better as long as the developer keeps the updates coming.\n\nGive it a try - they're adding more servers and you can run your own if you like also.", "timestamp_created": 1697222069, "timestamp_updated": 1697222069, "voted_up": true, "votes_up": 254, "votes_funny": 11, "weighted_vote_score": "0.896988570690155029", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148800502": {"recommendationid": "148800502", "author": {"steamid": "76561197998275811", "num_games_owned": 230, "num_reviews": 15, "playtime_forever": 18320, "playtime_last_two_weeks": 0, "playtime_at_review": 4871, "last_played": 1705526765}, "language": "english", "review": "I’m 81 hours into this game so far. I was very hesitant to get it because there’s soooo many negative reviews. \nSo if you’re you’re on the fence about getting it like I was, read this.\n\n1. Firstly the graphics are pretty good, up there with Ark and stuff, I’m able to run the game on ultra and still have about 90FPS.\n\n2. Lag and stuttering hasn’t been an issue for me, I play on a dedicated server because on official there are a few hackers I’ve noticed and mods are good about banning hackers on dedicated servers.\n\n3. This game is very grindy! But a fun grind! I do recommend playing on a 2x or even a 3x server (I play on 3x) as a duo or solo. Because you need a tonnnnn of resources always. But again it’s a fun grind.\n\n4. I prefer pvp just because it adds to the risk factor, you can do pve servers but you will get bored pretty quickly without that added risk. (In my opinion)\n\n5. This game is like Ark, Rust, and 7 days to die had a baby, and then add gunship helicopters and tanks and rpgs and stuff to the mix. Super addicting\n\n6. I haven’t had the game crash once, it’s been stable for me and all of my friends.\n\n7. The game is $20. It is worth at least $40-60. Get the game and enjoy days/weeks/months of it.\n\n8. The map is hugeeeee, there’s tons of npcs to kill and things to do. When you’re not sitting in your base grinding go explore.\n\n9. The only thing I will say negative about the game is the wind generators. I have mine over 80 meters high and they still get “insufficient wind” only generating 40 power instead of 75. Super annoying, nothing is near them either. \n\nConclusion: get the game and stop listening to negative reviews based off them having potato PCs and play on a dedicated server to avoid hackers.\n(EDIT): oh yeah about the people complaining about pvp, just to let you all know, your base is pvp protected for 21 hours of the day, you get to choose a 3 hour window that your base is raidable, so yeah, enjoy the game and ignore the negative reviews.", "timestamp_created": 1698170517, "timestamp_updated": 1698171016, "voted_up": true, "votes_up": 290, "votes_funny": 6, "weighted_vote_score": "0.892471611499786377", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148029185": {"recommendationid": "148029185", "author": {"steamid": "76561198344184946", "num_games_owned": 60, "num_reviews": 2, "playtime_forever": 18353, "playtime_last_two_weeks": 0, "playtime_at_review": 3927, "last_played": 1700805721}, "language": "english", "review": "I've seen comments talk about this game like it's just another generic survival game adding nothing to the genre. YouTube comments are brutal. Everyone seems to want to just assume this one is dead on arrival.\n\nI really disagree. This game actually has some fun things going for it.\n\nI've put in countless hours in to many survival games - ARK, 7D2D, Valheim, Grounded and others. I'm well aware of the usual tropes and gameplay loops and I can honestly say The Front offers a healthy mix of areas you're used to combined with new fresh ideas that feel creative and fun. \n\nMy group has mostly been messing around with PVE mechanics for the closed betas as the PVP elements in (very) early access survival games can prove to be sort of a mess. We're holding out until further down the line to really embrace  the PVP aspects, but I can safely say the PVE and crafting / gathering feels very polished for such an early build. The base defense system is reminiscent of 7D2D, but the \"zombie\" horde has many new enemy types that offer more layered levels of difficulty and strategy. Their roadmap indicates many many more on the horizon as well, and I'm excited to see what sort of threats they cook up as it progresses.\n\nThe player progression system incorporates \"Talents\" that are unlocked via Talent Books, and tech tree crafting blueprints that are unlocked via Ether Shards. Both are major sources of loot from the enemies you find in the wild and also from base defenses - this gives much needed purpose to maintaining a functional killbox base for your base defense gauntlets. Additionally, there are POIs that function as both surface-level enemy strongholds, as  well as instanced-like dungeon zones. While the loot in these needs improvement and pales in comparison to the loot you receive from defending waves at home, it's still kind of fun and shows what the future could hold. Their roadmap includes many improvements to these features, as well as eventual World Bosses.\n\nThe current price tag of this game is really had to beat. I put in 60 hours in the betas and still feel ready to put in many more. I spend more on a value meal at Burger King than the current sale price of this game, I just can't find fault in this dev team just yet. \n\nGive this one a try if you're a fan of the survival genre, and especially if you enjoy base defenses in 7D2D.", "timestamp_created": 1697036450, "timestamp_updated": 1697049392, "voted_up": true, "votes_up": 311, "votes_funny": 10, "weighted_vote_score": "0.891508162021636963", "comment_count": 20, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "151349107": {"recommendationid": "151349107", "author": {"steamid": "76561198174545241", "num_games_owned": 73, "num_reviews": 10, "playtime_forever": 150, "playtime_last_two_weeks": 0, "playtime_at_review": 150, "last_played": 1700716566}, "language": "english", "review": "This installs Ace anticheat and even after removing the game it remains. Don't trust these devs.Also movement is a joke in this, it feels like im playing a mmo in 2001.", "timestamp_created": 1700753868, "timestamp_updated": 1700753868, "voted_up": false, "votes_up": 217, "votes_funny": 4, "weighted_vote_score": "0.891488790512084961", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1703144043, "developer_response": "We have switched to EAC as our anti-cheat system"}, "148631356": {"recommendationid": "148631356", "author": {"steamid": "76561198016225807", "num_games_owned": 0, "num_reviews": 64, "playtime_forever": 314, "playtime_last_two_weeks": 0, "playtime_at_review": 163, "last_played": 1702494558}, "language": "english", "review": "I always wanted to play Rust in SP\nThis game made it even more  for us who wants to build,craft and kill AI without other people around you. Fun with so much to do.\nIn this early access stage game is kicking ass!", "timestamp_created": 1697924808, "timestamp_updated": 1697924808, "voted_up": true, "votes_up": 80, "votes_funny": 1, "weighted_vote_score": "0.874201476573944092", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "154093282": {"recommendationid": "154093282", "author": {"steamid": "76561198905974265", "num_games_owned": 52, "num_reviews": 20, "playtime_forever": 7163, "playtime_last_two_weeks": 0, "playtime_at_review": 7161, "last_played": 1703337876}, "language": "english", "review": "So, after spending 120 hours in the game, I have to say that it has incredible potential, just like many other games of this type. However, it feels like all that potential is being wasted because the developers have no clue what they're doing. It seems like they never played the game themselves; they just added things that they thought would be cool, but these things don't fit together. Maybe in 1-2 years, they will fix all of this, but currently, it's a big NO-NO.\n\nFor example, if you join a server as a new player, even on a one-week-old server that is meant to last for a year, there is no chance to survive. You're going to get raided every day or every few days because the technological difference is so huge that there is no chance to catch up and become equal.\n\nAnother issue is the presence of beds in the game that allow players to respawn on them. These beds have no limits, and the respawn time is very short, like a maximum of 10 seconds. So, what people are doing is using helicopters to crash onto the roofs of bases, causing a lot of damage to the structures. But before it happens, they jump out of the helicopter, so the player doesn't take any damage. Then they quickly destroy turrets with high-end explosives, and that's it—the raid is successful. After that, the raider doesn't even need to return to their base because they pick up the valuable items, commit suicide, respawn in their base using \"reclaimers\" to retrieve their drop, commit suicide again, respawn near the enemy base on one of the many beds, loot whatever is left, commit suicide, respawn in their base, and reclaim all the items.\n\nThe second issue is that to loot something, an enemy player has to demolish a chest so that everything inside it drops on the ground. There is only a 5-minute window to pick up all the materials before they decay and disappear. So, imagine if an enemy is attacking your base using explosives, demolishing many chests, and you're trying to stop them while focusing on the fight. There's no chance to get the drop and place it in new chests because you're engaged in the battle, which could last longer than 5 minutes, for example.\n\nI can't understand why there is no limit on the number of beds per player (maximum 1 without the ability to spawn on another player's bed). Why does that option to reclaim your items even exist? Imagine I am a sniper on a rock, killing someone who is far away from me. Who would reach their drop faster? Me, who needs to go down from the hill and walk far to pick it up, or the guy who respawns in their base after 10 seconds and clicks on the reclaimer?", "timestamp_created": 1703201526, "timestamp_updated": 1703201526, "voted_up": false, "votes_up": 243, "votes_funny": 10, "weighted_vote_score": "0.866301655769348145", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "149627076": {"recommendationid": "149627076", "author": {"steamid": "76561197988363181", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 842, "playtime_last_two_weeks": 0, "playtime_at_review": 842, "last_played": 1698034216}, "language": "english", "review": "READ HERE IF YOU WANT TO KNOW HOW THE \"HORDE\" SYSTEM WORKS. \n\nLots of reviews akin this game to 7d2d because survival and zombies. This will also make you think there are hordes of enemies especially with the trailer. No. This is not a survival game. It's a tower defense game that has a survival game slapped on the side of it for tedious things. There are sporadic points where you can get a half decent \"horde\" on your screen in certain towns but 7d2d does it better. Notice all the hordes of zombies and bases they run through? Yeah. It's that. You set the start and end point for the zombies and you start the event every 10 mins to have them rush to that end point and you build the path to stop them. Upgrading the distance etc as you grind through the levels. There's no random assault on your base or anything of that nature outside of pvp. \n\nAs a tower defense game, this is a solid 9/10. As a survival game it's a 3/10. The ai and open elements of the game are frankly, absolute dog shit. Everything follows the basic script of charge to player, but on top of that for melee mobs you can just jump in place to not take damage. Honestly feels worse than the old halo 2 Ai where you can sit behind a rock and they will slowly creep to it letting you blast them down. This Ai is perfect for tower defense games not survival style. They look for the path of least resistance and just rush forward. Tested it out a good bit opening doors further and further down a wall. They will in fact just run down to the open door even if it's forever away since it's easier than breaking a wall.\nBesides the Ai being weird things just don't feel right from a power creep perspective either. You get access to a full excavator that you can just sit on for free materials at the same time you unlock the ability to create a wood cabin. It also doesn't take electronics. Just awkward and all over the place for the build progression. For some reason the balista with no form of automation, just a regular giant bow you would normally have to man, will also just fire at things. Screams tower defense over survival. Survival games you ramp up and increase in a flow pattern that goes with the age that you are progressing through. Naked - weeds - woods- stone - metal - modern. This looks like that pattern and then you slap down a full automated oil rig next to your wood house and just start to question how you did that.\n \n\nThe power imbalance of pvp is more than obnoxious, between random ping issues from china connections, hacking being rampant, or the fact base building feels entirely irrelevant until you're at metal stuff is just wild. Even if you take away the already established side of survival games lets look at this from a fresh aspect.\n\nYou could sink all your time into making a base and getting it upgraded, feeling decently confident that if anyone else ends up higher than you they are def no life sweating at the game. Nah jimmyjoebob can just roll up to the winter zone and snag a tank and wipe you flat while putting up 0 effort to farm a single thing. He wasn't established, he didn't no life the game. Homie ran through dogwater AI that couldn't hit fish in a barrel then up to a tank that was \"guarded\" hopped in and proceeds to dump all over your base. Sweet design choice there, especially in a game where you should farm and work your way up to things. Nah just give people the ability to wipe bases naked free of charge. \n\nTLDr - it feels like it was built as a tower defense game and the devs didn't think it would hold enough interest so they just started slapping any feature they could from the survival genre. Should have left it as a TD, would have felt better to play.", "timestamp_created": 1699237689, "timestamp_updated": 1699237689, "voted_up": false, "votes_up": 263, "votes_funny": 5, "weighted_vote_score": "0.849331378936767578", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "156664308": {"recommendationid": "156664308", "author": {"steamid": "76561198153434778", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 59141, "playtime_last_two_weeks": 0, "playtime_at_review": 53693, "last_played": 1707231675}, "language": "english", "review": "I tried the pvp and it's more of a hard survival. People blocking spawn points with gates and such. The raids should be once a week and you should beable to pick your day/time. Instead it's everyday. raided everyday and loosing everything was too stressful. Not my cup of tea when a certain group decides to hog all resources/mines and randoms just kill you to take your stuff. \nNow, the pve is awesome. People work together a real great group to be a part of. It's amazing to see peoples creations and not have to worry they will kill you for just looking. I'd advise pve for those who actually want to play the game, and pvp for the ones that don't.", "timestamp_created": 1706055843, "timestamp_updated": 1706055843, "voted_up": true, "votes_up": 99, "votes_funny": 7, "weighted_vote_score": "0.842293739318847656", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148071340": {"recommendationid": "148071340", "author": {"steamid": "76561198036550901", "num_games_owned": 551, "num_reviews": 41, "playtime_forever": 4441, "playtime_last_two_weeks": 0, "playtime_at_review": 356, "last_played": 1698023759}, "language": "english", "review": "Can it be improved? - Yes\n\nIs it horrible? - No\n\nShould you leave a negative review because of \"store bought assets\" Like your favorite game Rust used - No", "timestamp_created": 1697108994, "timestamp_updated": 1697108994, "voted_up": true, "votes_up": 169, "votes_funny": 13, "weighted_vote_score": "0.839552640914916992", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "155265774": {"recommendationid": "155265774", "author": {"steamid": "76561198366011092", "num_games_owned": 114, "num_reviews": 6, "playtime_forever": 5127, "playtime_last_two_weeks": 0, "playtime_at_review": 5127, "last_played": 1704399259}, "language": "english", "review": "Base decay ruins this game, can't take any time away without loosing everything. Build up to top gear, have to go away for a few days and everything s gone when you get back.", "timestamp_created": 1704410320, "timestamp_updated": 1704410320, "voted_up": false, "votes_up": 140, "votes_funny": 21, "weighted_vote_score": "0.837739050388336182", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148439636": {"recommendationid": "148439636", "author": {"steamid": "76561198047996852", "num_games_owned": 156, "num_reviews": 2, "playtime_forever": 2285, "playtime_last_two_weeks": 0, "playtime_at_review": 184, "last_played": 1698170139}, "language": "english", "review": "With their new update. They want access to lock you off your windows account on your PC, access to your webcam, create hidden registration keys on your windows and access to windows user settings. My anti-virus tells me that and thats why it deletes the file instantly upon detection.\n\nTell me why you need to be able to lock people off their windows account, access to peoples user account settings and why you need access to peoples webcam?", "timestamp_created": 1697640561, "timestamp_updated": 1697640561, "voted_up": false, "votes_up": 251, "votes_funny": 12, "weighted_vote_score": "0.813758134841918945", "comment_count": 41, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "149549471": {"recommendationid": "149549471", "author": {"steamid": "76561199176788550", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 9427, "playtime_last_two_weeks": 0, "playtime_at_review": 7550, "last_played": 1701904352}, "language": "english", "review": "I like everything except for the inability to pick up and readjust building parts.", "timestamp_created": 1699140338, "timestamp_updated": 1699140338, "voted_up": true, "votes_up": 72, "votes_funny": 0, "weighted_vote_score": "0.799273490905761719", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "149670990": {"recommendationid": "149670990", "author": {"steamid": "76561198204322253", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 3024, "playtime_last_two_weeks": 0, "playtime_at_review": 2477, "last_played": 1699577961}, "language": "english", "review": "Played for 30 hours collecting resources and leveling up, i was finally able to make a car and a group that had 4 Abram tanks and Apache air support blew me up with my base and took all my stuff. I smoke meth now. 10/10 game", "timestamp_created": 1699304234, "timestamp_updated": 1699304303, "voted_up": true, "votes_up": 87, "votes_funny": 99, "weighted_vote_score": "0.796218216419219971", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "150838332": {"recommendationid": "150838332", "author": {"steamid": "76561197992976849", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 13, "playtime_last_two_weeks": 0, "playtime_at_review": 13, "last_played": 1700626247}, "language": "english", "review": "Extremely invasive Chinese anti-cheat that collects way more data than in should need? Strike one. \n\nA mandatory tether for non-dedicated sessions with a max distance of 1000m, making playing with your friends an absolute ballache? Strike two. \n\nIncredibly poor game systems tuning to the point where on vanilla settings, the first hobo npc with a knife that you encounter will one-shot you? Strike three. \n\nThis is 7 Days to Die if it was made by much less talented developers under constant duress from the threat of their families getting black-bagged, with a hefty dose of potential CCP malware thrown in. Hard pass.", "timestamp_created": 1700627195, "timestamp_updated": 1700627195, "voted_up": false, "votes_up": 67, "votes_funny": 8, "weighted_vote_score": "0.782477736473083496", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "154122138": {"recommendationid": "154122138", "author": {"steamid": "76561198029035288", "num_games_owned": 243, "num_reviews": 2, "playtime_forever": 2339, "playtime_last_two_weeks": 0, "playtime_at_review": 1526, "last_played": 1704168497}, "language": "english", "review": "TLDR: This game feels like an old game that didnt age well. It lacks modernization, and has very little polish and charm. Still a somewhat fun nostalgia trip though.\n\nPlaying The Front is a bit weird to me. The game is a time machine into the past, and quite frankly is being released a decade too late. If this game had been released in 2015 as an early access title, it would have fit right in alongside rust, Ark, Conan, etc. It may have even had a leg up on one or two of those competitors with its unique take on NPCs, tech level, vehicle options, and wave defense. However the game in its current state *feels* like those games back when they were released in 2013-2016 \nIt has dated resource grinding without any unique characterization to keep it from feeling dull. (think \"sweet spot\" minigame in rust, or dino harvesting in Ark).\n It has dated NPC ai where as long as you are walking backwards most melee enemies cant actually hit you, and all the enemy does is run a straight line at a target.\n\nPretty much everything about the game is just a 2015 survival game, from the concept, the mechanics, the graphics, all the way to the overall polish of the game. It is pretty unfortunate the devs havent seemed to pick up on any of the quality of life changes other big name games in the genre grew into. Or implemented any of the new techniques or technology explored by titles like The forest, Grounded, etc.\n\nI really enjoyed playing Rust back in the early days of its development, and still play a TON of Ark, so the dated mechanics have been a slight bit nostalgic for me to be entirely honest. Its like getting to experience a game you like for the first time again. However, I know that it wont take long for that nostalgia to end and the dated mechanics, graphics, and tedious grinding will make the game feel miserable to play. \n\nThe main thing The Front has going for it that is really promising though. The Wave defense mechanic is unique to the genre as far as the way it is implemented. Giving the player the ability to choose where and when the defense occurs is awesome and there is a loot reward tied to it so you arent forced to go clear POI's to get quality loot.\n\nUnfortunately The game is just outdated for games today, and it fights itself a little bit on what its identity is (PVE wave defense, or pvp survival shooter)\n\nI would recommend the game if you want a weekend or two of old school fun with some friends, you want a slight break from your other survival games you typically play but dont want to change genres or you want a hallucinogenic nostalgia trip into the hellscape that was 2010s survival games. Try and get it on sale. \n\nedited for formatting", "timestamp_created": 1703242395, "timestamp_updated": 1706349140, "voted_up": true, "votes_up": 41, "votes_funny": 1, "weighted_vote_score": "0.772081673145294189", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148368551": {"recommendationid": "148368551", "author": {"steamid": "76561197994611780", "num_games_owned": 427, "num_reviews": 25, "playtime_forever": 4602, "playtime_last_two_weeks": 0, "playtime_at_review": 132, "last_played": 1703103263}, "language": "english", "review": "UPDATE: After playing for roughly 16ish hours I can say at the price point, it gets a recommendation from me.  Most systems work well. For the love of god devs put in building pick up or full resource refund. \n\nI will say this. If you're planning on PVP. I wouldn't until they change their anti-cheat. It's made for mobile systems and does not work on a windows environment.\n\nBut if you like building, Tower Defense, and pew pew in PVE it's fun. With a group of friends it's even more fun.\n\nAs always I'm leaving my original reviews up for the masses to read if they like.\n\nTL;DR: Game orginally flagged AV Warning. Refunded. Issue was resolved. Re-purchased. Enjoying my time in PVE as PVP is full of hacks and exploiters.\n\nUPDATE: Original reviews below. While I haven't jumped in to play the game yet I did re-purchase the game as a buddy of mine said the AV issue was fixed.  Which is great.  Just wanted to throw this edit up so that people who see it can see that the either the devs fixed the issue or the files were submitted and cleared. \n\nOnce I get a chance to jump in the game again and see how it plays I'll amend my recommend status and review to fit my opinion of the game.  Because really, that's all reviews are, an opinion of one player of the game. You shouldn't take them as gospel and form your own opinion. \n\nI'm a big supporter of indie games / development but some of ya'll act like it's a crime to call things out. Calm down big guy, it's not life or death. The fanboi comments from the teenie boppers crack me up though so keep them coming.\n\n﻿Time;Scanner;Object type;Object;Detection;Action;User;Information;Hash;First seen here\n10/13/2023 10:52:24 PM;Real-time file system protection;file;C:\\Program Files (x86)\\Steam\\steamapps\\downloading\\2285150\\TheFrontManager\\ServerOperation.exe;a variant of Win64/GenKryptik.GOWI trojan;cleaned by deleting;Event occurred on a new file created by the application: C:\\Program Files (x86)\\Steam\\steam.exe (871C682F6BA9221705A4E5617D54FC51F1C63F91).;DF29C2E82583D9460FD8C53E6DB8CE1642431447;10/13/2023 10:52:06 PM\n\nCannot and will not recommend until the devs address this virus and remove it. I had to dance around my AV on an older machine to get in the game to play. No way was I turning off my protection on my main rig.\n\nDevs have danced around the issue and gave no answer other than \"not virus\". That's not enough. Address the issue Devs and maybe just maybe my playground and I will purchase the game again. \n\nRefunded.\nReason - Trojan found in files.", "timestamp_created": 1697512885, "timestamp_updated": 1701387020, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.767762303352355957", "comment_count": 18, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148111420": {"recommendationid": "148111420", "author": {"steamid": "76561197987034533", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 11718, "playtime_last_two_weeks": 0, "playtime_at_review": 1406, "last_played": 1697942230}, "language": "english", "review": "great game owned it for 24 hours, played 23 hours", "timestamp_created": 1697165808, "timestamp_updated": 1697165808, "voted_up": true, "votes_up": 56, "votes_funny": 14, "weighted_vote_score": "0.755589187145233154", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148224140": {"recommendationid": "148224140", "author": {"steamid": "76561198045604950", "num_games_owned": 238, "num_reviews": 5, "playtime_forever": 579, "playtime_last_two_weeks": 0, "playtime_at_review": 579, "last_played": 1697304510}, "language": "english", "review": "I spent nearly 10 hours trying to get a server started due to the poor documentation and horrendous translations only for the server to break 4 hours after successfully making one the moment an update was pushed out because the configuration required special characters that I'm assuming are Chinese and could ONLY be generated by a product shipped with the game; not the server software shipped with SteamCMD.\n\nThen to make matters worse once I got it up and running my friend \"Orenji\" tried making his character, and joining only to find that \"Ji\" is censored in his name and thus wouldn't allow him to use a name just because two letters of it are censored by their automatic filter that you can't bypass.\n\n\"Ji\" isn't even the worst of ridiculous words being censored by them.  \"Big\" and \"Server\" are some of the other ridiculous examples.  \n\nIn-Game Menu for graphics settings doesn't work, no option to change keybinds, no option to change graphics quality without editing an .ini directly, \"Enter\" doesn't work to confirm text boxes, mouse wheel doesn't scroll through the hotbar like ANY other game that has one...\n\nI'm looking at losing a refund because for some stupid reason I actually cared enough to TRY to set up this server and  spent 10 hours in-game troubleshooting why it wouldn't work.  I would recommend trying drugs before giving this game your money.\n", "timestamp_created": 1697305570, "timestamp_updated": 1697305570, "voted_up": false, "votes_up": 161, "votes_funny": 28, "weighted_vote_score": "0.755265235900878906", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148611781": {"recommendationid": "148611781", "author": {"steamid": "76561198812822574", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 792, "playtime_last_two_weeks": 0, "playtime_at_review": 449, "last_played": 1699539177}, "language": "english", "review": "I'll start by addressing the elephant in the room. It would seem if you play on a public server, you will get attacked by a sad low life hacker who can't play the game with out being an a hole. Maybe they should get out of the basement and be a decent human. This is not the devs fault. All games with pvp suffer the same. Let the children play pvp.\n\nI play on a private pve server and I have to say, it is incredible what they have achieved in such a short space of time. Graphically it is very pretty with almost no lag or glitches. I have 10 hours in and no bugs as yet.\n\nIn short, for £16 it is money well spent and long may the development continue.", "timestamp_created": 1697903348, "timestamp_updated": 1697903348, "voted_up": true, "votes_up": 49, "votes_funny": 0, "weighted_vote_score": "0.748489677906036377", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148029059": {"recommendationid": "148029059", "author": {"steamid": "76561199038980294", "num_games_owned": 156, "num_reviews": 16, "playtime_forever": 16523, "playtime_last_two_weeks": 0, "playtime_at_review": 11676, "last_played": 1701872532}, "language": "english", "review": "This game is a perfect mix between Ark, Rust, and Battlefield, there was never a time where i was bored, and i could always just PVE. good graphics, friendly community as well.", "timestamp_created": 1697036278, "timestamp_updated": 1697036278, "voted_up": true, "votes_up": 102, "votes_funny": 6, "weighted_vote_score": "0.747889220714569092", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "149435611": {"recommendationid": "149435611", "author": {"steamid": "76561198031299247", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 45056, "playtime_last_two_weeks": 0, "playtime_at_review": 15738, "last_played": 1701047865}, "language": "english", "review": "Still Early, but plenty of fun so far. Nothing beats the feeling of logging off in your palace and waking up naked and destitute.\n\nUpdate: \n\nI put in a little bit of time, and I think I've logged enough to give a more detailed review:\n1. The beginning of the game is fun the first time. After the first time it feels much more grindy but doesn't take too long to get through. This is unpleasant though if you are facing frequent server wipes.\n2. Mid-game is the most fun. This is when you are competing for resources, trying to get a defendable base, and unlocking your tech tree.\n3. End-game tends to drag. Grinding for talents and recipes is repetitively painful. Once you have a stash of thousands of rockets and tank ammunition, you just need to raid someone, but then you are waiting for their raid timer all the time. \n\nI played mostly solo, but found the game isn't great for solo play. Some of the end-game content is too easy and some is too hard for solo play. Some of it is too expensive... Grind ammo for two days in order to take out a site to get a poor ammo drop. Besides recipes, and very lucky raids, gathering resources is always the most productive activity by a factor of 100x. \n\nThis game could get really good if end-game is tuned right. My biggest complaints are no 3rd-person view, no mods workshop, and simple QoL issues like clicking 20 stacks twice to make a recipe. \n\nI had fun and it is definitely worth 10x the price for how much I played it.", "timestamp_created": 1699013137, "timestamp_updated": 1702178071, "voted_up": true, "votes_up": 36, "votes_funny": 28, "weighted_vote_score": "0.747489571571350098", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148864304": {"recommendationid": "148864304", "author": {"steamid": "76561197970357925", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 7205, "playtime_last_two_weeks": 0, "playtime_at_review": 3791, "last_played": 1701009023}, "language": "english", "review": "I'll write my review now after some 60 + hours in game (currently at \"concrete\" and the first chopper and second tank vehicle) \n\nI might update my review later on. \n\nThe game has a good base foundation set already, with most of the early access games, do not have every thing available yet (only wood / stone for example ), such as Ark Survival with launch when early access (i got around 1000 hours ) or sons of the forest (Wood / Stone available) \n\nThe current map seems nice and enough to do with snow and desert biodomes available, I also see several mines on the map with all sort of ores available and bases / buildings full of human NPC's in which you can \"raid\" and get their items.\n\nThere is a \"creature beacon\" available in which you can let \"waves\" of creatures / animals / humans come at you (you can maze and build traps for it, they need to reach your \"spacetime beacon\" that is set out as your area to build in and get auto repair as well ) and mobs give you loot and you be rewarded with blueprints and ether shards and talent points, you can get supplies at the spacetime beacon once you finished a round for extra shards and blueprints.\n\nThe ether shards you can use these to unlock new building / vehicles / gear but you also got  \"talent points\" in which you can use to improve your combat skills ( more damage with melee or certain weapons ) or survival ( think of getting more wood when chopping or more ore )  and another skills ( vehicle skills also upcoming but not available yet ) \n\nThis game is already much further in the progress with many things available already for a early access game.\nYou can go from wood towards stone and afterwards concrete and steel and at last \"tungsten\" \n\nThere are also several vehicles available from very easy to make until basic and also advanced tanks and helicopters.\nYou can go PvE but also PvP in this game.\n\nThere are some \"bad\" reviews here about that some things are bugged ( it is still early access, come on ) and glitches but they are fixing things i noticed ( last few patches was mostly fixing bugs / glitches and optimization ) and there is much available already for a \"early access\" game with a low price for now.\n\nSince i played several survival games i got some suggestions / features to add.\n\nFeatures / suggestions to add:\n- Synced local server files (able on your own \"local\" server to play anywhere where ever you install the game ) \n- 3rd Person view ( i am really missing this one specially while building ) \n- Ultra wide support\n- Mouse sensitivity\n- FOV slider\n- Mods and workshop / mod managers ( it is on the road map that is good, they say within 1-3 months of release ) \n- Squad Alliances \n- Bigger Squads \n- Able to pick up a object / building / wall whatever after placing it in game for a certain amount of time ( not nice to see your object placed wrong and you don't get it all materials back )\n- Shared XP when in squad while killing / crafting and such\n- See each other names when you are in a vehicle ( it is there in the options on \"Shown\" but not working )\n\nThey recently added a important request / fixes in game that was missing:\n-Costum Keybindings\n- Next to that they do alot of bug fixing i see coming by in the first few patches which is good ( a better and more stable optimized game ) \n\n**Dedicated server features / suggestions **\n- They added a \"The Front manager\" to manage your own \"dedicated\" server\n- Auto recovery of crashed / hang server\n- Auto boot of servers on certain time and restart schedule as well\n- Able to select what internal IP is used for the server\n\nThey are testing out 80 player slots servers at the moment and i wonder if more and clustered servers with different maps would be possible too.\n\nI play on my own dedicated servers and i see also reviews about cheaters but i do not play on another servers but my own ( so no cheaters on my servers ) \n\nNext to some reviews about having a virus: i also got Kaspersky and i did got a report about it since the update on the 13/14th of the game ( it was fine the first few days )\n\nSo i send the actual file \"TheFront.exe\" towards Kaspersky and a malware analyst checked it out and it said was clear of anything and they would be adding it to the safe list. \n\nI think this game has a lot of potential", "timestamp_created": 1698256080, "timestamp_updated": 1698270327, "voted_up": true, "votes_up": 22, "votes_funny": 0, "weighted_vote_score": "0.739547014236450195", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148189975": {"recommendationid": "148189975", "author": {"steamid": "76561198152117440", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 2465, "playtime_last_two_weeks": 0, "playtime_at_review": 1867, "last_played": 1697455777}, "language": "english", "review": "Game has a lot of potential launch was fairly smooth, no lag, no major game breaking bugs on the release, small fixes required here and there and most basic qol still missing but that can come with time cause it isn't crucial to the gameplay, ai was pretty braindead at the start got slightly better after some tweaks, animals are too op imo getting 1hit by a wolf in starting area is questionable but whatever and other smaller things but most importantly yet again as any pvp survival games these days it took 3 days for the game to get filled with chinese hackers that noclip through your base and fly up rocks to raid everyone and kill the server before they move onto the next server", "timestamp_created": 1697276103, "timestamp_updated": 1697277144, "voted_up": false, "votes_up": 74, "votes_funny": 3, "weighted_vote_score": "0.738309204578399658", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "149368993": {"recommendationid": "149368993", "author": {"steamid": "76561199073727917", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 14975, "playtime_last_two_weeks": 0, "playtime_at_review": 7179, "last_played": 1702158451}, "language": "english", "review": "the PvE was nice to play but the pvp is horrendous. I understand that cheaters and offline raiding is a problem of the genre as a whole and the front tries to counter it with the spacetime beacon, but and I say this with a big BUT, it was an aggravated experience when you get raided by the higher level players and you cant do nothing NOTHING about. oh you just finished your starter wood base and logged off, well Sb Molotov the entire thing. oh you upgraded to a stone/concrete, well here comes a tank about demolish it. I am frustrated to a tea with the fact that they have better armour, arsenal of weapons, and also did I forget to mention being offline.", "timestamp_created": 1698928026, "timestamp_updated": 1698928026, "voted_up": false, "votes_up": 108, "votes_funny": 26, "weighted_vote_score": "0.730282604694366455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148075708": {"recommendationid": "148075708", "author": {"steamid": "76561199013545202", "num_games_owned": 66, "num_reviews": 4, "playtime_forever": 34004, "playtime_last_two_weeks": 0, "playtime_at_review": 349, "last_played": 1701823807}, "language": "english", "review": "I would recommend this game to anyone that doesn't whine at every little issue they have, it's clearly an Early Access game. People are leaving negative reviews as if this was a finished game, Dev's have already released a patch to fix some of this issues. Basically they have taken a lot of inspiration from Ark, Rust, Conan Exiles, 7 Days to Die, and every other survival game you can think of kinda rolled them into one. If you have played any of those games then you already know they still have issues, This game has been out for 1 day and it's less than $20, I've already got my money worth out of it.  Personally I think it's worth it, especially if you're the type that enjoys a game that has a lot of potential and don't mind watching it grow.\n\n-Edit- After 500+ hours I've still not encountered any game breaking bugs, lots of minor bugs that can be an inconvenience. They are still releasing updates and patches quite frequently. This is by far one of the best Early Access games I've played. PVP or PVE they both are fun in my opinion.", "timestamp_created": 1697116022, "timestamp_updated": 1700590214, "voted_up": true, "votes_up": 41, "votes_funny": 4, "weighted_vote_score": "0.727782547473907471", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148059836": {"recommendationid": "148059836", "author": {"steamid": "76561198258422208", "num_games_owned": 0, "num_reviews": 476, "playtime_forever": 1271, "playtime_last_two_weeks": 0, "playtime_at_review": 652, "last_played": 1697405809}, "language": "english", "review": "[table]\n    [tr]\n        [th]GPU[/th]\n        [th]CPU[/th]\n    [/tr]\n    [tr]\n        [td]RTX 3070Ti 8GB[/td]\n        [td]Ryzen 9 5900X[/td]\n    [/tr]\n    [tr]\n        [td]RAM[/td]\n        [td]OS[/td]\n    [/tr]\n    [tr]\n        [td]64GB[/td]\n        [td]WIN 11[/td]\n    [/tr]\n[/table]\n\n\n[u][b] Gameplay [/b][/u]\nThis game is my type of survival with a great progression system and every player starting on even playing fields. There is a lot of crafting and the tutorial and mission system is simple and very easy to learning. Building is easy and i find it un-awkward to build i don't see the fuss of other people playing. You can Play with mouse and keyboard however i find using a controller through steam controller support works just as good. The character creation is very lame and i hope they expand on this in the future.\n\n[u][b] Graphics/Frames [/b][/u]\nThe graphics on this game are awesome i play on high settings and have no issues but you can play it on lowest and see no difference in graphical change it still runs amazingly well. I get over 90fps a great looking start for the graphical side of things.\n\n[u][b] Progression [/b][/u]\nThrough crafting to building to killing animals and Npcs this game rewards you with xp to level knowledge of tech. But its important to level up your character by killing Npcs as this gives you the books which are used to level stats and perks like increased stamina or health etc. \n\n[u][b] Final Thoughts [/b][/u]\nThis game has promise but it needs more work on the Character creation side of things as it feels bare minimum in this department. The servers need working on as connections crash alot and also i feel like there needs to be events like horde nights or dungeon exploration. Game is awesome though in all other areas. PS. watch out for the volume when first loading!! No in game VoIP makes the game feel lonely as there is no interaction but text.\n\n[u][b] Rating out of 5 [/b][/u]\n\nI will give this game a 4/5 as i feel the character creation is not so good and lets the game down a little.", "timestamp_created": 1697084666, "timestamp_updated": 1697299083, "voted_up": true, "votes_up": 38, "votes_funny": 1, "weighted_vote_score": "0.725395262241363525", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "149078918": {"recommendationid": "149078918", "author": {"steamid": "76561198015158637", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 6362, "playtime_last_two_weeks": 0, "playtime_at_review": 5418, "last_played": 1704491280}, "language": "english", "review": "love it, only negative i have is the building system wish you could stack foundations to make it better to build on hills and mountains, I love the tanks and helicopters.", "timestamp_created": 1698526667, "timestamp_updated": 1698526667, "voted_up": true, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.721339106559753418", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "154612323": {"recommendationid": "154612323", "author": {"steamid": "76561197971902784", "num_games_owned": 0, "num_reviews": 77, "playtime_forever": 1837, "playtime_last_two_weeks": 0, "playtime_at_review": 1837, "last_played": 1703686864}, "language": "english", "review": "The Front has some fascinating mechanics that combine elements of Rust and Tower Defense. My experience has been exclusively in the cooperative PvE mode, where things start off strong but taper off after around 20 hours.\n\nThe game introduces a variety of unlockables to keep you going, but it starts feeling a bit pointless. The tower defense aspect, which I initially enjoyed, hits a wall with a somewhat early cap on traps. It's a bummer, as I was hoping for more progression in that department.\n\nOne thing that caught my eye is that some game assets seem to be straight out of an asset store. While not inherently bad, their integration isn't always seamless, giving the game a slightly unpolished feel. It's not a dealbreaker, but it does detract from the overall experience.\n\nThere's undeniable potential here, much like many early access titles. The future success of this game hinges on the developers' commitment to refining and expanding upon its current foundation. As it stands, it's a decent game with room for improvement—here's hoping the devs can bring it to its full potential.", "timestamp_created": 1703754627, "timestamp_updated": 1703946861, "voted_up": false, "votes_up": 18, "votes_funny": 1, "weighted_vote_score": "0.718286335468292236", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148322475": {"recommendationid": "148322475", "author": {"steamid": "76561198001613917", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 4534, "playtime_last_two_weeks": 0, "playtime_at_review": 2239, "last_played": 1698039257}, "language": "english", "review": "This game will exceed your expectations. I have thousands of hours in games like Rust, Battlefield, EFT, Ark, Atlas, 7 days to die, Conan Exiles. you name it ive probably played it. This game has elements just about from all of those and surprisingly does it all very well. The base raiding, pvp and resource gathering is very much like Rust. The PvE is like 7 days to die mixed with Fallout. The vehicle system/pvp is similar to battlefield. My crew is having a blast so far. a few very small bugs but the team seems active and fixing it and listening to the player base. One of the best 15$ games ive purchased by far. Highly recommend.", "timestamp_created": 1697439466, "timestamp_updated": 1697439466, "voted_up": true, "votes_up": 69, "votes_funny": 4, "weighted_vote_score": "0.705237150192260742", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "156191779": {"recommendationid": "156191779", "author": {"steamid": "76561199174228174", "num_games_owned": 15, "num_reviews": 4, "playtime_forever": 2088, "playtime_last_two_weeks": 0, "playtime_at_review": 2036, "last_played": 1705534323}, "language": "english", "review": "Fun game, \n\nonly down side is the constant toxic players, shit is genuinely exhausting, wouldn't recommend for that reason alone as nothing gets done about it.", "timestamp_created": 1705524702, "timestamp_updated": 1705524702, "voted_up": false, "votes_up": 50, "votes_funny": 14, "weighted_vote_score": "0.699540257453918457", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148899539": {"recommendationid": "148899539", "author": {"steamid": "76561198058579630", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 3632, "playtime_last_two_weeks": 0, "playtime_at_review": 2410, "last_played": 1698505624}, "language": "english", "review": "Fun except the part about being FULL of hackers that can walk up to your base and literally delete it.", "timestamp_created": 1698312705, "timestamp_updated": 1698312705, "voted_up": false, "votes_up": 47, "votes_funny": 1, "weighted_vote_score": "0.697921454906463623", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148031471": {"recommendationid": "148031471", "author": {"steamid": "76561198140363009", "num_games_owned": 147, "num_reviews": 3, "playtime_forever": 24337, "playtime_last_two_weeks": 0, "playtime_at_review": 11526, "last_played": 1701899774}, "language": "english", "review": "The game has its own unique atmosphere and gameplay, similar to Rust, with some mechanics borrowed from Conan Exiles. However, it takes on a completely different feel in the late game with the introduction of modern vehicles and firearms. It's a very intriguing game, especially when played with your best eagle friends!", "timestamp_created": 1697039334, "timestamp_updated": 1700748546, "voted_up": true, "votes_up": 49, "votes_funny": 2, "weighted_vote_score": "0.692627549171447754", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148356448": {"recommendationid": "148356448", "author": {"steamid": "76561198116430830", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 11804, "playtime_last_two_weeks": 0, "playtime_at_review": 919, "last_played": 1709043413}, "language": "english", "review": "If Scum, 7 Days To Die and Conan had a baby... She sure ain't pretty but boy... Does she make it up with charm.", "timestamp_created": 1697491173, "timestamp_updated": 1697491173, "voted_up": true, "votes_up": 29, "votes_funny": 9, "weighted_vote_score": "0.69170832633972168", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148372557": {"recommendationid": "148372557", "author": {"steamid": "76561197968527920", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 8, "playtime_last_two_weeks": 0, "playtime_at_review": 8, "last_played": 1697447239}, "language": "english", "review": "If you have a widescreen or ultrawide screen monitor, AVOID. Couldnt even get into a game as the resolution is locked so as not to even let you see enough of the screen to actually start a game.", "timestamp_created": 1697522136, "timestamp_updated": 1697522136, "voted_up": false, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.679348766803741455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148697559": {"recommendationid": "148697559", "author": {"steamid": "76561197987953347", "num_games_owned": 160, "num_reviews": 15, "playtime_forever": 9785, "playtime_last_two_weeks": 0, "playtime_at_review": 7184, "last_played": 1698346994}, "language": "english", "review": "The Front - Surviving the Chaos of Early Access\n\nThe Front is a game that boldly wears its \"early access\" label as a badge of honor. In a world where early access often means a lack of updates and a disengaged development team, The Front stands apart as a shining example of what early access should be. This game is actively being developed on the fly, with a very dedicated and active admin and development team at the helm.\n\nFirst and foremost, it's crucial to address the elephant in the room - the occasional complaints about cheaters and perceived negligence from the developers. This is where a fundamental misunderstanding of the complexities of game design, internet security, and the challenges of working with a limited budget comes into play. The gaming community can sometimes be quick to criticize, but it's essential to acknowledge the Herculean task that game developers face. The Front's team is actively trying to make the game better, even in the face of these challenges.\n\nAs a seasoned survival game enthusiast with 4,000 hours in Rust, 1,500 hours in Conan, and several hundred hours in other titles of the genre, I can say that The Front is making a valiant effort to combine the best aspects of these games into one unique experience. While I currently enjoy playing on a PvE server due to personal preferences, I can empathize with those on PvP servers who might find hackers frustrating. However, it's important to note that the issue of hackers plagues many survival games, and it's often a battle that's tough to win, no matter the developer's efforts.\n\nOne remarkable aspect of The Front is the developer's receptivity to player feedback. They actively seek suggestions for improvements and bug reports through the official Discord channel. What's truly commendable is that they not only listen but also act swiftly to implement some of the requested changes. This kind of responsiveness is a testament to the commitment of the development team.\n\nIn terms of the game's current state, it may not be perfect, but it's important to remember that perfection is not the goal during the early access phase. The Front is a work in progress, and it's evident that the developers are putting their heart and soul into it. Thus, a 7/10 for the current state feels like a fair assessment, keeping in mind the challenges they face.\n\nAs an enthusiastic supporter of The Front, I'm excited to see where the game will go in the future. It's already showing great promise and potential, and I look forward to being an active player when the survival gaming bug bites me again. The development team deserves a solid 10/10 for their dedication and enthusiasm. If you're a fan of survival games and are willing to embrace the journey of early access, The Front is definitely worth a try.", "timestamp_created": 1698007819, "timestamp_updated": 1698007819, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.675562441349029541", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148065405": {"recommendationid": "148065405", "author": {"steamid": "76561198003518140", "num_games_owned": 2824, "num_reviews": 361, "playtime_forever": 327, "playtime_last_two_weeks": 0, "playtime_at_review": 327, "last_played": 1697095794}, "language": "english", "review": "Before I start, let me give my specs\n* AMD Ryzen 7 5700\n* 48 GB RAM\n* 5 TB SSD (one 1TB drive plus two 2TB SSDa\n* NVIDIA GeForce RTX 3060 TI\n\nSo nothing major, pretty much a decently mid-range rig.  I haven't tried the game yet on any of my other systems so I can't say how it runs on them.  So I will just be referring to playing on the above machine.\n\nFirst off I collect far more games than I should.  With the new Total War just coming out, I put around 3 hours into it.   Then this afternoon I put in just shy of 5 hours, into The Front.   I didn't spent a lot of that time as one does with similar games, trying to rush the early unlocks and get a lay of the land.   \n\nI should also disclaim that I played Solo, so I have no idea what it is like for regular players (much less PVP ones).  That said, I did not change any of the settings when setting up the local server instance, other than password protecting it.    I feel that is important to disclaim for one of two reasons, first it will  off I am going to guess that the majority of players most likely are playing on an dedicated or at least open Multiplayer server.     Nothing really to back that up that just know that is how most people play games like Rust, Ark, RoK, and all the many, many other survival crafting games.    The second reason is to say what it is like for those that play solo and if doing so needs you to adjust settings like many other games similar.\n\nWhen I first started  playing I almost refunded because I kept having CTDs, but I eventually figured out that the problem was fully on my end, not the games side of things.   So once I got that resolved, I had no further CTD and the game (at least for my setup) ran a solid 60 FPS without any major bugs to speak of, aside taking me a short period of time to figure out the way to put in doors and windows.   Hint (you want to pull up the radial bar via right click when setting up walls.  Unlike many similar games, this one doesn't go the route of having a different door frame or window frame upon direct setup.  Not a big deal, though, once that was figured out it didn't take me long to set up a fairly decent small building.\n\nAt the time I quite the game for the night I had mad it to level 21.  I have no ideal what the level cap is, or if it will be unlocked as the game continues via Early Access.   So far I haven't really seen a lot of unique things that have blown me away, but then again I am still in as well as playing solo so I am sure I progressed a fair bit quicker than someone play PVP would off course.\n\nOne small thing playing solo is as of right now most of the crafting and even smelting either has a bug, or I need to adjust it for solo, because everything from cooking, the crafting, and in between requires you to stay at said station (if the item(s) must be crafted at a station, which after the initial 2 and a half hours I had enough unlocks that I was really getting burnt out at just staying at a station crafting.   I know many other games do this, and I know that it is geared for multiple players, and since I didn't change any settings, maybe boosting up the time would help.   I realize that it adds some realism to the game, not like you would drop a stack of 20 fish to fry then start up multiple furnaces and such and then walk off and let them just do their thing.   I am not sure if that is what the devs are going for, or if it is just something that they are working on changing with input.\n \nFrom the small area on the east coast I built the start of my fortress on the top of a hill fairly near the initial mid-eastern coast line.   Plenty of things to get you started there, however you still have to explore as well often right off PVE NPC's that sometimes drop talent books and more importantly recipe books. There are also a number of worn down shacks that usually have at least one NPC but there is usually one or two chest on a nearby boat or inside one of the shanty houses.   I did run into some NPCs in a mining quarry that outclassed me by a fair amount.  One of NPCs had near boss level health.  So you want to be careful, however you can respawn at your point of death, and at least at the moment the mobs don't seem to attack you right off the bat so you are able to quickly pickup your dropped loot and work on pulling back out of the enemy area.   The NPC AI is different enough to be semi-challenging when you are outnumbered, however other than being outnumbered the only mob I fought against was a huge meat  shield who also had a shield.   I forgot to try a bola on him to see if I can use that to get around him and wear his large health pool down but didn't think of that.\n\nAll in all crafting is fair.  I would put it around the same level of build-up as Conan as far as the number of potential stations and craft-able items.   \n\nFor the price, the game is decent even at this early stage.  I never ran into any other animals in the wild other than bunnies who are just okay with their evasion AI tactics.  Half the time I didn't bother switching to a spear or the flintlock I had and would just kill them by using whatever gathering tool I had in my hands at the moment.  \n\nI mentioned Bolas being in the game.  They do help a great deal.  Matter of fact against the bunnies and NPCs they did a great job at holding them in place to let me get in a  decent position to attempt to flank them.\n\nAll in all out of my approximately 5 hours I can say it is fun.  It manages to be like so many other similar games, but does manage to pull off a few things that have an unique feel  to them.\n\nNow if I can just figure out how to to use the manual drilling machine for Ore and Crude Oil.   I have had to move mine around placing it on sand as it says it requires to find such items but with around 15 minutes of drilling I only got a single barrel of crude oil and a piece of clay.\n\nAll of these things I am sure will improve.   At this point I recommend it.", "timestamp_created": 1697097926, "timestamp_updated": 1697097926, "voted_up": true, "votes_up": 44, "votes_funny": 4, "weighted_vote_score": "0.675185263156890869", "comment_count": 17, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148568308": {"recommendationid": "148568308", "author": {"steamid": "76561198143010223", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 6194, "playtime_last_two_weeks": 0, "playtime_at_review": 3194, "last_played": 1699796914}, "language": "english", "review": "𝐈'𝐦 𝟗𝟗% 𝐬𝐮𝐫𝐞 𝐧𝐨 𝐨𝐧𝐞 𝐫𝐞𝐚𝐝𝐬 𝐫𝐞𝐯𝐢𝐞𝐰𝐬, 𝐬𝐨 𝐈'𝐥𝐥 𝐣𝐮𝐬𝐭 𝐬𝐚𝐲 𝐈'𝐦 𝐠𝐚𝐲.", "timestamp_created": 1697842397, "timestamp_updated": 1697842397, "voted_up": true, "votes_up": 407, "votes_funny": 245, "weighted_vote_score": "0.674755454063415527", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148992849": {"recommendationid": "148992849", "author": {"steamid": "76561199494484630", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 2232, "playtime_last_two_weeks": 0, "playtime_at_review": 357, "last_played": 1700863605}, "language": "english", "review": "hella glitchy but i do believe this game could be the Game we've all been looking for love it", "timestamp_created": 1698428132, "timestamp_updated": 1698428132, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.672064840793609619", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148385952": {"recommendationid": "148385952", "author": {"steamid": "76561197990545877", "num_games_owned": 1819, "num_reviews": 73, "playtime_forever": 1323, "playtime_last_two_weeks": 0, "playtime_at_review": 802, "last_played": 1698968027}, "language": "english", "review": "For the price of admission I feel I have already gotten my money's worth. I decided to play solo on an official pvp server. I had a blast for a few days building and gathering while leveling my tech and scoping nearby areas out for loot and enemies. Yesterday the servers went down for maintenance for about an hour. As soon as I could I logged back in. When I awoke in game there was a clan in my house raiding it somehow and they killed me and took all my stuff. I had no chance. I have no chance of clapping back solo either.  Play with friends or play pve until they make solo servers. I'm not even mad it was fun", "timestamp_created": 1697549869, "timestamp_updated": 1697549869, "voted_up": true, "votes_up": 27, "votes_funny": 2, "weighted_vote_score": "0.669702708721160889", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148780105": {"recommendationid": "148780105", "author": {"steamid": "76561198017923893", "num_games_owned": 178, "num_reviews": 6, "playtime_forever": 4970, "playtime_last_two_weeks": 0, "playtime_at_review": 4521, "last_played": 1698407788}, "language": "english", "review": "The game has lots of potential, but the studio's roadmap requires a complete overhaul if they are to achieve that. New guns, POIs, and \"content drops\" isn't what this game requires. It's starving for fixes, optimisation, balancing and enrichment of currently-existing mechanisms.\n\nThey've done a good job creating a vibrant, interesting map to play in. The PVEVP aspect is a welcome addition, with NPCs populating various areas of the game and the tower defence mechanic not being half bad. The progression is interesting and there's a variety of items, workbenches, and defensive structures to build. The grind feels meaningful, albeit not too hardcore. The electronics are implemented in a good way, for the most part. Farming is fun.\n\nThat being said, the game plays and feels like an early access game. Movement and combat are super junky. The AI pathing is horrendous. Server performance leaves a lot to be desired, and their release plans for the game servers have been abysmal (most of the 40 pop servers are dead, whereas the few 80 pop servers are overcrowded with queues lasting up to 4 hours). In typical fashion, most EU servers are overran by Asian hordes.\n\nThe map itself is big and resources are in abundance. It can easily accommodate double the amount of players than it currently is, should performance issues be addressed. As it currently stands, most areas are desolate, with whole grids being owned by a single clan. I've spent approx. 80 hours in this game, and apart from an early game bow fight, I've only ran into other players a whooping 3 times! Unless some sort of resource scarcity is introduced, or the pop. cap increased dramatically, competition is unnecessary - farming is always the easiest/fastest option. \n\nRaiding is unfortunately overtuned. Cocktails are plentiful, and they melt through everything up until concrete. \n\nMeaningful player interactions should be the way development heads towards. Unfortunately, I don't trust the devs to do that.", "timestamp_created": 1698147014, "timestamp_updated": 1698147014, "voted_up": false, "votes_up": 64, "votes_funny": 4, "weighted_vote_score": "0.669314861297607422", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "149028824": {"recommendationid": "149028824", "author": {"steamid": "76561198006881537", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 17543, "playtime_last_two_weeks": 0, "playtime_at_review": 300, "last_played": 1703460109}, "language": "english", "review": "Beter building then Ark. More stuf to do then 7 days to die. And no lose like Rust.", "timestamp_created": 1698475226, "timestamp_updated": 1698475226, "voted_up": true, "votes_up": 36, "votes_funny": 7, "weighted_vote_score": "0.66781240701675415", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148380767": {"recommendationid": "148380767", "author": {"steamid": "76561198010655219", "num_games_owned": 0, "num_reviews": 51, "playtime_forever": 737, "playtime_last_two_weeks": 0, "playtime_at_review": 258, "last_played": 1699617848}, "language": "english", "review": "Fun game.\nNeeds some bugfixing and from what I'Ve heard, a lot of anti cheat efforts on online servers.\nI play single player, so I don't care about that.\nExamples for bugs: Sometimes gates won't close. If you craft and move stuff around, it might bug out. Some of the quests randomly stop tracking for some time.\n\nNothing game breaking.\n\nThe animations need improvement, but they're getting the job done.\n\nOverall: Good game for the price.", "timestamp_created": 1697541133, "timestamp_updated": 1697541133, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.66719663143157959", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "150502452": {"recommendationid": "150502452", "author": {"steamid": "76561198073157621", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 315, "playtime_last_two_weeks": 0, "playtime_at_review": 315, "last_played": 1700500772}, "language": "english", "review": "I've always enjoyed the survival craft component of games, the fundamentals of these games are relatively similar throughout so it is pretty simple to establish your comfort level if you play games like the ones I will be comparing it to.\n\n After a few hours of playing here is what I have concluded.\n\nIf a video game were to have two parents like Rust and 7 Days to die, but the parents don't really talk as much anymore; I mean they're trying to make it work and the effort is showing. The child spends most of their days in school being taught by Conan Exiles, but their favorite instructor is actually Craftopia however, they only see this teacher during shop class...This child would be, The Front, let me be clear. These are all GOOD things, in my opinion. I enjoy things in all of those games and have lost hours to all of these games. \n\nI feel this one has more than enough unique and original components to remain interesting. \n\nThis game feels like it is just barely learning to walk in a world where you want and need to run so badly,\nThe PVP community is anything but toxic, something I feel has plagued games like Rust for a while now. The chat often remains informative and supportive and I haven't witnessed any hostility or abuse which has become and exhaustive feature in most games.\n\nI have only played on dedicated servers because of my history with 'Official' which often have a good amount of 'hackers'- with any game.\n\nI will be spacing my playtime of this game out and I look forward to seeing where it will go. I don't really want to comment on specifics like the NPCs, mechanics etc, because like I've mentioned it truly feels like the game is just placing its feet on the ground and for early access I'm not disappointed at all.\n\nIn the end, the game is worth the purchase, I recommend.", "timestamp_created": 1700501912, "timestamp_updated": 1700501912, "voted_up": true, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.660853326320648193", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148490978": {"recommendationid": "148490978", "author": {"steamid": "76561198412884666", "num_games_owned": 59, "num_reviews": 3, "playtime_forever": 3259, "playtime_last_two_weeks": 0, "playtime_at_review": 2812, "last_played": 1697809700}, "language": "english", "review": "So here is my review after approximately 50 hours of playtime on official and dedicated servers.\n\n- Yes, it's buggy and needs work, but it's still early access. However, look back at the Rust Legacy, which most people never played, or the early days of 7 Days to Die. It's 10x worse than this game right now in this state.\n\n- Progression, Crafting Recipes, Tiers of Loot, Various Ways of XP Gain, Car Crafting and Customization, Horde Defense (All exceeded my expectations.)\n\n- The game already has a bunch of content in it, so even after 50 hours, I still haven't reached the true endgame.\n(I can raid and get raided, but I still haven't fully finished all the content for the wipe.)\n\n- The negative reviews are people with less than a few hours complaining about server capacity (they added more servers) and performance issues, which I know for a fact will get fixed soon.\n\n- Playing solo or with a squad is fun; however, when it comes to farming and progress, the bigger the group, the easier it gets.\n\nSo I would say give it a try, and you won't regret it. I have 1000 hours on Rust, and this game knocks rust out of the park already. The only thing I would say for the developers is to focus on optimizations and additions settings (FOV, etc.) and connection stability. Other than that, I would say you guys did great with the content, and this game is on the correct path.", "timestamp_created": 1697727938, "timestamp_updated": 1697727938, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.659773886203765869", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "155124675": {"recommendationid": "155124675", "author": {"steamid": "76561198843324117", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 11338, "playtime_last_two_weeks": 0, "playtime_at_review": 7888, "last_played": 1705603890}, "language": "english", "review": "ARK + RUST and few 7 Days to die, less ai enemy though\nGood enough as an EA version, developer also update frequently\nPlayer can open boxes like cs tradable items and sell on Steam market", "timestamp_created": 1704265620, "timestamp_updated": 1704265620, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.657737135887145996", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148413514": {"recommendationid": "148413514", "author": {"steamid": "76561198827109818", "num_games_owned": 54, "num_reviews": 8, "playtime_forever": 7186, "playtime_last_two_weeks": 130, "playtime_at_review": 2797, "last_played": 1713158399}, "language": "english", "review": "Personally this game has major potential! Fun with friends and a lovely grind system.", "timestamp_created": 1697589368, "timestamp_updated": 1697589368, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.656952381134033203", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148193829": {"recommendationid": "148193829", "author": {"steamid": "76561199122110226", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 15997, "playtime_last_two_weeks": 0, "playtime_at_review": 495, "last_played": 1703304190}, "language": "english", "review": "YO!!!!!!! This game is Epic!! Don't be be fooled by the haters, this game is insanely good!!! If you like Ark/Rust style games where you farm for building materials and Survival, build Bases, defend from raiders and fight and NPC's, raid and attack other bases, make alliances,  fly attack Heli's, drive Tank's, etc etc ...you will LOVE this game! The only thing that doesn't make sense is the low $19.99 price point! This is a $60 title all day long .....but i'm not complaining!", "timestamp_created": 1697281105, "timestamp_updated": 1702848761, "voted_up": true, "votes_up": 36, "votes_funny": 0, "weighted_vote_score": "0.648679912090301514", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "152695538": {"recommendationid": "152695538", "author": {"steamid": "76561197969524700", "num_games_owned": 0, "num_reviews": 38, "playtime_forever": 11050, "playtime_last_two_weeks": 0, "playtime_at_review": 2587, "last_played": 1703821692}, "language": "english", "review": "Rough around the edges is a good way to describe this game. It's not totally fleshed out yet and that is understandable since it is Early Access. I think my biggest gripe so far is that I would like to see the Devs thoroughly test patches BEFORE they update. Often the patches/updates they push cause extreme problems for servers, players and in game mechanics. \n\nMy second biggest gripe is PLEASE for the love of Pete FIX the ever loving sound in this game! Helicopter right over my head, can't hear a thing, rockets being shot from 2000m away sound like they are 50m away. NPCs walking right up behind ya with no footsteps or sound. Please put this at least on the priority list. \n\nAll in all, the game is good, and I can see what the Devs are trying to do with it. If they are successful at this attempt, you might very well be seeing this game played as much as Ark and Rust. However, if the Devs do not address some glaring issues NOW (not just the ones I mentioned) this game will be in the bargain bin in less than a years time. The fate of this game lies with the Devs programming knowledge and ability to hear the community.", "timestamp_created": 1701490868, "timestamp_updated": 1703361154, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.646052420139312744", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148241986": {"recommendationid": "148241986", "author": {"steamid": "76561197999031086", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 4897, "playtime_last_two_weeks": 0, "playtime_at_review": 441, "last_played": 1698881806}, "language": "english", "review": "So far enjoying the game with lots more to do.  Definitely has vibes of ARK and RUST with a touch of 7 Days to Die thrown in as well.  Definitely worth the $16 while on sale (and even $20).\n\nHave high hopes for the continued development of the game.", "timestamp_created": 1697326362, "timestamp_updated": 1697326362, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.639889240264892578", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "150838243": {"recommendationid": "150838243", "author": {"steamid": "76561197970723192", "num_games_owned": 275, "num_reviews": 14, "playtime_forever": 119, "playtime_last_two_weeks": 0, "playtime_at_review": 11, "last_played": 1703139257}, "language": "english", "review": "I initially gave this game a negative review.  This was due mainly to the poorly chosen anti-cheat software.  It was extremely intrusive on windows and prevented even running the game if it wasn't installed or couldn't be installed, eg linux.  While I do not have a problem with anti-cheats generally, that appeared to be up to more than just detecting cheats.  \n\nThat being said, they have now switched to a widely recognized anti-cheat engine and the game runs now even without it.  I don't cheat but I do run mainly on linux and run a server for me and my friends. I don't have to worry about them cheating so just being able to play the game without those distractions is nice.", "timestamp_created": 1700627182, "timestamp_updated": 1707039849, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.635762572288513184", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148449044": {"recommendationid": "148449044", "author": {"steamid": "76561198260326197", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 356, "playtime_last_two_weeks": 0, "playtime_at_review": 356, "last_played": 1697612612}, "language": "english", "review": "Let me preface this by saying the game is a lot of fun solo, probably better with a group of friends.\n\nFirst off pretty fun game has 7d2d vibes with some Rust mixed in. Played solo on my own server so nothing could distract me. I  was skeptical about the anti cheat but ran it through Kaspersky and it came up clean so I let it go (wouldn't let you play if you didn't.)\nSo played for a few hours, had some fun, there is a good game here, and quit.\nWoke up to Kaspersky sending me an alert that it found a virus.\nI was like \"Hmm, let me guess it's the Anti Cheat triggering a false positive.\"\nNope. It was TheFront.exe and I was like, well that's not good.\n\nEvent: Application placed in restricted group\nComponent: Intrusion Prevention\nName: UDS:DangerousObject.Multi.Generic\nThreat level: Low\nObject type: Group of applications\nObject name: Untrusted\nReason: Detected: UDS:DangerousObject.Multi.Generic\n\nSo I said, better safe than sorry. and let Kaspersky do it's thing, which abruptly hung my computer requiring me to unplug my computer because even me hitting the power button didn't shut it down.\n\nSo I uninstalled it and asked for a refund.\n\nIf there is a turd in the punch bowl, I'm not taking the risk to find out if it's actually Baby Ruth.", "timestamp_created": 1697652927, "timestamp_updated": 1697652927, "voted_up": false, "votes_up": 19, "votes_funny": 4, "weighted_vote_score": "0.633011579513549805", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "150101711": {"recommendationid": "150101711", "author": {"steamid": "76561197973481324", "num_games_owned": 398, "num_reviews": 2, "playtime_forever": 4519, "playtime_last_two_weeks": 0, "playtime_at_review": 4489, "last_played": 1701993575}, "language": "english", "review": "Game is fun, but filled with CHINESE hackers. Add region lock PLEASE.", "timestamp_created": 1699944286, "timestamp_updated": 1699944286, "voted_up": false, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.632324635982513428", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "153236741": {"recommendationid": "153236741", "author": {"steamid": "76561197996153830", "num_games_owned": 476, "num_reviews": 22, "playtime_forever": 9612, "playtime_last_two_weeks": 0, "playtime_at_review": 222, "last_played": 1705257221}, "language": "english", "review": "Nothing like siting in your nice warm base eating fresh cooked meat when your front door gets blown in by two guys wearing wood armor holding shotguns. 10/10", "timestamp_created": 1702151227, "timestamp_updated": 1702151227, "voted_up": true, "votes_up": 31, "votes_funny": 30, "weighted_vote_score": "0.631274640560150146", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "150757333": {"recommendationid": "150757333", "author": {"steamid": "76561198034423594", "num_games_owned": 611, "num_reviews": 20, "playtime_forever": 2146, "playtime_last_two_weeks": 0, "playtime_at_review": 2146, "last_played": 1700611073}, "language": "english", "review": "its a little rough around the edges right now, but with all these weekly updates its sure to be good soon", "timestamp_created": 1700611187, "timestamp_updated": 1700611187, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.629840493202209473", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "149217150": {"recommendationid": "149217150", "author": {"steamid": "76561198087137504", "num_games_owned": 272, "num_reviews": 10, "playtime_forever": 35, "playtime_last_two_weeks": 0, "playtime_at_review": 30, "last_played": 1698701678}, "language": "english", "review": "No FOV slider.. That really F*ck's the game up for me. Feels like i'm playing the game with binoculars", "timestamp_created": 1698700807, "timestamp_updated": 1698700807, "voted_up": false, "votes_up": 63, "votes_funny": 9, "weighted_vote_score": "0.628950357437133789", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "151032262": {"recommendationid": "151032262", "author": {"steamid": "76561198011394911", "num_games_owned": 195, "num_reviews": 5, "playtime_forever": 969, "playtime_last_two_weeks": 0, "playtime_at_review": 969, "last_played": 1699145281}, "language": "english", "review": "I am a bit on the fence with this one. Some of my friends are still playing it regularly but it just did not grab me. \nI may update this to recommends later but for now, it just doesn't do it for me. It does a lot of stuff, bringing in elements from other games like 7DTD, Conan Exiles and Ark and Rust. But it isn't really anything new or special. Just feels like a lesser version of all those other titles to me. It is fun and playable but doesn't grab my attention. I would rather go play Conan or 7DTD instead. I will check back after a few updates and see if it changes my mind.", "timestamp_created": 1700664219, "timestamp_updated": 1700664219, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.626078605651855469", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148733682": {"recommendationid": "148733682", "author": {"steamid": "76561198197589670", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 12346, "playtime_last_two_weeks": 0, "playtime_at_review": 6518, "last_played": 1700949673}, "language": "english", "review": "TOO MANY BUGS AND CHEATERS  RIGHT NOW!!\n\n**I have over 100 hours but much of it is because they create a huge incentive for afk farming [you gain hunger or thirst when afk farming] which could create really big issues with heavily populated servers - half the people just passively farming and no one being able to log in to play]**\n\nThis game has a lot of potential, but right now there are bugs and cheaters that make the game way more painful than fun, with little to no sympathy from the developers or support team. Spend 8-10 hours trying to collect resources to finally build your first helicopter, safely land it at your base with nothing around you, helicopter starts rag doll spazzing out flipping right side up and upside down and then blows up.\n\nThe grinding in this game IS the entire game. Even small animals can take what feels like millions of bullets and they'll chase you for a hilarious distance [seriously like 2 miles]. Playing this game starts feeling like a fulltime job just to play and enjoy it. Making the ammo and repairing the easily breaking guns becomes obnoxious. Instead of being immersed in the joy of hunting and gathering, I started thinking about how many ores i was shooting at some annoying wolf that followed me across an entire biome. \n\nDon't get me wrong, games like these are very addictive and the farming is obviously apart of all of them, but I was happy when my base was raided bad enough for me to just quit instead of starting over [most of the servers reset every 45 days]. I won't be coming back until this game gets out of early access or I at least find out that most of the bugs have been ironed out. \n\nThe cheating is laughable and a total embarrassment to the developers. The cheats are something that you would see 10-20 years ago. Its not just \"walls\" or \"aimbots\" they have actual speed hacks and I've even heard some reports of cheaters just going in and auto destroying peoples bases like they have admin control. \n\nI cant suggest anyone starts playing this game until they fix these bugs and has a halfway decent anti cheat. Its really sad too because I worry that this game will fizzle out by the time they fix it and people will just move over to Rust 2 when it comes out.", "timestamp_created": 1698067601, "timestamp_updated": 1698068418, "voted_up": false, "votes_up": 28, "votes_funny": 2, "weighted_vote_score": "0.625688910484313965", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148433040": {"recommendationid": "148433040", "author": {"steamid": "76561198263835167", "num_games_owned": 165, "num_reviews": 10, "playtime_forever": 39, "playtime_last_two_weeks": 0, "playtime_at_review": 9, "last_played": 1697647203}, "language": "english", "review": "you cannot change your keybinds so the game is unplayable on an azerty keyboard even after changing keyboard layouts it does not work", "timestamp_created": 1697631543, "timestamp_updated": 1697631543, "voted_up": false, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.618659555912017822", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148112712": {"recommendationid": "148112712", "author": {"steamid": "76561198107804369", "num_games_owned": 593, "num_reviews": 17, "playtime_forever": 13041, "playtime_last_two_weeks": 0, "playtime_at_review": 700, "last_played": 1698385847}, "language": "english", "review": "Solid start to a solid addition to the survival genre.\n\nDedicated servers being available to the public for use at launch is a HUUUGE plus.\n\nCan't wait to see Steam Workshop implementation.", "timestamp_created": 1697168417, "timestamp_updated": 1697168417, "voted_up": true, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.617530584335327148", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148115407": {"recommendationid": "148115407", "author": {"steamid": "76561199467816758", "num_games_owned": 54, "num_reviews": 4, "playtime_forever": 1014, "playtime_last_two_weeks": 31, "playtime_at_review": 303, "last_played": 1713379365}, "language": "english", "review": "A mix of Rust, Ark, 7D2D, and others.\n\nFOR PLAYERS:\nCurrently, the game is a bit raw but fun. The sheer amount of content can sometimes be overwhelming, which is fantastic. As of now, I'm writing this review at the game's launch, so I highly recommend giving it a try if you're a fan of this genre. The game is actively being updated. However, if it gets abandoned (as sometimes happens), I'll change my review to negative.\n\nFOR DEVELOPERS:\nObvious bugs such as: the sound of vehicle destruction can be heard from a kilometer away when another player is just passing by, server lags, etc.\n\nRecommendations from a player who values this genre and is also a game developer:\n1. TTK (Time to Kill) is very long. Gunfights with many players are chaotic because players die slowly, quickly revive teammates, and throw down spawns. Mostly, the team with more players wins. Like in Rust, going 1 against 3 is almost impossible. To do so, you have to be significantly more advanced than your opponents.\n2. Weapon balance is terrible. If you have a spear (especially a non-standard color that's easy to find), you can skip all weapons up to the first SMGs and shotguns.\n3. There's a significant lack of item descriptions, like for electronics (how much power they consume or other stats) and clothing (how much protection they offer). You have to craft them blindly to figure out which is better.\n4. Raiding is terrible. If your house is made of stone (you're in trouble). Stone houses don't degrade quickly, so it's frustrating that a clan can come and wipe you out with one drill.\n5. Household chores take up a lot of time. Inventory windows open slowly, and moving items around is clunky. If you try to move something between cells and miss, it just won't move. Over time, it becomes more comfortable to loot with the right mouse button and then manage everything in one inventory. Overall, more quality-of-life features would be appreciated since it's a significant part of the game.\n6. Player movement feels sticky and takes some time to get used to. Movement speed should be increased; during gunfights, it feels like you're shooting at boulders instead of humans trying to survive at any cost.\n7. Electronics. I haven't played with them much, but there's a HUGE lack of DETAILED explanations of how specific logic chains work, and there are balance issues.\n8. Graphics. For a game at launch, it looks not bad. But the draw distance for textures is strange. When running around a house on Ultra settings, you can see the texture on walls change just 5 meters away from you.\n9. Animations are very rough, unfortunately. Add mini-games for gathering wood and stone. In Rust, this was done to break up the monotony. Here, it feels even more tedious than in Rust.\n10. Ore spawn is spread uniformly and randomly across the map. It would be better to create more concentrated zones, making it more enjoyable to mine rather than running from one metal ore to another every 30-60 seconds. Very few oil clusters.\n11. Regarding server lags and hit registration, I won't even comment; it's a complete mess, and you probably see it for yourself. The only thing I'd suggest is to make NPC animations less sharp and jerky. Even with decent hit registration, it's challenging to aim at an enemy whose head can change its position within a frame.\n12. Loot is weird. Sometimes you farm wood and stone for half an hour, and then in a random barrel by the road, you find the same resources but in larger quantities. Overall, I'd introduce more progression in terms of the quantity of extracted volume, either through skills or the type of axe/pickaxe, but it should be somewhat noticeable. There's a massive spawn of building blocks; I can literally build a concrete house after looting 1-2 RTs. If I progressed and unlocked concrete through levels, I would have had to play another 10 hours. The same applies to weapons.\n13. Random tanks on the roadside. Please remove this; it's very, very dumb. Clans that just joined the game, without a base or clothing, just run around looking for these tanks and, early in the game, come to a solo player and decimate him.\n14. The mouse constantly drifts to the second screen, and even when it's turned off, the cursor sometimes appears in the corners of the screen when you move the mouse quickly to the side. (this problem is not on all devices and not on all screen resolutions)\n15. External walls and gates: make it possible to position them relative to each other at different angles, not just 90 and 180 degrees. The lighthouse zone is round, and it would be nice to design accordingly. Currently, players use foundations and tall 2x2 walls for a building instead of external walls because the cost of external walls and gates is just unreasonable.\n16. Make tasks more abstract: instead of \"build a wooden foundation\", simply \"build a foundation\", as often you progress faster than the tasks. There's also an issue with being strictly tied to crafting on a specific workbench; you can't complete a task by crafting a bandage on an advanced medical station – you need to do it on the starter one. There's a very low progression of experience for tasks; the further you go, the reward of experience points should increase to motivate players to complete them.\n17. Ether shards. There are so many of them that every level requires you to mindlessly click through studies.\n18. Beacon rewards. Unfortunately, NPCs cannot navigate on foundations, and it's an issue since no one mentions it anywhere. It's unclear which block can be placed where.\n19. Overall, battling NPCs looks very odd; they appear dumb and laggy. It's satisfying to kite an armored bot, but on the other hand, the rest of the gameplay seems odd. Starting bots do not instill any fear even when you only have fists and are naked; they are easy to trick regardless of their strength. (not counting medium or strong bots; their special skills don’t compensate for their helplessness)\n20. There are constantly some strange noises, like someone stomping with one foot every 5-10 seconds. The crafting sound is also very annoying; the ticking doesn't provide any useful information and is merely irritating. Overall, please pay attention to the sounds; they play a significant yet uncomplicated role in the game's atmosphere.\n\nFor now, this isn't all the information. If you find my recommendations useful, you can contact me privately for more details. I'm deeply invested in this game, so I'll be happy to help.", "timestamp_created": 1697174015, "timestamp_updated": 1700824603, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.613304495811462402", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "154254494": {"recommendationid": "154254494", "author": {"steamid": "76561198298002966", "num_games_owned": 85, "num_reviews": 5, "playtime_forever": 936, "playtime_last_two_weeks": 0, "playtime_at_review": 235, "last_played": 1703746190}, "language": "english", "review": "I am always attracted to survival games. My two ultimate favorites are Ark and 7 Days to Die. I have been craving a new game as 7 Days can get very repetitive and Ark Ascended was a huge disappointment - over taxing on my PC with almost no new content for a full-game price - no thank you! I tried The Front because it's a new, early access, open world survival game. Immediately I noticed the performance was way better. While it's not as graphically as beautiful as Ark, it is actually playable. Ark Ascended is so poorly optimized and so graphics heavy that even with an i9 and a 2080 super, I cannot run it without significant lag. However, The Front runs without issue, without any video adjustments. Just out of the box, this game performs far better. It also looks better than 7 Days, so graphically, I would consider it an inbetween that will probably improve further over time. \n\nAs far as game content goes, the quest or \"task\" system is very robust. There are many many different avenues for leveling talents and learning new skills and abilities in weapons, gear, building, etc. The building is fairly intuitive and similar to Ark. The only downside I see so far is the inability to pick up building pieces after they are placed and the inability to stack building pieces. However, with the addition of new pieces for building, this may be an issue that resolves itself over time as the game develops. \n\nThe map is pretty large and the resources drive you to move around the map and explore, which I like. Especially since there is a vehicle crafting system that I have yet to dive into but I am sure will make map traversal even more fun. \n\nThe server system is nice. I created a solo/self-hosted server on my own PC - similar to self-hosting on 7 days - and the amount of very easily accessed server customization built into their UI automatically was incredible. Every minute detail can be custom set, from XP/Loot multipliers, food rates, HP, self-NPC-PVP damages, etc. They can scale wildly to create some very custom servers. This will definitely be a versatile game that will accommodate both high-action PVP survivalists and those PVE-preferred survivors, like me with ease. \n\nAll in all, this is well worth the cost to get in on the ground floor and participate early on. I got it on the winter sale for $14, which is a steal for a survival game with this much content.", "timestamp_created": 1703377337, "timestamp_updated": 1703377337, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.610497951507568359", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "155249795": {"recommendationid": "155249795", "author": {"steamid": "76561199119671168", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1881, "playtime_last_two_weeks": 0, "playtime_at_review": 1077, "last_played": 1704590590}, "language": "english", "review": "I think its a great game, it's just me and my buddy playing in our own server, and we are having fun. some bugs here and there but nothing that's ruined the experience completely. i'm having fun, and so is he. That's all i need in a video game", "timestamp_created": 1704395948, "timestamp_updated": 1704395948, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.607764720916748047", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "151622512": {"recommendationid": "151622512", "author": {"steamid": "76561198022735028", "num_games_owned": 276, "num_reviews": 6, "playtime_forever": 5, "playtime_last_two_weeks": 0, "playtime_at_review": 5, "last_played": 1700841812}, "language": "english", "review": "Just another way for sketchy companies to insert malicious software to your computer.", "timestamp_created": 1700841864, "timestamp_updated": 1700841864, "voted_up": false, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.604880750179290771", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148885238": {"recommendationid": "148885238", "author": {"steamid": "76561199380922285", "num_games_owned": 16, "num_reviews": 3, "playtime_forever": 2575, "playtime_last_two_weeks": 0, "playtime_at_review": 2534, "last_played": 1701316211}, "language": "english", "review": "The game is worth the $20. For the quality it brings, every single dollar is worth this game. BUT THATS IT. \n\nPositives: its the tame, tower defense version of Rust, where the focus is no longer being toxic and raiding other players, but it's a combination of self defense in raids and self-defense from players. It's more difficult to raid a location than to bring the raid to you, so it gives a sense of novice security when first starting off in a PVP setting. That's where $20 is worth it. It starts to fall off when you realize that there is no sound cue's in the game whatsoever. EVEN WHEN YOU GET SHOT, you don't hear yourself get shot. You barely even hear the autoturret that targeted you 50m away. But that's not the main problem.\n\nThe Follower system is no where near what anybody expects it to be. Every aspect that you'd think a follower would use, like the Bike Generator, or the Manual Miner, or the Crude Mineshafts, is unapplicable. But the workbenches the player uses and where it's already automated by crafting times and recipes? That's where the followers are used. They can also be used for tower defense, which would be nice, except that means these expendable humans that take at least 5 minutes each to attain can die within 2 minutes of any enemy interaction, play er or not.\n\nThe so called introductory \"lore\" given to the player is that they are apart of a \"resistance\" that has this mission of taking down the rise of a \"tyrannical\" empire. And after 40 hours on one server and producing enough resources to complete this main mission, you start to realize that the Front suffers from the same chronological curve as the Starfield; it should not take 30 hours to 50 hours for the game to get interesting. You HAVE to play on 3x XP or higher dedicated servers to see any type of story progression within the first week of playing. However, to give them some leeway, this is probably how they don't want the player to experience. So the lets stay specific to the Official Servers, where measurements and specifics are controlled by the devs themselves.\n\nEvery single PVP Official Server by The Front is given a Wipe Date. You won't experience the end within this time. \nEvery single PVE Server is given a *1 Gathering Rate, which means you will spend at least 50 hours to get to the story.\n\nPlay it for 20 dollars, nothing more.", "timestamp_created": 1698286758, "timestamp_updated": 1698286758, "voted_up": false, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.604112863540649414", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148059537": {"recommendationid": "148059537", "author": {"steamid": "76561198066035064", "num_games_owned": 280, "num_reviews": 3, "playtime_forever": 734, "playtime_last_two_weeks": 0, "playtime_at_review": 212, "last_played": 1697333705}, "language": "english", "review": "This game seems great; PLEASE ADD FOV SETTING!", "timestamp_created": 1697083950, "timestamp_updated": 1697083950, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.601737856864929199", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148050945": {"recommendationid": "148050945", "author": {"steamid": "76561198071048926", "num_games_owned": 546, "num_reviews": 115, "playtime_forever": 9135, "playtime_last_two_weeks": 0, "playtime_at_review": 121, "last_played": 1698264793}, "language": "english", "review": "Yes. This game will take off. It is amazing and really enjoyable. \n\n I have 2200 hours in rust , nearly 1000 in ARK  and this game is AMAZING!!!!!!", "timestamp_created": 1697066900, "timestamp_updated": 1697066900, "voted_up": true, "votes_up": 20, "votes_funny": 1, "weighted_vote_score": "0.594280898571014404", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148723073": {"recommendationid": "148723073", "author": {"steamid": "76561198178964858", "num_games_owned": 137, "num_reviews": 13, "playtime_forever": 11185, "playtime_last_two_weeks": 0, "playtime_at_review": 521, "last_played": 1711482067}, "language": "english", "review": "This game will exceed your expectations. I have thousands of hours in games like Rust, Battlefield, EFT, Ark, Atlas, 7 days to die, Conan Exiles. you name it ive probably played it. This game has elements just about from all of those and surprisingly does it all very well. The base raiding, pvp and resource gathering is very much like Rust. The PvE is like 7 days to die mixed with Fallout. The vehicle system/pvp is similar to battlefield. My crew is having a blast so far. a few very small bugs but the team seems active and fixing it and listening to the player base. One of the best 15$ games ive purchased by far. Highly recommend.", "timestamp_created": 1698047629, "timestamp_updated": 1698047629, "voted_up": true, "votes_up": 10, "votes_funny": 3, "weighted_vote_score": "0.593667268753051758", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "154632986": {"recommendationid": "154632986", "author": {"steamid": "76561198844010924", "num_games_owned": 122, "num_reviews": 9, "playtime_forever": 3042, "playtime_last_two_weeks": 0, "playtime_at_review": 1519, "last_played": 1706368514}, "language": "english", "review": "I think even thought there is a few negative reviews the game has a lot of potential and unlike some early access titles the dev actually fix things people complain about I am confident taht if you give this game a chance comparably to the amount of money u spend you will have a high amount of hours you will enjoy the game. I can not understand people that have over 100 hours and complain in  a fashion that makes the game seem unplayable. if it was bad to that degree you wouldnt have played 100+ hours.  I hope the devs keep considering the feedback their players give and improve a lot.\n\nsince some players listed some things that make the game not recommendation worth I shall just list some things that might make sense to change in the game:\n\n1. Fullscreen does not feel like actual fullscreen but like boarderless windowed mode, also when u go windowed or anything similiar u cannot change the resolution bc it essentially does not downscale it is just bound to the windows size thus low end machines can not lets say lower randerscale or pick a lower resolution to make the game work.\n\n2. Waterfalls dont drag you, this is kinda a thing most people will probably ignore but I feel like river and water should have a pulling/pushing/moving force especially if you standing on the edge of a waterfall.\n\n3. Helicopters dont take damage when you crash them into the ground on that note idk if the blades do damage. lastly they could overhaul the contro system of the helicopters but that is player preference idk how others feel about it.\n\nIn my 25.3 Hours of which like 15 are playtime I havent found many other things that bothered me but I havent tried many things as well.", "timestamp_created": 1703776730, "timestamp_updated": 1703776730, "voted_up": true, "votes_up": 9, "votes_funny": 1, "weighted_vote_score": "0.59267657995223999", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "149984882": {"recommendationid": "149984882", "author": {"steamid": "76561197993001020", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 3237, "playtime_last_two_weeks": 0, "playtime_at_review": 3032, "last_played": 1699817696}, "language": "english", "review": "game is rampant with cheaters. first day on official servers a Chinese clan was spawning in max tier heli's with infinite ammo and blowing up everyone's bases.  on day 1 of server wipe. this still regularly happens. you could grind all day and get the max tier defence for your house but you cant fight infinite heli's with inf ammo.  the same cheaters are still here no bans issued no decent anti cheat. a simple region lock would do so much for this game.", "timestamp_created": 1699772845, "timestamp_updated": 1699772845, "voted_up": false, "votes_up": 9, "votes_funny": 1, "weighted_vote_score": "0.590807259082794189", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "156429777": {"recommendationid": "156429777", "author": {"steamid": "76561199483344486", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 14166, "playtime_last_two_weeks": 0, "playtime_at_review": 426, "last_played": 1707429007}, "language": "english", "review": "Toxic player base.", "timestamp_created": 1705805359, "timestamp_updated": 1705805359, "voted_up": false, "votes_up": 41, "votes_funny": 12, "weighted_vote_score": "0.58816838264465332", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148216751": {"recommendationid": "148216751", "author": {"steamid": "76561198108655663", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 807, "playtime_last_two_weeks": 0, "playtime_at_review": 467, "last_played": 1703438579}, "language": "english", "review": "When you look past the early acces part this is a great addition to the survival genre.  It has a lot depth and complexity with iots depth in its crafting and skilltree. Its nice that you are forced out in the world to loot areas to obtain rare recipes etc. Its a nice combination of a looter, a pvp  and a building game. \n\nThe negative reviews are from people who expect triple A polish in an early acces game. Yes there is a lot to improve, but thats the point of an early acces. And judging by the patching this team seems very dedicated to improve this game. The game has a very solid base to compete for the top spot in survival genre.", "timestamp_created": 1697299234, "timestamp_updated": 1697299413, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.587955653667449951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "149763533": {"recommendationid": "149763533", "author": {"steamid": "76561198045335030", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 10571, "playtime_last_two_weeks": 0, "playtime_at_review": 6949, "last_played": 1699736304}, "language": "english", "review": "Chinese hackers just ruin every server and just spam spam chatting about us white trash losers and N******. They aren't doing anything to prevent this. It would be a pretty good game without it.", "timestamp_created": 1699458265, "timestamp_updated": 1699458265, "voted_up": false, "votes_up": 12, "votes_funny": 2, "weighted_vote_score": "0.587476730346679688", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148217340": {"recommendationid": "148217340", "author": {"steamid": "76561198147250490", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 3433, "playtime_last_two_weeks": 0, "playtime_at_review": 885, "last_played": 1704525197}, "language": "english", "review": "It's super early access and yet the amount of content is overwhelming. Exploring the landscapes and discovering new things in a fresh new game with all there is to learn is a feeling I haven't experienced since Rust's early days. It's buggy, the sound needs some work and the AI are irritating, but every session is full of dopamine and laughter. Highly recommend", "timestamp_created": 1697299614, "timestamp_updated": 1697299614, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.584905624389648438", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148512845": {"recommendationid": "148512845", "author": {"steamid": "76561198145237438", "num_games_owned": 208, "num_reviews": 3, "playtime_forever": 4175, "playtime_last_two_weeks": 0, "playtime_at_review": 1306, "last_played": 1698297753}, "language": "english", "review": "I really do not understand why there are so many negative reviews on this game. If you love survival and building games, you will honestly more than likely really enjoy this game. Is it perfect? Absolutely not, it is still in early access though and in all honesty for a game that is not completed yet, it is pretty polished. And I personally, on the server my boyfriend and I play on, have not had interactions with anyone that has blatantly cheated or hacked the game (that I know of, also edited to note that we have played exclusively pve so far). It is really honestly fun! Suuuuuper grindy but if you like the grind, you'll like this game :)", "timestamp_created": 1697757689, "timestamp_updated": 1697757881, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.583838522434234619", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148351660": {"recommendationid": "148351660", "author": {"steamid": "76561197964075344", "num_games_owned": 871, "num_reviews": 33, "playtime_forever": 190, "playtime_last_two_weeks": 0, "playtime_at_review": 190, "last_played": 1697483702}, "language": "english", "review": "If you want more Rust/Ark/Conan etc this might be for you... don't expect too much though and remember it is early access... pending continued dev support!\n\nIt has a lot of ideas from a lot of places, and as a dev I notice a lot of assets placed about from asset packs, which in itself is not a bad thing... but The Front does nothing with them to make them unique. \nFor its current price point it can be fun for you and a friend or 2, I only tested PVE so I cannot say much on the PVP/Gunplay at this time, but I may update my review as time goes by.\n\nI only recommend as its a fairly solid start and we didn't experience any major bugs.", "timestamp_created": 1697484446, "timestamp_updated": 1697484446, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.582959651947021484", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "149342175": {"recommendationid": "149342175", "author": {"steamid": "76561199190605203", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 3453, "playtime_last_two_weeks": 0, "playtime_at_review": 1429, "last_played": 1708119684}, "language": "english", "review": "this game is so much fun and very interesting.  Love that you can actually build vehicles in this game\n", "timestamp_created": 1698883325, "timestamp_updated": 1698883325, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.579439640045166016", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "150445999": {"recommendationid": "150445999", "author": {"steamid": "76561197960277727", "num_games_owned": 776, "num_reviews": 42, "playtime_forever": 13892, "playtime_last_two_weeks": 0, "playtime_at_review": 13892, "last_played": 1700283766}, "language": "english", "review": "This game needs about 2 years more of development assuming the devs don't abandon it before then like i suspect they will. As it stands right now most of the systems in the game straight up either do not work or are so bugged that it just causes frustration to play the game instead of fun. Vehicles are extremely slow and the weapon systems do not work, they also take multiple hours to build. A machine gun should fire more than 1 bullet every 30-60 seconds. The Raid system is cool if it works but fact of the matter is that NPC's get stuck all the time. When they aren't stuck they have a tendency to fall through the ground making you wait out the entire raid round before it completes. The gun mechanics are stupid. Why does the scope have separate sway from the barrel? Why do i have a ramp up time to sprint? The character talents offer nothing unique to the game and can be ignored. This game is a massive dumpster fire of shotty development and i have tried out every aspect of the game. Its really not worth purchasing until they fixed the massive amount of bugs. My last straw was when i logged in on my PVE server account to find half my buildings missing but the wire are still connected because the developers are so trash they deleted most people buildings. With devs this stupid i estimate about 2 years before the game is playable and NO this is not a Rust killer type game. I would be shocked if it made it out of early access before the devs abandon it.", "timestamp_created": 1700419307, "timestamp_updated": 1700419307, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.578813016414642334", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "152849834": {"recommendationid": "152849834", "author": {"steamid": "76561198017485280", "num_games_owned": 445, "num_reviews": 38, "playtime_forever": 799, "playtime_last_two_weeks": 0, "playtime_at_review": 799, "last_played": 1700947064}, "language": "english", "review": "ACE / S-Guard that is a kernel level anti-cheat. No thanks.\n\nEDIT UPDATE-\n\nThey removed ACE and now use EAC-Easy Anti Cheat with plans to add valves as well. Kudos for them on removing ACE.\n\nNow as for the game, I still have to say wait. It has a decent amount of content and might be fun yes but is littered with bugs and issues and seems every new patch them just break more game mechanics. Let this one sit on the burner a bit more and cook.", "timestamp_created": 1701664845, "timestamp_updated": 1703130896, "voted_up": false, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.577761352062225342", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1701829693, "developer_response": "https://steamcommunity.com/games/2285150/announcements/detail/3899617007501078392\nwe are switching to a new anti-cheat system"}}, "query_summary": {"num_reviews": 74, "review_score": 6, "review_score_desc": "Mostly Positive", "total_positive": 2443, "total_negative": 986, "total_reviews": 3429}, "cursors": {"AoIIPwAAAHi719kE": "Mon Apr 22 23:41:14 2024"}}
