{"reviews": {"160540536": {"recommendationid": "160540536", "author": {"steamid": "76561198052426602", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 2661, "playtime_last_two_weeks": 0, "playtime_at_review": 2661, "last_played": 1710448327}, "language": "english", "review": "i will start off with, I really really really want to like this game. Some of it is fun for me but so much more is not. \r\n\r\nThis is NOT an MMO. You will not log into the game with an option to play among 200 other players on a server, You will log in and find a very limited option of 10 player limits on player hosted PCs. That was the first real disappointment.\r\n\r\nThe rest is around its targeted player base choice. If you are going to market this game to an English speaking player then you really should translate the entire game. I even downloaded an app on my phone to help me translate what was on my screen so I could read it and this is AFTER choosing the English option for language. Only about 60% is translated and that leaves a lot to figure out on my own. \r\n\r\nSorry, but thats not fun to me. I love Wuxia and Xianxia as I have read and am still reading the genre daily but this game is a huge let down for me.", "timestamp_created": 1710451922, "timestamp_updated": 1710451922, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.574792563915252686", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162624947": {"recommendationid": "162624947", "author": {"steamid": "76561197965301344", "num_games_owned": 274, "num_reviews": 17, "playtime_forever": 460, "playtime_last_two_weeks": 0, "playtime_at_review": 460, "last_played": 1711659962}, "language": "english", "review": "Cultivation is basically a hard drug for me. days lost. searching for more cultivation games, looking for that FIX. Chasing that white dragon......this is not that white dragon. THIS is a failed botched experiment, thats gone horribly horribly wrong.\nand kicked off here just to get a few extra coin, \nso HEY if the server doesn't exist later. and there's no single player. and no one is gonna care to put this into a single player state. what's the point? right?\n\nALSO  I can't be a bald body cultivator? no fists? just that long hair arch type frou frou hair guy huh?\n20 friends. 20 friends and you could have a time. but why do that when you can just burn your money\n\nYEP the 5 elements are not harmonized and the heavens are in disarray.\n\nfor laughs and understanding americans. GOOGLE translate this page.", "timestamp_created": 1712781232, "timestamp_updated": 1712781232, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.560293138027191162", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159504794": {"recommendationid": "159504794", "author": {"steamid": "76561198023205534", "num_games_owned": 260, "num_reviews": 7, "playtime_forever": 558, "playtime_last_two_weeks": 11, "playtime_at_review": 177, "last_played": 1713443833}, "language": "english", "review": "I am having a great time in PVE, dont listen to the OLD reviews \nThe only trouble is that not everything is translated yet so I have to use Google Translate on my phone to read stuff\n\nTo quote the stag \"waaaaah\"", "timestamp_created": 1709166939, "timestamp_updated": 1709166939, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.509259223937988281", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "114239766": {"recommendationid": "114239766", "author": {"steamid": "76561198025485142", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 247, "playtime_last_two_weeks": 0, "playtime_at_review": 163, "last_played": 1651046742}, "language": "english", "review": "People are crucifying this small dev like it's Battlefield 2042. They didnt realize that a core part of their game would create so much server stress, when the game has as much interest as it does. That was a mistake, a big one. Four server crashes over 6 days, and the developers have halted sales of the game + are approving all refunds while they sort out the issues.\n\nTHIS IS WHAT CORPORATE RESPONSIBILITY LOOKS LIKE!!\n\nLarge companies like EA get away with situations *worse* than this, yet they never have to answer to it. So seeing a small developer like this take complete and total ownership of the situation, is very refreshing. But the gaming community \"TAKES NO PRISONERS\" and will downvote/neg review this game into oblivion. Learn to be a little patient, and allow the dev an attempt to fix everything, *in a good faith effort*. Ya'll that expect + demand perfection deserve and will receive nothing, from a lot of things in life. \n\nHaven't played the game much yet so cant speak too much to it, but it definitely has the environment/atmosphere down for us Wuxia nerds. Not a big MMO guy but the gameplay felt pretty fun, all of the weapon movesets felt pretty unique to each other", "timestamp_created": 1650566906, "timestamp_updated": 1650566906, "voted_up": true, "votes_up": 218, "votes_funny": 3, "weighted_vote_score": "0.885216295719146729", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "115253561": {"recommendationid": "115253561", "author": {"steamid": "76561198203672781", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 9442, "playtime_last_two_weeks": 0, "playtime_at_review": 9418, "last_played": 1652540685}, "language": "english", "review": "Moving past the questionable decisions made by the developers over the course of a few weeks time,  this game now requires you to buy a season pass that is more expensive than the cost of the base game itself. I could go with it as the game is actually pretty decent and has plenty of potential being still in the early stages of the game. However, upon purchasing the season pass, I discovered that there is no longer any server outside of china as opposed to pre-season pass variations of it. If you are a foreigner located outside china, you will not be able to play the online portion of the game. The ping makes it literally unplayable. This game is just a wasted potential being done by a group of 6 developers constantly making questionable and sketchy decisions. There isn't even a customer support established. \n\n\n游戏原本是很有潜能的。不过基本上被开发者作废了。服务器很不稳定，诺要自己开宗门还要给钱。还钱后发现只有国服。 基本上如果不住在中国的是玩不了的。游戏也没有客服，没法联络任何开发者询问解决方案，游戏里买的东西（宗门令牌和皮肤）也不能退款。这钱就白白送给开发者了。\n\ntldr: If you don't live in China, dont get the game. 如果你不住中国的，别买这游戏。", "timestamp_created": 1652191762, "timestamp_updated": 1652191762, "voted_up": false, "votes_up": 75, "votes_funny": 1, "weighted_vote_score": "0.846249938011169434", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "113964370": {"recommendationid": "113964370", "author": {"steamid": "76561198066065791", "num_games_owned": 247, "num_reviews": 24, "playtime_forever": 29, "playtime_last_two_weeks": 0, "playtime_at_review": 29, "last_played": 1650120670}, "language": "english", "review": "This game is marketed directly towards me and it pisses me the hell off. If you look at every game on my steam account, I've invested multiple thousands of hours to the open world survival genre of game. This game has base building and a really cool combat system that looks AMAZING in the trailers, however it's not possible to play this game right now, as a north american.\n\nThis was my experience - I did the tutorial (which is pretty ok not going to lie), then made my character and arrived at the main menu of the game. To my surprise I'm greeted by a video explaining that this game is a player hosted peer to peer style server based game that requires you to enter a QUEUE to join. Now here's the thing, any time you actually select a server to join, a yellow text will pop up in chinese and then it will disappear and you will not join the server you select. Doesn't matter what server you try to pick. Notice how this isn't the queue'd part. When I attempted to go into MY OWN WORLD, THAT was when I was placed into a queue, and this was a queue that would never end until I gave up and refunded the game. I waited in that queue for almost 20 minutes.\n\nThe players home instanced world should not require a queue to enter. Make it so we can go into out own worlds without a queue and MAYBE I'll rebuy this game.\n\nP.S. as a sidenote I attempted to reset my position in queue by quitting and reopening the game, but this however completely removes your ability to select which language you want to play this game in. Inside the tutorial for the game it asks if you want to play in english or chinese, but after you've completed the tutorial it NEVER asks again, and defaults to chinese and the option to change the language after the tutorial is difficult to find.\n\nI'll look at this game again in a year and see what's changed, but so far it's not looking good.", "timestamp_created": 1650133235, "timestamp_updated": 1650339085, "voted_up": false, "votes_up": 270, "votes_funny": 15, "weighted_vote_score": "0.827919065952301025", "comment_count": 12, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "113954905": {"recommendationid": "113954905", "author": {"steamid": "76561198331662462", "num_games_owned": 280, "num_reviews": 4, "playtime_forever": 1936, "playtime_last_two_weeks": 0, "playtime_at_review": 185, "last_played": 1650543338}, "language": "english", "review": "EDIT: Due to recent server problems I was unable to play at all for the past several days. I will still watch development of the game but for now I've returned it.\nOk, so let's start with good sides of the game:\n+ It looks decent, it's not beautiful, but it's not awful either.\n+ Interesting mix of ark survival evolved, cultivation and Chinese mythology.\n+ The game has a lot of interesting mechanics....\nAnd there we start with bad sides of the game:\n- ... which often doesn't work and/or are mistranslated or even not translated at all.\n- Sounds effects more often made me laugh than e immersed into the game. For example, when you defeat female cultivator, or you take damage as one sound effect for this is straight up moaning, animals doesn't make any sounds till you won't attack them and kill them which if you do so they have only one sound effect for each animal.\n- Server issues, teleportation, random kicks from the server and often downtimes.\n\nOk, these were good and bad sides of the game, but there are also some neutral ones:\n· Animations are very simple and often wooden, but they're good enough.\n· There are really few monsters and most of them looks funny.\n· Every fight is straight up stat check.\n· Only two skill slots for fighting skills.\n\nAnd that's it. I tried to write it objectively as I could.\nPersonally, I've enjoyed the game hence I recommend this game.", "timestamp_created": 1650121888, "timestamp_updated": 1650927007, "voted_up": true, "votes_up": 30, "votes_funny": 0, "weighted_vote_score": "0.77624744176864624", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "113877992": {"recommendationid": "113877992", "author": {"steamid": "76561198047593851", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 2917, "playtime_last_two_weeks": 0, "playtime_at_review": 132, "last_played": 1651704639}, "language": "english", "review": "Good, a bit janky, but it's been out for a few hrs and i'm enjoying it quite a bit. The negative reviews are about the current connectivity issues, however the Devs are addressing these issues. Over 800 as soon as servers went online and i'm sure it wasn't expected by the devs so I'll give it a bit before servers are back online.\n\nEDIT 1: Was able to get back in for a bit but  everyone got kicked from the servers again, I assume it's the high player count and the servers being flooded. Still recommend the game, but i'd give it a bit of time if you're thinking about getting it cause I'm not sure if it'll keep happening at this point or not, but within 4 almost 5 hrs of the launch the devs have been working hard to fix the issues. We'll see. I'll update ya.\n\nEDIT 2: They fixed the issue. Ended up putting in a lot more time and forgot about the review lmao", "timestamp_created": 1650004024, "timestamp_updated": 1650058826, "voted_up": true, "votes_up": 26, "votes_funny": 2, "weighted_vote_score": "0.694560527801513672", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "115361387": {"recommendationid": "115361387", "author": {"steamid": "76561198152477206", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 447, "playtime_last_two_weeks": 0, "playtime_at_review": 447, "last_played": 1652300608}, "language": "english", "review": "The game is actually pretty good, and the concepts are amazing, but if you wanted a MMO game, this is not it, you play on player hosted servers that have 10 people on them, and they are all chinese, so if your from north america, don't purchase, if you were looking for a game where you play in a world with hundreds of players at a time, this is not it.\n-also crashing is a big thing in this game as well, if your interested in the game, i suggest watiting a year or 2 for the game to update and maybe see about playing it.", "timestamp_created": 1652389495, "timestamp_updated": 1652389550, "voted_up": false, "votes_up": 30, "votes_funny": 1, "weighted_vote_score": "0.676770448684692383", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "115761218": {"recommendationid": "115761218", "author": {"steamid": "76561198002971229", "num_games_owned": 0, "num_reviews": 37, "playtime_forever": 22, "playtime_last_two_weeks": 0, "playtime_at_review": 22, "last_played": 1653094764}, "language": "english", "review": "I can't even name my kingdom so i can enter the main portion of the game. No matter how outlandish the name is, it always says \"Kingdom Name Is Already Taken\"... so basically... it becomes unplayable after passing the tutorial", "timestamp_created": 1653094821, "timestamp_updated": 1655039598, "voted_up": false, "votes_up": 23, "votes_funny": 3, "weighted_vote_score": "0.662302672863006592", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114034123": {"recommendationid": "114034123", "author": {"steamid": "76561198019696256", "num_games_owned": 0, "num_reviews": 104, "playtime_forever": 1208, "playtime_last_two_weeks": 5, "playtime_at_review": 33, "last_played": 1713461364}, "language": "english", "review": "Cash Shop in the game Even worse they added a shit Gotcha system to the store!!!!!!!!! Avoid this title at all costs, let the devs learn their lesson. \n\n, buy to play with no private hosted servers or single player. \nBuy are your own risk, if the devs choose to turn the servers off tomorrow, you lose the game you paid for. \nunless the devs add a single player or way to play the game after they shut down the servers, buy at your own risk.", "timestamp_created": 1650236994, "timestamp_updated": 1661069126, "voted_up": false, "votes_up": 57, "votes_funny": 7, "weighted_vote_score": "0.653795123100280762", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114063743": {"recommendationid": "114063743", "author": {"steamid": "76561198269151345", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 2899, "playtime_last_two_weeks": 0, "playtime_at_review": 381, "last_played": 1651419599}, "language": "english", "review": "In case new players don't know, the game dev guaranteed refund for all players no matter how many hours you played and when you bought the game, before 5/3, because of their terrible server issue and game performance. \n\nRefund rejected on 5/3 - Hi developers, if you don't want to refund us, you don't have to make such an announcement saying you've talked to Steam and made the decision that you are going to guarantee refund for no reason and for no matter how many hours have been played.  That free return was ended on 5/3 and I've submitted my request on 5/1. Steam Support has kicked back my request for a couple times like they don't even know about this.  \nI know a lot of players have received their refunds but not me. Guess I fall into the unlucky group again LMAO\n-------------------------------\nREFUND REQUEST SUBMITTED as of 5/1 - I have no words and hopefully no PVE player will suffer the pain of queuing forever. I'm fine but my friend literally spent over 5 hours in queue today and still cannot get in. He was 86 hours and today as he submitted refund his gaming time has been 91 hours. Thank you developers.\n-------------------------------\nanother update as of 4/29 - I'm right on the edge of getting a refund. Game dev just doesn't care about PVE players at all. Yes, the server melting down thing isn't that bad in the past week but most of my gaming time wasted in queue. In queue FOREVER. Me and my friend took turns to wait at first and took us average about 10 min to get in. However, after the latest patch, thank you game devs, it's just impossible to get in. My total time playing was 45 hours two days ago and now is 47.1 hours but I NEVER GET IN THE GAME for once! I literally spent 2 hours in queue and still cannot get in. The worst part is that their queue design is just unbelievable. Once you are in queue, it will start counting from 1 and when it reaches to 11, it will pop a notification saying hey server full. Guess what? you have to click yes or no on the notification and start queuing again. For the past two days I'm repeating the \"wait for it get to 11, click no, start queue again\" over and over again. Hey genius devs, you do realize you can let people waiting in queue without forcing them get out and come back for another queue right? \nAnd also, just want to let everyone know that the reason they let you wait for so long is definitely not because too many players online. We tried get in queue when there's 7k/5k/3k/2k players. 2k players online only and PVE players still cannot get into the game. What a joke. I remember a few days ago when we have 20k players online we can still get in. \nI was planning to wait until May (they claimed to have a new patch for PVE players playing offline). But now after all the dramas and the poor PVE experience...trying to talk my friend out of this game too. \n-------------------------\nupdate as of 4/20 - Well my friend and I planned to finish up with our base and found out we can't access server list again. Checked discussion board and found out the game has crushed in early morning around 8. Official announcement posted after 10 am and still not fixed yet. It's 10 pm now lmao. Again I love the mythology background but over 12 hours...If you are interested in this game, don't buy until the server issue is fixed.  \n-------------------------------------\nCongrats! This will be my FIRST negative review on Steam and I'm pretty sure this will be the only one since for the games I don't like I usually will just request refund and uninstall. \nFirst of all, game-wise, there's definitely no satisfaction with the combat system. Yea they designed all the attacking, dodging, blocking.....but basically the only thing you need is pure luck because there is a random delay during the combat. Click on whatever key you like, you will see your character standing there like you're disconnected from the server. Everything in the combat system is totally random. \nSecond, the server sucks. SUCKS. WORST SERVER EVER. You never know when they are going to announce the server is temp down. I mean I played so many multi-player online games, this is the first server that is MELTING every day. A COUPLE TIMES A DAY. IMPRESSIVE. As of 4/19, another big server temp down and lots of delays and even sudden disconnection. Hopefully this problem will go away in the future, or start thinking about options like players host server. I'm a pure PVE players and PVE players don't really need online server with random people. We just play with friends that's all. \nLast but not least, this is a sandbox game but I have to wait in queue trying to get into my own world? Totally not acceptable. There is no such thing as a local server. Even you decide to be a single player, you will have to join the online servers and that, again, sucks. \nAnyway...I liked this game when I first bought it. Love sandbox, love the online coop, love the Chinese mythology background and I really expected from it. But it's just huge disappointment.", "timestamp_created": 1650291097, "timestamp_updated": 1652581978, "voted_up": false, "votes_up": 43, "votes_funny": 7, "weighted_vote_score": "0.637020647525787354", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "119615092": {"recommendationid": "119615092", "author": {"steamid": "76561198063597935", "num_games_owned": 161, "num_reviews": 8, "playtime_forever": 2117, "playtime_last_two_weeks": 0, "playtime_at_review": 2117, "last_played": 1653827162}, "language": "english", "review": "Don't buy unless you are CN. This game was going to be great but they abandoned all English support.", "timestamp_created": 1658975207, "timestamp_updated": 1658975207, "voted_up": false, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.627366304397583008", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "122208079": {"recommendationid": "122208079", "author": {"steamid": "76561198111072487", "num_games_owned": 212, "num_reviews": 15, "playtime_forever": 1392, "playtime_last_two_weeks": 0, "playtime_at_review": 1384, "last_played": 1698093512}, "language": "english", "review": "Was looking forward to it for awhile when it was being developed and about after a month or 2 after releasing they abandoned their discord all mods left and no more support / contact form them. The game completely abandoned and scammed its english player base to just focus solely on the Chinese player base. Best if you don't support such a horrible dev team. they made so many promises saying they would fix the game in there just to abandon it after awhile.", "timestamp_created": 1663115496, "timestamp_updated": 1663115496, "voted_up": false, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.624789714813232422", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "114377241": {"recommendationid": "114377241", "author": {"steamid": "76561198040333361", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 7230, "playtime_last_two_weeks": 0, "playtime_at_review": 5174, "last_played": 1652494008}, "language": "english", "review": "Tldr:\nGood game, having server problems. Wait until May. \n\nIt's a great game for an early access! They are currently having some server issues due to the amount of people trying to play the game. Thats why there are so many negative reviews. Yeah it sucks to deal with for now but in early may they will be changing the way the online systems work. I would wait until then if you really don't want to deal with it. As for me, I don't mind spending 30 minutes or so to get into my own server. \n\nAs for the game itself, its beautiful and has neat boss mechanics. You can tell the developers put a lot of thought and time into them. You can also build tall ass buildings and easily upgrade them. I feel like I've done so much but I'm nowhere close to the endgame.", "timestamp_created": 1650776095, "timestamp_updated": 1650776095, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.613959789276123047", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114024330": {"recommendationid": "114024330", "author": {"steamid": "76561198046680010", "num_games_owned": 0, "num_reviews": 52, "playtime_forever": 2196, "playtime_last_two_weeks": 0, "playtime_at_review": 815, "last_played": 1686199560}, "language": "english", "review": "i'll change my review probably after some more updates and when i don't spend over an hour waiting to load\nalso doesn't help when a update to fix conection issues causes more issues\n\nEDIT: \n\nit's better than it was some translations are still waiting on or work in progress and yes you do still need artifacts to access areas in pve (or the air itself kills you) do miss the npc invasions a bit though", "timestamp_created": 1650222970, "timestamp_updated": 1656439971, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.593004345893859863", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "135527229": {"recommendationid": "135527229", "author": {"steamid": "76561198081832627", "num_games_owned": 0, "num_reviews": 24, "playtime_forever": 905, "playtime_last_two_weeks": 0, "playtime_at_review": 551, "last_played": 1700669372}, "language": "english", "review": "Solid Game foundation, it got review bombed due to server issues when it released but it runs fine now more or less. the game is good for audiences that enjoy survival craft games like Conan exiles but with a Cultivation Wuxia like theme. Typically found in many Maunwah that come out recently. the world itself feels a tad empty at times but there are generally groups of enemies gathered at set areas on the map. Id say that the hardest part so far is experimenting with the EXP Bolus recipe since you can throw just about anything into that furnace to try your luck, but once you find a good medium you might wanna write that down. Overall id say the game has a lot of potential so keep an eye on it and dont pay attention to the older reviews since they no longer apply to the current build of the game. Honestly how many times have we seen AAA game companies do so much worse to us and gotten away with it?! The devs for this game deserve a second chance.", "timestamp_created": 1679894822, "timestamp_updated": 1679894822, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.585004806518554688", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "120124086": {"recommendationid": "120124086", "author": {"steamid": "76561198868845803", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 173, "playtime_last_two_weeks": 0, "playtime_at_review": 173, "last_played": 1652152368}, "language": "english", "review": "Just gonna give a warning to anyone that decides to ignore the negative reviews because it's a cultivation game and just say don't do it. The devs pretty much abandoned this game while it was still far from finished.", "timestamp_created": 1659729114, "timestamp_updated": 1659729114, "voted_up": false, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.577297091484069824", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114212605": {"recommendationid": "114212605", "author": {"steamid": "76561198083350789", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 864, "playtime_last_two_weeks": 0, "playtime_at_review": 864, "last_played": 1650365745}, "language": "english", "review": "1/10\n不推荐这款游戏，主要有几点原因：\n1.随意关闭游戏服务器\n- 团队完全没有预先通知/通告告知玩家需要关闭游戏服务器，进行维护，这对玩家的游戏体验十分差。\n2.货不对板\n-团队在玩家正式入坑的3-4天后，突然发通告要改变游戏的模式，而且还需要额外收费，让玩家们不仅错愕，大部分玩家也已经不符合退款资格（游戏超过2小时）\n \nRating 1/10\nNot Recommendation for playing based on few reasons:\n1. The Developer just simply shut down the game server\n- The Developer shut down the game server (he claimed for maintenance) without any notice to the players where seriously giving us a bad gaming experience and they have the maintenance for most of time.\n2. The game not same as you receive\n- After the players have purchased this game for 3-4 days and played for more than 2 hours, the developer announced that they want to change the game play mode and you are going to pay more if you are going to play in the PVP mode.", "timestamp_created": 1650524072, "timestamp_updated": 1650524072, "voted_up": false, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.569378018379211426", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "124411718": {"recommendationid": "124411718", "author": {"steamid": "76561198059814826", "num_games_owned": 190, "num_reviews": 73, "playtime_forever": 38, "playtime_last_two_weeks": 0, "playtime_at_review": 22, "last_played": 1706058299}, "language": "english", "review": "English support is abandoned, didn't even play it bought it to wait for updates that won't come and its too late to refund.", "timestamp_created": 1666781796, "timestamp_updated": 1666781796, "voted_up": false, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.568118810653686523", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "135561493": {"recommendationid": "135561493", "author": {"steamid": "76561198045533004", "num_games_owned": 258, "num_reviews": 9, "playtime_forever": 221, "playtime_last_two_weeks": 0, "playtime_at_review": 182, "last_played": 1679945106}, "language": "english", "review": "Server is playable now.", "timestamp_created": 1679942906, "timestamp_updated": 1679942906, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.566666662693023682", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "114554868": {"recommendationid": "114554868", "author": {"steamid": "76561198839971169", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 4143, "playtime_last_two_weeks": 0, "playtime_at_review": 2479, "last_played": 1674242549}, "language": "english", "review": "This game is so fukin good. Don't let the server problem kill this game!", "timestamp_created": 1651056546, "timestamp_updated": 1651056546, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.565789461135864258", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114235515": {"recommendationid": "114235515", "author": {"steamid": "76561198055483790", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 11013, "playtime_last_two_weeks": 1149, "playtime_at_review": 656, "last_played": 1713736679}, "language": "english", "review": "To all the bad reviews about the resent server problems \"Get a life\". Yes the server has been down stopping us from playing but this is an Early Access Game there are going to be problems, the devs are very active and are trying to resolve the issue, be a little patent they seem determined to get it working correctly and have even offered refunds to those who feel that they must have a perfect experience of the game from day one, there have been worse releases of big budget games but they did not give out refunds.\nI have played a lot of games over the last 35 years and this is my first ever review because I feel strongly that this game does not deserve all the negativity.", "timestamp_created": 1650560950, "timestamp_updated": 1650560950, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.56418454647064209", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "113877815": {"recommendationid": "113877815", "author": {"steamid": "76561198101289070", "num_games_owned": 181, "num_reviews": 3, "playtime_forever": 5212, "playtime_last_two_weeks": 0, "playtime_at_review": 96, "last_played": 1656914936}, "language": "english", "review": "This Review will be updated as I keep playing.\n\nSo far my experience has been good, playing with a group, figuring out how cultivation works, testing our alchemy skills. The combat is fluid and feels like you are in a xianxia cultivation game. I'm enjoying so far no matter if there's login issues at the start of a mmo as do all other mmos start out with :)", "timestamp_created": 1650003773, "timestamp_updated": 1650003773, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.560863018035888672", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "113934642": {"recommendationid": "113934642", "author": {"steamid": "76561198286013865", "num_games_owned": 78, "num_reviews": 5, "playtime_forever": 890, "playtime_last_two_weeks": 0, "playtime_at_review": 348, "last_played": 1697235626}, "language": "english", "review": "I must train 1000 years to cultivate to reach the next realm so i can defeat the demon lord and achieve immorality. 10/10", "timestamp_created": 1650090160, "timestamp_updated": 1650090160, "voted_up": true, "votes_up": 6, "votes_funny": 6, "weighted_vote_score": "0.558238685131072998", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "120932560": {"recommendationid": "120932560", "author": {"steamid": "76561198360859606", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 18, "playtime_last_two_weeks": 0, "playtime_at_review": 18, "last_played": 1660990631}, "language": "english", "review": "im a fan of cultivation mythology and what not this takes a step away from it if the idea of having to craft to increase your cultivation at all sounds fun by all means go ahead and play i was thinking youd have to build up a cultivation room to start making gains but its all pills and the menu / system is almost entirely chinese i cant even tell what time of day it is not to mention what i can only assume is your cultivation level is also entirely in chinese the music slider doesnt work the game world doesnt feel real they did good for a small dev team with early access and all but you can tell half the assets are from the unity store the weirdly high res character models clash with the 144p plant textures and nothing really feels tied together in any meaningful way game play is more akin to a fever dream it NEEDS a LOT of WORK \n\nWith that out of the way lets get to the few positives the devs arent cucks which cant be said about most small teams and the concept is thoroughly enjoyable i found the abilities are quite fun and feel good to use but there arent all that many options which is fine if not disappointing as there are around 7 or so for each fighting style where this game really grinds my gears is that cultivating is a mechanic that restores your resources ie health and stamina i dont mind that but id like it if it progressed cultivation even slightly the elements are fire water earth and gold which is slightly disappointing but probably needed to meet production timelines id love for this game to be good but after the tutorial and kingdom system being an utter mess i cant in good faith recommend it until most of the above issues get resolved i may or may not refund depending on the next few updates\n\nupdate the patch notes are entirely in chinese as well so i cant even tell", "timestamp_created": 1660991732, "timestamp_updated": 1660996080, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.557170212268829346", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114250349": {"recommendationid": "114250349", "author": {"steamid": "76561198073873660", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 284, "playtime_last_two_weeks": 0, "playtime_at_review": 225, "last_played": 1650665864}, "language": "english", "review": "It's a little rough but I love the concept. Admittedly it's mostly the theme and concept that drives me to like the game, I've been hoping for a game similar to what you'd see in a cultivation manga for quite a while. The game-play itself is a little rough, but still very enjoyable. The only real issues I've run into are the issues with the servers, and the oddly short amount of time to use a gourd on enemies. Icon pops up and shatters away before I can actually equip the capture gourd to get the essence, resulting in a failure to collect. Admittedly though, that could just be a failure on my part to understand and properly execute the action.\n\nAnyways, I like the game, mostly for the concept but the game itself is still fun for what it is and I don't blame the developers for the server issues or anything (some sort of offline mode would be nice though), I just really hope this doesn't go the way of Worlds Adrift and just end up being shut down/removed entirely.\n\nI'll likely be putting in a good number of hours into this game. Honestly, I would probably already have tens of hours on Cultivation Tales if it wasn't for the server issues and the multiplayer binge of Elden Ring I've been on with my brother.\n\nI wish the developers all the best and I hope to look forward to a bright future for the game they're crafting here.", "timestamp_created": 1650584059, "timestamp_updated": 1650584059, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.555241644382476807", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "117212640": {"recommendationid": "117212640", "author": {"steamid": "76561198056425196", "num_games_owned": 0, "num_reviews": 44, "playtime_forever": 1421, "playtime_last_two_weeks": 0, "playtime_at_review": 1415, "last_played": 1674410994}, "language": "english", "review": "Rare case of developers owning up to their mistakes and using them to better their product, amazing and incredibly fun", "timestamp_created": 1655603883, "timestamp_updated": 1655603883, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.549087107181549072", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114244100": {"recommendationid": "114244100", "author": {"steamid": "76561198153834647", "num_games_owned": 259, "num_reviews": 14, "playtime_forever": 556, "playtime_last_two_weeks": 0, "playtime_at_review": 306, "last_played": 1668244603}, "language": "english", "review": "Great game! Anything a wuxia fan could need is here. I do not care about the server issues, the developers are doing their best. It is early access after all. Gonna get better soon for sure.\nBy the way, the developer said that they are still communicating the refunds with steam, not that they already have an ok from the platform. Anyone complaining about not being able to refund needs to go back to school for reading classes. \nThe game itself was very satisfying as long as we could get in. Right now just waiting for the next patch in May for a better experience with the servers. Keep up the good work, guys!", "timestamp_created": 1650573215, "timestamp_updated": 1650835342, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.548162937164306641", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114077999": {"recommendationid": "114077999", "author": {"steamid": "76561198126865320", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1527, "playtime_last_two_weeks": 0, "playtime_at_review": 1315, "last_played": 1660628598}, "language": "english", "review": "Not for now. This game is fun and unique but the server is extremely unstable dc, lag, server down, unable to log in ect all the time (i mean it! All the time!). China market focus, if you know...you know. And it leads to current (on the written date) event, community is having great opinion diversify among players and dev about \"double-standard\" of compensation for the server problem. Read on the discussion board before purchased, to judge it yourself to see if it is worth a shot, though it's mostly Chinese. \n\nHere's my topic:\nhttps://steamcommunity.com/app/1504570/discussions/0/5154941593376278257/\n\nDo note that this is early access and small dev team, i think its highly promising when they finally solve all the issue, and start to adept \"international\" approach on managing the game. Hope i can come back and change this into positive review.\n\nP.S I mean management of the game like marketing, streaming reward like twitch drops, official groups management ect...", "timestamp_created": 1650309462, "timestamp_updated": 1650309462, "voted_up": false, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.547957003116607666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114356786": {"recommendationid": "114356786", "author": {"steamid": "76561198346083125", "num_games_owned": 41, "num_reviews": 1, "playtime_forever": 503, "playtime_last_two_weeks": 0, "playtime_at_review": 278, "last_played": 1661093007}, "language": "english", "review": "I would gladly reccomend this game for those, who like chinese culture and all the cultivation aestetics. It's interesting to explore the world and build your own Sect. \nThe game is still in Early Access tho, it'll need some time with waiting for servers stability now. But still, developers did a pretty good job as far as i saw.", "timestamp_created": 1650744246, "timestamp_updated": 1650744246, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.547325074672698975", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "113916152": {"recommendationid": "113916152", "author": {"steamid": "76561198271187754", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 1383, "playtime_last_two_weeks": 0, "playtime_at_review": 128, "last_played": 1679934232}, "language": "english", "review": "This game is already quite well established and it runs very well. \nIt has quite a few fun systems to. It definitely needs polish but that's what this early access is for. I heartily recommend it.", "timestamp_created": 1650058603, "timestamp_updated": 1650058603, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.542919814586639404", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "116486939": {"recommendationid": "116486939", "author": {"steamid": "76561198386033083", "num_games_owned": 70, "num_reviews": 7, "playtime_forever": 44, "playtime_last_two_weeks": 0, "playtime_at_review": 39, "last_played": 1681416997}, "language": "english", "review": "good game but can't get into a server most of the time i refuned it but i am going to get it back soon\n\nbut the devs are a small group of people and they are trying there best.", "timestamp_created": 1654369759, "timestamp_updated": 1654369803, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.539028942584991455", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "121399769": {"recommendationid": "121399769", "author": {"steamid": "76561198037858454", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 3448, "playtime_last_two_weeks": 0, "playtime_at_review": 1206, "last_played": 1703035874}, "language": "english", "review": "The game isn't bad. It might need a little more explanation when it comes to what the cultivation ranks are (levels in english) other than that, I like the premise. Cultivation is all about patience, so it makes sense that you get more experience from gathering/crafting vs actual combat. So for those trying to grind levels by combat, I understand why you are upset. You are most likely paying against the way its meant to be played. Note for developers, if you make ranks English in parentheses above the Caligraphy, it won't take away from the style of the game. Also, for the judgement elixirs,  if you make it possible to gain information on the map by hovering over the boss icon and have the elixir material in parentheses along with the rank it is needed to break through to, it would also help to drop the rate of suicides due to not knowing where you are not able to go to yet. \n\nI thoroughly enjoy this game after figuring it out. It is not truly quest guided, meaning it's really on you how you will increase your strength. I've been saying for a very long time that we should have a cultivation mmorpg.  This is the closest thing to such a game. It is still in the developmental phase, so go easy on them. No man's sky was also horrible when it just came out, and you can see where it's gotten today. Developers, please take my words into consideration.  If these few minor changes are integrated, you could estimate at least a 30% or more increase in gameplay and much better reviews.", "timestamp_created": 1661733719, "timestamp_updated": 1661733719, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.538461565971374512", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "114722142": {"recommendationid": "114722142", "author": {"steamid": "76561199038099519", "num_games_owned": 0, "num_reviews": 61, "playtime_forever": 3390, "playtime_last_two_weeks": 0, "playtime_at_review": 2954, "last_played": 1657635795}, "language": "english", "review": "Obviously this game has had a very rocky start like most indie projects of this type, due to server issues. They are a small team of 6 and it seems they bit off more than they could chew, never imagining that their little gem would attract this much attention, which in turn resulted in server overloads. But still, I am thoroughly hooked. The levelling system is very in depth, game mechanics are very easy to pick up and even though the community is mainly Chinese, I did manage to find some English speaking people to play with.\nThe fact that the Developers are working hard to correct the server issues and are very informative of their actions and plans moving forward, gives me great confidence in this project. If you enjoy open world style games, with crafting, base building and of the mythical/fantasy Asian theme, then this is possibly a game you should consider?  But I would recommend to maybe wait till next month when they release the new more stable version.", "timestamp_created": 1651327589, "timestamp_updated": 1651327589, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.529243946075439453", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "113960536": {"recommendationid": "113960536", "author": {"steamid": "76561198368151865", "num_games_owned": 0, "num_reviews": 74, "playtime_forever": 21834, "playtime_last_two_weeks": 0, "playtime_at_review": 649, "last_played": 1683797982}, "language": "english", "review": "After playing too many Western Survival Crafting Base Building game and burned out, this survival crafting game in Ancient Chinese setting will reboot and refresh the experience. Different graphic/art style, different structures, different era, different lore, but it is still a survival crafting base building everyone likes to play. \n\nThe lore of Ancient Chinese setting be it xianxia or wuxia or inbetween is, humans are permitted by gods to borrow their superhuman abilities via cultivations. Light body skill/ability to fly , superhuman strength, energy wave, just to name a few, and this game have them all.\n\nDon't be intimidated by the Mixed Reviews and kinda low percentage, those are mostly because of \"login\" problem in the game, once in the game, it's all good, but yea it can be frustrating at times, because of the long queue.  \n\n[strike]The game isn't actually an online game, but it does check something, I bet it is just for checking copy protections, some Chinese games use that. This game is actually a \"Single Player\" or Co-Op , not an mmo.[/strike] This game does have online features for reading everyone's kingdom name, and can join other people's kingdom, it also has leaderboards and rank people's progress. \n\nThe more I play and when experiencing lag, turned out the game is ACTUALLY an online game, playing on a server, because when my game crashed and I got back to it, it put me exactly where I was dc, that's impossible for a local game. Also when i was  lagging, there was rubberbanding and enemies position also followed. That only happens in a server/client connected game. So this is probably a different kind of online game, it is instanced. Same map different session just for people in the same kingdom.\n\nThe pvp in this game is quite fun, there is no one shot, there is no perma stun, in here we exchange blows, land a hit and also get hit, so a fight is very engaging, need an opening/opportunity to actually land a hit, the main combat is melee but there are atacks from afar and medium range, it can be hectic in a close range because of camera view and mouse rotation, but if lucky that could also be an opportunity to land a huge damage. Since the combat is mostly melee, kiting is also at play in combat. Healing is slow in this game, but even at low hp, can still turn the tide by playing supersafe, there's also a healing artifact which again, also slow with 90s cd and recovers not too many hp. It can be a cat and a mouse game but it can also be a cat with a cat game depending on situation. It's a really fun experience and different kind of fun from headshotting someone in fps games.\n\nOne thing I like is the raid aspect of the game. In most games raiding other's base actually destroys their base in real time, it is fun only for the winning party, the losing party will hate the game for that because all of their hard work for a long time will be gone/robbed/destroyed in just a short time of fun in pvp. In here, since the game is instanced, the game creates an instance of the real base then teleporting all participants to pvp in it. After the fight is over the game will generate whatever the winner has raided from the base they attack while the one that got raided and lost will only suffer losing a bit of what's raided and only cost 10% or whatever percent I forgot for repairing the whole base.\n\n----changes-----\nThe game is now built differently for pvp and pve. Pve is hosted by whoever loads the game from Steam cloud save, not joining on a server anymore. While for PvP is a few months session and is a paid server. That's how it is from the last time I played. Dunno if it's changed now, havent played the game for quite a long time.", "timestamp_created": 1650128543, "timestamp_updated": 1677674498, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.528974413871765137", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114204074": {"recommendationid": "114204074", "author": {"steamid": "76561198815506907", "num_games_owned": 133, "num_reviews": 4, "playtime_forever": 2119, "playtime_last_two_weeks": 0, "playtime_at_review": 486, "last_played": 1656431376}, "language": "english", "review": "Loved the game but too many crashes", "timestamp_created": 1650507743, "timestamp_updated": 1650507743, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.528795838356018066", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "116539356": {"recommendationid": "116539356", "author": {"steamid": "76561198074101679", "num_games_owned": 85, "num_reviews": 1, "playtime_forever": 752, "playtime_last_two_weeks": 0, "playtime_at_review": 740, "last_played": 1654505529}, "language": "english", "review": "Currently this game is still facing issues (e.g Some translation part, bugs and error) which is common on Early Access games.\n\nBut nevertheless I feel that this game got great potential. Will always keep in check.\n\nFor those who are lost,\nENGLISH BASED HOST ID : DDC7FB3FE1F2403", "timestamp_created": 1654453606, "timestamp_updated": 1654453606, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.528445005416870117", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114438172": {"recommendationid": "114438172", "author": {"steamid": "76561198972517513", "num_games_owned": 68, "num_reviews": 6, "playtime_forever": 4810, "playtime_last_two_weeks": 0, "playtime_at_review": 1692, "last_played": 1652540034}, "language": "english", "review": "Not bad for a game that only created by 6 people . well done\n", "timestamp_created": 1650863705, "timestamp_updated": 1650863705, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.528301894664764404", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114482310": {"recommendationid": "114482310", "author": {"steamid": "76561198344410572", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 5132, "playtime_last_two_weeks": 0, "playtime_at_review": 1482, "last_played": 1666255746}, "language": "english", "review": "停服一次卡一天，维护一次卡一天，修复一次卡两三天。这是个闪现游戏，你们可能不知道的是主播的宗门随时都是最流畅的，平民的宗门卡出天际。所以我不推荐这游戏，太区别对待了。别问我怎么知道的，我朋友的发小就是个主播，他们宗门贼流畅。", "timestamp_created": 1650934712, "timestamp_updated": 1650934712, "voted_up": false, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.526881694793701172", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "130301603": {"recommendationid": "130301603", "author": {"steamid": "76561198027845290", "num_games_owned": 644, "num_reviews": 9, "playtime_forever": 911, "playtime_last_two_weeks": 0, "playtime_at_review": 911, "last_played": 1660690713}, "language": "english", "review": "This game is absolutely Amazing, there's a fairly large amount of content, considerable customisation for progression and choice of weapons/skills/etc. \nThe gameplay follows a loop similar to open world sandbox/crafting games, you gather materials, craft new stuff, use the new stuff to gather better materials and use those materials to make better stuff, however this is broken up by certain areas of the map requiring specific \"artefacts\" with specific upgrade levels, the artefacts themselves drop from specific elite enemies, the upgrade materials are dropped from instanced challenge dungeons, these require a lot of prep to raid and usually require multiple runs to get enough materials to move on to the next area. Overall the gameplay follows a similar formula but is different enough to set itself apart from similar games such as ARK and Valheim.\n\nThe game feels much more accessible than many other sandbox/crafting games, for example there is little-to-no penalty for death, you respawn at your home with all your items intact. \nAnd on that note, you have an instanced \"home\" area which is only accessible to you and your team, you can build your stuff and store all your materials here easily, there are occasional NPC raids but otherwise your stuff is \"safe\", in the pvp mode other players can raid a copy of your home island and you gain or lose points based on the outcome, from my understanding you do not lose any materials/buildings from this and the raiders only find randomised loot in your chests, although I may be wrong here due to translation issues. \nYou can still build in the main world but your constructions are always at the risk of being destroyed by players or monsters. \n\nThis might all sound good but... after the game initially had some severe server issues in the first few days after release it seems the developers have completely abandoned the idea of having servers hosted anywhere outside of China and even then the servers are not very stable. \nIn addition to this the official PVP server is locked behind a season-pass-style purchase that only unlocks access for the current season. The PVE mode can be accessed freely but the game is heavily focused on the PVP gameplay.\nThe developers have also stopped translating any news announcements/etc. and some newer portions of the UI don't get translated till several patches after they're released. \n\nThe game is good enough to be the next big hit, but I believe it will only get there if a western publisher picks up the English version.", "timestamp_created": 1673042746, "timestamp_updated": 1673042746, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.527868866920471191", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "114030125": {"recommendationid": "114030125", "author": {"steamid": "76561198078178546", "num_games_owned": 1010, "num_reviews": 335, "playtime_forever": 23, "playtime_last_two_weeks": 0, "playtime_at_review": 23, "last_played": 1650223329}, "language": "english", "review": "Walkthrough: https://youtu.be/FQTzQD4pB-o\n\nGameplay: Nothing special\nGraphics: Good\nAudio: Good\nPC Requirements: Rich Guy\nPrice: Wait for a lower price\nBugs: Ruining the game", "timestamp_created": 1650230928, "timestamp_updated": 1650231044, "voted_up": false, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.527373015880584717", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114671649": {"recommendationid": "114671649", "author": {"steamid": "76561198840120210", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 4376, "playtime_last_two_weeks": 0, "playtime_at_review": 3087, "last_played": 1652543084}, "language": "english", "review": "Actually we five (eight) people enjoyed the game for the past two weeks despite so many negative comments on the steam.\nNo doubt that it was a nightmare at the beginning during which at least three times 'data reverse back' involved. But I gotta say the play style of this game attracts me deeply.\nPros:\nFour bosses are very fun to challenge, even for me who get used to monster hunter series.\nGraphics looked very bad from the demonstrations but actually very OK.\nA pretty mature progressing system that addicts people.\nPVP is A LOT OF fun.\n\nCon:\nLong waiting in queue if you are not the guild master (yes, waiting time for me was never too long as our guild master is always online).\nGuess the server in Asia is in Hong Kong, some delays can be expected. And there is no EU server.\nA LOT OF COPYING ITEM BUGS. For this point, i must admit, FK all the hackers. Same stories happened to myths of empire, etc. Always some hackers attacking the server and 'accidentally' found many bugs.\n\nOverall, as an early access game, I hope it can get better~ it is well, satisfying to me.", "timestamp_created": 1651248299, "timestamp_updated": 1651248299, "voted_up": true, "votes_up": 5, "votes_funny": 2, "weighted_vote_score": "0.525247633457183838", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114399670": {"recommendationid": "114399670", "author": {"steamid": "76561197999449679", "num_games_owned": 2412, "num_reviews": 58, "playtime_forever": 1236, "playtime_last_two_weeks": 0, "playtime_at_review": 1200, "last_played": 1659144800}, "language": "english", "review": "This is a personal recommendation. there are limits to what kind of user this might apply to.\nI am a big fan of chinese cultivation novels and myths. This game's main point is said cultivation and it is easy to think out a story around it for your character. That being said the game is in early access and it has lots of flaws at the moment, these flaws might very well be gone by the time the game returns to the store again though.\nFor people who have knowledge on different survival games would probably best understand if I compare it to others:\n\nBuilding: Basically like in Rust. you build up your basic structures and are able to later upgrade it to other materials. though there are some quuality of life features like mass upgrading mass repairing and more. As for building parts, I hope that they will add more in the future, as some are still missing, which are in my oppinion necessary. (Walls for half foundations)\n\nCombat: the combat is something new depending on your weapon of  choise, the attacks already differ. for every Weapon there is also multiple Qi abilities, frowm which you might choose two to have equippped at the same time. To unlock those abilities and level them up you have to spend skillpoints, which you get when leveling up or finding certain landmarks or skillbooks in the world.\nThe enemies are interesting, sadly I was not able to test them to their full extent, as the connection to the servers caused quite some lagg at times.\n\nGraphics: The graphics are nice. Nothing to be amazed of like the best looking game ever, but nice and typically styled for a survival game. \nThere is reason to be careful with torches though, as the fire effects are not perfectly optimized and can cause your computer to use quite some calculating power.\n\nCultivation Mechanic: For the most part you will be doing the introduction questline to learn the game. This will also lead you to understand, that pellets are the most effective way to strengthen your Qi energy (level up)\nyou will have to use a special furnace to create pellets from herbs and other materials until you reach a bottleneck and have to break through it with a pellet, that requires a boss material.\n\nOverall I already had lots of fun exploring this game. For me it was worth the price, as I spent more hours playing it, than I spent Euros paying for it.\n", "timestamp_created": 1650807473, "timestamp_updated": 1650807473, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114363421": {"recommendationid": "114363421", "author": {"steamid": "76561198006020354", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 11855, "playtime_last_two_weeks": 16, "playtime_at_review": 5855, "last_played": 1713425747}, "language": "english", "review": "Given the amount of misleading reviews that are affecting the score here, I figure I'd throw in my thoughts.\n\nThe game as it is, is better than most other sandbox like games currently available in early access despite being in it's early stages.  The combat system, though a little janky at times, is miles ahead of other similar games in the genre.  The building part of the game is about what you'd expect as well, neither good nor bad, but enough to build pretty much what you want.\n\nThe main issue with the game at the moment, and why they've stopped sales and are issuing refunds, is that they weren't expecting to get so many players when the game first launched into early access so there's been server issues.\n\nFor the first few days, the servers would run well enough til overheating (as said in the dev post) and needing time to be fixed, not something a simple restart would fix.  There's also the issue of lag, but I suspect this is english speaking players selecting the 'Asia' server to play on, rather than the 'America' one.  Europeans and others are out of luck for now, though.\n\nThey've stated, given how they've programmed the game so far, that they'll need to rewrite the net code and a few other things, to make it more suitable for the large amount of folks wanting to play.  So, right now, they've limited how many servers can be open (since before, every single kingdom instance would be like opening up a 'mini server', which would put the main server under a lot of stress.  Their words, by the way.)\n\nThis, of course, has gotten quite a few people angry, understandably, and it's all rather unfortunate as even if they do fix this, and I think they will, the score will stay as it is and I don't think the game deserves that because it's really not that bad.\n\nIf you don't want to spend a few minutes queuing up to get your own server open, or join another (which is how long it takes right now, as of posting) then I'd suggest waiting til about May when they're scheduled to get the big fix in, and take what the negative reviews say with a grain of salt.", "timestamp_created": 1650753901, "timestamp_updated": 1650753901, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114222750": {"recommendationid": "114222750", "author": {"steamid": "76561198350318669", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 2319, "playtime_last_two_weeks": 0, "playtime_at_review": 163, "last_played": 1672498272}, "language": "english", "review": "I really enjoy this game so far. While being in the early access stage and making it rough around the edges, it has so much potential. I have not yet played many hours, but I know this is a game I personally have been looking for. One that combines my love of survival and crafting games, with my love of stories of cultivation.", "timestamp_created": 1650543117, "timestamp_updated": 1650543117, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114215800": {"recommendationid": "114215800", "author": {"steamid": "76561198095149506", "num_games_owned": 0, "num_reviews": 50, "playtime_forever": 1242, "playtime_last_two_weeks": 0, "playtime_at_review": 9, "last_played": 1651016002}, "language": "english", "review": "I was the top review originally. I got a refund, and I reversed the refund because the dev's were actually trying. Since that review, the dev's have abandoned english support, removed all servers outside of china, and added a cash grab scheme. They'll be abandoning this project within a year now. It was unfortunate, I was really looking forward to this game succeeding.", "timestamp_created": 1650531057, "timestamp_updated": 1662203323, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114181053": {"recommendationid": "114181053", "author": {"steamid": "76561198058770423", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 2421, "playtime_last_two_weeks": 0, "playtime_at_review": 1575, "last_played": 1689195699}, "language": "english", "review": "Love the game. It still is in Early Access, so.. expecting perfection right away, is kind of dull. People who complain about Server issues really should find something to do, apart from this game.\n\nIt still has a way to go. But so far, everytime I login, I really enjoy spending my time in building, exploring, combat and crafting. \n\nThe Dev is as far I know, based on a 6-headed Team, the quality the game delivers, is beyond most expectations so..\nIt would not be fair to write a bad review only because of a bad Server availability, which hits even the biggest developers & publishers these days.\n\nGive it a try, you might enjoy it as much as I do.", "timestamp_created": 1650470374, "timestamp_updated": 1650470374, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114053573": {"recommendationid": "114053573", "author": {"steamid": "76561198011182974", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1358, "playtime_last_two_weeks": 0, "playtime_at_review": 199, "last_played": 1652531944}, "language": "english", "review": "Pretty fun if you're into the wuxia genre. \nBasically a sandbox third person action rpg in the wuxia genre style.\nI look forward to seeing the updates to come.", "timestamp_created": 1650275401, "timestamp_updated": 1650275401, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.522758603096008301", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "113984442": {"recommendationid": "113984442", "author": {"steamid": "76561198006635508", "num_games_owned": 6641, "num_reviews": 82, "playtime_forever": 555, "playtime_last_two_weeks": 0, "playtime_at_review": 96, "last_played": 1650253094}, "language": "english", "review": "9/10 - This is a Chinese cultivation mythology take on games like Rust, Conan Exiles, and Ark. This is not just another survival clone, there are very many unique gameplay mechanics. Def give a try.\n\n[b] Follow my [url=https://store.steampowered.com/curator/41353964/] curator page [/url] for more reviews! [/b]", "timestamp_created": 1650164029, "timestamp_updated": 1650164029, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.522602200508117676", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "113903463": {"recommendationid": "113903463", "author": {"steamid": "76561198036213458", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 89, "playtime_last_two_weeks": 0, "playtime_at_review": 89, "last_played": 1650041115}, "language": "english", "review": "As it stands now I can not recommend this game and not because of the server issues. My issue with this game has to do with the fact that it tries to do too much and has so many things that just seem to be unneeded like crafting an axe only to almost immediately be given a shapeshift spell that makes axe obsolete. It has some good ideas but right now they just seemed to be covered in muck. This style of game should be kept simple allowing the players to feel like its a world open to just play around in building and crafting not overwhelmed with tutorials that never seem to end with lengthy explanations of how to do everything except understand all of the menues.", "timestamp_created": 1650042106, "timestamp_updated": 1650042106, "voted_up": false, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.522455453872680664", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "115237219": {"recommendationid": "115237219", "author": {"steamid": "76561198152551629", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 23313, "playtime_last_two_weeks": 0, "playtime_at_review": 14542, "last_played": 1653065123}, "language": "english", "review": "各种沙盒生存类游戏玩了几千小时了.一开始满怀期待,想说在如今沙盒生存建造百花齐放的时候,终于有一款国产游戏站了出来，玩了200多个小时最后只剩失望.\n1.开服5天炸4天忍了,好,你小公司经验不足。但是游戏已经收费了出现如此重大事故到了开服10几天才退款,不知道是故事写不下去了还是实在找不出新的理由了\n2.沙盒游戏建造系统做的垃圾就不说了,平衡和bug一大堆,最后感觉不用bug就没法玩. 上百万资材建的家一样顶不住一波技能.哪怕S1平衡了,能建出来的东西和视频里宣传的完全就不是一个东西。\n3.粗制滥造的调色板衣服几百块一套,国产游戏公司赚钱我没意见,毕竟有钱才能做更好的游戏.但这贴图换色卖这么贵纯属恰烂钱,是觉得玩家都是智障么,不是花不起钱而是觉得这样应付玩家的公司没必要花钱.\n4.小公司不是借口,国外有的是几年用心打磨游戏的小公司,游戏都没做明白就出来割韭菜属实不太厚道,地图是挺大,但是大的空洞,除了副本门口几个传送点有用基本就是一片荒芜,地图上99%的房子里没有npc,没有家具,开放世界没有半点探索元素开这么大地图意义何在. 整个地图算下来一共就5个boss,每个本都长得差不多,boss也没啥机制就是一顿乱窜。想要好点的装备就是重复再重复的刷。饼是画的很大,但从细节和执行力来看很难等到那一天.\n5.S0结束了只看到国服的排名奖励,亚服和美服是都懒得发了嘛？\n最后总结: 目前不推荐入手, 可玩性低,重复度高. 别的沙盒游戏都是充满了惊喜与未知,这游戏是充满了bug和失望.", "timestamp_created": 1652158449, "timestamp_updated": 1652158449, "voted_up": false, "votes_up": 16, "votes_funny": 5, "weighted_vote_score": "0.521837174892425537", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114020992": {"recommendationid": "114020992", "author": {"steamid": "76561198272507042", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 246, "playtime_last_two_weeks": 0, "playtime_at_review": 185, "last_played": 1673492929}, "language": "english", "review": "Well, as someone who was waiting for this type of a game for a long time, i have a very mixed feelings about it. Lets start off with basics. Graphics is OK. Neither good, nor straight up bad. There's quite a few visual bugs here and there, but nothing game breaking. Sounds are, well, low budget i would say, but also not straight up bad. All in all, its OK, \n\nNow for the systems themselves. Lets first talk about map. Its useless. Tells you where you are on the map, thats about it. In a game where you have to gather resources a lot, you would expect some indicator when you are close to something, but there isnt anything. So your best bet is to open some fan made map to actually find what you are looking for. Without it, well, good luck. \n\nCultivation. Propably the reason why y'all deciding whenever to get this game or nah. Well, in simple terms, this is basically RPG game with levels. There is little concept for cultivation itself. You get EXP for doing various tasks and once you accumulate enough, you level up, get bit of stats, and repeat. Now i havent gotten far into the game, but it looks like you have to at least craft a pill when breaking through big realm (foundation, golden core etc. etc.) so thats at least somewhat similar to cultivation. Another way to level up is getting resources and put them into furnance, which will literally give you EXP pill.  You dont get to meditate or something, which you would expect in this type of a game. Again, its not terrible, but its not good either. Really just feels like playing a regular RPG with bit of cultivation theme in it. \n\nCombat. Oh well, this one is actually pretty bad. Its clunky as hell, good luck hitting anything. Not to mention i started randomly teleporting with a club when killing a boar. (not lags, just clunkiness) \n\nIts early access and thats what i tell to myself to not feel bad about the game. If the game gets some love, and devs put in effort, it HAS potential to be a very good game actually. For now however, its not the best experience. It cost me 15€, and i am fine with that. 15€ is appropriate price for this game right now. \n\nTLDR: If you have 15€ you wont miss and are desperate for cultivation game, i would say get it, but dont have high expectations. If you have limited allowance, wait till it gets better.", "timestamp_created": 1650218869, "timestamp_updated": 1650218869, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.52173912525177002", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "113980867": {"recommendationid": "113980867", "author": {"steamid": "76561198138467793", "num_games_owned": 197, "num_reviews": 12, "playtime_forever": 1869, "playtime_last_two_weeks": 0, "playtime_at_review": 286, "last_played": 1697432695}, "language": "english", "review": "I love the game so far but I hate that I can't play because I don't got the proper version. It tell me to update but it literally not updating. failure of a game maker if this keeps happening", "timestamp_created": 1650157710, "timestamp_updated": 1650157710, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.521300971508026123", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114381193": {"recommendationid": "114381193", "author": {"steamid": "76561198150144955", "num_games_owned": 0, "num_reviews": 52, "playtime_forever": 675, "playtime_last_two_weeks": 0, "playtime_at_review": 675, "last_played": 1650554815}, "language": "english", "review": "Even if don't ever get to play the game... \n\nthe responsible stance you took is so rare in the industry. Admiting the mistake? Refunding uncoditionally? Getting the game off the store untill everything is sorted out?\n\nYou can keep the money, and hopefully you will finish the game you envisioned.", "timestamp_created": 1650782636, "timestamp_updated": 1650782636, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.520851790904998779", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114182399": {"recommendationid": "114182399", "author": {"steamid": "76561198801036066", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 6671, "playtime_last_two_weeks": 0, "playtime_at_review": 1641, "last_played": 1654418098}, "language": "english", "review": "Once the server issue has been fixed, you will enjoy this game if you like Chinese Mythology \nor read Chinese Manhwa :)\n\n---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☐ Good\n☑ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☐ If it's on sale\n☑ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☐ Minor bugs\n☑ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n\n\n\n", "timestamp_created": 1650472375, "timestamp_updated": 1650610873, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.519841313362121582", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114070232": {"recommendationid": "114070232", "author": {"steamid": "76561198876385095", "num_games_owned": 27, "num_reviews": 4, "playtime_forever": 3141, "playtime_last_two_weeks": 0, "playtime_at_review": 1046, "last_played": 1653774344}, "language": "english", "review": "Good game", "timestamp_created": 1650299348, "timestamp_updated": 1706653908, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.51932525634765625", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114213039": {"recommendationid": "114213039", "author": {"steamid": "76561198008686583", "num_games_owned": 176, "num_reviews": 26, "playtime_forever": 3710, "playtime_last_two_weeks": 0, "playtime_at_review": 1427, "last_played": 1687320570}, "language": "english", "review": "\nEDIT: WHAT THE HELL IS THIS PAY TO PLAY MODEL??? 24 DOLLARS FOR THREE MONTHS OF PVP?? ARE YOU SHITTING ME????? ABSOLUTELY DEGENERATE! AVOID AT ALL COSTS!", "timestamp_created": 1650525029, "timestamp_updated": 1687218128, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.518518567085266113", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114817975": {"recommendationid": "114817975", "author": {"steamid": "76561197989524210", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 238, "playtime_last_two_weeks": 0, "playtime_at_review": 238, "last_played": 1650405124}, "language": "english", "review": "Game is not even Early Access, Its early Server Down time. Don't think this one is going to make it.", "timestamp_created": 1651467698, "timestamp_updated": 1651467698, "voted_up": false, "votes_up": 15, "votes_funny": 1, "weighted_vote_score": "0.517757236957550049", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "113916483": {"recommendationid": "113916483", "author": {"steamid": "76561199071156025", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 1170, "playtime_last_two_weeks": 0, "playtime_at_review": 306, "last_played": 1650208047}, "language": "english", "review": "Fly around, find herbs, make drugs, smoke them, become more powerful, withstand lightning because the heavens are clearly weak, and your psycopathic way of meth smoking herb concocting and butchering of ambiguous creature, is what matters\n10/10 would become god again\n\n\nEdit 1: spent another 10 hours in game the day after i wrote this review, game is still fun as hell but definately is a grindfest and doesnt hold your hand, despite that im still ranked 189th for cultivation and my sect leader is ranked 66th\nim at the level before breaking through the second great realm (yes after 18 hours thats how grindy this game is) we built a huge base and upgraded the tree to level 4 which took us basically all day. my only complaint with the game is that they should tell you which mobs drop what because gear takes 10 different things in great amounts and its kind of difficult to know which mob drops it.", "timestamp_created": 1650059085, "timestamp_updated": 1650133120, "voted_up": true, "votes_up": 3, "votes_funny": 5, "weighted_vote_score": "0.516652703285217285", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "115038824": {"recommendationid": "115038824", "author": {"steamid": "76561198005382438", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1324, "playtime_last_two_weeks": 0, "playtime_at_review": 319, "last_played": 1652270026}, "language": "english", "review": "Great game, alot of potential. Maybe finish translating all the texts to english though.", "timestamp_created": 1651845442, "timestamp_updated": 1651845442, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.513271808624267578", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114054986": {"recommendationid": "114054986", "author": {"steamid": "76561198810981871", "num_games_owned": 116, "num_reviews": 3, "playtime_forever": 3035, "playtime_last_two_weeks": 0, "playtime_at_review": 370, "last_played": 1658208858}, "language": "english", "review": "cnm吃相真难看想玩PVP还要拿168？把我当大佐呢？我开加速器也要把这个差评给了！兄弟们都别买68买的就是一个带修改器的PVE我是退不了了，68当喂狗了！he tui今天我就骂脏字了真忍不了", "timestamp_created": 1650277995, "timestamp_updated": 1652201816, "voted_up": false, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.511473000049591064", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114208346": {"recommendationid": "114208346", "author": {"steamid": "76561198077190807", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 1531, "playtime_last_two_weeks": 0, "playtime_at_review": 1531, "last_played": 1650473440}, "language": "english", "review": "Irresponsible developer\nServer has been downed 80% of the time since launch.\nThe dev will shut down the server anytime they want without any notice.\n*Please do not purchase the game, it's a scam*\n\n\n只能说 新人别买，快跑\n\n80%时间都在维修，停服，炸服。\n官方也没提早说要维修，也没第一时间通知。\n想开就开，想关就关\n\n还有，请顺手点小蓝旗举报。 游戏下架大家得到退款最好的。\n这种国产游戏，老子一分都不想给他赚", "timestamp_created": 1650515680, "timestamp_updated": 1650515680, "voted_up": false, "votes_up": 17, "votes_funny": 2, "weighted_vote_score": "0.511165738105773926", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "115682017": {"recommendationid": "115682017", "author": {"steamid": "76561198844143667", "num_games_owned": 60, "num_reviews": 10, "playtime_forever": 34256, "playtime_last_two_weeks": 0, "playtime_at_review": 22918, "last_played": 1693148258}, "language": "english", "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☐ Adults\n☐ Poop Enjoyers\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Difficulty }---\n☑ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☑ You'll need a second (and possibly third) life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☑ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ The game itself is a big terrarium for bugs\n☑ ARK: Survival Evolved", "timestamp_created": 1652957826, "timestamp_updated": 1655286977, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.508060276508331299", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114116481": {"recommendationid": "114116481", "author": {"steamid": "76561198047140112", "num_games_owned": 72, "num_reviews": 3, "playtime_forever": 3189, "playtime_last_two_weeks": 0, "playtime_at_review": 1308, "last_played": 1702139651}, "language": "english", "review": "The Game is fun , but still not recommend , since the first day launching until now,  the game having following serious problem \n\n1) Always Queue , no idea what to queue when you try host so call your own world\n2) Server always down since the first day until now , review time 21.8 , queue and down time took about 18 hour at least in total .\n3) Latest Update Fix from dev in order to reduce queue time and fix their 24x7 server down issue, added in game purchase season pass (per season) to enter official server or so call create your own kingdom, what a brilliant solution and the game have no unofficial server. so you have to pay for the base game and 20+ USD for playing without a guarantee all the bug is fix.\n4) Unacceptable in game purchase pricing for costume. even more expensive than the ingame + season pass price", "timestamp_created": 1650360824, "timestamp_updated": 1652154542, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.50415503978729248", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "113886999": {"recommendationid": "113886999", "author": {"steamid": "76561198016141402", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 6051, "playtime_last_two_weeks": 0, "playtime_at_review": 181, "last_played": 1652238082}, "language": "english", "review": "对于一个EA游戏内容还是不错的。可惜是强制上线游戏，服务器稳定性有待加强。\n15/4:打开游戏3个小时，排队进宗门排了两个小时，实际游戏时间勉强有一个小时。晚上11到凌晨2点可以玩可是就有点卡。\n16/4: 早上9点多到10点多之间，服务器重启几次。中午终于可以正常游戏。\n18/4: 又炸服了，直接停服维修。\n19/4: 凌晨开始可以正常游戏。早上数据异常又紧急维修，晚上服务器上线一分钟又炸了。\n\n\n\n\n", "timestamp_created": 1650020065, "timestamp_updated": 1650381999, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.501853704452514648", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114308293": {"recommendationid": "114308293", "author": {"steamid": "76561198164136983", "num_games_owned": 24, "num_reviews": 3, "playtime_forever": 10780, "playtime_last_two_weeks": 0, "playtime_at_review": 2088, "last_played": 1656288167}, "language": "english", "review": "Inspite of the recent events, the game has only been out a short time, the play time we have is quite good. \nI would recommend this to anyone who has patience to put up with the server stability.  It has improved and with the recent changes for the best, I have no doubt that it will just get better.  The is quite fun, building is easy, quest is pretty straight forward and their tutorials are excellent.  I think it has been well worth the price and I have already gotten my monies worth.  Looking forward for more fun with this game. \n", "timestamp_created": 1650677982, "timestamp_updated": 1650677982, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501114130020141602", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114300861": {"recommendationid": "114300861", "author": {"steamid": "76561198006442887", "num_games_owned": 527, "num_reviews": 35, "playtime_forever": 6641, "playtime_last_two_weeks": 0, "playtime_at_review": 1302, "last_played": 1651695224}, "language": "english", "review": "Game is awesome, but you need a group to play with as there are a limited amount of servers and its a war for slots. Game plays better with a group anyway.", "timestamp_created": 1650665071, "timestamp_updated": 1650665071, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501114130020141602", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114279038": {"recommendationid": "114279038", "author": {"steamid": "76561198822334092", "num_games_owned": 40, "num_reviews": 11, "playtime_forever": 131, "playtime_last_two_weeks": 0, "playtime_at_review": 131, "last_played": 1650327034}, "language": "english", "review": "The game is what you can ask for when it comes to cultivation, although a story would be nice. People need to realize that this is a start up studio on a start up game so its as indie as you can get. It will take time for this game to evolve and compete.", "timestamp_created": 1650635911, "timestamp_updated": 1650635911, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501114130020141602", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114027560": {"recommendationid": "114027560", "author": {"steamid": "76561198019971406", "num_games_owned": 500, "num_reviews": 41, "playtime_forever": 12150, "playtime_last_two_weeks": 0, "playtime_at_review": 1791, "last_played": 1651956077}, "language": "english", "review": "The game is a lot of fun. You can punch down trees as a rhino and smash rock with a giant hammer as a minotaur. It has a tiered upgrade system for basically everything you can craft in the game, as well as many layers of character progression. It definitely has the Chinese Wuxia feel to it, which adds a lot of character to this type of game. \n\nIt's definitely rough around the edges, but these are some of the most active developers I have ever seen, and it's perfectly functional as is. Also it's $20 (currently on sale for 18). That's a movie ticket or 2 starbucks coffees.", "timestamp_created": 1650227323, "timestamp_updated": 1650227323, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501114130020141602", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "113917135": {"recommendationid": "113917135", "author": {"steamid": "76561197990900800", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 26019, "playtime_last_two_weeks": 0, "playtime_at_review": 438, "last_played": 1682025468}, "language": "english", "review": "server dont fuckin work sometimes", "timestamp_created": 1650060007, "timestamp_updated": 1650596970, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.499492377042770386", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "113924507": {"recommendationid": "113924507", "author": {"steamid": "76561197997459751", "num_games_owned": 0, "num_reviews": 34, "playtime_forever": 811, "playtime_last_two_weeks": 0, "playtime_at_review": 209, "last_played": 1650336008}, "language": "english", "review": "Played for 3 hours, game looks really good, good soundtrack, U.I. looks clean, character models are decent enough. Probably the best loading screen simulator ever made.\n I Love how the circles go round and round in a circle while you are waiting for something to happen. Would be nice if they would on occasion go the other way, but i guess that will be next patch (fingers crossed).\n\nThe jump scares when please wait a moment pops up on the screen before putting you back to the menu are truly breathtaking and well worth the price of admission and time spent. Deffinately a masterpiece in the genre.", "timestamp_created": 1650072167, "timestamp_updated": 1650073326, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.498885869979858398", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "131308187": {"recommendationid": "131308187", "author": {"steamid": "76561198200102841", "num_games_owned": 55, "num_reviews": 2, "playtime_forever": 2758, "playtime_last_two_weeks": 0, "playtime_at_review": 2576, "last_played": 1679112359}, "language": "english", "review": "Totally disappointment, I remember how the dev promise many things. It seems the english/global player base has been abandoned. Seems like cannot trust small chinese dev anymore.", "timestamp_created": 1674352584, "timestamp_updated": 1674352584, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.497925341129302979", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "115697755": {"recommendationid": "115697755", "author": {"steamid": "76561198117769319", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 5387, "playtime_last_two_weeks": 0, "playtime_at_review": 5177, "last_played": 1653366693}, "language": "english", "review": "This game is fun to play, especially with friends. I just don't like the fact that it keep updates allllllllll the times. Other than that, I just hope that more outfits, weapon skin, mounts and building structure can have more choices out soon. \n\n游戏挺好玩的， 就是总更新 贼烦。。。 \n很期待能有更多的衣服， 武器皮肤，坐骑跟设计房屋能多些变动或者再出一些房屋的皮肤啥的 更好。 家具也可。。。。 嘿嘿", "timestamp_created": 1652981970, "timestamp_updated": 1652981970, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.497553646564483643", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "113897890": {"recommendationid": "113897890", "author": {"steamid": "76561198862150820", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 46, "playtime_last_two_weeks": 0, "playtime_at_review": 46, "last_played": 1650034685}, "language": "english", "review": "Since it only released today and in early access, there still is not a lot to offer. The game is very basic...too basic at the moment. It has a lot of potential. I look forward to the farming and building and hopefully they make it more detailed rather than easy. The interface such as texts and menu hopefully will still be improved (design wise). The idea of being invaded or going to war is absolutely great but that is another aspect of the game which usually is developed over time. The character movement still seems slightly stiff and has room for improvement. Currently, everything is made easy and players receive a lot of items to increase their levels quickly. The environment is beautiful but still seems \"dead\" at the same time. Background noises and sound effects quality could be improved more. Character customisation: I hope they make it more detailed in the future. There is no story in this game but I hope there will be one whether as a starter or involve a story-rich content. I think a game has to start from a certain story where players can move on from. I like this game but I don't think I will be playing it fully yet. I would like to follow the updates for now before I invest more time in it. I am hoping this game develops further and successfully.", "timestamp_created": 1650035123, "timestamp_updated": 1650035325, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.497262120246887207", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "136869765": {"recommendationid": "136869765", "author": {"steamid": "76561199467320735", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 6184, "playtime_last_two_weeks": 0, "playtime_at_review": 782, "last_played": 1684252710}, "language": "english", "review": "its fun, a little laggy and some hitboxs are weird, but overall enjoy playing", "timestamp_created": 1681755362, "timestamp_updated": 1681755362, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.494619935750961304", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "114211329": {"recommendationid": "114211329", "author": {"steamid": "76561198136133857", "num_games_owned": 734, "num_reviews": 36, "playtime_forever": 165, "playtime_last_two_weeks": 0, "playtime_at_review": 165, "last_played": 1650521375}, "language": "english", "review": "Whilst the game is really fun. The servers just don't work. The game servers have been down for most the time it's been out. The devs put out announcements that give little to no information. Most of the announcement is just them saying how bad they are at their jobs and like two sentences are actually useful. The translation is really not good, some things are done well enough but others have been completely forgotten like the little information box when the game opens. If these issues are fixed then i have no doubt that this game will be fantastic.", "timestamp_created": 1650521919, "timestamp_updated": 1650521919, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.494505524635314941", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114752325": {"recommendationid": "114752325", "author": {"steamid": "76561198087225212", "num_games_owned": 50, "num_reviews": 11, "playtime_forever": 330, "playtime_last_two_weeks": 0, "playtime_at_review": 330, "last_played": 1650515464}, "language": "english", "review": "Not really playable but the devs on their own pushed for unlimited refunds.", "timestamp_created": 1651369260, "timestamp_updated": 1651369260, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.491803258657455444", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "139502749": {"recommendationid": "139502749", "author": {"steamid": "76561198388501679", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 282, "playtime_last_two_weeks": 0, "playtime_at_review": 282, "last_played": 1685825666}, "language": "english", "review": "as of now i wouldn't recommend buying. yes im aware of the older reviews but the newer ones were very positive. first if you prefer to use a controller then don't bother. you'll be like me switching back and forth to the keyboard to do most things. next it really doesn't explain food and water, which you absolutely need. the fighting is atrocious and that's just the simple attack skill, the power moves works maybe once if it even hits the target. at lvl 10 you have to pass a trial to kill several lvls of multi mobs to pass but once your hit you cant attack or block.  your only hope is to spam dodge but if they surround you then you're screwed and trapped and will die bc you can't walk,dodge,or attack out of it. Building- honestly i get what they were trying to do but with how much resources you need to make a small wall i could make a 2 story cabin in real life. either they should lower the material requirements or get rid of it and replace it with complete buildings you can place then customize. i almost forgot that it took me a hour just to figure out how to get into the game itself. this online server stuff is killing it. they should just simplify the game then sale it being single player then maybe when everything is great open it back up like minecraft.", "timestamp_created": 1685826739, "timestamp_updated": 1685826739, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.491617590188980103", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "114972880": {"recommendationid": "114972880", "author": {"steamid": "76561198954575860", "num_games_owned": 277, "num_reviews": 10, "playtime_forever": 578, "playtime_last_two_weeks": 0, "playtime_at_review": 34, "last_played": 1696716202}, "language": "english", "review": "Unfortunately the game keeps crashing. From what I have seen the game has a lot of potential. I would love to see how far the game goes, but I know it has a small team. Keep up the hard work devs.\nI have been waiting for a game like this for a long time. I would love to see it stay and improve.", "timestamp_created": 1651731173, "timestamp_updated": 1651731173, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.490275442600250244", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114938238": {"recommendationid": "114938238", "author": {"steamid": "76561198221877844", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 3308, "playtime_last_two_weeks": 0, "playtime_at_review": 1858, "last_played": 1692043951}, "language": "english", "review": "Its a bit buggy and still in development, but it has a lot of potential to be a very good game. Pair that with an attentive dev team that seems to be genuinely trying their best and you have the makings of an excellent game!", "timestamp_created": 1651674173, "timestamp_updated": 1651674173, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.490275442600250244", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "113911099": {"recommendationid": "113911099", "author": {"steamid": "76561198027942921", "num_games_owned": 314, "num_reviews": 28, "playtime_forever": 25, "playtime_last_two_weeks": 0, "playtime_at_review": 25, "last_played": 1650051427}, "language": "english", "review": "-Translation is a joke\n-No EU servers \n-Strange asets\n\nit looks interesting at first, but it is rly strange, gameplay feel's junky", "timestamp_created": 1650051703, "timestamp_updated": 1650051703, "voted_up": false, "votes_up": 10, "votes_funny": 3, "weighted_vote_score": "0.490029782056808472", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114127607": {"recommendationid": "114127607", "author": {"steamid": "76561198040002085", "num_games_owned": 650, "num_reviews": 39, "playtime_forever": 5783, "playtime_last_two_weeks": 0, "playtime_at_review": 2855, "last_played": 1650885234}, "language": "english", "review": "DO NOT BUY THIS GAME! IF YOU LOVE CULTIVATION TYPE OF GAME, PLEASE WAIT! A LOT OF GOOD CULTIVATION GAME GONNA BE RELEASE SOON!", "timestamp_created": 1650378386, "timestamp_updated": 1658201411, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.487616091966629028", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114106994": {"recommendationid": "114106994", "author": {"steamid": "76561198096843772", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 3606, "playtime_last_two_weeks": 0, "playtime_at_review": 1067, "last_played": 1651461530}, "language": "english", "review": "DLLM", "timestamp_created": 1650340905, "timestamp_updated": 1650340905, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.487130969762802124", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114117692": {"recommendationid": "114117692", "author": {"steamid": "76561198036811624", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 5932, "playtime_last_two_weeks": 0, "playtime_at_review": 942, "last_played": 1685961980}, "language": "english", "review": "Exciting from the get-go! \nA lot of polish for a game 4 days into EA.\nGreat potential.", "timestamp_created": 1650363008, "timestamp_updated": 1650363008, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.485880404710769653", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114110662": {"recommendationid": "114110662", "author": {"steamid": "76561198066192001", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 2952, "playtime_last_two_weeks": 0, "playtime_at_review": 482, "last_played": 1679249096}, "language": "english", "review": "So far so good looks like its going to fun", "timestamp_created": 1650349050, "timestamp_updated": 1650349050, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.485880404710769653", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "113922112": {"recommendationid": "113922112", "author": {"steamid": "76561198184970257", "num_games_owned": 115, "num_reviews": 15, "playtime_forever": 4696, "playtime_last_two_weeks": 0, "playtime_at_review": 272, "last_played": 1651008739}, "language": "english", "review": "NMSL? SBDX 退钱！", "timestamp_created": 1650068115, "timestamp_updated": 1650572389, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.483909428119659424", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114762858": {"recommendationid": "114762858", "author": {"steamid": "76561198097244312", "num_games_owned": 139, "num_reviews": 1, "playtime_forever": 3894, "playtime_last_two_weeks": 0, "playtime_at_review": 3773, "last_played": 1652621989}, "language": "english", "review": "the game is unplayable atm u cant play any mode and at any server \nnot recommending  this game at this point", "timestamp_created": 1651386936, "timestamp_updated": 1651386936, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.483328640460968018", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "115310843": {"recommendationid": "115310843", "author": {"steamid": "76561198187119867", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 114, "playtime_last_two_weeks": 0, "playtime_at_review": 80, "last_played": 1654630872}, "language": "english", "review": "Refunded do to the server issues, but it was fun while I played it. Will play again after a few more updates.", "timestamp_created": 1652293635, "timestamp_updated": 1652293635, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.481711238622665405", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114064082": {"recommendationid": "114064082", "author": {"steamid": "76561198064492488", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 2038, "playtime_last_two_weeks": 0, "playtime_at_review": 224, "last_played": 1650769758}, "language": "english", "review": "Not now!", "timestamp_created": 1650291505, "timestamp_updated": 1650291505, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.481074661016464233", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114059080": {"recommendationid": "114059080", "author": {"steamid": "76561198112662115", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 5128, "playtime_last_two_weeks": 0, "playtime_at_review": 528, "last_played": 1663127641}, "language": "english", "review": "The only game that can get me hooked after Valheim", "timestamp_created": 1650284645, "timestamp_updated": 1650284645, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.480113625526428223", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114554838": {"recommendationid": "114554838", "author": {"steamid": "76561198834377205", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 22528, "playtime_last_two_weeks": 0, "playtime_at_review": 3589, "last_played": 1686728936}, "language": "english", "review": "(y)", "timestamp_created": 1651056507, "timestamp_updated": 1651056507, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.47826087474822998", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "113937433": {"recommendationid": "113937433", "author": {"steamid": "76561198090316125", "num_games_owned": 25, "num_reviews": 13, "playtime_forever": 777, "playtime_last_two_weeks": 0, "playtime_at_review": 230, "last_played": 1652974686}, "language": "english", "review": "Fun game, take me 3 hours playing nonstop", "timestamp_created": 1650095486, "timestamp_updated": 1650095486, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.477302223443984985", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "146042659": {"recommendationid": "146042659", "author": {"steamid": "76561197970559855", "num_games_owned": 588, "num_reviews": 2, "playtime_forever": 2596, "playtime_last_two_weeks": 0, "playtime_at_review": 215, "last_played": 1712320992}, "language": "english", "review": "Okay so...\n\nThe game definately needs work at the moment. but.. its functional in english. Its not entirely translated so as long as your  familiar with xianxia works you will probably work out whats going on even for non translated stuff.\n\nThe translation is also iffy but passable.\n\nYou can host you own server on your own PC but it seems to need a connection to the devs servers I haven't looked into this alot.\n\nOverall despite its current state its actually quite fun to play. I hope the developer puts in the effort to build and smooth out the weak areas to make a truely fun cultivation game.", "timestamp_created": 1694338769, "timestamp_updated": 1694338769, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.476190477609634399", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "136242870": {"recommendationid": "136242870", "author": {"steamid": "76561198978783946", "num_games_owned": 0, "num_reviews": 23, "playtime_forever": 1013, "playtime_last_two_weeks": 6, "playtime_at_review": 785, "last_played": 1713671025}, "language": "english", "review": "wish it was in English so i can play", "timestamp_created": 1680830991, "timestamp_updated": 1680830991, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.476190477609634399", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "114526454": {"recommendationid": "114526454", "author": {"steamid": "76561198873959479", "num_games_owned": 79, "num_reviews": 2, "playtime_forever": 373, "playtime_last_two_weeks": 0, "playtime_at_review": 367, "last_played": 1658172690}, "language": "english", "review": "yes", "timestamp_created": 1651002984, "timestamp_updated": 1651002984, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190477609634399", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114226055": {"recommendationid": "114226055", "author": {"steamid": "76561199161534457", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 1202, "playtime_last_two_weeks": 0, "playtime_at_review": 546, "last_played": 1651709504}, "language": "english", "review": "its like ARK meets wuxai very fun", "timestamp_created": 1650547774, "timestamp_updated": 1650547774, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190477609634399", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114341499": {"recommendationid": "114341499", "author": {"steamid": "76561198071377862", "num_games_owned": 0, "num_reviews": 39, "playtime_forever": 138, "playtime_last_two_weeks": 0, "playtime_at_review": 102, "last_played": 1659713376}, "language": "english", "review": "Honestly? It's super clunky and weird looking. But for some reason I think it's fine. It's not a high quality experience at all and this feels like an alpha and the devs don't know what they're doing. Maybe they mind-controlled me and made me thought that quality isn't always everything. \n\nI know it's stupid but I'd give it a chance, it is constructed out of good ideas, just held together with tape and school glue.", "timestamp_created": 1650725469, "timestamp_updated": 1650725469, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.475206613540649414", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "116156266": {"recommendationid": "116156266", "author": {"steamid": "76561199274681983", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1116, "playtime_last_two_weeks": 0, "playtime_at_review": 387, "last_played": 1680193246}, "language": "english", "review": "I love the authentic and realistic feeling this game gives you, the fact that you can start your cultivation from scratch and do alchemy to create elixers is amazing. The graphics are awesome. This game is worth playing, im definitely addicted", "timestamp_created": 1653767105, "timestamp_updated": 1653767105, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.47480010986328125", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114314913": {"recommendationid": "114314913", "author": {"steamid": "76561198044571851", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 58, "playtime_last_two_weeks": 0, "playtime_at_review": 58, "last_played": 1650081317}, "language": "english", "review": "If you rated this game positively, I'm going to assume you are getting paid, there is no way way you think this is a good game in it's current state, it's like playing a tech demo without the tech, it's just shit.", "timestamp_created": 1650687631, "timestamp_updated": 1650687631, "voted_up": false, "votes_up": 3, "votes_funny": 3, "weighted_vote_score": "0.474480658769607544", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}}, "query_summary": {"num_reviews": 3, "review_score": 5, "review_score_desc": "Mixed", "total_positive": 137, "total_negative": 72, "total_reviews": 209}, "cursors": {"AoIIPvLvLHHqibQD": "Mon Apr 22 23:40:22 2024"}}
