{"reviews": {"157222496": {"recommendationid": "157222496", "author": {"steamid": "76561198071105849", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 6440, "playtime_last_two_weeks": 0, "playtime_at_review": 6436, "last_played": 1706743609}, "language": "english", "review": "As an survival games enthusiast (7dtd, the forest, Green hell, Empyrion, and many others), I think this is the best survival game I have played.\n\nIt kept me on my toes for a long time. The initial struggle for survival was great. It was fair and not tedious as in some other games. You almost feel how pathetic your initial primitive tools are. And you really cheer once you figure out how to build better ones. The shelter/house building system is absolutely great and not grindy.  One chopped tree lets you to build up to four wall segments. An absolute gem is the ability to move already constructed walls (or disassemble them and get the resources back).\n\nAll islands are cleverly designed with lots of hidden stuff, resources and varied animals, encouraging exploration.\n\nThere are some pretty unique mechanics (very minor spoiler for the first 5 minutes of the game: you can choose some initial tools), a very reasonable fast travel system once you construct a raft or a boat, animals that are getting easier to hunt, but still dangerous later on if you don't pay enough attention etc.\n\nI've spent 100+ hours on it and thoroughly enjoyed every single minute on it. The game was in EA when I reviewed this, but I have not encountered any bugs or crashes. The last region was not available. All other regions were fully finished. The story was entertaining and well written.\n\nOverall, I found my favourite survival game!", "timestamp_created": 1706657891, "timestamp_updated": 1706657891, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.708960950374603271", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161767294": {"recommendationid": "161767294", "author": {"steamid": "76561198172621506", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 3286, "playtime_last_two_weeks": 0, "playtime_at_review": 3286, "last_played": 1711754002}, "language": "english", "review": "I... REALLY like this game.  It has a lot of jank; character and animal movement being the most obvious one, however as someone who has been searching for a good survival game for some time, this really ticked all of the boxes for me.  The survival elements are pretty well tuned, wide ranging but not overly time-consuming to manage.  The hand-crafted design of the world is probably the biggest sell; it's a world I just wanted to see more of, uncover the next bit of story, find that new crafting resource.\r\nCombat is simple but surprisingly satisfying, progression is genuinely meaningful and again, very well tuned/paced.\r\nIt's definitely rough around the edges but so far I've put in 54 hours and have very much enjoyed my time here.", "timestamp_created": 1711759148, "timestamp_updated": 1711759148, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.641459047794342041", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159423433": {"recommendationid": "159423433", "author": {"steamid": "76561197970464725", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 914, "playtime_last_two_weeks": 0, "playtime_at_review": 709, "last_played": 1709395289}, "language": "english", "review": "There are a lot of interesting survival mechanics in this game that make me recommend it.  Barely.    Unfortunately a lot of them are badly implemented in some of the most annoying, tedious and obnoxious ways possible.   Hopefully this crap gets addressed before full release. Some of the worst examples:\n\nPick up 2 rocks on an empty inventory and you're over weight.  Worse, the terrible sound design has you ceaselessly grunting like you're constipated.  Its almost impossible to craft anything without an overweight inventory.  Carting around a wheelbarrow with you everywhere barely helps.\n\nAn unreal amount of time passed to do anything... and I mean anything.   Pluck a tree for a couple fronds.. hours pass in the game.  Open a coconut to drink, hours pass.  This means its almost impossible to stay on top of the constant thirst and hunger.\n\nObnoxiously arbitrary degradation of a lot of things in the game where the stuff degrades based on days, not usage which would make more sense.  And remember above.. everything takes stupid amounts of time.  12 hours to start a fire.. another 20 just to cook a couple things and now look, all the stuff you just made to wear is seriously degraded from you just standing there.   Whee, how fun.\n\nOverall terrible sound design.  Most sounds in the game are just annoying in not only how they play, but the frequency.  From the overweight constant constipated grunting, to the worse rattlesnake noise that I've ever heard.  And what's the excuse here, not like the sound of a rattlesnake is copy-written.  Any moron can find an example of a real world rattlesnake sound.  Most animals in the game are like this.\n\nAnyway, the game does have a lot of good going for it though too.  But for now I can only stomach about an hour max of play time before the annoyances get the best of me.", "timestamp_created": 1709075356, "timestamp_updated": 1709075356, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.6132354736328125", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161554573": {"recommendationid": "161554573", "author": {"steamid": "76561197985690960", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 4934, "playtime_last_two_weeks": 0, "playtime_at_review": 4934, "last_played": 1711346616}, "language": "english", "review": "Many thousands of hours across Raft, Green Hell, Rimworld, Don't Starve, Stranded Deep, ONI, etc. This game should get more attention as it's pretty fun. \r\n\r\n-The storyline is kind of interesting and i found myself a little invested in it. \r\n-Tool durability is pretty well designed - it's rough in the beginning and gives payoff for finding better materials\r\n-Mapping system is nice (needs a tweak for line-of-sight visibility -- if I can see it, please map it.\r\n-Exploring feels fun/interesting. Could use some more underwater content.\r\n\r\nI'll replay it on very hard when the last island is released.", "timestamp_created": 1711507511, "timestamp_updated": 1711507511, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.612995684146881104", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160831082": {"recommendationid": "160831082", "author": {"steamid": "76561198003297891", "num_games_owned": 0, "num_reviews": 32, "playtime_forever": 3933, "playtime_last_two_weeks": 0, "playtime_at_review": 3933, "last_played": 1710502084}, "language": "english", "review": "I'd give this a neutral vote if I could. It's fun for a while and works well but after a while it becomes a grind with the constant need to repair your weapons which become weaker after each repair and reed to be repaired much more frequently until you need to make a new one. Even when you get \"better\" weapons this doesn't improve.\n\nWater is always a problem especially when you get to the next island where you overheat and it becomes a real pain. I spent so much time travelling back and forth between islands to stock up on water. The tools you need at the various benches need to be picked up, used and put back in a chest. Does a blacksmith carry around his tongs and hammer or does he just leave them on his forge? It's just irritating when it tells you you're missing a tool. Even more when it tells you it's broken and needs repairing. \n\nCreatures seem to spawn too quickly. I need to kill 4 or 5 crits on my way into a camp and following the same path back they were waiting for me. I couldn't repair my spear, which broke during this so I had to run through them while they beat on you. (while overheating and low on water) If you sleep without a 60% water and hunger rating you don't fully heal or regain stamina so you need to gather water.......\n\nWeapons and tools need to be 3x stronger. Get rid of the overheating and this could be good.\n\nThis should be fun but it isn't. I've come to the third island and my motivation is gone. I wanted to carry on but I just can't. I'm tired of the grind and repetitive game play. Good potential, poor implimentation. The 65 hours covers a lot of paused play. I've probably only played for half that and it's still a grind.", "timestamp_created": 1710752799, "timestamp_updated": 1710753131, "voted_up": false, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.601489424705505371", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1710772367, "developer_response": "Hey there! Appreciating your feedback! We're currently working on the system of custom settings, within which you'll be able to manually set some parameters including tools durability and animals respawn speed. "}, "160604481": {"recommendationid": "160604481", "author": {"steamid": "76561199060034211", "num_games_owned": 0, "num_reviews": 35, "playtime_forever": 168, "playtime_last_two_weeks": 0, "playtime_at_review": 168, "last_played": 1710443340}, "language": "english", "review": "It is a survival themed game on the outside when it comes to dealing with hunger, thirst, sleep.  Where it starts to fall apart is the crafting and building aspect of it.\n\nSome of the things don't vibe and are problematic.  Lots of scenery but you cant use it like looking for the rocks tons around in the landscape none that are useable. The crafting  is not user friendly, what I mean by that is when you first setup a camp any other games you would have to make a shelter, make a bed which all of the items and materials  are attainable in the beginning area.   In this game to make a shelter you need big sticks which you cant find on a tree .....found it in a menu made from another item....cant make that item untill you find this other item.   cant build the type of machine to make the item you need to make the shelter.  you cant sleep until you make the bed you cant make the bed until you craft the parts cant craft the parts until you build the the machines cant build the machines until you discover the items you cant discover the items because you are out of energy  because you cant sleep ..... lots of redundancy and frustration with the crafting.", "timestamp_created": 1710527775, "timestamp_updated": 1710692546, "voted_up": false, "votes_up": 9, "votes_funny": 3, "weighted_vote_score": "0.588978707790374756", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1710772097, "developer_response": "Hello! Thanks for the feedback! The crafting system is quite complex, that's true. One thing: you can sleep without a bed, just press T. Energy regen won't be as good as with sleeping in a bed though. "}, "162948485": {"recommendationid": "162948485", "author": {"steamid": "76561198040833291", "num_games_owned": 146, "num_reviews": 5, "playtime_forever": 75, "playtime_last_two_weeks": 75, "playtime_at_review": 75, "last_played": 1713210470}, "language": "english", "review": "This game isn't about exploration, or survival. It's about babysitting any number of status effects the game applies to you endlessly. Oh you wanted to harvest sticks from that tree? Oops, you cut your hand! Oh you wanted to walk slightly near that scorpion? You're now poisoned. Had the audacity of walking out in the sun for literally 30 seconds? Sunburn.\n\nI played for around an hour, it's genuinely nothing but constant setbacks applied to the player for the most ludicrous reasons. I used my crafted stone axe for approx. 5 swings. It was broken and needed to be repaired. I could tell very quickly that arbitrary difficulty was their preferred method of game design. Open world survival games are my favorite kind of game, I've played countless over 20+ years. This is not an open world survival game, it's a status effect babysitting game where you appear to be the most accident prone, clumsy moron the world has ever seen who can do absolutely nothing without it ending in near death.\n\nIt's so bad I almost believe the real reason this game exists is to poke fun at the open world survival genre, because it doesn't at all feel like a serious game, or one that was given any serious thought.", "timestamp_created": 1713211310, "timestamp_updated": 1713211426, "voted_up": false, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.57711559534072876", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159364057": {"recommendationid": "159364057", "author": {"steamid": "76561198066310950", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 13316, "playtime_last_two_weeks": 0, "playtime_at_review": 11788, "last_played": 1710723033}, "language": "english", "review": "Other than Subnautica, I haven't played survival games, so I don't have anything to compare it to.  I enjoy it.  Just at this point there isn't a lot for me to do, as I have completed the content that has been released so far.  I originally bought the game on sale, but I like it enough that I later bought the Supporter DLC thing with the amigo to give them more money.  I am not a person who cares what reviews say, so I have nothing to add.  Worth it to me and I will be eager to play the next content release.  Good work, Odinsoft.", "timestamp_created": 1709000544, "timestamp_updated": 1709000544, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.566644787788391113", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160876175": {"recommendationid": "160876175", "author": {"steamid": "76561197981666110", "num_games_owned": 0, "num_reviews": 37, "playtime_forever": 2979, "playtime_last_two_weeks": 0, "playtime_at_review": 2340, "last_played": 1711496509}, "language": "english", "review": "I own numerous survival games. This one is challenging, requires thought and interconnected actions, and is immense. The amount of exploration you can do as well as tons of crafting makes this island survival game a no brainer.", "timestamp_created": 1710800308, "timestamp_updated": 1710800308, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.560759782791137695", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161347599": {"recommendationid": "161347599", "author": {"steamid": "76561198024026901", "num_games_owned": 0, "num_reviews": 47, "playtime_forever": 2920, "playtime_last_two_weeks": 0, "playtime_at_review": 2920, "last_played": 1711283051}, "language": "english", "review": "Great survival game. Even unfinished in early access, there is a lot of content and it is worth its price.\n\nMechanics of note (good or bad):\n[list]\n    [*] You level up skills so by the end of the game you can run really fast and carry a lot\n    [*] You find books in the world that make certain things easier, or unlock certain skills or recipies\n    [*] Actions like chopping trees, mining, cooking etc use energy and you must sleep to replenish energy\n    [*] Tools and weapons have durability, and repairing them diminishes their future durability\n    [*] You get up high and \"map\" the area to mark resources on your map\n[/list]\n\nGripes I hope the developers address in future updates:\n[list]\n    [*] Please please please add a sort and \"stack to similar in chest\" option\n    [*] Relatedly, \"take all\" should actually take all not just faster 1 at a time\n    [*] What's the point of letting us choose difficulty with unlimited rezzing, when the amount of living water is restricted anyway. please add a recipe\n    [*] Hard resources like metals need to respawn more frequently or the durability rate of high level tools and weapons needs to be adjusted... I completely skipped over copper tools and weapons as I needed it for other things, and it didn't respawn enough before I found iron anyway\n    [*] The top focus skill should definitely highlight creatures, rather than requiring us to rely on a potion\n    [*] Allow a crafting queue in the smelter, dryer, distiller etc (or way more slots), waiting on it all is boring especially late game\n    [*]  Given how long the smokehouse takes to make stuff and how little you can make at a time even at the highest upgrade, it feels kind of pointless\n[/list]\n\nThings that seem to be broken:\n[list]\n    [*] Sprinting sometimes just doesn't actually trigger\n    [*] \"An animal is hunting me\" indicator for birds etc often doesn't result in anything and you can try again immediately\n    [*] Boats take damage when fast travel docking, because apparently the swell knocks them against the dock\n[/list]", "timestamp_created": 1711283878, "timestamp_updated": 1711283977, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.560021698474884033", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161212318": {"recommendationid": "161212318", "author": {"steamid": "76561198031044028", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 3008, "playtime_last_two_weeks": 0, "playtime_at_review": 3008, "last_played": 1710479642}, "language": "english", "review": " Good for the price, well thought out. enjoyed it overal", "timestamp_created": 1711159196, "timestamp_updated": 1711159196, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.552715659141540527", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160985638": {"recommendationid": "160985638", "author": {"steamid": "76561198084984782", "num_games_owned": 488, "num_reviews": 81, "playtime_forever": 3022, "playtime_last_two_weeks": 0, "playtime_at_review": 3022, "last_played": 1710702559}, "language": "english", "review": "This game has an incredibly pleasant resource demand cycle. Your aspiration whether it's the main story, survival, gear improvement or base building will demand you to travel the map to acquire the resources needed and game progression feels right where most games lead you to being overpowered rapidly. By the time I completed the third map (current content) I still got several hours of gameplay building a new high tier base at the current zone.\r\n\r\nI would compare this game to conan exiles and to a very lesser degree, ark survival evolved. Each island region is very well made and it feels like a scavenger hunt for goodies at first.", "timestamp_created": 1710935870, "timestamp_updated": 1710935870, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.54356849193572998", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160217358": {"recommendationid": "160217358", "author": {"steamid": "76561198139839703", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 523, "playtime_last_two_weeks": 0, "playtime_at_review": 151, "last_played": 1710538355}, "language": "english", "review": "I have played tons of games in this genre (open world survival craft), I enjoy these types of games due to the levels of immersion you typically find in them. Ark was my very first and had this special effect that hooked me. \n\nHere recently the amount of good quality ones in this genre had taken a dip to where things had just gone a little stale, that is until I discovered this one. \n\nThis has some fresh takes on the genre that I didn't anticipate happening, and the story leaves you feeling completely immersed in the world they have created. \n\nIt gives you that same feel of, I want to replay this over and over again just so I can experience the magic that's been created here again. \n\nThere are not many games that make me want to start all over every 5 minutes, but this is one of them.", "timestamp_created": 1710023480, "timestamp_updated": 1710023480, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.541984736919403076", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162686307": {"recommendationid": "162686307", "author": {"steamid": "76561198390898342", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 3562, "playtime_last_two_weeks": 1064, "playtime_at_review": 3332, "last_played": 1713301705}, "language": "english", "review": "This is a harsh survival game. You land empty handed on an island and need to discover what happened with your crew and thrive. At the end you can build houses, ships, farms, etc. It'a a super fun game, really well made. Can't wait for the next updates!", "timestamp_created": 1712869619, "timestamp_updated": 1712869619, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157671496": {"recommendationid": "157671496", "author": {"steamid": "76561198384668678", "num_games_owned": 35, "num_reviews": 7, "playtime_forever": 6433, "playtime_last_two_weeks": 0, "playtime_at_review": 4629, "last_played": 1707299400}, "language": "english", "review": "One word: AWESOME!!! The first hour I was skeptical and the mechanics of mapping and reading, it was a learning curve for me. I kept playing and it grabbed me like I didn't expect. The crafting, building, gathering, decorating, exploring, hunting a large variety of animals is very well laid out and very very good. I was, and am impressed. I would take this out of EA as its better than most AA games out there. This game is not a quick run through so keep in mind it is a grind with a surprise at every corner. I decided to leave my boat and swim a small portion around some rocky outcrops and found an underwater cave with good loot, i was running in the forest and found a hole in the ground that i squeezed through and found good loot and these are not on the map. there is just so much in the game. I love the fishing and the underwater diving with harpoon exploring a sunken ship i found. I highly recommend this game as It is very fun for the low price that it is. The Developers stay on top of everything and are quick to respond and fix any issues if there are any, and they are constantly adding to and updating the game.", "timestamp_created": 1707164877, "timestamp_updated": 1707164877, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157399638": {"recommendationid": "157399638", "author": {"steamid": "76561198130436612", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 1578, "playtime_last_two_weeks": 1, "playtime_at_review": 1576, "last_played": 1713524326}, "language": "english", "review": "Its ok, but way too grindy for my taste.", "timestamp_created": 1706871012, "timestamp_updated": 1706871012, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162867172": {"recommendationid": "162867172", "author": {"steamid": "76561198050459135", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 3551, "playtime_last_two_weeks": 2219, "playtime_at_review": 1538, "last_played": 1713541963}, "language": "english", "review": "A true undiscovered gem of the survival genre. As a true fan of these types of games as a whole, I keep finding myself drawn back to this one; the most comparable title to this would be Green Hell, which I also thoroughly enjoyed.\r\n\r\nWhile it is not the most beautiful of games and is generally lacking in visual polish, the effort put into the various effects and depth of gameplay really makes S:FoY shine. I'm not even off the first island yet and I've found plenty to do and struggle with, especially the sons of problematically tempered mothers... The scorpions. Every damn time I try to collect some wood one pops out of the ground to make me panic-run back to my base for a poison antidote, which is pretty reminiscent of Green Hell too. The regular updates are a true joy that mildly restores my faith in early access, and I'm really looking forward to the last island being completed to see what else this great team has achieved. \r\n\r\nTL;DR: if you like to suffer, enjoy tropical island settings, and think spending hours breaking coconuts is a fun way to spend the day, this is probably the game for you.", "timestamp_created": 1713102743, "timestamp_updated": 1713102743, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.520547926425933838", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161856756": {"recommendationid": "161856756", "author": {"steamid": "76561198001577834", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 2806, "playtime_last_two_weeks": 407, "playtime_at_review": 1069, "last_played": 1713596301}, "language": "english", "review": "If you're after a good survival game with a bit of a story line then look no further.. It can be a bit slow to start off and learn the game but once you get 8 hours in it can be very enjoyable.", "timestamp_created": 1711860770, "timestamp_updated": 1711944565, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.519999980926513672", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "163093200": {"recommendationid": "163093200", "author": {"steamid": "76561198010910395", "num_games_owned": 329, "num_reviews": 3, "playtime_forever": 1031, "playtime_last_two_weeks": 1031, "playtime_at_review": 560, "last_played": 1713525862}, "language": "english", "review": "I really can see this game becoming really good in the future. But at this time there is way too much status choirs. Everything is hurting you constantly while you're not getting all of the necessary resources to build stuff properly. One of the basic resources is always missing on your island while you're getting sunburned, poisoned and jumped by animals going way too fast changing directions mid jump animation. Want to cure your poison? There are no crafting materials on your island for that.. Want to do something against Sunburn? You should better be constantly looking for water while you slowly die because you can't craft anything against sunburn on this island you're at.\n\nPlease implement giving the player a break. Allowing progressing on crafting stuff. I played it on \"Normal\" and its still a pain in the ass to survive. And give the player the resources without him having to constantly search for a way to obtain a specific stick type u need. While u play you have the feeling of constant reaction not really the freedom of making choices/playing the way you want.\n\nAnd a thing that is also annoying is that Birds in Mapping Trees are constantly keeping you infight while not attacking because of the tree so you can't start the mapping process.\n\nEdit: Predicting the range of your spear meele attack is not possible. It feels like its different every time.", "timestamp_created": 1713435186, "timestamp_updated": 1713435290, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.517045438289642334", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1713784746, "developer_response": "Hey there! Appreciating your feedback! We're already working on the system of custome settings, with the help of which it will be possible to set some parameters like animals aggro, tools durability, etc. So, you'll be able to tweak some things within the difficulty you chose. In the meantime, I can suggest you switching to Easy or Very Easy, as these modes may allow you to focus more on the exploration rather than on surviving."}, "161297388": {"recommendationid": "161297388", "author": {"steamid": "76561198193290558", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 2985, "playtime_last_two_weeks": 0, "playtime_at_review": 2985, "last_played": 1710884186}, "language": "english", "review": "I will just repeat what others have said already simply cause it's true. \n\nThis is one of the best survival games there are currently and I can't wait for new update(s)!", "timestamp_created": 1711231697, "timestamp_updated": 1711231697, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.508771896362304688", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160163331": {"recommendationid": "160163331", "author": {"steamid": "76561198015089916", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 714, "playtime_last_two_weeks": 0, "playtime_at_review": 714, "last_played": 1709967975}, "language": "english", "review": "The in game resources are hard to find and when you do find it you will be constantly bitten by spiders and snakes. not what i call fun game more like frustrating as you find your self in constant search for same resources not allowing you to actually build and plan for further exploring. Cut the grass with your axe and you get hurt wtf. back to forest to find limited number of palm leaves and while you are there you get bitten like hundreds of time. save your money.", "timestamp_created": 1709968639, "timestamp_updated": 1709968639, "voted_up": false, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.507559359073638916", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1710177938, "developer_response": "Hey there! Thanks for your feedback! Right now, we're working on polishing onboarding to make the start of the game not so frustrating for some players. As for the chances of getting poisoned by spiders/scorpions or getting hurt during processes, you may take additional precautions (there is a higher chance of getting hurt when working at night, you may use a torch to scare scorpions away, etc.). Hope that helps!"}, "163063727": {"recommendationid": "163063727", "author": {"steamid": "76561198202294285", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 7779, "playtime_last_two_weeks": 7, "playtime_at_review": 7779, "last_played": 1713382978}, "language": "english", "review": "If you ever wished to get into the shoes (or lack thereof) of Robinson Crusoe look no further. The game’s setting, and the freedom to play it as a sandbox facilitates roleplay at your own pace. Of course there is the storyline which can serve as a pretext for exploration, but it will not be the focus of this review.\r\n\r\nThe game can be highly immersive with the right approach. Set it to the highest difficulty from the start. Figuring out the mechanics, as well as the whole journey will feel much more rewarding. You may die a couple of times, but it’s not much of an issue, as the penalties for dying are nullified through an ingame mechanic – living water.\r\n\r\nIt is one of the limited resources you will find, however the main limited resource, in SFoY as in life, is time. The gameplay loop is centred around time management, and by progressing in technology the player can complete actions more efficiently, i.e. gather, repair, cook, or even travel at a lesser time expense. The progression from stone, through obsidian and copper, to iron is an experience of human prehistory.\r\n\r\nSFoY can be relaxing when taken slowly. Once you overcome the struggle of getting water, food, shelter, and medicine there is still more to do. Explore. Collect rare items. Upgrade your gear and tools. Make a garden. Build an amazing fortress on top of a mountain. Watch a sunrise at 3 a.m…\r\n\r\nIn summary, SFoY is not a perfect game: there is some jankiness in animal movement, and the story snippets and cutscenes may lack the triple A polish, but the game is a great sandbox survival experience when played on the highest difficulty setting. \r\n", "timestamp_created": 1713383839, "timestamp_updated": 1713383839, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.504595577716827393", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158681082": {"recommendationid": "158681082", "author": {"steamid": "76561199383677250", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 12092, "playtime_last_two_weeks": 2671, "playtime_at_review": 4713, "last_played": 1713735019}, "language": "english", "review": "This game is so fun! I've been wanting a game that's similar to the Sims 2 Castaway for years. This is like that but even more developed. Yay!", "timestamp_created": 1708305091, "timestamp_updated": 1708305091, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "136993747": {"recommendationid": "136993747", "author": {"steamid": "76561198034737124", "num_games_owned": 0, "num_reviews": 48, "playtime_forever": 635, "playtime_last_two_weeks": 0, "playtime_at_review": 607, "last_played": 1681992256}, "language": "english", "review": "I am really liking this game, but I have some constructive feedback....\n\nPro's\n- Visually great looking\n- Challenging in terms of keeping healthy\n- Large maps/ areas to explore\n- lots to construct and things to build (work stations etc)\n- Small elements of good things from other games (Crafting, exploring, sailing).\n\nCon's / constructive\n\n1) Basic things like sticks/stones can take 20 mins to go find (not in abundance) like the Forest\n- When you need 4 sticks and need to run 15 mins to a tree on the other side of the island\n- When you need a stone, the minimal 2-3 formations are empty and you need to find a random round stone\n- Running past trees/bushes which can't be farmed (no animation) like on Raft is grindy\n\n2) Away from the story, the game can feel bland like \"Raft\"\n- Lots of random small islands with nothing on them\n- It's great building kilns etc, but clay is very rare in most areas - which defeats wanting to build a base/items.\n- Same animals all over, dog, snake, and scorpion placed near resources makes it a bit \"MMO\" feeling\n\n3) Resources are spread far too wide, with 3 or 4 stone piles on a large island (when running past millions of rock \n  formations)\n- Large Island - Great! Lots of trees and rocks - Awesome! Can you mine most of it - NO?\n- Throw stuff like random big sticks, branches, and more sticks around, let us build and be creative once the story/ initial survival element is getting stale.\n- No animations/time consumption for crafting - often contradicts the survival system\n\nWhen you first spawn in, getting sunburned, thirsty, and naked...feels like the movie \"Cast Away\" which is AWESOME!\n\nAfter a while, it starts feeling like the game \"Raft\" where it's nice and pretty, but so much missing and there could be so much more to do...please add this whilst it's in early access! :)", "timestamp_created": 1681978246, "timestamp_updated": 1681980178, "voted_up": true, "votes_up": 157, "votes_funny": 4, "weighted_vote_score": "0.917903661727905273", "comment_count": 14, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1682013104, "developer_response": "Hey there! Thanks for your thorough feedback! We'll definitely continue improving the game, so that the player's journey becomes more and more enjoyable with each update. Hope you'll keep playing!"}, "141716167": {"recommendationid": "141716167", "author": {"steamid": "76561198102075511", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 63, "playtime_last_two_weeks": 0, "playtime_at_review": 63, "last_played": 1688936957}, "language": "english", "review": "A survival game in a conquistador setting with a strong focus on exploration and some interesting mechanics like sunburn? \n\nWhat's not to like, this sounds right up my alley.\n\nAbout fifteen minutes into the game though, I started suspecting that the developer lacked understanding of what makes a survival game fun.\n\nThe things is, how you interact with the world is the possibly the main concept you need to get right in this the kind of game. At its best you experience a tactile engagement with a living world. Chopping that log, felling that tree or picking up those rocks needs to feel good and rewarding.\n\nOr you could just make the process so tedious, I loose all enjoyment of it. \n\nWhich is what this game chose to do.\n\nHere, when you engage with any object or \"resource node\" in the world, you press a button to interact, which brings up a menu. You then select how many resources out of a maximum you want to harvest from that node - let's say picking up three sticks out of five available from a small tree. The game then calculates the time per resource harvested to pass while you did that and advances the clock accordingly.\n\nIt feels like sitting in a beautiful nature location, but only focusing on the spreadsheet data printouts of it that you have brought along. \n\nIt feels inherently wrong.\n\nIt feels like I am playing a game, not interacting with a world.\n\nWhile this is the one design choice that made me not want to play the game, it is by no means to only bad one.\n\nIn good survival design a resource node never feels like a resource node, but a part of the world you engage with. The opposite of that would be when you, for example, cannot pick up those nice looking stones over there, because they aren't part of a node or you can only harvest sticks from that specific kind of tree, never mind picking them off the ground like you would in real life. \n\nWhich, again, is what this game chooses to do. \n\nNevermind that those basic resource nodes are unnaturally scarce. I get that the developer wants to make survival challenging, but when you make picking up sticks, stones and leaves a tedious process with a lots, and I really mean lots, of running around, the fun gets lost along the way. I don't think I have ever seen it done quite as badly in any surival game.\n\nSadly, the world interaction through menus and time passing offscreen seems to be integral to the developer's vision for the project, which is why this ended up being the first time I actually refunded a game on Steam.", "timestamp_created": 1688940555, "timestamp_updated": 1688991348, "voted_up": false, "votes_up": 383, "votes_funny": 7, "weighted_vote_score": "0.90990293025970459", "comment_count": 27, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "139605262": {"recommendationid": "139605262", "author": {"steamid": "76561198183828193", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 4986, "playtime_last_two_weeks": 0, "playtime_at_review": 2655, "last_played": 1710364036}, "language": "english", "review": "Absolutely one of the best survival games I've played. And I've played The Forest, Green Hell, The Infected, The Long Dark, Medieval Dynasty, My Island, Raft, Satisfactory, Sons of The Forest, Stranded Deep, Subnautica and Valheim. I love the way you gather resources and build! I love that you can follow the story or mind your own business. I love that there are very easy mode, because for me it's not about fighting and dying all the time. I also love that things are secret until you unlock them, so suddenly you can build or make new things you didn't know was coming. I can't wait for this game to be finished so I can visit more regions and explore. Keep up the good work!", "timestamp_created": 1685992481, "timestamp_updated": 1685992481, "voted_up": true, "votes_up": 143, "votes_funny": 3, "weighted_vote_score": "0.891174554824829102", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "137389791": {"recommendationid": "137389791", "author": {"steamid": "76561197993686720", "num_games_owned": 275, "num_reviews": 21, "playtime_forever": 2855, "playtime_last_two_weeks": 0, "playtime_at_review": 2001, "last_played": 1683057873}, "language": "english", "review": "Really good.\n\nIt's one of these games that actually attempts at being a survival experience and not an adventure game with a hunger bar slapped onto it. My first semi-blind playthrough took 33 hrs, altho I like to take my time, explore and prepare, so take that as you will. The game is, compared to other offerings in the genre, very polished for an early access release. UI is also really nice. That said, the crafting UI is very, very game-y and if you're a fan of how Green Hell or The Forest handle their crafting UIs, you very likely won't like this one.\n\nIn most survival games I've played, there's a point where you can grow your own food, have excess of every resource and generally become unkillable. This isn't the case in this game (not right now at least). Natural resources respawn after +20 in-game days, there are various status effects you have to keep in mind or take care of (weather, diseases, etc.), you have to sleep once in a while to not fall over from exhaustion. It's always a risk if you go out exploring without proper prep. Exploration is fun and rewarding. The plot is there for you to unravel at your own pace, there's no HURRYUP'pers at any point. Graphics are respectable. not AAA quality by any means, but the game does look nice.\nAs far as performance goes, it's meh. Not great, not terrible. GPU is almost never fully utilized (RTX 3070). There's no upscaling (DLSS/FSR), no borderless windowed mode (it can forced with Borderless Gaming or alternatives). Also no FOV slider (at the time of writing this review) so check out the demo first (if it's still up) or some gameplays on YT to make sure you're fine with it.\n\nWhat I don't like, in no particular order:\n- Going down slopes makes you do tiny little jumps. These jumps count as being mid air, so you can't jump by pressing your jump key. This makes nailing jumps trickier than it should be. Also the sound of constantly landing on the ground is annoying.\n- Fall damage is very \"aggressive\", so to speak. Falling from small heights deals little bits of damage that add up over time. I'd prefer if the lowest required height to take fall damage was increased along with the damage the player receives.\n- House building system is rather painful to use. You have to craft an item that's essentially a \"building block\", craft a hammer, place \"ghosts\" of what you want to build using the hammer and then manually go through the so popular \"crafting popup\" for every single piece. It's somewhere between Icarus/old Conan building system and Valheim/Rust, where the latter is superior. That said, once built, you can freely move most things around without deconstructing them, which is really, really nice.\n- There's way too many goddamn crafting stations. And most of them have upgrades, one or two levels. Upgrades which either unlock crafting recipes that this station should have access to from the beginning or something that's available later in the game. There's an alcohol distiller that's sole purpose is to make one item. Sure, it makes sense it does just that, but it's a video game. Why can't the alchemy table do this?\n- Certain actions take way too much time. I think I know why it's the way it is, but as the same time I wish it didn't take me 45 minutes to pick 3 oranges from a small tree.\n- Storing large amount of heavy items is a PITA. Storage containers have infinite slots (I think), but are limited by weight, so if you wanna store a lot of rocks or ores, be ready to build multiple boxes.\n- Refining ores doesn't follow the established \"confirm the action and stare at passing time\" crafting system. You put the ores in, light the fire and have to babysit the crafting station to manually remove the crafted item, put raw resources in and press \"CRAFT\" again. It's tedious and not fun. Same applies to making charcoal.\n- Other minor balance oddities like a barrel holding 5 more units of water than a palm sized bamboo stick.", "timestamp_created": 1682630203, "timestamp_updated": 1682630203, "voted_up": true, "votes_up": 47, "votes_funny": 1, "weighted_vote_score": "0.817230224609375", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141171632": {"recommendationid": "141171632", "author": {"steamid": "76561198165355474", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 10298, "playtime_last_two_weeks": 0, "playtime_at_review": 1875, "last_played": 1701807164}, "language": "english", "review": "Post Update Edit: Game is getting much better after the last update. Well worth the price. You get used to tedious UI, and leveling up the player buffs helps the game play, reducing the grind. \n\n1. Spanish galleon (or whatever it's called) is MUCH better than the catamaran. \n2. New Iron island region is very cool\n3. Story line is well written IMO.\n4. New building pieces are great, Upgrade option is very well done\n5. If the DEVs continue releasing updates of this caliber and quality, this will quickly become a \n    favorite survival/crafting game of mine. \n\n\n\n\n\nPlay-through of early version completed: EDITED REVIEW.\n\nStill like the early release game, for < $20. A fairly decent buy. ... BUT. \n\n1. Tool, weapon and boat(s) longevity and repair upkeep is phenomenally RIDICULOUS. Even late game, top tier, copper level tools. Utterly Stupid really. An exercise in grind induced carpal tunnel. Totally unrealistic. I can't make this clear enough. This may cause this game to die very quickly. \n\n2. Basic stone resources are far too scarce. Despite there being mountains and rock features that compose of 90% of the main island. . Enough small stones harder to farm than should be ..  really DEVs ? c'mon.\n\n3. GUI is wearing my mouse hand TF out. It takes 5-6 point-and-clicks to accomplish something simple as simple as loading materials into a kiln, or carpenter bench and making a plank.  If you work behind a key board for a living, by the end of the week you won't want to play this game. \n\n4. Fast map is well done.\n\n\n\nAbsolutely recommend.  * IF * \n- You like Green Hell, The infected, 7 days to Die, The Forest, The Long dark and Sons of the Forest.\n- You like hunting, gathering, crafting, base building.\n\n\nDo Not Recommend  * IF *\n-  You have a life outside gaming. The grind is brutal at times and you don't have the time to spend\n- Want human enemies to combat\n- You want to complete the game in a single run-through, or even two days.\n- Hate snakes and spiders. and snakes   and more snakes. ** DEVS: you could dial this back a tad, really.  \n\n\nThe save is janky but works.  \nThere's no 3rd person view of your player, option.\nThe storage crates and boxes go by weight, not by slots. and qty's.  Annoying at first but realistic. \nPlayer stats and environment buffs are very challenging on Normal and even Easy. Difficult setting.... forget about it. \n\nThe graphics are good. Not Sons of the Forest good. But better than The infected, Conan Exiles, and 7 days to die.  Most games are better than that visual insult,  The Long Dark. \n\nPrices is fair for what you get at this time. Has a lot of potential for expansion and improvements.", "timestamp_created": 1688336781, "timestamp_updated": 1692304421, "voted_up": true, "votes_up": 50, "votes_funny": 0, "weighted_vote_score": "0.795407533645629883", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "143619847": {"recommendationid": "143619847", "author": {"steamid": "76561198014905724", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 31, "playtime_last_two_weeks": 0, "playtime_at_review": 31, "last_played": 1691450002}, "language": "english", "review": "Yikes...\n\nSomeone else already posted a review explaining this but you don't actually use your tools. You just press E next to a tree and get the resources you want. You don't swing the axe, you don't physically do anything, whole game is a giant menu simulator. I don't know if this is a conscious design choice or the game is just 3 years out from anything resembling an actual game but that ain't gonna fly for me. \n\nJust absolutely mind boggling.", "timestamp_created": 1691450280, "timestamp_updated": 1691450280, "voted_up": false, "votes_up": 341, "votes_funny": 13, "weighted_vote_score": "0.794601917266845703", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "145034134": {"recommendationid": "145034134", "author": {"steamid": "76561199016797807", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 2355, "playtime_last_two_weeks": 0, "playtime_at_review": 404, "last_played": 1703714027}, "language": "english", "review": "its ok but need Co-op mode", "timestamp_created": 1693025231, "timestamp_updated": 1693025231, "voted_up": true, "votes_up": 63, "votes_funny": 4, "weighted_vote_score": "0.786307990550994873", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141307805": {"recommendationid": "141307805", "author": {"steamid": "76561198128120540", "num_games_owned": 0, "num_reviews": 101, "playtime_forever": 5720, "playtime_last_two_weeks": 0, "playtime_at_review": 219, "last_played": 1689093745}, "language": "english", "review": "After having played for 60 hours, I am changing my former negative review to a positive one. \nFountain of Youth attempts to simulate a more realistic survival game, which I think it does successfully. \n\nThis game takes some getting used to, and its going to take most players time to get used to the game mechanics. This is not a game that players should attempt rushing through. You really have to look at the resources you need for your future crafts and plan accordingly. \n\nOne of the oddities of the game mechanics that players may or may not enjoy is the that nearly all resource gathering and crafting is menu driven. You won't be swinging your axe to chop down a tree. Instead, you will be taken to a menu which will tell you how long it will take for the action. Time in this game passes accordingly, and is an ever present struggle. For that reason, simply gathering everything you see is a poor strategy that will often leave you starving or dying of thirst. \n\nI personally am not a fan of this mechanic. It is the least immersive way of experiencing a survival game. It feels like it should be a placeholder for future animations. But given that the leveling system is based on this time mechanic, I believe this is the direction the developers will continue forward on, for better or worse. \n\nGraphically the game is average, and so is its music/sound. However, the maps are designed well and create an engaging player experience. \nAI leaves a bit to be desired. Fighting in this game comes down to timing your attack so you don't take damage from creatures leaping on you. \nWeather conditions and your overall character hunger/thirst/energy levels do play an important part in success, and are a contributing factor in whether you get wounded while engaging in nearly any activity. It also effects how likely you are to catch a cold, a stomach ache, fever, etc. There are a number of different conditions, all resolvable by creation various liniments and bandages. It does however ultimately come down to RNG, and can be very frustrating, especially in the early game. \n\nOne gripe I do have about the game is that the feeling of real progression is difficult to come by. Important resource nodes take a long time to replenish, so even though you may be able to craft better gear, the resource cost often means you'll still be crafting stone tools well into the late game. Similarly, the game leaves you feeling like you're just chasing your own tail most of the time. And though the game does get easier through your characters level progression and perks, you never truly feel like you've fully gotten out of the stone age. Larger ore nodes and/or faster replenishment time would help alleviate this issue, but it may be by design. \n\nIt is worth noting however that the game is far from complete. There may be more tiers that they will be implementing to get around the above issues. To the developers credit, I had no serious bugs during my 60 hours of playtime. The bugs I did experience were more of a slight inconvenience. The part of the game that is complete is well done and perfectly playable and enjoyable. It seems that the devs have more of a DLC style roadmap in mind, where they will release new islands through development. This is a smart idea, and I hope that players will not need to start completely over as they add to it. \n\nOverall, the devs did a great job bringing everything together, and I recommend the game for anyone into this genre.\n\n\n\n\n\n\n\n", "timestamp_created": 1688491147, "timestamp_updated": 1689054038, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.785822689533233643", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1688556463, "developer_response": "Hello! Crafting menus are important for the game because we aimed for a challenging experience where you should micromanage everything. And those menus show a lot of information like how much your tool will degrade after the process, how much time will pass, what chances of a successful action you have, how you can increase them, etc. When you play on Hard/Very Hard with Permadeath keeping track of those things becomes crucial. As for UI, we also think that it need improvement and we'll be working on that, thanks for pointing this out!"}, "136993807": {"recommendationid": "136993807", "author": {"steamid": "76561198262556289", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 5247, "playtime_last_two_weeks": 0, "playtime_at_review": 710, "last_played": 1700629257}, "language": "english", "review": "I strongly urge anyone who enjoys survival games to pick this game up and give it a try, AND BE PATIENT! When I bought this game I found myself not enjoying it for the 1st 2 hours of gameplay. I took a step back and actually played another game for a couple of hours, and once I was relaxed and ready to try this game again I went for a straight 12hr binge. What I didnt like at first impression was how stiff and slow everything is, coupled with the \"Long Dark\" style of time passing during certain actions you make. But I now very much appreciate how the physics of the player work in the game, as it feels more grounded in realism, and really isn't that bad at all. The time passing mechanic kinda grew on me as it actually keeps the pace of the game going from decision to decision and I have absolutely no complaints.\n\nWhat keeps me hooked on playing the game is the immersion I feel in the world. The graphics are great , but not fascinating and they remain consistently polished to the point where every asset on the island and it's surrounding waters feels like it belongs. The map itself is very well made and I find myself keen on discovering everything if I have the stamina to do so. There are so many things to learn and build in this game that I can foresee myself putting hundreds of hours into this game, which brings me back around to my first point.\n\nIf you are a fan of Survival games, you don't want to miss out on this game!", "timestamp_created": 1681978404, "timestamp_updated": 1681978404, "voted_up": true, "votes_up": 44, "votes_funny": 1, "weighted_vote_score": "0.768896281719207764", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "139809315": {"recommendationid": "139809315", "author": {"steamid": "76561198004742837", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 862, "playtime_last_two_weeks": 0, "playtime_at_review": 713, "last_played": 1686525371}, "language": "english", "review": "A blend of Green Hell, Long Dark and Stranded Deep on tropical islands. Good story also, having a lot of fun so far. Seems like a lot more content planned too. Hope it doesn't get abandoned.", "timestamp_created": 1686356897, "timestamp_updated": 1686356897, "voted_up": true, "votes_up": 32, "votes_funny": 0, "weighted_vote_score": "0.762539863586425781", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "154087167": {"recommendationid": "154087167", "author": {"steamid": "76561197982130634", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 5383, "playtime_last_two_weeks": 0, "playtime_at_review": 3894, "last_played": 1709374414}, "language": "english", "review": "The game really grew on me. \n\nFirst attempt I was always thirsty, hungry and kept getting sick. Thought the game was too tough. \nSecond try I took it way more slowly, set up a base and kept an eye on the basics - food, water, shelter, and making \"daily\" trips around the island to gather resources and suddenly the game was much more fun. It just takes a bit of planning before you run off gathering stuff.\n\n[spoiler]Now I've got bronze/leather armor, cleared all regions, built the stormbreaker, upgraded the stormbreaker, upgraded it again and again, defeated a boss and can't wait for the next region to open up.\n[/spoiler]\n\nLove that there's an actual story behind all the surviving/crafting.\nI also love that to build stuff you don't need 40 ingots or whatever. just a few of each.\n", "timestamp_created": 1703194590, "timestamp_updated": 1703194590, "voted_up": true, "votes_up": 25, "votes_funny": 0, "weighted_vote_score": "0.758178174495697021", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "138907802": {"recommendationid": "138907802", "author": {"steamid": "76561198201022265", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 7, "playtime_last_two_weeks": 0, "playtime_at_review": 7, "last_played": 1684933326}, "language": "english", "review": "[b]Summary:[/b] the game started as a hardcore realistic survival simulator focused on resource and time management, but then developers decided to target a different audience of casual players, so with each update all survival mechanics were dumbed down and discarded, until there was nothing left of the original concept.\n\n[b]Detailed review:[/b]\nDemo version of Fountain of Youth, released back in 2022, had strong vibes of The Long Dark and Green Hell. Which was a good thing, because there aren't that many survival games focusing on balanced and realistic survival. Gathering food, water, treating wounds, hunting animals and struggling against hostile environment to survive until next day were your primary tasks. It was clear that original concept for the game was a realistic survival simulator where you had to carefully explore islands and plan your actions in advance, manage time and resources.\n\nThat's why people who played the demo reasonably expected the game to continue evolving in that direction. Unfortunately, developers didn't have a spine to stand up for their original vision. As soon as some kids from Minecraft/Roblox scene started to complain, because they had to actually spend their time surviving and could not just instantly win everything and build skyscrapers, developers took the game into a drastically different direction - towards a relaxed doing-nothing & fooling-around sandbox game.\n\nSome recent changes the developers introduced compared to original Fountain of Youth from 2022:\n[list]\n    [*]Attack trigger distances for all animals were reduced by 500% or more (now it's less than 2 meters for some predators), so now you can freely walk everywhere without ever being attacked, unless you specifically look for encounters and literally bump into animals.\n    [*]Inventory/carry capacity was pushed well beyond any realism (was ~20kg on hardest mode after all upgrades, now it's over 90kg), so managing your inventory and building carts to carry more items became irrelevant.\n    [*]Crafting times for all blueprints were reduced to bare minimum.\n    [*]Requirements for quantity of resources for crafting are also reduced in every update.\n    [*]Amounts of resource spawns is increased in every update, while resource respawn times are decreased, so there is less and less incentive left exploring islands.\n    [*]Fire starting time was decreased several times, so now you don't even need to use tinder (which was an important part of original gameplay).\n    [*]Time to harvest resources is decreased in every update, so now all harvesting is almost instant (takes 1 minute, in the past it was from 5 to 10 minutes of in-game time).\n    [*]By disassembling crafted objects you always get back 100% of resources, including from burned fires. Which means you never need fuel for fire, it's infinite. The whole concept of harvesting and stocking wood (integral part of original gameplay) is destroyed.\n    [*]Original concept of exploring global map and travelling between distant islands was removed completely. Was replaced by instant-travel, where you just click on a button and next second you arrive to another island without any effort. Food dehydrator and smokehouse became meaningless for gameplay, since there is no feasible scenario  any longer where you need any long-term storage food.\n    [*]Mines with ore, which in the past required crafting pickaxe, now have pre-mined ore just lying in front of them, so you can pick up ore without any effort.\n    [*]Cold temperature at night (required burning campfire), mosquito swamps (required malaria treatment), and many other features from demo were also removed completely.\n[/list]\n\nThis list can go on and on, every single aspect of gameplay was affected. The whole game was remade in a way so that you can successfully \"survive\" without any real effort and without ever being in danger. After all these changes, there is no survival simulator and no original FoY concept left to speak of.\n\nMoreover, all of that fully applies even to hardest modes. While I and other people asked developers to differentiate between difficulty modes so that the game remains similar to demo at least on hardest settings, there was no response, and developers keep introducing sweeping changes across all difficulty modes. Every next patch note comes with row after row \"more resources everywhere, less time to do everything, easier everything, etc.\" They call it \"improving game balance\", but somehow all that balance always goes only one way - by making everything x2, x5, or x10 easier, and discarding all original survival mechanics one by one.\n\nLong story short, in hopes of attracting a wider audience of casual gamers who can't be bothered to actually survive and just constantly beg to make instant-craft, instant-harvest, auto-walk, auto-eat, infinite-resources, and basically instant/auto/infinite everything, developers completely butchered and destroyed their original vision of the project. The demo was brilliant and had a strong potential to become a cult classic survival simulator in its own right, but now all of that is gone.", "timestamp_created": 1684937383, "timestamp_updated": 1686706343, "voted_up": false, "votes_up": 252, "votes_funny": 12, "weighted_vote_score": "0.749505341053009033", "comment_count": 60, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "156106996": {"recommendationid": "156106996", "author": {"steamid": "76561198008170690", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 2115, "playtime_last_two_weeks": 0, "playtime_at_review": 2115, "last_played": 1700928565}, "language": "english", "review": "Great game, would love to see a multiplayer mode.", "timestamp_created": 1705424166, "timestamp_updated": 1705424166, "voted_up": true, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.748224020004272461", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "142675067": {"recommendationid": "142675067", "author": {"steamid": "76561199021297318", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 6921, "playtime_last_two_weeks": 0, "playtime_at_review": 652, "last_played": 1709776916}, "language": "english", "review": "After getting in further and a few updates I had to change my review. Nothing but good things to say about this game, its a little slow to start but if you enjoy survival, crafting and building then you should love this. Even in its early access stage. The game looks great, has a lot of diversity, good controls, an interesting crafting and building system with a great story line that helps you progress your crafting as well. From bare beaches to lush forests, underwater reefs and shipwrecks to islands flowing with lava. Build your boats and start setting up docks at different locations for your fast travel.  Its worth the buy.", "timestamp_created": 1690158305, "timestamp_updated": 1698191276, "voted_up": true, "votes_up": 37, "votes_funny": 4, "weighted_vote_score": "0.747671067714691162", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "150494094": {"recommendationid": "150494094", "author": {"steamid": "76561198088651769", "num_games_owned": 299, "num_reviews": 4, "playtime_forever": 6055, "playtime_last_two_weeks": 0, "playtime_at_review": 4219, "last_played": 1701264687}, "language": "english", "review": "Great Survival. It's difficult but not too difficult, realistic but not too realistic. The story so far is cliche but not bad per se, and the graphics are gorgeous. \n\nOnly problem I can find right now are animals, which is either a skill issue from my part, or an issue with the game still being on development. \n\nFor all those Valheim lovers out there, this is another great \"even as a beta this is better than most AA games\" survival.", "timestamp_created": 1700491975, "timestamp_updated": 1700491975, "voted_up": true, "votes_up": 25, "votes_funny": 0, "weighted_vote_score": "0.727862179279327393", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141083604": {"recommendationid": "141083604", "author": {"steamid": "76561198162073737", "num_games_owned": 0, "num_reviews": 24, "playtime_forever": 536, "playtime_last_two_weeks": 0, "playtime_at_review": 278, "last_played": 1708893405}, "language": "english", "review": "Maybe someday it will be fun.\nAs of now, it's just a grind. And a strange one at that.\nThere's nothing like being on an island surrounded by rocks, and not being able to find any rocks. Except maybe being in a forest of tall trees but not being able to find a stick. Or a log. Or finding a fine looking bucket and being forced to break it down into sticks. Or maybe being on a big island that has no streams running out to the sea.", "timestamp_created": 1688247862, "timestamp_updated": 1688247862, "voted_up": false, "votes_up": 67, "votes_funny": 7, "weighted_vote_score": "0.726736783981323242", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1688287078, "developer_response": "Hey! Be sure to use the mapping feature (it's one of the tutorial quests): the map will show all resources you need inluding water storages, animals and interesting items."}, "137144809": {"recommendationid": "137144809", "author": {"steamid": "76561198021358554", "num_games_owned": 190, "num_reviews": 9, "playtime_forever": 4518, "playtime_last_two_weeks": 0, "playtime_at_review": 1528, "last_played": 1700740778}, "language": "english", "review": "UPDATED: \nI love the game. \nPros:\nThere are goals\nGuidance without hand-holding \nThe story keeps me engaged\nThe building is okay. nothing fancy, but functional and easy to do\nFood and water are easy enough to deal with. (considering I hate food and water stats in all games)\nIts a fairly pretty game\nDifferent biomes, animals, and hazards keep things interesting\nSailing is always a plus\nSwimming also a plus\n(The dev team is very responsive)\n\nCons: \nThe weight system is annoying. I spend more time managing inventory than enjoying the game. (The devs have some some improvements to this since the original review. Its still a bit more managing than I would like, but its a start)\nCombat feels sluggish. \nThe durability system is just horrible. I spend too much time repairing, gathering for repairs, and managing weight so I can repair my gear which is really heavy btw.", "timestamp_created": 1682211713, "timestamp_updated": 1682616088, "voted_up": true, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.72429347038269043", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "137025098": {"recommendationid": "137025098", "author": {"steamid": "76561197970574207", "num_games_owned": 0, "num_reviews": 33, "playtime_forever": 1678, "playtime_last_two_weeks": 0, "playtime_at_review": 1160, "last_played": 1682058149}, "language": "english", "review": "i really wanted to like this game.  it is GORGEOUS, but i can't help but wonder if these guys have ever been out in the woods...EVER?  things that should take 15mins take 2hrs.  the durability of equipment is laughable.  and the respawn rates of materials is horrifically long.  you can't move anything you build on water and there's no indication that you are building something erroneously, so you waste time, materials, and space.\n\nspeaking of space, your storage bins only hold a certain amount of WEIGHT!!!  not slots, WEIGHT.  ON THE GROUND.  IN A BOX.  bar none, the dumbest thing i've ever come across in a survival game.\n\non top of all that, you toon moves so slowly (on such a big island), you'll struggle to make any meaningful progress without a serious time-sink.  all-in-all, until the devs takes a serious look at balancing and speeding the character movement up, i'd pass on this one.  sadly.", "timestamp_created": 1682027447, "timestamp_updated": 1682027447, "voted_up": false, "votes_up": 143, "votes_funny": 8, "weighted_vote_score": "0.722993314266204834", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "139779149": {"recommendationid": "139779149", "author": {"steamid": "76561197972113644", "num_games_owned": 0, "num_reviews": 57, "playtime_forever": 113, "playtime_last_two_weeks": 0, "playtime_at_review": 72, "last_played": 1701617439}, "language": "english", "review": "Interesting game so far. It's pretty tough to stay healthy. Lots of crafting of healing-type items to keep negative effects off. I like the survival difficulty of it.\n\nThe first person perspective, or field of view could use some settings. I'd love a FOV bar to zoom out a little (or third person, even better). Also the POV feels like you are 2 feet tall, or crawling around all the time. This game gives me a little motion sickness because of these things.\n\nOutside of that, this is a heavy inventory management game. Lots of different items, inventory capped by slots and carry weight. So be prepared to make a bunch of containers if you are like me and pick up EVERYTHING. ;) \n\n", "timestamp_created": 1686311736, "timestamp_updated": 1686311736, "voted_up": true, "votes_up": 23, "votes_funny": 1, "weighted_vote_score": "0.719388306140899658", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140478235": {"recommendationid": "140478235", "author": {"steamid": "76561198044341213", "num_games_owned": 524, "num_reviews": 4, "playtime_forever": 36, "playtime_last_two_weeks": 0, "playtime_at_review": 34, "last_played": 1687566734}, "language": "english", "review": "I was extremely excited for the way this game looked and after playing the intro and waking up on the island I was ready to go.\nI went into my \"survival game mode\" went to find a stone and some sticks to make an ax (chose backpack and fishing rod from chest) figured could make tools quick. Got the ax and was like oh yeah it's go time.....Why can't I chop down the trees?.....why can't I smash the rocks to get stone...I mean come on guys this is survival game basics. Who wants to hit a button and turn a tree into logs I want the pleasure of doing it myself it's part of the fun of a survival game gathering resources. I was honestly bothered by it and as clean as the game looks and feels I'm debating refunding since it seems even though this is Early Access this isn't going to change and was developed this way on purpose. Can we also get a real block mechanic? Parrying as a main defense sucks. All that said this game is amazing and honestly I would sit here and play for hours on end like I did with Raft....I just can't play it with these 2 mechanics the way they are it doesn't feel right. Hit button turn tree to logs but it wasted time so it's night now and oh no you're no where near your house...that's annoying.. staying out a little late to gather seeing the sun start to go down as you're swinging away and going oh man gotta get back then trying to rush to safety is exciting. Please take this into serious consideration your game has what it takes to be one of the really good survival games and I want to see it get there. Leaving a recommend...because I believe this game has something special and that it's Devs care about feedback. Prove me right.", "timestamp_created": 1687410310, "timestamp_updated": 1687410310, "voted_up": true, "votes_up": 55, "votes_funny": 6, "weighted_vote_score": "0.708019852638244629", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "137081002": {"recommendationid": "137081002", "author": {"steamid": "76561198095038010", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 46, "playtime_last_two_weeks": 0, "playtime_at_review": 46, "last_played": 1682120304}, "language": "english", "review": "The game was so close to being great but the never ending menus completely ruin the immersion. If you want to cut down a tree it is a menu, harvesting an animal is a menu, picking a flower menu, sleeping menu, eating menu, lighting a fire menu, cooking menu. \n\nI felt like I was playing Survival: DMV/IRS edition.\n\nThe only action that doesn't require a menu is the combat, which I found clunky and unintuitive. \n\nFor these reasons I cannot recommend this game to most people. Unless you are a fan of surviving bureaucracy, then have fun you glorious weirdos.", "timestamp_created": 1682121014, "timestamp_updated": 1682121014, "voted_up": false, "votes_up": 45, "votes_funny": 9, "weighted_vote_score": "0.697608351707458496", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140317695": {"recommendationid": "140317695", "author": {"steamid": "76561199020183300", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 78, "playtime_last_two_weeks": 0, "playtime_at_review": 78, "last_played": 1683619871}, "language": "english", "review": "I refunded this game.  I did not like the way one gathered resources.  Instead of visually chopping trees, rocks, bushes… one is just presented a menu/interface to choose which resource and how much you want to gather and applies a time penalty.  This is just too boring and tedious for me.   I want to chop a tree, pick the leaves, scrape off the bark while hearing the associated sounds, while wielding the corresponding tool.   I didn’t get much further into the game.   Maybe will try again in the future.", "timestamp_created": 1687153180, "timestamp_updated": 1687153180, "voted_up": true, "votes_up": 57, "votes_funny": 6, "weighted_vote_score": "0.680050015449523926", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "136969070": {"recommendationid": "136969070", "author": {"steamid": "76561197970774969", "num_games_owned": 0, "num_reviews": 52, "playtime_forever": 107, "playtime_last_two_weeks": 0, "playtime_at_review": 22, "last_played": 1682692738}, "language": "english", "review": "Well I bought the game because of the funny negative reviews about a badger. I just arrived at the beach, the badger is dead. Long live a new adventure ahead. This game looks cool. Don't let the negative review about a simple badger distract you from buying and supporting this game.", "timestamp_created": 1681928621, "timestamp_updated": 1681928621, "voted_up": true, "votes_up": 34, "votes_funny": 10, "weighted_vote_score": "0.664732158184051514", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "146086779": {"recommendationid": "146086779", "author": {"steamid": "76561198048421359", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 5560, "playtime_last_two_weeks": 0, "playtime_at_review": 4301, "last_played": 1695070840}, "language": "english", "review": "Game is challenging. Reminds me a lot of Green Hell. I Like the the story, time period and locale. No zombies, chainsaws or assault rifles, all a plus for me! I like the health system too. The creatures however....are annoying. Too many snakes, scorpions, and little dogs. The sounds from them are quite bad too. They are hard to track down by surround sound. Once in range of them, they make warning sounds that your close, but I can't seem to 'hear' which direction they are from me, or how close. I haven't watched videos or reviews from other players, It's made it more fun to learn on my own. I've had to start over about 5 times to really get the feel of the game. The UI and controls feel clunky to me, I switch to xbox controller and the game plays much better now.", "timestamp_created": 1694386864, "timestamp_updated": 1694386864, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.664702296257019043", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "136978163": {"recommendationid": "136978163", "author": {"steamid": "76561197992113417", "num_games_owned": 0, "num_reviews": 50, "playtime_forever": 24, "playtime_last_two_weeks": 0, "playtime_at_review": 24, "last_played": 1681941051}, "language": "english", "review": "I was not a fan of the GUI / UX in this game. Everything felt very artificial - e.g. collecting palm leaves by pressing E when staring at the trunk to pop-up a container-like view, selecting the leaves I wanted, and then pressing \"collect\". I didn't feel immersed in the environment at all. I also didn't love the awkwardness of pressing RMB to start throwing a spear, then RMB to put it away, but LMB to actually throw it.\n\nI want to address the badger combat that a few other reviewers have complained about.\nI think the problem with the combat is two-fold.\n\n1. It seems like the player's block is very slow, like pressing RMB has a delayed reaction / the actual block occurs a non-negligible amount of time afterwards. This applies also to the attack.\n2. It didn't seem like the badger had any telegraphing before the attack, so as a player it felt like I was just pressing RMB at an arbitrary moment in time in order to block the attack that would come later.\n\nThe combination of those two factors made the combat feel clunky and non-responsive. That could be addressed by tightening up player animations (make them much more responsive) and making sure enemies have a clear \"pause\" period before their actual attack so that the player can recognize and block at that exact moment.", "timestamp_created": 1681942800, "timestamp_updated": 1681942800, "voted_up": false, "votes_up": 28, "votes_funny": 8, "weighted_vote_score": "0.661726236343383789", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1681998745, "developer_response": "Hey! Thanks for the detailed feedback! We'll be reconsidering the badger combat for sure, with some better hints for the hotfix and more complex reworking in general."}, "155056145": {"recommendationid": "155056145", "author": {"steamid": "76561198068236524", "num_games_owned": 400, "num_reviews": 83, "playtime_forever": 5514, "playtime_last_two_weeks": 0, "playtime_at_review": 3168, "last_played": 1704860330}, "language": "english", "review": "Much more depth to this game than is obvious in the first few hours of play. It's an excellent open world survival game. If you enjoy games (as I do) like The Long Dark, Valheim, No Man's Sky and Subnautica. Then you should have fun playing this game. It has everything you should want apart from pvp, but if you want that then you probably aren't reading this review! Buy it. Explore, hunt, survive and enjoy.", "timestamp_created": 1704200117, "timestamp_updated": 1704200117, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.66046607494354248", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "138217715": {"recommendationid": "138217715", "author": {"steamid": "76561197990154744", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 14798, "playtime_last_two_weeks": 2922, "playtime_at_review": 3976, "last_played": 1713688588}, "language": "english", "review": "You can count the number of SERIOUS survival games on less than one hand - The Long Dark and Green Hell. \n\nThis early access title has the potential to become number three on that list, as long as the developers maintain their focus on day-to-day survival and don't cave to the \"gimme a big yellow dotted line to my next objective\" set.\n\nThere are dozens of survival-lite games on the market, but only a few that make you stop and think about everything you're doing [i]before you do it[/i], as you would in a real survival situation. \n\nKeep up the great work devs.  Make surviving [i]one more day[/i] as difficult as you can.", "timestamp_created": 1683951566, "timestamp_updated": 1683951892, "voted_up": true, "votes_up": 31, "votes_funny": 0, "weighted_vote_score": "0.658125579357147217", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "143618445": {"recommendationid": "143618445", "author": {"steamid": "76561198025148074", "num_games_owned": 0, "num_reviews": 31, "playtime_forever": 3754, "playtime_last_two_weeks": 0, "playtime_at_review": 2715, "last_played": 1692630658}, "language": "english", "review": "If you enjoy PVE survival craft, this is one to check out.\n\nI've recently gotten into survival craft with Subnautica and Satisfactory and the like.  \nThis title fits nicely among those, giving me the challenge to build up from a shipwreck survivor to a comfortable individual exploring the isles.\n\nI think I got this game on a slight discount putting it around 20 bucks.  Even before the most recent update (they added another island to explore and I've not even lost interest in the first expedition), I think double that is an acceptable ask for what is given.\n\nThe PVE is important to me.  Multiplayer may be fun in the future, but the relaxed, yet challenging experience this game offers is why I will happily tell everyone to check this out if they mention an interest in anything close to it.", "timestamp_created": 1691448434, "timestamp_updated": 1691448434, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.657473325729370117", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "137352521": {"recommendationid": "137352521", "author": {"steamid": "76561197994010989", "num_games_owned": 151, "num_reviews": 10, "playtime_forever": 3548, "playtime_last_two_weeks": 0, "playtime_at_review": 1816, "last_played": 1692889237}, "language": "english", "review": "i have played many survival builder games and this one is among the best of them so far. if you liked subnautica, raft, stranded deep or valheim then you should check this one out. there's no shortage of lands to explore, materials to collect and plenty of tasks that provide very meaningful upgrades to keep you engaged as you follow the story. the island settings have a lot of variety to them and each have their own challenges.", "timestamp_created": 1682565244, "timestamp_updated": 1682565244, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.657229781150817871", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "142589493": {"recommendationid": "142589493", "author": {"steamid": "76561198993860628", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 9893, "playtime_last_two_weeks": 0, "playtime_at_review": 3239, "last_played": 1707521466}, "language": "english", "review": "This game has everything a survival addict wants.  I've played The Long Dark, Green Hell, Subnautica, and a whole host of other survival games and this one is among the top 3 in my opinion.  The crafting seems to never end as there are always new recipes that make life better and better.  Even though it is possible to get \"settled\" in you never really feel like everything is fine.  There is always something else you need to make survival easier.  I love that they have the options separated for iron man setting as I always love playing permadeath but it's usually only available on harder setting that you cannot usually set it up separately but in this game you can.  The wildlife is fun and the scenes are breathtaking.  I only with they could add a paint feature to take \"photos\" of the world without the HUD.  I haven't finished the game yet so I don't know if they have implemented this but one thing I would add would be perhaps random things washing up on shore maybe added nets that would catch drifting items or fish that could be checked daily.  Traps would be an awesome addition.", "timestamp_created": 1690039693, "timestamp_updated": 1690039693, "voted_up": true, "votes_up": 24, "votes_funny": 2, "weighted_vote_score": "0.656679987907409668", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141026534": {"recommendationid": "141026534", "author": {"steamid": "76561197961417130", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 269, "playtime_last_two_weeks": 0, "playtime_at_review": 269, "last_played": 1688190088}, "language": "english", "review": "This game is ABSOLUTELY not ready to be played. Right now the resource grind can be best described as \"tuned like FarmVille where it expects you to buy boosts\". Logs turn into split logs, but it's impossible to turn split logs into sticks until a later tier, when legitimately long stocks will be your primary blocker for... ever? I wish when new companies would make new games they would learn from what had come before. The balance here is atrocious, and not letting the players make adjustments to that is wild.\n\nAlso, you should check into how coconuts work, because like... I just think it would be edifying for you. That's not really how coconuts, and their ripeness, works.", "timestamp_created": 1688190217, "timestamp_updated": 1688190217, "voted_up": false, "votes_up": 16, "votes_funny": 2, "weighted_vote_score": "0.655161201953887939", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "150921063": {"recommendationid": "150921063", "author": {"steamid": "76561198067289763", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 5838, "playtime_last_two_weeks": 0, "playtime_at_review": 3946, "last_played": 1711482423}, "language": "english", "review": "Absolutely great survival game. Mechanics are interesting, LOTS of things to do, crafting, leveling, building. Starting island is huge with many many things to do and then, many more islands with different things to keep you busy and entertain. Devs really care, constantly adding new stuff. Minimum bugs and only minor. There is a story to follow (or not, but it's more interesting with it). Graphics are great and enviroments around changing in every island. Absolutely worth the money. One of the best survival games out there, in my opinion.", "timestamp_created": 1700644598, "timestamp_updated": 1700644598, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.65182805061340332", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "139288405": {"recommendationid": "139288405", "author": {"steamid": "76561198055782475", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 9536, "playtime_last_two_weeks": 0, "playtime_at_review": 8642, "last_played": 1691881175}, "language": "english", "review": "I recommend this game to anyone that wants to be wowed with a fantastically immersive, intriguing, highly original content environment, story line, and a sandbox environment letting you progress through the story at your own pace, or just mull around and try not to perish. Following the story line does help you discover new ways to overcome challenges that are much more difficult to overcome in early stages, but as you grow and learn new skills, get new blueprints for better gear, build them, you find you can ease of the intensity without a constant grind. But you will not get there easy, and sometimes you have to be imaginative and creative and think about how to use newly learned recipes in a new place to overcome issues you face in the new place. There are puzzles to solve, items to find, materials you can only find a few times and then those have a limited lifetime, so learning alternatives will help you adapt. Sure, there are some bugs here and there, it is early access at the time I write this, but for the money spent, I already feel I derived a ton of value from the game, with moments of terror, thrill, accomplishment, fun, and awe were worth it! I have no history with the game, did not even get the demo, just came across it a few weeks earlier, tried it out, and then proceeded to spend over a hundred hours playing it, longing for it when I slept, thinking about it while working, just unable to not play when I faced a particular unsolved challenge. I even made up my own goals long after finishing the game, from building, to challenges in making one of every possible thing, like all armor sets, or maxing out food drying skill, figuring out which armor was best in which situations, learning which medicines would heal in the right way and how many I needed on hand when I adventure out, climbing structures I bypassed early game to find treats laying about I would never have found, swimming through underwater rocks, mapping other non-storyline critical areas of a map, and so much more. The last thing, I've been wanting to be on a beach for a long time, and this is the closest way for me to feel like I've really been there. Try it, you won't regret it if you like the things I mentioned above and get a kick out of playing a game solo, no one else is needed for me to really get the best from the game and survive on my own wits and work.", "timestamp_created": 1685485593, "timestamp_updated": 1685485593, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.651569962501525879", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148820870": {"recommendationid": "148820870", "author": {"steamid": "76561197962142640", "num_games_owned": 485, "num_reviews": 9, "playtime_forever": 58, "playtime_last_two_weeks": 0, "playtime_at_review": 58, "last_played": 1698193056}, "language": "english", "review": "I kinda wish there was a \"eh, kinda recommend this game, I guess\" button.\n\nI only played through the tutorial. I like the concept and the atmosphere, but what really keeps me from enjoying this game is the gathering, which is completely unsatisfying. You're not chopping down trees or anything like that, you \"interact\" with the trees and then select what items you want to harvest.\n\nIt's all menu based. If you can get by that, then I think you'll probably enjoy this game.\nI hope that they make the gathering more immersive.", "timestamp_created": 1698193428, "timestamp_updated": 1698193643, "voted_up": false, "votes_up": 29, "votes_funny": 2, "weighted_vote_score": "0.6476859450340271", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "145973561": {"recommendationid": "145973561", "author": {"steamid": "76561198062657990", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 2330, "playtime_last_two_weeks": 0, "playtime_at_review": 2330, "last_played": 1692889620}, "language": "english", "review": "I loved the game mechanics, graphics, story and the ambiance. However, due to its game breaking bugs, I am unable to play any further. Hours of gameplay went down the drain when the save file could not load 80% of the structures that I built. Now, I have floating walls with missing floors.\n\nSave your time and grief and wait for a patch. I guess the game isn't built to save and load huge structures and stuff on all three islands.", "timestamp_created": 1694256780, "timestamp_updated": 1694256780, "voted_up": false, "votes_up": 22, "votes_funny": 5, "weighted_vote_score": "0.645253658294677734", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1694595793, "developer_response": "Hey! Could you please send us your game folder to support@odinsoft.com, so we can check this bug? You game folder is usually located here: C:\\Users\\USERNAME\\AppData\\LocalLow\\Odinsoft\\ Thanks in advance!"}, "137457804": {"recommendationid": "137457804", "author": {"steamid": "76561199122292478", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 45, "playtime_last_two_weeks": 0, "playtime_at_review": 45, "last_played": 1682737137}, "language": "english", "review": "Game is like The Long Dark where you spend energy/time to do anything. And too much menu interface. Not my flavor with survival. If this isn't a problem for you, you'll like it. It does look good. I wanted to like it because I'm a sucker for pirate/Caribbean theme games. But it's a no go for me.", "timestamp_created": 1682737640, "timestamp_updated": 1683155504, "voted_up": false, "votes_up": 42, "votes_funny": 5, "weighted_vote_score": "0.629751265048980713", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "137444907": {"recommendationid": "137444907", "author": {"steamid": "76561198443947892", "num_games_owned": 89, "num_reviews": 4, "playtime_forever": 6069, "playtime_last_two_weeks": 224, "playtime_at_review": 2609, "last_played": 1713382943}, "language": "english", "review": "I did not expect much from fresh Early Access release but the core of the game seems already established and a road map is quite obvious. The game already feels like good competitor to Stranded Deep which is finished and released for quite a time. Here are core points for people wondering about place of Survival: Fountain of Youth in vast space of 'open world craft' games:\n- Story is not forced or mandatory. In the start, your major concern will be survival and first steps in story helps you to figure it out. After that you will be able to afford to indulge your creativeness and build things as you want.\n- Game progress is based on skills/perks and resource/tools/machines. Skills and perks are not simple bonuses to crafting speed and some choices can make your survival a lot easier. But like in a real life, the biggest leaps happen due to exploiting new resources and building new tools. Exploring and hunting is necessary for a lot of critical materials but ability to reveal parts of the map simplifies this process a lot.\n- Renewable sources of materials. Respawn times are quite long but still there is no pressure to hoard things and no existential dread of running out of resources.\n- Several tiers of tools and equipment. Crafting menu is quite extensive and will expand in the future. Crafting complicated stuff have a lot of requirements but some simplifications are made and overall it is quite manageable.\n- A lot of factors to take care of. Sunburn, indigestion, heatstroke, poisoning, flu, fever, injury, light conditions etc. Everything can be solved and even quite easy but it could be a steep learning curve. Some negative reviews are already reflecting that, for example, people having no clue that they are getting injuries due to crafting in the dark.\n- Story and lore are there if you need it. It is not just pure sandbox, there is a proper setting and pieces of the puzzle spread across the islands.\nGraphics is good enough for such extensive game. Music, on other side, is quite good and really gives vibes of 16th century expedition. But don't expect too much as most of the time you will be listening to nature: birds singing, snakes hissing and another animal growling at you.", "timestamp_created": 1682717725, "timestamp_updated": 1682717725, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.62690359354019165", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "136965261": {"recommendationid": "136965261", "author": {"steamid": "76561197971373756", "num_games_owned": 0, "num_reviews": 32, "playtime_forever": 12389, "playtime_last_two_weeks": 0, "playtime_at_review": 180, "last_played": 1711176151}, "language": "english", "review": "A challenging single player survival experience that reminds me of the joy I had playing The Long Dark in sandbox mode. It's hard to find pure survival experiences. The way diseases are implemented on higher difficulties makes choices very meaningful.", "timestamp_created": 1681923215, "timestamp_updated": 1681923215, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.626318573951721191", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "145143395": {"recommendationid": "145143395", "author": {"steamid": "76561198041863115", "num_games_owned": 1349, "num_reviews": 183, "playtime_forever": 1177, "playtime_last_two_weeks": 0, "playtime_at_review": 1144, "last_played": 1699371859}, "language": "english", "review": "[h3]This game is actually already (early access) quite good. At the core it's your ususal (but mostly well made) survival game, starting on an island. But with a clear theme, and a well integrated and reasonably interesting story, that  gives your survival and exploring more of a purpose and direction. But WITHOUT being too pushy or limiting your freedom to explore or doing stuff in your own time or place. [/h3]\n\n It limits (quite smartly) your access to the next big aree but not at all your freedom the one you're in.  This game finds a smart way of balancing story and exploring. Of course it's NOT an story RPG or something. Don't expect that level. \nThere are (early access) multiple future areas not available yet, so it's hard to judge, how it will turn out or works later.\n\n[h3]As for the survival, combat, crafting and the rest: [/h3]\nIt doesn't try anything crazy or new but does a very competent job. It also looks very good! UI, controls, all nothing crazy, but works. And as usual, WAY too grindy in default settings. \nThe medical system is overloaded and annoying in any setting though. \n\n The boat system  is even now something more interesting. Hoping there are more options coming. \nCombat is pretty standard, not amazing or anything special.  There are also multiple difficulty options to adjust the gameplay. But they come in big packages. \nNone of the flexible options other games have (to for example like make combat harder but lower eating and drinking gind... or ease p on the 38medical conditions and treatments.\n\n[h3]It's early access and it's far from finished. But they do one big area at the time and make it work and somewhat polish it.[/h3] So what is in the game works pretty well, you just don't have access to later areas yet. they come in one big patch. \n Since so many people are mentally challenged by understanding the early access warning in the store, this is a good way of doing it. You have a mostly well working game, just not all of it yet. \n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3026664848\n\n[h1]Issues (beyond expected early access ones.[/h1]\n\nThere is still no unstuck function despite people asking for it for months! You can respwn but drop stuff.   In a  place where you can get stuck! So it's too risky to try getting it back.   With a very large open world area and pretty free movement options, there will ALWAYS be places you can get stuck. \n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3026664750\n\n[h1] The biggest issue by far :No proper save system.[/h1]\nThere is no free save system, only ONE save game. So realoading when your stuck...  it is (so far) pure single player, There is no excuse not to give it a flipping save system.  Besides in early access that is just asking for bug trouble. \n\nit does internally multiple saves and you can copy around and back up ( %USERPROFILE%/AppData/LocalLow/Odinsoft/Survival Fountain of Youth )\n\nDon't wait too long after you get stuck or they are all overwritten!\n\n[h3]Little rambly insert on balance and mods:  Mods trying to add more flexibility seem to be actively sabotaged by the devs. During development there is the excuse that mods are a complication for troubleshooting, but if this game doesn't change it's stance on mod support on release, this review will turn negative. There is no one balance that fits all, and this game will not be the first one. [/h3]\n\nAccess to the save system, the decision for punishing or not respawn, the seperate balance of different survival aspects (eating/drinking, the tedious medical \"simulation\", combat, ressource/ship repair grind and so on...\nFrom the (appreciated) forum discussion with devs i get the impression that they have real trouble giving some control and choices to the players.  Also mod support is sucha  MASSIVE factor in the success of a survival game, there is no justifiable reason from anyones perespective to block it.\nAND   In a non competetive and even Single Player game, there is NO excuse to be so contorl freaky over tit.", "timestamp_created": 1693153903, "timestamp_updated": 1700862641, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.616438388824462891", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "137023973": {"recommendationid": "137023973", "author": {"steamid": "76561198032167768", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 50, "playtime_last_two_weeks": 0, "playtime_at_review": 50, "last_played": 1681905657}, "language": "english", "review": "Looks and feels like every other Unity survival game. From the weirdly dough-like textures and meshes, to the menu-heavy harvesting/crafting system.\n\nPick up coconut. Open crafting menu. Click on coconut to craft edible coconut. Exit crafting menu. Open inventory menu. Eat coconut. There is no immersion to be found here.", "timestamp_created": 1682025423, "timestamp_updated": 1682025423, "voted_up": false, "votes_up": 21, "votes_funny": 0, "weighted_vote_score": "0.613655984401702881", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141099348": {"recommendationid": "141099348", "author": {"steamid": "76561198127674970", "num_games_owned": 252, "num_reviews": 16, "playtime_forever": 14, "playtime_last_two_weeks": 0, "playtime_at_review": 14, "last_played": 1682134631}, "language": "english", "review": "Instead of actually chopping or mining you walk up to a tree/rock/etc and press a menu and its just pain. Looks like a good game but from what i saw my friend playing but its just that one feature that really ruins it for me personally. (If there was an option to switch to actual swinging and less menu shit id totally love the game.", "timestamp_created": 1688267206, "timestamp_updated": 1688267206, "voted_up": false, "votes_up": 15, "votes_funny": 3, "weighted_vote_score": "0.612775087356567383", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1688286838, "developer_response": "Hello! Time skipping feature is key for our game, so we're not planning to change it right now. Maybe, in the future."}, "152906058": {"recommendationid": "152906058", "author": {"steamid": "76561197984016318", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 2986, "playtime_last_two_weeks": 0, "playtime_at_review": 2821, "last_played": 1701828184}, "language": "english", "review": "Coming from Green Hell it was a big change, but I love this game in its own way.  This is easily climbing to the top of my lists of best survival I've ever played.", "timestamp_created": 1701749627, "timestamp_updated": 1701749627, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.605415821075439453", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "137136423": {"recommendationid": "137136423", "author": {"steamid": "76561197969870105", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 4577, "playtime_last_two_weeks": 6, "playtime_at_review": 422, "last_played": 1713510876}, "language": "english", "review": "Takes a little while to get used to the mechanics however with a few balance changes and continued development this game has some serious potential. \nReminds me of a mix of green hell , stranded deep and the long dark with a little bit of skyrim (or other 'gain attributes while doing stuff) game.\n\nGraphics are nice and game runs very well at max setting (12700K/3080/32G).\nSome ingredients are a little on the heavy side, i.e. 2 wide leaves to make a bandage and the 'V' perk seems a little OP.\nMost annoying thing for me so far is I'm surrounded by trees but took ages to find one that gives logs or big branches!", "timestamp_created": 1682199624, "timestamp_updated": 1682199624, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.604790389537811279", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "137780326": {"recommendationid": "137780326", "author": {"steamid": "76561198054309757", "num_games_owned": 0, "num_reviews": 57, "playtime_forever": 11406, "playtime_last_two_weeks": 125, "playtime_at_review": 11406, "last_played": 1713529298}, "language": "english", "review": "It's a good ol' fashioned SP survival game with an engaging story (ok, it won't win an Oscar, but it's good), a nice looking game world (e.g. better than ARK 1 but not Unity 5 photo-realistic) and mechanics that are different enough to be fresh and challenging but not so out there you are lost even if you're new to the genre. The game is still in EA and only 2 of 5 regions are currently available but there is already a lot to see and do while the realities of walking/sailing in and around Caribbean islands in the 16th century make the world seem quite large - and biome exploration is a basic requirement if you want to do more than sit on a beach drinking coconut milk and trying to spear a crab for lunch. There is a good amount (over 100?) recipes and techs to learn, upgrading gear, clothes, ships and workbenches as you go as well as 'learn by doing' character development system. First person only may be an issue for some, however, the difficulty settings provide options for hard core masochists as well as casual gamers looking for a less stressful way to die slower (jokes, \"very easy\" mode is just that). Building is solid if not amazing (want to build a polished marble Greek temple? Go play Conan) but Fountain of Youth allows you to build a base that looks and feels like it should for the Robinson Crusoe you essentially play (Having said that, the super-harsh piece collision with terrain and admittedly VERY ordinary camera perspective for building make building anything more than a glorified box a beach a VERY painful experience). The wildlife and resources have been balanced since the demo released and the whole package is now just a blast and one where you are (thankfully) never really super resource rich and secure as things take a sensible amount of time to regrow/respawn. In terms of hardware, I have an intel i7 8700 with a GTX 1080Ti and the game runs silky smooth for me and I've had zero freezes, CTDs, save game problems or any other issues at all that I can think of. The devs are engaged in the Steam forum and more updates are planned in the months (July?) ahead. I've finished the story such as it is to date, been to all the islands and key locations (that I know of), built most everything there is to build, stocked up on a relatively comfortable amount of resource in my base (again, not enough to feel really relaxed about things) and it has taken me about 60+ hours (I really didn't rush through though) - I will almost certainly stretch that as playing it as a sand box is very possible. Multiple save slots also means I will be starting again shortly with new settings and base location.\n\nWould I recommend as is, even in EA? Hell yes. \nWould I buy it again knowing what I know now? Hell yes. \nIs it good value for money? No - it's GREAT value for money.", "timestamp_created": 1683210521, "timestamp_updated": 1713529550, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.603855133056640625", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "143620239": {"recommendationid": "143620239", "author": {"steamid": "76561198032866970", "num_games_owned": 0, "num_reviews": 21, "playtime_forever": 6901, "playtime_last_two_weeks": 2845, "playtime_at_review": 1219, "last_played": 1713720677}, "language": "english", "review": "Pros:\n\nThis is the most in depth and concise survival sandbox game I've played to date.  I love the customization and in-depth building tools and instructions to go with it.  The fights feel smooth and every move you make is important.  Fighting techniques with timed reaction spells success or defeat in every confrontation in the game.  I've only been on 20 hours and I can't put this game down.  I can tell the devs put a lot of thought and love into this game.  I hope to continue to see that type of attention and dedication towards the future.  All the way from the Short eared dog to the fearsome Warthog, everything you do matters.  Fights are certainly not face-forward-keyboard smash, like many other titles.\n\nI apparently joined into this game at the perfect time, three days before a major patch and content update!\n\nCons:\n\nI would like highlight a suggested QoL customization - Players should be allowed to play on normal difficulty but to customize the number of times they can die.  To mix and match things, etcetera.  Simply put, more customization options at launch of your current campaign should be available.\n\nSuggested changes for deaths:\n\nHardcore - No deaths.\nSoftcore - 12-20 deaths.\nExplorer - Unlimited deaths.\n\nI want harder monsters but it feels too punishing to lose everything if you die more than six times.  I can't imagine playing the game and I could be in over a week and not being able to progress any more because I get too curious one day and lose everything.\n\nKeep up the good work team!  Lets keep seeing more awesome ideas come out!", "timestamp_created": 1691450800, "timestamp_updated": 1691450800, "voted_up": true, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.602110028266906738", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141171152": {"recommendationid": "141171152", "author": {"steamid": "76561198030737359", "num_games_owned": 0, "num_reviews": 30, "playtime_forever": 34, "playtime_last_two_weeks": 0, "playtime_at_review": 34, "last_played": 1688333142}, "language": "english", "review": "This is another case where I wish steam had something besides recommend/not recommend as options for reviews. \n\nI fully understand that the game is in early access, and expected the issues that can come along with that. I did experience several crashes right after the intro and had to turn all of my graphic settings down to low to even get past it. \n\nThe game looks great, graphically and I was getting good frames after figuring out how to get through the crash-at-intro issue.\n\nMy issue with the game though is one of the most basic, core elements of any survival game - gathering resources. In every other survival game I've ever played, you actively chop wood, gather stones, mine iron, etc. But here, if you want to gather wood for instance, you just press E on a tree, choose how many sticks you want to gather, it tells you how much that will degrade your tool, then you press G to confirm, and it's done instantly. \n\nThis also means that you don't really interact with any of your tools, other than weapons. You just craft an axe/cutting tool/pick and it sits in your inventory giving you the ability to use the gather GUI for that resource. \n\nNow, on some settings, even though the gather action is instant to the player, it will take in-game time. On the basic settings, it is just instant. This just feels to me like a cheap system all around. \n\nI will probably come back and give this game another shot after it progresses a little further, but it just feels a little underbaked at the moment for me.\n \n\nEdit after developer comment: I really don't understand that logic at all. Actively/interactively  gathering resources (Green Hell, Grounded, Subnautica, Icarus, etc.) also burns time, energy, hunger & tool durability. This method just kind of seems like a way of doing it that doesn't involve creating animations, lol.\n\nIt's fine to make that design decision, but that logic being the reason just doesn't track.", "timestamp_created": 1688336247, "timestamp_updated": 1688611199, "voted_up": false, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.59985119104385376", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1688540765, "developer_response": "Hey! Thanks for your review! As you correctly mentioned, the menu for processes not only allows you to chop wood/gather stones, it also shows the time, and how much your tool will degrade. This is very important. We wanted to make a challenging and not a casual game, in which carefully planning your actions and micromanaging everything would be crucial to surviving as it would be in real life. The Long Dark has the similar system. \nOf course, we continue optimizing and improving the game, so hopefully you'll give it one more try in the future!"}, "154687207": {"recommendationid": "154687207", "author": {"steamid": "76561199046604897", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 3523, "playtime_last_two_weeks": 0, "playtime_at_review": 3419, "last_played": 1704235196}, "language": "english", "review": "Absolutely love this game. If you are a fan of survival games then this is definitely a game to check out.", "timestamp_created": 1703826088, "timestamp_updated": 1703826088, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.599776148796081543", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "154089644": {"recommendationid": "154089644", "author": {"steamid": "76561198006362126", "num_games_owned": 510, "num_reviews": 16, "playtime_forever": 64, "playtime_last_two_weeks": 0, "playtime_at_review": 64, "last_played": 1703071477}, "language": "english", "review": "I think I'll edit my review after receiving actually constructive feedback from a developer.  That which seemed like hostility towards user difficulty mods very probably isn't.  Under that light I'll say that this game likely shows a lot of promise in the future.  Right now it's a bit prohibitively difficult in how much realism it tries to portray, but in the future may offer the user more options to customize this.  Keep an eye on it for updates.\n\nCertainly all the right elements are there for this game to be potentially tons of fun for just about any fan of survival+building games in the future.  Right now all the basics are there, but difficulty is a bit rough.  Firstly, the timescale positively blows through the day at an insane rate.  Just gathering leaves can take 20 minutes even though it's just simulating you literally just walking up to a tree and pulling a few large leaves off.  Not a large backpack full of leaves.  3 or 6.  Creating a campfire with rocks consists of taking a few rocks and sticks out of your backpack and arranging them in a circle.  This takes an hour and 7 minutes for some reason...  I think our character must have serious OCD where the rocks must be arranged perfectly, only the leaves with exactly zero blemishes will do, etc or something because otherwise I simply can't see why it takes so long to do these things...  \n\nUnfortunately this is paired with a hunger and thirst meter that go down all too fast as time passes which is too hard to even get up very much upon actually eating things.  I don't really understand how these people in actual emergency situations struggle so much to handle hunger and thirst really.  Humans can live more than a week without food in an absolute emergency and go several days without water.  Of course this would be bad and probably after something like three days without food or two days without water you'd struggle to be able to hunt or etc effectively so I'll accept that, but you can start struggling even before the first day has ended even though you even eat and drink a tiny bit right at the start as part of the tutorial.  (Ok it's not much, but it still should help more than it does.)\n\nBut the thing that made me decide I just didn't even want to deal with this one right now in its current state is degradation is so extreme that many things like the clothes on your back or your backpack just degrade over time automatically.  Not just tools (I already hate that as a thing) but the stuff you have to rely on even just to walk around and do basic things.  Without a backpack you can barely carry anything and without clothes you get sunburn insanely fast and start suffering negative status effects.  At first I had to spend all my time rushing between shade and even then still got a low level sunburn.  It looks like you can repair stuff, but of course you need the proper materials which just adds to the grind loop all the more.\n\nUnfortunately Steam only gives us two hours in which we can try to evaluate a game (I really feel like it should be more for these types of games where even a light player will hit 200 hours easy) so I couldn't really evaluate any building stuff.  What I can say is that I was fighting so much just to keep sufficient food and water levels with my health so low (while hostile creatures hissed at me any time I approached anything -- I had a spear by then but with low HP due to all the sunburn, starvation, etc etc I didn't dare tackle them -- especially with only one) I just never made any progress towards even beginning to build during the time I dared.  I was hoping to build a workbench, but even that was a struggle and I was dying of starvation and struggling to get enough food in time to not die when I decided I just didn't have enough time to really evaluate any further.  Unfortunately the food thing is quite an issue because apparently several crabs aren't enough for even part of one meal.  (Someone tell that to a lot of restaurants making a lot of money off of that!)  It looked impressive what the game advertises that you can do in this regard, but now I worry that structures may degrade too...", "timestamp_created": 1703197236, "timestamp_updated": 1703402375, "voted_up": false, "votes_up": 85, "votes_funny": 7, "weighted_vote_score": "0.598939061164855957", "comment_count": 16, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1703241720, "developer_response": "Hello! Thanks for sharing your thoughts! We were aiming for a challenging experience with this game. Nevertheless, we're already working (please, keep in mind that the game is still in active Early Access stage) on the system of custom settings, which will include all the points you mentioned (degrading of things, how fast the time flies, food/water stats). Most probably, it will be implemented with the full release in 2024. As for Bepinex, we've made no specific actions to block it. But again, the game is still being actively developed, so it could have been done unintentionally. As you said, we have no reason to specifically block it since the game is single-player only. On the contrary, we intend to fully support mods creation for our game."}, "146148867": {"recommendationid": "146148867", "author": {"steamid": "76561198010386277", "num_games_owned": 0, "num_reviews": 59, "playtime_forever": 1037, "playtime_last_two_weeks": 0, "playtime_at_review": 1037, "last_played": 1694486223}, "language": "english", "review": "There are many games out here, that call themselves \"survival\" games.\nBut This, and Green Hell are the two ive seen that truly deserve the name. \n\nEven after 70 days in game, taking my time and surviving rather than just rushing forward with the story, survival still isnt assured.\nit brings with it a gameplay loop that follows Mazlowe's heirarchy of needs.\nWater, Food, Shelter, repeat.\nyou may have a shelter, but there is no refrigeration here. Preserving food with salt and smoke is time consuming as well, better for making meals to use on a long journey or emergency. I often find myself spending two ingame days collecting food and water, for those few days where i can spend the whole day crafting or reading a skill book. \nIve found that the Civilization \"one more turn\" feeling, hits me in this game as \"one more day\". just like in Green Hell, i find myself hoping to spend a day, and ending up with a weeks worth of preperation, meticulously checking off a mental list of everything i may need for an expedition, be it across the island or to another island entirely. and while you may have a map, youll find yourself memorizing the landscape if you spend enough time. only to forget if you put the game down for extended periods. The hand crafted environments both confounding the unfamiliar eye, and comforting the native. eventually recognizing landmarks like \"oh theres that rock/tree, i turn left here.\"\nThe struggle to find water in the mid game is real, as you realize your coconut sources have gone dry and the rain, unreliable as they are, have not come. \n\ni absolutely recommend this game to Survival lovers", "timestamp_created": 1694486781, "timestamp_updated": 1694486781, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.593094944953918457", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "149438455": {"recommendationid": "149438455", "author": {"steamid": "76561198032426402", "num_games_owned": 0, "num_reviews": 49, "playtime_forever": 3684, "playtime_last_two_weeks": 0, "playtime_at_review": 887, "last_played": 1704795894}, "language": "english", "review": "Negatives first - (1) The dogs are the most annoying creature of any game i have played. For some reason you can't always see them but oh yes you can hear them ...but you can't use left/right speakers to find them. It's just so frustrating. At least let the concentration skill highlight enemies.. i don't care about the 1000s of overlapping footprints.... Or just highlight a noise or foliage rustling.\n\n(2) Please can we have a system where you can use items stored in nearby boxes?? It gets frustrating going in and out of boxes to get a hammer, now a saw, now an axe, now a narrow leaf  oops i need a wide leaf, uh oh need a twig etc etc  after a few hours of playing it gets old quickly. \n\n(3) Jumping - You feel like a feather, it's weird. You can't jump up small ridges but can lash ropes to huge trees and build complicated things??? I nearly refunded early when I was on a mountain trail and decided to look over the edge because there seemed to be a hidden path - Even when standing still you seem to slip ...I went over a tiny ledge but couldn't jump back up. Even more ragey is the fact you bounce off the tiny ledge and almost float off the mountain to your death ( I pride myself in zero deaths in these kind of games). Anyway please change the way you jump and land - there's too much skidding and bouncing, making  combat near impossible. \n\nBuy it if you like an open world challenge. You're more or less allowed to play how you want. It's a really great set of islands so far (still getting regular updates too!)\n\nWhat's different from Green Hell? - When you do any action it costs you time ( you don't see the animation of cutting/making something) - So say it's morning and you decide to make some clothes, you might press the button to do the jobs 5 times and suddenly it's nighttime because each job took 1.5 hours. When it's dark you have a chance to injure yourself when doing a job (unless you have a light on) so plan ahead!\n\nIn game bugs - Your equipment sometimes doesn't repair properly and you waste time repairing it only for it to say 'no equipment' durability 1/50 etc. Dogs/Boars seem buggy when they disappear from sight but suddenly jump out from within the floor to hit you.\n\n\nI know this is weird review, I didnt feel like writing what others have explained. Overall it is a great game and is different to other open world games .\n\nEdit - COMBAT - perhaps it's obvious but for anyone on the fence about buying/refunding because of the feel of combat, try to notice that when you HOLD attack it SLOWS time for a split second so you can aim and get a BLOCKING hit. For hours I felt frustration at the way I was taking hits from animals who could change direction on a whim and fly towards me, then I discovered the hold attack tactic. So ...much....better now!", "timestamp_created": 1699016429, "timestamp_updated": 1701348550, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.589969396591186523", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "136952330": {"recommendationid": "136952330", "author": {"steamid": "76561198026527375", "num_games_owned": 261, "num_reviews": 45, "playtime_forever": 1118, "playtime_last_two_weeks": 0, "playtime_at_review": 7, "last_played": 1700645465}, "language": "english", "review": "A wonderful survival game with a unique and interesting story and setting. Features a wide array of beautiful (and terrifying) animals and other creatures. This review is based on the demo which I played and enjoyed extensively!\n\nUpdate:\nBeyond my expectations, despite some performance issues which I hope will be ironed out sooner rather than later.", "timestamp_created": 1681903942, "timestamp_updated": 1682009843, "voted_up": true, "votes_up": 17, "votes_funny": 3, "weighted_vote_score": "0.589397907257080078", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "138543154": {"recommendationid": "138543154", "author": {"steamid": "76561199154387519", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 3266, "playtime_last_two_weeks": 26, "playtime_at_review": 2673, "last_played": 1712674396}, "language": "english", "review": "Pretty good game. Excited to see the updates.", "timestamp_created": 1684498247, "timestamp_updated": 1694044738, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.586362481117248535", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1684513251, "developer_response": "Hey! The animals respawn issue will be addressed in the upcoming patch, it's already being tested."}, "151884257": {"recommendationid": "151884257", "author": {"steamid": "76561198083435290", "num_games_owned": 107, "num_reviews": 21, "playtime_forever": 6314, "playtime_last_two_weeks": 0, "playtime_at_review": 5299, "last_played": 1702413440}, "language": "english", "review": "I played this when it first released, and it was rock-solid back then, even on the hardest permadeath difficulty, which I started out on. It's only gotten better. I encountered no bugs, my feedback was responded to by the developers, and there's a unique richness to the various mechanics of the game that feels like a breath of fresh air, and offers revitalization to the sometimes over-saturated and tired Survival Crafting genre. It's not like other games, I promise. It's vastly different, and a it's wonderful top-tier survival crafting game. If you like games such as: The Long Dark, 7 Days to Die, Raft, Valheim, Stranded Deep, Green Hell, The Infected, etc, then this game is definitely up your alley.", "timestamp_created": 1700937987, "timestamp_updated": 1700937987, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.583333313465118408", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "143656095": {"recommendationid": "143656095", "author": {"steamid": "76561199296585303", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 23, "playtime_last_two_weeks": 0, "playtime_at_review": 23, "last_played": 1691504537}, "language": "english", "review": "How do you fuck up a game based around the fountain of youth and conquistadors? It's a survival game where you cant actually chop down trees and experience huge fps drops around certain resources. It's like if Ark and the Raft had an autistic child. Stranded deep has far superior graphics along with green hell as well and even the forest. The developers think we want to destroy trees using a stupid menu that fasts forward an hour every time we build a stone ax. Like wtf man, I just wanna play the game not go through menus half the time. I am returning this. I'd rather eat out Dianne Fienstein than play this shit.", "timestamp_created": 1691504935, "timestamp_updated": 1691504935, "voted_up": false, "votes_up": 33, "votes_funny": 35, "weighted_vote_score": "0.581299245357513428", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141589715": {"recommendationid": "141589715", "author": {"steamid": "76561197995448080", "num_games_owned": 1163, "num_reviews": 32, "playtime_forever": 22, "playtime_last_two_weeks": 0, "playtime_at_review": 22, "last_played": 1688811430}, "language": "english", "review": "No field of view options. \n\nAlso has weird, slow field of view changes for sprinting and other interactions. \n\nRefunded, will probably give it another go if they ever add FoV options.", "timestamp_created": 1688811591, "timestamp_updated": 1688811591, "voted_up": false, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.577942430973052979", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "137393047": {"recommendationid": "137393047", "author": {"steamid": "76561198050484584", "num_games_owned": 56, "num_reviews": 1, "playtime_forever": 1090, "playtime_last_two_weeks": 0, "playtime_at_review": 1090, "last_played": 1682633133}, "language": "english", "review": "This game is the pinnacle of the survival genre for me at this point. I have enjoyed many survival games in the past, but none have gripped me so hard with their gameplay before.\n\nThe map is unique, filled with secrets, but not to the point that you are annoyed by their quantity.\n\nThe story is simple to follow, yet beautiful and surprising, so you are often left wondering what you will uncover while preparing for the next journey ahead.\n\nThe crafting system is vast, but I never felt overwhelmed. New items were always only introduced once they seemed within reach.\n\nI guess what I am trying to say is this game has struck a perfect balance in many ways for me personally. I was always eager to try out new crafting recipes, prepare for the next adventure, or stock up on much needed items. Things always seemed possible, and I was never too bothered by anything. I always wanted to play more. For me, many games today just start being a headache after a certain point, too much to manage, too much to explore, and too much story, so I rarely finish an experience. This game felt like a book that I could not wait to turn the page in, and learn more. I finished what is in store for now and I can not wait to get more from the devs.\n\nImprovements I wish could be made:\n- Make turtle shells spawn from every turtle, I have killed like 7, and even though I can see it right there on it, I can never harvest it. Maybe you could make it so that if you unalive the turtle in a specific way ( ie. hitting it only in the head) the shell is always there, otherwise it gets damaged and is unusable.\n- I have never found horseweed, and I swam around huge rocks for 2 hours straight looking for it. Overall I think the marine biome needs a little bit more work, but I trust that you are on it.\n- Allow me to slow time while aiming, at least if you are intending to keep animal movement so fast and clunky. Especially against larger predators in caves, it never made sense to use ranged weapons, and I would just resort to melee and heals, which felt like a shame. Maybe you can add a focus meter and make it be used up with (v) as well as this. Also because spamming (v) is an exploit at night and in caves.", "timestamp_created": 1682635620, "timestamp_updated": 1682635620, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.577825427055358887", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "136977160": {"recommendationid": "136977160", "author": {"steamid": "76561198007917907", "num_games_owned": 340, "num_reviews": 18, "playtime_forever": 315, "playtime_last_two_weeks": 0, "playtime_at_review": 315, "last_played": 1681939959}, "language": "english", "review": "Ive played quite a few survival crafters and feel i have a good base line to compare to.\n\nThus far, this one needs some work. \n\nThe harvesting is quite bland with no animations, just a pop up screen.\nThe crafting UI is pretty terrible and un-intuitive.\nThe durability on items is ridiculously low, almost 1 shot use.\nThe progression of crafting tech doesnt seem particularly streamlined.\nItem quantity requirements feel really high in comparison to low harvested items. \nMap shows icons where \"resources\" are - loses a bit of immersion.\nResources have recharge times listed meaning static spawns which is just meh.\n\nI was hoping for a mix of green hell / icarus but at the moment this game is way off. Great concept just not particularly well implemented.\n\nEverything seems laborious, from killing to crafting to harvesting - and not in a fun way.\nGeneral gameplay wise, it got boring quite quickly - plugged away to try and do more but its just...dull.\n\nWorst part: You cant harvest whilst being hunted by an animal. (The hunted animal was a snake 10 metres away just looking at me....just meh)\n\n4 hours on record otherwise i would request a refund. \n\nMay try it again in the future once some work has been done.", "timestamp_created": 1681940942, "timestamp_updated": 1681940942, "voted_up": false, "votes_up": 22, "votes_funny": 2, "weighted_vote_score": "0.575465619564056396", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1681999017, "developer_response": "Hey! It's a pity the experience wasn't enjoyable for you, but thanks for the feedback anyway! We are now carefully gathering all ideas and suggestions, and hopefully, the game will be becoming better and better with further updates."}, "143696364": {"recommendationid": "143696364", "author": {"steamid": "76561199141544278", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 188, "playtime_last_two_weeks": 0, "playtime_at_review": 188, "last_played": 1691555697}, "language": "english", "review": "the survival aspect is to tedious and actually makes it very boring", "timestamp_created": 1691555949, "timestamp_updated": 1691555949, "voted_up": false, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.574628353118896484", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "143674212": {"recommendationid": "143674212", "author": {"steamid": "76561198116122756", "num_games_owned": 669, "num_reviews": 39, "playtime_forever": 468, "playtime_last_two_weeks": 0, "playtime_at_review": 145, "last_played": 1711147581}, "language": "english", "review": "[h1]A breath of fresh air within the survival genre.[/h1] \n\nUnfortunately I cannot write a full review on this game because I have only played a measly two hours at the time of writing this review, but from what I've experienced this game has massive potential to be something great.\n\nAfter playing most of the big survival titles there is available on Steam, it was nice to run into yet another potentially great survival game. I say 'potentially great' because this game lacks in several departments. That being: A rather poor combat system mainly bogged down by sluggish animation, [b]horrible[/b] optimization, a lack of interactive harvesting and crafting that's done through a separate window. This has to be the 2nd worst thing besides the piss poor performance. Aside from that I really do enjoy the theme and time period this game takes place in. I've yet to see any survival game take place within this period of time. Also, there's a story and objectives which is a big plus in my opinion. I've personally become rather tired of survival games that don't include any kind of meaningful objective to keep me playing.\n\nHere's a rundown of my specs just so you can get an idea of how bad this game is optimized: \nRTX 3060 (12 gb vram) \nRyzen 5700x \n16gbs of DDR4 ram\n\nI understand that this game is in early access. I just figured I'd mention this as a caution for future buyers.\nOddly enough, as far as I can tell, I've heard no word from the developers regarding performance fixes. I hope they don't plan on optimizing the game after 1.0 as that would be tragic for someone like me who'd love nothing more than to play this in its early access state.", "timestamp_created": 1691523678, "timestamp_updated": 1695732151, "voted_up": false, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.574546575546264648", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "136973312": {"recommendationid": "136973312", "author": {"steamid": "76561197964471157", "num_games_owned": 1167, "num_reviews": 302, "playtime_forever": 246, "playtime_last_two_weeks": 0, "playtime_at_review": 216, "last_played": 1681934926}, "language": "english", "review": "One of the scariest games I've every played, made me realize what soyboy I really am. Screaming with the balcony open most have scared my neighbors as well. Spiders, Scorpions and Snakes, wow! Spooky.\n\nOther then that, solid game more akin to The Long Dark then other survival games, works well feel like time has value. The map is a bit dull that's my only big complaint.\n\nGot it for free because i asked for it.", "timestamp_created": 1681934875, "timestamp_updated": 1681934875, "voted_up": true, "votes_up": 14, "votes_funny": 3, "weighted_vote_score": "0.572921276092529297", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "142885029": {"recommendationid": "142885029", "author": {"steamid": "76561198167283461", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 20363, "playtime_last_two_weeks": 0, "playtime_at_review": 10547, "last_played": 1703196262}, "language": "english", "review": "     Прежде всего хочу заметить, что разработчикам предстоит долгий путь, чтобы эту игру можно было по праву ставить в один ряд с тем же THE LONG DARK, но уже сейчас игра вполне приятная и радует картинкой и некоторыми механиками. \n      На момент написания обзора мною наиграно 175 часов. Игра затягивает, но есть кое-какие  моменты, которые необходимо отметить. Буду говорить только об уровне сложности \"очень сложно\". \n       Во-первых, ни о какой \"хардкорности\" речи здесь не идёт. Игра слишком простая. Окружающая среда изобилует пищей и водой, а крафт позволяет в течение получаса реального времени забыть о первичных потребностях, что сводит всю вашу игровую деятельность к крафту постоянно ломающихся инструментов, которые нужны, чтобы крафтить постоянно ломающиеся инструменты, и какие-то ненужные вещи, которые, за небольшим исключением,  почти не влияют на игровой процесс. \n       Во-вторых, механика \"останавливающего удара\". Она позволяет почти сходу, скрафтив каменное копье,  безопасно убивать любое животное в игре на данный момент, что сводит на нет необходимость развиваться, и никакой радости крафт брони или лучшего оружия не приносит.  \n       В-третьих, время в игре. Время идёт очень быстро, и тот же респ кабанов раз в семь дней, на деле превращается в постоянные, рутинные  забеги за кожами с телегой. Теряется ценность ресурса. Любой ресурс, кроме меди и обсидиана в изобилии. \n      В-четвертых, охота и животные в игре. Из за плотности животных на острове, которые почти все агрессивны и респаются достаточно быстро, игра больше похожа не на выживач, а на экшн. Отсюда переизбыток ресурсов, трофеи не приносят радости. Некоторые моменты, например птицы, летающие с торчащими из них копьями, вообще удивляют. Или свиньи, которые перед тем как убежать смотрят вам в глаза несколько секунд;-). Вообще звери на островах невероятно умны, и стоит вам только начать натягивать тетиву, тут же бегут. Но это всё меркнет, когда, немного прокачав атлетику, вы будете догонять  свиней и убивать их голыми руками. Я понимаю, что сравнивать эту игру и RDR2 нельзя, но хотя бы поведение животных и принцип качества шкур пригодных для крафта оттуда взять можно. \n      В-пятых, навыки, умения и их прокачка. В игре реализовано \"ведьмачье чутье\", которое позволяет упростить и так очень простую игру. А еще есть картография, которая скажет вам, когда обновится тот или иной зверь или ресурс, а добавив ко всему этому тревожную музыку, когда вас замечает хищник, мы получаем всё что угодно, но не \"хардкорный выживач\".  Сама прокачка навыков в зависимости от времени готовки или дальности точного выстрела оставляет вопросы. Например за приготовленную лисицу вы получаете почти столько же очков опыта, что за грибной суп, но лисиц вокруг тьма, а грибы - редкость, и приготовить суп в разы трудней. Ну и устраивать тир по змеям, чтобы быстрее прокачать стрельбу, стреляя в них с соседнего холма, быстро надоедает. Благо сами навыки особо ни на что не влияют и 5-6 уровня вполне хватает, чтобы комфортно играть. Возможно как-то помогла бы привязка уровня прокачки навыка кулинарии к доступности блюд, а охотничьих умений к доступности оружия. Вариантов здесь очень много. \nТак же плавание. При прокачке навыка до 5-6 и прочтенной книжке, персонах плывёт под водой как подводная лодка. Прогресс настолько стремителен, что не приносит удовлетворения. Или навык \"ремонт\". Ремонт многих предметов вообще вреден чисто экономически и требует пересмотра или рецептов крафта или ресурсов для ремонта. \n     И последнее - это реиграбельность. На данный момент ее просто нет. Помимо того, что все предметы и ресурсы находятся строго на своих местах, сами острова достаточно невелики, и строить базы вы будете скорее всего в тех же местах. \n     Что понравилось в игре ,так это змеи и шакалы. Змеи держат в напряжении первое время, а момент, когда вы крадетесь в кустах и натыкаетесь на змею - просто бомба. Как говорится: \" Видели бы вы мои брюки сзади\".  Или шакалы, которые видят вас, но их самих плохо видно в траве и если бы не музыка, могло быть очень интересно. Опять же всё портит \"ведьмачье чутье\". \n     Ценителям жанра я бы рекомендовал для начала выкручивать яркость на минимум, чтобы хоть какая то нужда в факеле ночью была, не брать умения \"ведьмачьего чутья\", ибо игра становится много проще, и ждать пересмотра рецептов-навыков-умений. Но играть всем советую. Мало толковых игр в этом жанре, а у этой есть неплохие шансы ей стать. \n      В общем, ценителям жанра стоит играть. Игра может стать отличной, но работы у команды разработчиков еще очень много.\n", "timestamp_created": 1690450219, "timestamp_updated": 1690450219, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.571045637130737305", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "143618928": {"recommendationid": "143618928", "author": {"steamid": "76561197976660288", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 3630, "playtime_last_two_weeks": 0, "playtime_at_review": 2988, "last_played": 1691661470}, "language": "english", "review": "I love a good crafting survival game, and this one has proven to be one of my favorites of all time. It's beautiful and well-balanced. It's also a good example of early-access done well - I can't wait for the next update.", "timestamp_created": 1691449065, "timestamp_updated": 1691449065, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.570474088191986084", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141443806": {"recommendationid": "141443806", "author": {"steamid": "76561197993475108", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 123, "playtime_last_two_weeks": 0, "playtime_at_review": 97, "last_played": 1691516209}, "language": "english", "review": "The game is really fun. Some fresh and interesting ideas on survival games.\n\nIt still needs a lot of balancing and refinement, tools have no durability, in the first few days you spend half the time just gathering resources to replace the tools you use to gather resources. Voice acting is a bit shoddy. Some resources are way too scarce.\n\nIn the end, it is really fun, even in the state it is in now, and that is what matters most I guess.\n\nReally looking forward to the new areas and content.", "timestamp_created": 1688647088, "timestamp_updated": 1688647088, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.569517135620117188", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141864218": {"recommendationid": "141864218", "author": {"steamid": "76561197978062856", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 17004, "playtime_last_two_weeks": 1, "playtime_at_review": 9090, "last_played": 1713302583}, "language": "english", "review": "This is a great game, even in its current state, July 2023. As it stands, the main starter area is done as well as one additional island group, with another slated for next month and two more to follow. The developers have been adding these areas as they approach full release on schedule, with added patching and bug fixing between the area additions. Even at it's current state, it's quite balanced in gameplay and difficulty, with additional difficulties for a challenge if you prefer that option, including a hardcore death mode. It's reminiscent of a combination of The Long Dark, with a more first person perspective similar to The Forest. It is single player, but don't let that dissuade you from a very good game that looks to be a keeper even now, and with additional areas before the full release, should be a mainstay in the survival genre.\n\nThis isn't a shooter, nor a co-op game and the struggle you will face to survive long term is real and an integrated part of the gameplay. You have to carefully manage food, drink, rest, and multiple health conditions, even as you attempt to gather resources for a foothold, and many upgrades of things along the way. But the story here also pushes you to advance and not get stagnant, with rewards for things along the way as well as points to spend to customize your character a bit. The maps are static, but quite large and as a guess should provide 80+ if not 100+ hours of game time by the full release.\n\nI've played through to the temporary finish point on normal and about at the same point  on hard mode (with an additional challenge mode after that should I want to play it.) The additional challenge is welcome and puts this game very close to the feeling of The Long Dark where you have many times during gameplay where you wonder if you'll make it, if you'll loose a precious life (called fainting here,) or if on hardcore death setting, if you'll end your game. This game requires a bit of strategy, a lot of preparation and some luck along the way to survive. As someone that loves survival games, I appreciate that planning, upgrading and building are rewarded during gameplay, and while luck is there, you can fight it with better planning and gear. \n\nThe graphics are good, utilizing the Unity engine they appear to have gone for a feel somewhere between painted as in The Long Dark and realistic, similar to The Forest. If you've played Green Hell, its a similar look and feel. There are multiple dark areas in the game as well as some stormy/rainy nights that can be VERY dark. Weather is handled well in the graphics engine and is also an integrated part of the gameplay, requiring rain for water collection, overcast days for better fishing, sunny days for better visibility to do mapping, etc.\n\nThe sounds are good, with a decent undertone of music, which changes as you approach danger, etc. There are also unique sounds to most of the wildlife in game, providing a way to hear when they are near, as well as which direction they may be in, even if you cannot see them yet. \n\nThe game loop slowly changes over time from basic survival, branching out to gaining a foothold with an encampment, and growing to sailing, traveling to new areas, creating small outposts to help process things you find there, and so on. Boating in this game is rather simplified, but allows fast travel once you do some initial exploration. The vast majority of this game is on foot, which highlights both the early time period of its setting as well as making it feel like more of a challenge for survival.\n\nI'm still having a blast at 150 hours in on harder gameplay modes and I think that bodes well for the full release. If you are a survival game lover, go all in now at the early access price, I don't think you'll be disappointed.", "timestamp_created": 1689113607, "timestamp_updated": 1689113607, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.568658173084259033", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "137792123": {"recommendationid": "137792123", "author": {"steamid": "76561198024038137", "num_games_owned": 289, "num_reviews": 11, "playtime_forever": 4829, "playtime_last_two_weeks": 0, "playtime_at_review": 1499, "last_played": 1701287724}, "language": "english", "review": "another great indie survival. enjoying this alot. time management while crafting, cooking and gathering like \"the long dark\". hazards like sun burn, food poisoning, animal attacks and scorpion/snake bites like \"green hell\". setting like \"stranded deep\". it's very similar to these 3 great survival games but just not so polished and still rough around the edges, which is ok while still in EA.\n\nit also has ships and sailing, and a story. it has the classic \"the more you do of something, like running, swimming, gathering, cooking etc. the more you skill up that skill\" which is always a great & satisfying mechanic. base building feels very good and to the point. all around a very solid and promising survival game.\n \nonly thing I kinda miss is being able to plant at your home base so that you don't have to travel far away to gather mats. I hope there's much more to come and can't wait for other biomes/regions and further development. recommended for any survival game enthusiast.", "timestamp_created": 1683225853, "timestamp_updated": 1683225853, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.568078935146331787", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "142474768": {"recommendationid": "142474768", "author": {"steamid": "76561197988165645", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 2016, "playtime_last_two_weeks": 0, "playtime_at_review": 922, "last_played": 1690234415}, "language": "english", "review": "Hits right on the mark, if you love crafting and exploring. Quite playable even in early access.", "timestamp_created": 1689868775, "timestamp_updated": 1689868775, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.567901253700256348", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "153756062": {"recommendationid": "153756062", "author": {"steamid": "76561198006611287", "num_games_owned": 631, "num_reviews": 29, "playtime_forever": 460, "playtime_last_two_weeks": 0, "playtime_at_review": 248, "last_played": 1702802619}, "language": "english", "review": "This game is a hidden gem of a game.", "timestamp_created": 1702777039, "timestamp_updated": 1702777039, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.566109418869018555", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "137289445": {"recommendationid": "137289445", "author": {"steamid": "76561198016695218", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 2077, "playtime_last_two_weeks": 0, "playtime_at_review": 1610, "last_played": 1699644473}, "language": "english", "review": "IT's got a lot of good survival aspects. It also has a cool story line that keeps you playing. The weight system is way off. You can't carry enough gear even with bags. Even the storage boxes are based on weight. There will be updates I'm sure. All in all it's good fun.", "timestamp_created": 1682448511, "timestamp_updated": 1682448511, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.564284741878509521", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141325804": {"recommendationid": "141325804", "author": {"steamid": "76561198312638488", "num_games_owned": 156, "num_reviews": 8, "playtime_forever": 22, "playtime_last_two_weeks": 0, "playtime_at_review": 22, "last_played": 1688501967}, "language": "english", "review": "Use menu to cut down tree.. all yours.", "timestamp_created": 1688507338, "timestamp_updated": 1688507338, "voted_up": false, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.563759982585906982", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1688556442, "developer_response": "Hello! While using menus for processes may not seem fun at first, it is actually essential to our game because it shows a lot of useful information. Our goal was to make a challenging game, so carefully planning your time and micromanaging everything is very important, especially if you play on Hard/Very Hard with the Permadeath option."}, "138332418": {"recommendationid": "138332418", "author": {"steamid": "76561198031995602", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 4306, "playtime_last_two_weeks": 0, "playtime_at_review": 885, "last_played": 1704599439}, "language": "english", "review": "Simply speaking, I wish my brain doesn't remember the memory of playing this game.\nSo I can start fresh game with better version of it that the devs continuously updated the game.\nThis is a good game. \nBuy it.\nPlay it.\n\nHopefully the game will be complete soon and at the point I forget good part of the game so I can have fun again.", "timestamp_created": 1684148432, "timestamp_updated": 1689328493, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.562390446662902832", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141651570": {"recommendationid": "141651570", "author": {"steamid": "76561197993373280", "num_games_owned": 0, "num_reviews": 80, "playtime_forever": 54, "playtime_last_two_weeks": 0, "playtime_at_review": 54, "last_played": 1688792161}, "language": "english", "review": "3d action with menu options! \n\nSeriously. \n\nImagine a modern survival game that...when you swing an axe at a tree a menu comes up where you select how many branches you want. That's this game. The devs intended it this way. None of the screenshots show it (as of this review)\n\nIt's like playing a baseball game but when you go to swing the bat, a menu comes up with how you want to swing the bat then text shows up where the ball lands. \n\nIt's...dumb. Weird. Something that is really, really out of place in a modern 3d game. Something you'd expect to see in a text based game. Hopefully this is a one off thing and not a looming nightmare coming to all 1st person games.", "timestamp_created": 1688875669, "timestamp_updated": 1688875669, "voted_up": false, "votes_up": 10, "votes_funny": 2, "weighted_vote_score": "0.560983419418334961", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1688895502, "developer_response": "Hello! It is shown in the trailer, the stream on our Steam page also shows it. But we added a screenshot with it as well, thanks for pointing this out!"}, "153812559": {"recommendationid": "153812559", "author": {"steamid": "76561198368151865", "num_games_owned": 0, "num_reviews": 74, "playtime_forever": 2485, "playtime_last_two_weeks": 0, "playtime_at_review": 442, "last_played": 1703185985}, "language": "english", "review": "The game saves after the character dies, [strike]it doesn't have strict autosave that prevents savescumming, which is common for single player game.. Autosaving after character death is forcing it and doesn't serve any purpose other than just being annoying.[/strike]\n\nAfter assessing the situation and the balance of the game, I think it is fine as it is even though I still prefer manual save, the autosave system like this should be optional, as it is now I just have to know when to engage or avoid enemies when low in health, that way I can still have time for alt-f4 when I know I cant win a fight.\n\nAlso, Living Water bottle in the game world is enough to last until needing to use it or finding the next one when shit happens.\n\nWith that being said, I'll revise my review to recommended because the game is actually good.", "timestamp_created": 1702841920, "timestamp_updated": 1703032452, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.559322059154510498", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1702977969, "developer_response": "Hello! The game autosaves regularly (for example, at the end of each day). We're also working on a manual saving system to be implemented in the future."}, "138877177": {"recommendationid": "138877177", "author": {"steamid": "76561199087912169", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 11712, "playtime_last_two_weeks": 0, "playtime_at_review": 554, "last_played": 1703530091}, "language": "english", "review": "It's a lot of fun, keeps me interested in playing and even on the easiest level there is challenges.  I would highly recommend for anyone that enjoys open world survival.  Can't wait to see what they come up with in updates!", "timestamp_created": 1684890283, "timestamp_updated": 1684890283, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.558984458446502686", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "154106552": {"recommendationid": "154106552", "author": {"steamid": "76561198221233748", "num_games_owned": 78, "num_reviews": 3, "playtime_forever": 4823, "playtime_last_two_weeks": 0, "playtime_at_review": 1192, "last_played": 1703851799}, "language": "english", "review": "great game. Though the durability of equipment could be improved. Just about everything wears out exceptionally fast.", "timestamp_created": 1703218856, "timestamp_updated": 1703218856, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.557195544242858887", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "137930154": {"recommendationid": "137930154", "author": {"steamid": "76561198112796104", "num_games_owned": 39, "num_reviews": 2, "playtime_forever": 5637, "playtime_last_two_weeks": 0, "playtime_at_review": 5298, "last_played": 1683863100}, "language": "english", "review": "Great game so far.  It's a shame it's flying under the radar of more popular content creators.\nGoing to start off by saying this game has great potential. The survival part of the game is top tier. Managing illnesses, along with food, water, energy and time, is very well done. \nThere are some places that need a bit more work though. \nThe building is very basic. Does what it needs to,  but there's a whole community of gamers that like to build more then just the basic box, with a roof.  It also lacks furniture.  So can't really decorate. If you can craft all these \"machines,\" you should be able to make atleast some basic furniture. \nAs for the resources you gather..  it needs some work.  Things don't respawn or replenish as they should. Or slower then they should.  But I'm sure they'll iron that out in future patches.  But it's worth mentioning. \nThen there's some other QoL things that I'd like to see implemented.  But it's still early access, so those features may come down the line. \nAll-in-all, it's got great bones and I hope it only gets better with time.", "timestamp_created": 1683446575, "timestamp_updated": 1683446575, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.555921077728271484", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140663766": {"recommendationid": "140663766", "author": {"steamid": "76561198426517902", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 28958, "playtime_last_two_weeks": 0, "playtime_at_review": 11168, "last_played": 1696021977}, "language": "english", "review": "Fantastic survival game. Don't rush the beginning though otherwise it's laggy and and you can lose track of what you should be doing. It has a great little story as to why you're alone surviving and you have to discover your own way in the world. I really enjoy this game :)", "timestamp_created": 1687685719, "timestamp_updated": 1687685719, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.554070532321929932", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141747710": {"recommendationid": "141747710", "author": {"steamid": "76561198007147670", "num_games_owned": 0, "num_reviews": 59, "playtime_forever": 57, "playtime_last_two_weeks": 0, "playtime_at_review": 57, "last_played": 1688982640}, "language": "english", "review": "The good- Another crafting game. The mediocre- same theme as any other crafting game. The bad- Convoluted crafting system, way too many commands to do anything, cannot fully bind keys for left handed, graphics are mediocre, hints for crafting are poor. Just nothing enjoyable about it. It needs a lot of polishing and less keys to do anything", "timestamp_created": 1688983062, "timestamp_updated": 1688983062, "voted_up": false, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.552378654479980469", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "153578889": {"recommendationid": "153578889", "author": {"steamid": "76561198001177257", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 11916, "playtime_last_two_weeks": 82, "playtime_at_review": 4477, "last_played": 1713223591}, "language": "english", "review": "Fantastic game, really enjoying it.  Great mix of exploration, building and combat.", "timestamp_created": 1702566708, "timestamp_updated": 1702566708, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.550750374794006348", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140795831": {"recommendationid": "140795831", "author": {"steamid": "76561197979522654", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 11908, "playtime_last_two_weeks": 0, "playtime_at_review": 2762, "last_played": 1702780868}, "language": "english", "review": "Highly recommended for survival and crafting fans. Within a few hours I knew that this was one of the games I'd need to be careful about or I'd mess up my schedule because it was so hard to stop playing! \n\nI'm very excited about what comes next and it's very encouraging to see regular updates to content and systems that takes player feedback into account. Thank you developers for this rising star!", "timestamp_created": 1687879434, "timestamp_updated": 1687879434, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.549991905689239502", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "138795530": {"recommendationid": "138795530", "author": {"steamid": "76561198143650960", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 1781, "playtime_last_two_weeks": 0, "playtime_at_review": 1417, "last_played": 1685047585}, "language": "english", "review": "This game is awesome!  I find myself thinking about it during my work day.", "timestamp_created": 1684793387, "timestamp_updated": 1684793387, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.549574971199035645", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "138505375": {"recommendationid": "138505375", "author": {"steamid": "76561198025394635", "num_games_owned": 0, "num_reviews": 278, "playtime_forever": 1288, "playtime_last_two_weeks": 0, "playtime_at_review": 559, "last_played": 1687483664}, "language": "english", "review": "This is where The Long Dark and Green Hell meets. Game is very good, but it has aspects to be polished.\n\nFor example, snakes are always aware of you and static. Animals do not interact with each other, so you are the center of the game.", "timestamp_created": 1684437826, "timestamp_updated": 1684437826, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.548325777053833008", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "153648946": {"recommendationid": "153648946", "author": {"steamid": "76561197994140976", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 4891, "playtime_last_two_weeks": 0, "playtime_at_review": 1213, "last_played": 1704668463}, "language": "english", "review": "A  fantastic survival game. A slight twist to gathering mechanics that feels a bit clunky at first but then really shows its stuff as you play on. The Story added to a survival game is stellar.", "timestamp_created": 1702656012, "timestamp_updated": 1702656012, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.548151552677154541", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "137193765": {"recommendationid": "137193765", "author": {"steamid": "76561198130436575", "num_games_owned": 569, "num_reviews": 35, "playtime_forever": 743, "playtime_last_two_weeks": 0, "playtime_at_review": 110, "last_played": 1685931262}, "language": "english", "review": "After my first time playing, I immediately see a huge problem with this game: base management. One of the first things you do in a survival crafting game is survey resources available in an area and decide where to put your base. However, in this game, resources take a long time to regenerate, so you will either have to constantly move your base, or travel further and further for resources (and that doesn't include how much the story quests move you around the map). With the very limited and restrictive movement/carry weight system (you stop completely dead if you are even .1 overweight, which I would suggest a change to maybe 75% movement speed reduction and unable to jump or run, when you are overloaded).\n\nAn overlooked possible feature of this game, right at the start, is salvaging the debris from your ship... Like, you see pieces of it all over, but can't do ANYTHING with it.\nIt's a mountainous island that you start on right? WHY ARE ROCKS SO RARE?\n\nI'm not even 2 full hours into this game so far, so my review will likely change. Maybe it's just the learning curve, but for at least the first couple of hours, I am not particularly enjoying this game.", "timestamp_created": 1682280395, "timestamp_updated": 1682280395, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.546747326850891113", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1682328339, "developer_response": "Hello! You are right, the learning curve may be the issue here, because the character adapts within time, leveling up skills, crafting better tools, etc. But some of the problems you mentioned are also true, and we'll fix them (like adding more stones to the Island of Hope). Anyway, thanks for your feedback"}, "156693166": {"recommendationid": "156693166", "author": {"steamid": "76561198258041060", "num_games_owned": 0, "num_reviews": 37, "playtime_forever": 836, "playtime_last_two_weeks": 0, "playtime_at_review": 648, "last_played": 1706168927}, "language": "english", "review": "What I meant to be a 30 minute game session turned into a 10 hour game session for the first time I played the game. Not too shabby. I recommend the game to everyone who's into survival games.", "timestamp_created": 1706095388, "timestamp_updated": 1706095388, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545454561710357666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "146884774": {"recommendationid": "146884774", "author": {"steamid": "76561198127145123", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 15776, "playtime_last_two_weeks": 127, "playtime_at_review": 9079, "last_played": 1713719774}, "language": "english", "review": "This is turning out to be a rather entertaining game.  Every month's update gets better and better.", "timestamp_created": 1695499884, "timestamp_updated": 1695499884, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.545277893543243408", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "137226391": {"recommendationid": "137226391", "author": {"steamid": "76561197985651710", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 169, "playtime_last_two_weeks": 0, "playtime_at_review": 169, "last_played": 1682340920}, "language": "english", "review": "holymoly it has been some time since i played a game with the amount of garbage and clunkyness this one here has.\n\nThe graphics are quite good so far, but thats it.\n\nThe gameplay and movement mechanics are complete garbage.\nThe way they put a \"simulation-layer\" behind every basic sort of action like \"grab a hanging coconut from a palm taking 40 minutes time + ~40% chance to injure yourself while doing it --> the wound you recieve as a result is not just a simple HP-drain but a status-ailment\" lets you limbo in micro-management loops way to often.\n\nFor example: - difficulty setting: Hard\n\nYour Character starts with 100 points which slowly drain during a day.\nHunting a whole chicken --> harvesting its meat --> ignite a fire on your campfire --> cook the meat --> eat the meat (all of it with a small to mediocre chance to suffer a wound) takes around 2-3 hourse meanwhile where your hunger depletes by a far greater value then this could balance out.\n\nEven without that you would need 11 chicken or 35 coconuts (whole! and not the \"green\" ones, as they only quench your thirst!) to eat to go through the day.\n\nWhat happens when you get injured while crafting/cooking/harvesting or else?? --> you need to mitigate the effect with another loop of \"gather leafes to make a bandage (which could take you hours as the tend to appear extremely scarce) --> craft a firestarting tool, ignite a fire (which will fail quite often --> the amount of time (60 minutes!) is still spent!), craft a bandage --> apply the bandage...then notice that the bandage only heals 1-2 stacks of wound --> craft another bandage (takes 30 minutes and you need a burning fire to do so).\n\nMeanwhile you beginn to become exhausted.\nYou will need to build a sleeping bag for which of course you need other materials.\nThe crafting takes 45 minutes, with a 14% chance to hurt yourself.\nYou cannot sleep, when you are hurt, hungry or thursty.\nYou cannot craft when you are sleepy.\nYou cannot make food, for which will need \"crafting\" when you are sleepy.\n\nEverything in this game is so damn boring and pointless beyond the point of stupidity and lack of logic.\n\nWhy ffs. can't you take a damn stone and throw it up to a palm to gain a coconut?\n\nI hope steam lets me refund this even with allmost 3 hours spent ingame.", "timestamp_created": 1682343996, "timestamp_updated": 1682343996, "voted_up": false, "votes_up": 14, "votes_funny": 7, "weighted_vote_score": "0.544520378112792969", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "143568778": {"recommendationid": "143568778", "author": {"steamid": "76561198036276182", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 5881, "playtime_last_two_weeks": 23, "playtime_at_review": 2777, "last_played": 1712708347}, "language": "english", "review": "Really enjoyed this game, and bought in on a whim after getting tired of Icarus and Subsistence.   The story-line is good (although the voice for the main character is...odd) and pretty well balanced.   In hindsight I would have paid double the price for this game, but to be fair, the low entry-point price was what got me to try it. \n\nI especially liked the Windy Island mini-quest and the reasonable nature of the skilling up of what was needed to complete the (hint: gas) objective.   \n\nReally anticipating the drop of the next chapter, and kudos to the devs for almost completely bug-free gameplay as of this writing in Aug '23.  \n\nThumbs up and highly recommended to any open-world, crafting, objective gamers...", "timestamp_created": 1691384121, "timestamp_updated": 1691384121, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.54356849193572998", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141995506": {"recommendationid": "141995506", "author": {"steamid": "76561198080506575", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 852, "playtime_last_two_weeks": 0, "playtime_at_review": 789, "last_played": 1689266335}, "language": "english", "review": "The game sits comfortably between The Long Dark and Green Hell with a couple unique twists.\n\nIt is NOT your usual \"punch a tree get wood\" survival, it is very much your \"plan your time and resources\" survival. \nPeople complain that the menu based harvesting and crafting system is not immersive, why can't you just swing your pick at a rock and get some stone. This is simply not that kind of game (there is plenty of those around) and as a TLD player it makes me super happy.\n\nDifficulty spikes between the different modes is significant and I strongly recommend starting at the lowest one, especially if you're new to management based survival.\n\nIt is a lot of fun.", "timestamp_created": 1689263647, "timestamp_updated": 1689263647, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.542570590972900391", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}}, "query_summary": {"num_reviews": 23, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 705, "total_negative": 108, "total_reviews": 813}, "cursors": {"AoIIPwAAAHr/qN0E": "Mon Apr 22 23:49:22 2024"}}
