{"reviews": {"159569598": {"recommendationid": "159569598", "author": {"steamid": "76561198820879099", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 23, "playtime_last_two_weeks": 0, "playtime_at_review": 23, "last_played": 1709246376}, "language": "english", "review": "If only the dev put as much effort coding the game as buying fake reviews", "timestamp_created": 1709246584, "timestamp_updated": 1709246584, "voted_up": false, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.586561143398284912", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159446542": {"recommendationid": "159446542", "author": {"steamid": "76561198052788274", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 1027, "playtime_last_two_weeks": 0, "playtime_at_review": 1027, "last_played": 1700979386}, "language": "english", "review": "bad game, developer don't give anything about it!... \nbad quality, no updates, toxic community.\nDON'T PLAY THIS CRAP!\nWASTE OF TIME", "timestamp_created": 1709093459, "timestamp_updated": 1709093459, "voted_up": false, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.578674495220184326", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "157699214": {"recommendationid": "157699214", "author": {"steamid": "76561199466842222", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 43333, "playtime_last_two_weeks": 0, "playtime_at_review": 43333, "last_played": 1707185557}, "language": "english", "review": "Don't waste time your time like i did", "timestamp_created": 1707204406, "timestamp_updated": 1707204406, "voted_up": false, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.551851868629455566", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "162511433": {"recommendationid": "162511433", "author": {"steamid": "76561198131402663", "num_games_owned": 13, "num_reviews": 2, "playtime_forever": 684, "playtime_last_two_weeks": 401, "playtime_at_review": 282, "last_played": 1712861744}, "language": "english", "review": "It is a great game but the company should make it playable on low end pc", "timestamp_created": 1712619738, "timestamp_updated": 1712619738, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158036108": {"recommendationid": "158036108", "author": {"steamid": "76561199594839643", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 1724, "playtime_last_two_weeks": 0, "playtime_at_review": 1629, "last_played": 1712085709}, "language": "english", "review": "BEST GAME  my base got raided while i was offline  then when i got back online i got killed by a killer robot and i died from watter", "timestamp_created": 1707607185, "timestamp_updated": 1707669362, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "157155262": {"recommendationid": "157155262", "author": {"steamid": "76561198069474960", "num_games_owned": 114, "num_reviews": 18, "playtime_forever": 9821, "playtime_last_two_weeks": 0, "playtime_at_review": 9525, "last_played": 1711811605}, "language": "english", "review": "Totally dead game, don't waste your time to play it! Almost 2 years the game stay on season 6! The moderators are some sour uncles who are not even good at their jobs. And when you tell them their game is dead, they can't swallow it! Now i just play it because of few friends. If you even want to play it, don't waste your money for it, its not worth it! Developers are not serious, they only rely on one person to code the game for them, which is completely frivolous. If you want to play pvp game, better go to PUBG or something much better for PVP. This one is good only for PVE!", "timestamp_created": 1706575628, "timestamp_updated": 1709068213, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.51327437162399292", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1706584381, "developer_response": "Hello!\n\nThank you for your feedback and we appreciate that you took time to share your thoughts.  We will be reviewing the missions system for the next season update and some changes are coming.  Although we can't promise that there won't be some pvp missions, we have some ideas in mind to help with this situation.\n\nCheers"}, "50957392": {"recommendationid": "50957392", "author": {"steamid": "76561198199180179", "num_games_owned": 320, "num_reviews": 14, "playtime_forever": 791, "playtime_last_two_weeks": 0, "playtime_at_review": 297, "last_played": 1560363546}, "language": "english", "review": "XERA: Survival is a post-apocalyptic first-person shooter game developed by a single individual. The game takes place in a world ravaged by a deadly virus that has transformed the majority of the population into mindless mutants. The game presents players with an interesting and engaging storyline that provides a good framework for the gameplay.\n\nHowever, despite the potential, the execution falls short in several areas. The game suffers from numerous technical issues such as bugs and glitches. The game's graphics and sound effects also leave a lot to be desired, with the overall quality feeling like something out of a game from a decade ago. The lack of diversity in enemy types and the limited number of weapons available also detracts from the overall experience. One of the biggest issues with the game is its lack of content and replayability. The game can feel repetitive after a few hours, with the same objectives and enemies appearing in almost every level. There is also a lack of variety in the environment, which can make the game feel monotonous.\n\nDespite these criticisms, it's important to remember that XERA: Survival is a one-person project. The developer has created a game that has a lot of potential and ambition, but the limitations of working alone are evident. The fact that a single person was able to develop a game of this scope is impressive, and it's worth supporting indie developers who take on such daunting tasks.\n\nIn conclusion, XERA: Survival is a game that has a lot of flaws and limitations. However, it's also a game that has potential and is worth playing if you can look past its shortcomings. The game's one-person development team deserves recognition for their efforts and creativity, and supporting indie developers is always a worthy endeavor. If you're a fan of post-apocalyptic games and are looking for a new experience, give XERA: Survival a chance.", "timestamp_created": 1559228256, "timestamp_updated": 1684246239, "voted_up": true, "votes_up": 228, "votes_funny": 45, "weighted_vote_score": "0.889465153217315674", "comment_count": 6, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "50920152": {"recommendationid": "50920152", "author": {"steamid": "76561198054744284", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 1864, "playtime_last_two_weeks": 0, "playtime_at_review": 247, "last_played": 1626883550}, "language": "english", "review": "For the dev to read: \n\nThe game is incredibly well optimised. It is insane to get 144fps in an early acces game. \nMovements feels smooth pvp as well. I love all the events (airdrop,compound event etc.). \nYou can stash your extra gear and drop out of an helicopter to avoid players camping safe zones.\n\nHere are the cons and my suggestions:\n\n- Full servers make everything laggy\n- buildings feel empty and sometimes towns look the same \n- too many pistols in military zones\n- Compass should be top center of the screen. In an action game you don't have that much time to callout and looking far left for the compass is not optimal.\n- 1pp servers are a must. 3pp is fun but the fact that you can see people while they can't is a bit busted\n- light armor and heavy are too close (12% vs 18%) when helmets are perfect\n- Airfield feels empty\n- Military zones look the same\n- quad is too laggy\n\nI enjoyed playing a lot and i'm looking forward to the next update.", "timestamp_created": 1559092460, "timestamp_updated": 1559092460, "voted_up": true, "votes_up": 215, "votes_funny": 8, "weighted_vote_score": "0.887879252433776855", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "51059147": {"recommendationid": "51059147", "author": {"steamid": "76561197977920776", "num_games_owned": 15197, "num_reviews": 22, "playtime_forever": 783, "playtime_last_two_weeks": 0, "playtime_at_review": 783, "last_played": 1559646289}, "language": "english", "review": "I initially purchased this game due to nostalgic throwbacks to warz/iss after watching some gameplay and wanted to experience some old moments once again (excluding the migraine inducing sheer rage moments caused by Sergei and Artemis).\n\nAfter downloading the game and loading into a server, I was pleased to see the same antics players did back in warz were being utilized in Xera. However, after wandering around for a couple hours and exploring the map, there [i]really[/i] isn't much to do.\n\nThe towns are empty.\nThe majority of buildings that you'd want to get into to setup a nice ambush or have a vantage point are inaccessible.\nThe buildings that you can get into such as houses are bare and empty with a bag of chips in the corner or a can of soda upstairs in the closet.\nThe main city is generic with absolutely no reason to go there. No loot worth mentioning, minimal AI, no players.\nDon't curse. Seriously. My buddy called me a cunt in chat and was instantly banned.\nThe ATV, the only vehicle in the game is buggy.\n[list] \n[*]Stuck on a pebble? Can't get out.\n[*]Hit a hescos near the roadblock? Get catapulted into the air and experience being challenger 2.0.\n[*]Have a player with a 1911 sneeze on you? Explode into a ball of furious flaming hilarity.\n[*]Engage a team of 3-5 players and gotta get the hell outta dodge cause you goofed your opener? Too bad since the ATV has a mind of its own and will only go 2.5mph resulting in the initial confusion getting you killed and teabagged.\n[/list]\n\nPlayer interaction i.e. pvp is regulated to around safe zones or at the airport and/or military base. Only areas worth looting are airport and military (with an occasional visit to the roadblocks). Compound \"event\" is pointless since the moment the fist turns red (indicating someone is there and it is in progress) you will have multiple people whether teamed or solo camp outside on the hills until you are finished looting to murder your face the moment you step outside and turn the area into a mini battle royal while everyone scrambles to get to your corpse. (No joke the first time this happened, the sheer volume of rounds hitting my ragdolling corpse from every direction made me think of murphys execution scene from the original Robocop)\n\nAirdrops are an interesting addition. Usually results in players setting up an ambush point near a dropped crate and raping your face as you wait the ten seconds to open it. (I did it too. Its easy loot.)\n\nI had a run in with what I thought was a cheater. Teleporting around to better flanking positions, getting the drop on me from the complete opposite direction from which I initially engaged him/her. Turns out it wasn't a cheater but the developer himself [b]*drum roll*[/b] JOSHUA.\nThis person is quite full of himself with an arrogant attitude. When called out on it, he denied everything and told me I quote \"if you don't like it refund the game\" then proceeded to spam \"LUL\" to my further complaints. I'm actually surprised I wasn't banned.\n\nI know its early access and the general issues I currently have with the game will be worked on in the near future(will it?). But after my experience with the lead honcho himself, I highly doubt this game will progress far. Infestation: Survivor Stories is a polished masterpiece compared to this steaming pile of shit. (This is the only \"praise\" you'll ever get from me Sergei. Fuck you Artemis. Kill yourself)\n\n[b]To anyone who sees this review, I highly recommend you stay away from this game. Purchasing this game is a crime against humanity and you deserve to be shot if you do so.[/b]\n\n[b]*Edit 20190605*[/b]\n\nHey look, a developer response!\n\nSigh. JOSHUA... JOSHUA... Oh JOSHUA...\n\nAt the very least spend a few minutes writing an actual response instead of lazily ctrl+a, ctrl+c and ctrl+v-ing. \n\nI didn't say \"you wanted to kill me so that you can say you killed a dev.\" To those reading, scroll up to where I said \"I'm actually surprised I wasn't banned.\" That is due to me stringing and combining a multitude of obscenities that would've made Clint Eastwood blush and ask me out to dinner. I guess there is something positive to say about you, JOSHUA.\n\nHowever, since i'm bothering with editing a posted review, I might as well add a bit more information to help my fellow gamers not be lead astray. [u]Lets have a look at some negative reviews to reduce the amount of searching needed to come to a conclusion on whether you should buy this game or not.[/u]\n\n[list]\n[*]https://steamcommunity.com/id/W0mbRaider/recommended/625340/\n[*]https://steamcommunity.com/id/ExtentCSGO/recommended/625340/\n[*]https://steamcommunity.com/profiles/76561198101211275/recommended/625340/\n[*]https://steamcommunity.com/id/mradderall/recommended/625340/\n[*]https://steamcommunity.com/profiles/76561198263349513/recommended/625340/\n[*]https://steamcommunity.com/id/deepockent/recommended/625340/\n[*]https://steamcommunity.com/id/batmanisntarealsuperhero/recommended/625340/\n[*]https://steamcommunity.com/id/ProteinAbuse/recommended/625340/\n[*]https://steamcommunity.com/profiles/76561197969896037/recommended/625340/\n[*]https://steamcommunity.com/profiles/76561198309213675/recommended/625340/\n[*]https://steamcommunity.com/id/awewhat/recommended/625340/\n[/list]\n\n\nNow, lets have a look at some of these shill positive reviews.\n\n[list]\n[*]https://steamcommunity.com/id/kozzy420/recommended/625340/\n[/list]\n\nDid you really just say that Xera: Survival is a mix of Escape from Tarkov, DayZ, WarZ and Nether?\n\nOkay. Please explain to me how this game is within/in/near/considered? the same catagory as Tarkov? It seems to be lacking:\n\n[list]\n[*][b]Hardcore[/b] first-person shooter\n[*]In-depth weapon modding which still to this day, no game has come close to replicating\n[*]A variety of items. (Don't take the word variety lightly. There are [b]several[/b] hundred items to mod the numerous amount of weapons to your liking. You [u]will[/u] spend 5-20 minutes modding your gun (so you can lose it ten seconds into spawning :D)\n[*]Inventory management\n[*]Skill leveling and weapon mastery\n[*]Player driven global market\n[*]Extend this bullet list down about twenty more points. I'm stopping here so I can continue to berate you.\n[/list]\n\nHow is this game in any way, shape or form related to DayZ and all the memories it created? (Not standalone. That shit is a flaming dumpster fire).\n\nhttps://www.reddit.com/r/greentext/comments/3amto8/anon_plays_dayz/\n\nYou're telling me Xera: Survival can create those feels?\n\n.........................HAHAHAHAHAHAHA.\n\nWarz was fun the first two weeks. Game quickly fell to shit courtesy of [i]yours truly[/i], Sergei.\nNether is a completely different game. Doesn't fit into anythinig here.\n\nGet the hell out of here with your shill review. How much did you get paid to post this? Fifteen shekels?\n\n\nNext on the list.\n\n[list]\nhttps://steamcommunity.com/profiles/76561198082590661/recommended/625340/\n[/list]\n\n\"Probably the most fun I've had on a game in years.\"\n\nNow i'm going to assume with you having used the word \"probably\", you're undecided on whether this is the most fun you've ever had gaming in years. However, if you actually meant that, you need to save more than $20 my man and check out some A rated games instead of sticking wth the B's and C's.\n\n\nNext on the list.\n\n[list]\nhttps://steamcommunity.com/profiles/76561198248347154/recommended/625340/\n[/list]\n\n\"This game is extremely addictive and fun to play!\"\n\nYou know what else is extremely addictive and fun to do? Jerking off with a cheese grater and finishing the climax with some steel wool.\n\n\nLook, i'm not saying that some people didn't enjoy and have fun with this game. But what I am saying is that the reviews were really funny to read.\n\nPlease, for the love of god my fellow gamers, steer clear of this game. There are plenty of other games to spend your hard earned money on. Games more deserving than this.\n\n[list]\n[*]Scum\n[*]Rust\n[*]Arma 3\n[*]7 days to die\n[*]Squad\n[*]Mordhau\n[/list]", "timestamp_created": 1559722283, "timestamp_updated": 1559808679, "voted_up": false, "votes_up": 382, "votes_funny": 50, "weighted_vote_score": "0.880244970321655273", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1590920757, "developer_response": "Hi there!\n\nThanks for taking the time to write a review, we accept all criticism.\n\nSince the posting of this review, most of these issues have been resolved. \n\nTowns, buildings and other areas have been filled up with brand new assets made in-house and a lot of other great props. Most buildings now have full interiors with lots of searchable objects. Towns are full of loot and roaming AI to battle against. There is lots of loot in the main city and all areas. \n\nThe ATV has since had a massive overhaul and feels really great to drive.\n\nWe have a fairly strict code-of-conduct, so generally we do issue temp bans to those who abuse other players. Your friend was banned for abusing other players because it’s something that we don’t take lightly, we have to make sure the game is a safe environment for our community.\n\nThanks again for your feedback, and we are constantly working on ways to improve the game.\n\nCheers!\n"}, "51072634": {"recommendationid": "51072634", "author": {"steamid": "76561198256047563", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 308, "playtime_last_two_weeks": 0, "playtime_at_review": 306, "last_played": 1559966324}, "language": "english", "review": "Extremely dissapointing game. Management team, they will block you to avoid any negative feedback etc etc. I was banned for asking the owner Joshua, what nuceler was, as a friend of mine was accused of using it (Guessing it is a hacked client). He proceeded to say \"Oh its you\" assuming I am clearly someone else, with no say back I was banned. I tried to contact the Twitter, Facebook & Email. All I was blocked on and can never contact again. I have all proof of conversations. I was never toxic, unfriendly or a pest. I ended up creating a thread on the forums announcing my issues, the thread ended up getting a few replies, until yet again. It was deleted and I was banned. I'd love a refund as I bought this game early release, as well as I streamed and gave keys away. Fuck you Joshua and your management team. i will be following up with this a lot further.\n\nJoshua has decided to refund and revoke my game which I thought had the situation sorted, but I had my complete mindset changed after I was streaming, my friends were joking about hacking after the whole situation and Joshua decided to take it too heart and threaten me regarding it. Here is the clip he gathered.\n\nhttps://streamable.com/iewv9 Keep in mind we are playing a totally different game and not associating with him anymore but he decides to sit and watch my stream trying to gain dirt.\n\nHe then threatened me and blocked me, here is the screenshots. \nhttps://gyazo.com/318ab706b39723274616c16bf479e101\nhttps://gyazo.com/cc281b81f3884c43d262ec66af8378d0\n\nI was also revoked of access to speak in the discord minutes after this, after sending a link of this review.\nhttps://gyazo.com/5b5ee4be26045cb5fe6fef96cc7b8ae6\n\nCarries on to speak about the situation in general, linking the video laughing about it but giving me no say in the situation at all as I am muted https://gyazo.com/0aa38c734147889acd6d45a1c2525fa6", "timestamp_created": 1559788191, "timestamp_updated": 1560161491, "voted_up": false, "votes_up": 335, "votes_funny": 36, "weighted_vote_score": "0.831667006015777588", "comment_count": 108, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1561944330, "developer_response": "Hi there,\n\nThank you for your review, we appreciate your feedback.\n\nWe have went ahead and refunded the full pre-order amount to both parties involved, even with a HWID association to cheats (due to a family member using cheat software) to sort this issue out.\n\nWe value our customers and unfortunately in this case, our abrupt shut-down of messages and communication with these parties was strictly to avoid the exposure of mentioned detected cheats. In this case, \"nuklear\". We would never try shut-down opinion or feedback, we welcome it all. Good or bad.\n\nI would like to add, as pure evidence of specific parties involved that cheating and the association to cheaters is evident. https://streamable.com/iewv9\n\nFurthermore, this user has since been VAC banned (15 days ago) for cheating in CS:GO. \n\nCheers"}, "51055625": {"recommendationid": "51055625", "author": {"steamid": "76561198065305279", "num_games_owned": 136, "num_reviews": 19, "playtime_forever": 10821, "playtime_last_two_weeks": 0, "playtime_at_review": 6232, "last_played": 1579459430}, "language": "english", "review": "While I write a bad review, I want to remind everyone reading it that this is my experience with the Dev team and the game play.\n\nThe game is a ton of fun, it brings a lot of good qualities from other games while taking out the bad qualities. The combat isn't horrible, actually it is quite good (considering it is still in early access). There isn't bullet drop but there is damage drop off (newly added). Recoil is there but it's currently bugged (tied to FPS).\nThere are some bugs; FPS drop removes/decreases recoil, the ATV will bug out quite often (move slow, unable to get out if stuck on a rock, etc), there are also some bugs with items such as logging with attachments on weapons will still be attached but not actually on the weapon and issues with the heli and items.\n\nThe really bad part about this game, and my experience with it is the Dev team (specifically Joshua, the creator). While playing in a game on the live server, I saw someone standing still and shot and killed them (as everyone would). Then I got killed by JOSHUA who then looted my body and his friends body (presumably a dev). However, after dying my teammate engaged Joshua pushing him back to a tree where Joshua then teleported away. I confronted him in game text chat, where Joshua tried to deny it, but then confessed to teleporting. I expressed my disconcern for the game due to his actions, he then tried to defend his actions saying he teleported away to test a rock glitch. He got upset and left the server, said I can go ahead and request a refund and that he didn't care. While I felt, before this event, that the game had huge hopes and was a ton of fun to play, the actions of the creator and development team is super disconcerning. If the creator of the game cares so little that he is willing to cheat and doesn't care about it, on public servers, rather then \"testing bugs\" on a private server. Makes you wonder if he really cares about the game and it's future, or if he even cares about other people cheating (which I have recorded and sent to their dev team). \n\nNeedless to say, I would not recommend this game and I would even suggest that steam consider reviewing the publisher and consider removing them from steam, I think that this game will die and become a major out-cry for people who buy it thinking that the game has hopes, when in truth the game will probably die due to the creator not caring anymore. And steam will get flooded with requests for refunds.\n\nI do hate to give this game a bad review, I love playing it and I thought that the dev team being involved with the players could make the game a huge success, but my interaction with Joshua forces me to think otherwise.\n\n\n--\\\\\\-- UPDATE --\\\\\\--\n\nWhile I have tried to play for awhile after my first review, trying to help with the community the game rather then the crappy developer. IcedYoshi asked me to do another review of the game since, as the community manager and from what it appears, the only sensible person on the... development team? not sure what to call them since Joshua has said on many occasions that he is the ONLY developer.\n\nI would say, in the last 3 months the game has made progress in a lot of horrible ways. First was the attempt at implementing a recoil system which caused a lot of players to quit, then they took it away and it made things worse. In total they haven't figured out the gun play for this game at all and have just screwed it up completely now. \nYou can tell by how they just throw \"Patches\" or updates out to try and fix things, but they never actually test it. It probably doesn't help that the only developer cheats when he plays so he never gets into true combat to understand how his \"fix\" is really breaking the game.\n\nIn the last 3 months, the game community has almost all but quit playing, which is totally understandable. In three months, millions of dollars, this game has added weapon skins and a couple of events... no real content. Where are the new maps? new weapons? the missions or tasks? There isn't anything that really pulls you into this game, aside from watching the ONLY developer cheat in his own game and then lie about it. \n\nOVERALL: Thumbs Down! 100%, The current route the game is going and the actions and response of the \"ONLY\" developer (and his team) are not conductive to an enjoyable game. I suggest you avoid this and that steam cuts this publisher off.\n\nAdditional update: Now that the developer (Joshua) has changed his response again, lying about what happened I feel that it goes to show how this 'team' feels about the development of this game. I would remind Joshua that no abusive messages were written in the in-game chat by myself. In truth, we did not know that they were admins as there is no way to tell until you confirmed it in chat and teleporting away from a fight after looting a player that you killed because you had god mode on is cheating in just about every sense of the word. Which, by the way, is in violation of the Value developer community terms of use regarding Conduct on the sites as this would be classed as a \"functionality that may give a player an unfair competitive advantage when playing multiplayer\".\nHonestly, Valve should remove this developer and ban their company from using their product(s).", "timestamp_created": 1559697341, "timestamp_updated": 1606103503, "voted_up": false, "votes_up": 206, "votes_funny": 4, "weighted_vote_score": "0.815709471702575684", "comment_count": 44, "steam_purchase": true, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1590919413, "developer_response": "Hi there!\n\nThanks for posting a review, we accept all criticism.\n\nI use teleport tools to get around the map quicker to check for bugs and other issues. Given it is Early Access – I need to stay on top of these bugs. This occurrence happened very soon after our launch, so we had a lot of bugs to get through and there are a lot of issues that can only be replicated on a live build (with a full load etc). \n\nIn some occasions, we do run into players – which usually they recognise us and avoid us, and other times they do try kill us. A moderator and myself were testing some bugs out in the wild on live servers and “WombRaider” initiated combat with us and as a result was killed, and was upset. About a couple minutes later and the encounter was over, a player reported a bug and I teleported to them to review it (Not thinking “WombRaider” would get upset by this). \n\n“WombRaider” and his friend begun to write abusive messages in the in-game chat towards myself and our staff. \n\nIn hindsight I should have let you just kill us, but in reality – we used nothing in the PVP encounter as an advantage and it was a fair fight (which you initiated). Please keep in mind that anyone on the team (myself included) would never use any developer tools as an advantage against a player. \n\nCheers!\n"}, "50910216": {"recommendationid": "50910216", "author": {"steamid": "76561198071174796", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 3776, "playtime_last_two_weeks": 0, "playtime_at_review": 1272, "last_played": 1560895041}, "language": "english", "review": "if you like open world looter shooter you gonna like this game.\nits not hardcore like dayz where u loot 2 hours to get some  guns, its faster and arcady \nyou can stash your  gear that you farmed in   your global inventory \nits   very pvp focused \nand its not a sergej titov game...its made by one guy alone.\nperformance is rlly nice i get like 150-200 fps\nno dc /crashs so far.\nruns really smooth\nrlly nice game to jump on with some friends and just kill other players :)", "timestamp_created": 1559053769, "timestamp_updated": 1559053769, "voted_up": true, "votes_up": 70, "votes_funny": 5, "weighted_vote_score": "0.814650297164916992", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "101586125": {"recommendationid": "101586125", "author": {"steamid": "76561198323490036", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 616, "playtime_last_two_weeks": 0, "playtime_at_review": 379, "last_played": 1675370679}, "language": "english", "review": "After playing for a few hours I realize a couple of PROS and CONS about this arcade day-z looter shooter.\nSome things may change if you play with friends (I played Solo my first couple gameplays)\n\nPVP AND GUNPLAY\nThe hit reg seems alright, not bad for an early access game but the looting is so painful, having to scroll through the persons entire inventory seems very stupid and in most cases would get you killed. Guns are easy to find which I enjoy, attachments work and are very plentiful as well. \n\nTHE MAP\nThe map is huge which in some cases is good but it makes playing very boring and lonely. Pvp interaction is pretty rare even on a full pop server. Most of the cities have copied and pasted buildings and contain very little loot making going there an extreme waste of time.\n\nTHE AI\nProps to them for not using zombies and having their own unique thing, but there is very little Ai interaction adding on to the loneliness of the game.\nI didn't even know there were any other A.I other than robots until I was looting and heard gunshots coming from a \"bandit\" that seemed to be the only thing that was in the city.\n\nBASE BUILDING\nAfter rounding up a couple of tools that seemed to be needed for a proper base build I decided to try it out. I feel like this could be easily fixed but WHY is it so hard to find a spot to build a base. Not even kidding I spent almost an hour running around the map trying to find an area to build.\n-\n When I finally found a decent spot to build i placed down the flag thing and got to building. I personally dont really mind the building and individually placing down each base frame but I feel it requires so much grinding to get even a simple 1x1 set up. Traps and Turrets are very cool addition either buying or finding the parts to craft one. Overall its very easy to understand but just really inconvenient in some cases.\n\nEVENTS \nI like the constant events going around the map like Airdrops and Helicopter crashes. It really spices things up and gives the player something to do other than just looting and killing other people. These events provide very good loot and gives a very big challenge to people.\n\n\nOverall id give this game a 6/10 its not the best, but its not the worst either. Fun game to hop on if you are looking for an arcade looter shooter similar to H1Z1 Just Survive (games a mix of Dayz and Rust)\n\nThis is my first real review on a game so if there is anything I could improve please leave a comment.", "timestamp_created": 1635130475, "timestamp_updated": 1635130475, "voted_up": true, "votes_up": 36, "votes_funny": 2, "weighted_vote_score": "0.800557553768157959", "comment_count": 3, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "100061871": {"recommendationid": "100061871", "author": {"steamid": "76561199084411073", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 1981, "playtime_last_two_weeks": 0, "playtime_at_review": 909, "last_played": 1664640357}, "language": "english", "review": "its like a free version of rust", "timestamp_created": 1632783482, "timestamp_updated": 1632783482, "voted_up": true, "votes_up": 44, "votes_funny": 6, "weighted_vote_score": "0.775352358818054199", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "101322675": {"recommendationid": "101322675", "author": {"steamid": "76561198180171225", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 54241, "playtime_last_two_weeks": 0, "playtime_at_review": 10468, "last_played": 1703026022}, "language": "english", "review": "This game is super fun if you like dying to people with silent snipers, or being pinched from behind. \nIf you enjoy raiding bases then I recommend this game for sure, just make sure you get LOTS of friends to come raid with you so they can soak the dozens of turrets that will shoot thousands of bullets at you before running out of ammo.\nIf you enjoy getting ran over by cars that are invisible then you will like this game.\nIf you like not being able to hear anything other than the music that you can't turn off every time you enter a city then you will for sure like this game.\nIf you enjoy running out of thirst because you decided to jump a few times for the last 30 seconds you will like this game.\nIf you like pvping from long range and love when your weapons deal much less damage when you are far away and anyone can outheal it then you will like this game. \nIf you like running around trying to find a spot to place a land claim for hours on end on any of your high pop region servers then you will enjoy this game.\nIf you like driving around in a full health car and having a player come out from behind a tree to shoot your car and instantly blow you up you will for sure like this game.\nIf you enjoy numerous building and raiding glitches that are severely exploitable then you will love this game.\nIf you like a designated area where most of the people on the server go to pvp, then you will love this game. The location is called \"the mall\" players will camp at this place holding several angles making it nearly impossible to push.\nIf you like finding a cheater out of every couple pvp fights then you will like this game.", "timestamp_created": 1634695151, "timestamp_updated": 1634882757, "voted_up": false, "votes_up": 42, "votes_funny": 40, "weighted_vote_score": "0.774350583553314209", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "55694534": {"recommendationid": "55694534", "author": {"steamid": "76561198318532150", "num_games_owned": 94, "num_reviews": 1, "playtime_forever": 262, "playtime_last_two_weeks": 0, "playtime_at_review": 262, "last_played": 1558975570}, "language": "english", "review": "Because these user experiences got pushed to the bottom, reposting so that this important information isn't forgotten.\n\nThe dev WILL play the game and WILL cheat to win, i.e insta gibbing you because you killed him. This has happened to several players, and probably happened to many more since I stopped playing this game a few months back. In addition, he will ban you if you do anything that he disagrees with, or if he considers you a cheater despite proof of otherwise.\n\nI personally recommend not buying. It's fun for all of a few hours, but after that you're just gonna get frustrated. If not with the dev, then with the other cons of the game.\n\nEdit - For all of those asking and doubting, I made this post originally to bring light to other experiences that people have had. I stopped playing this game due to these player's experiences, and I thought that you might want to as well, or I could stop you from feeding a company I do not agree with. Here are the links to those posts. Sorry for not being clear enough the first go-round. \n\nhttps://steamcommunity.com/id/ExtentCSGO/recommended/625340/ \nhttps://steamcommunity.com/id/W0mbRaider/recommended/625340/ \n\nThese are the situations which I reference. Take it or leave it.", "timestamp_created": 1571605930, "timestamp_updated": 1571886822, "voted_up": false, "votes_up": 246, "votes_funny": 22, "weighted_vote_score": "0.771207690238952637", "comment_count": 38, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1571644982, "developer_response": "Our development tools are quite useful when tracking bugs and getting around the map looking at issues that players report. They are also quite useful for tracking cheaters and players who break our code of conduct. These tools are only available to 3 staff on the team, including myself, our Community Manager (Gary) and our new developer (Reuben) who just joined the team about a month ago. These tools are strictly locked to hard-coded Steam accounts.\n\nWhile we would love to play and PvP, the truth is we just don’t get the time to do so. Even if we did have the time – we would definitely not use these tools against our players. Each of our staff do have alt accounts which have the same privileges as a normal player (no dev tools) – for the rare occasion of when we do jump into the wild and play. Other than that – when we are on dev accounts, we are in talking with our players, helping out new players or checking game-servers for lag and other issues.\n\nThese allegations of us using these tools to “win” – what really would we have to gain? We have access to all the loot we would ever need and have a dedicated testing environment away from the live environment. Using these tools would honestly do nothing for us. \n\nAdditionally - We actually track a lot of useful information, including the kills / deaths of players. This data is never wiped for security purposes. Based on this data the user in question “Axliam” never had any PvP encounters with a developer or any of our staff in-game. As you can see here: https://i.imgur.com/sX11ruk.png \n\nAs for bans - we have a very strict code of conduct which players can find themselves breaking when being toxic in the heat of the moment. Generally, bans go in the order of: 24 Hours, 48 Hours, 72 Hours, 7 Days, 14 Days, 30 Days - depending on the infraction and the severity. You can find our code of conduct on our support portal here: https://support.xeragame.com/hc/en-us/articles/360024225574\n\nI hope this clears up any misinformation, feel free to reach out to me directly at joshua@spottedkiwi.nz if you have any questions.\n\nI also encourage anyone with any concerns or questions to jump into our Discord and have a chat with us. Our Discord provides you with direct access to our staff and we typically reply within a few hours. https://discord.gg/xera\n\nRegards,\nJoshua"}, "155344711": {"recommendationid": "155344711", "author": {"steamid": "76561198008251633", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 101290, "playtime_last_two_weeks": 0, "playtime_at_review": 101290, "last_played": 1702061170}, "language": "english", "review": "BEWARE of  DEVS getting your steam account into a ban on record!.\n\nThey rather ban people for no reason instead of fixing his dead ass game full of bugs and people using hacks.\nnot worth risking your steam account status by playing this trash game.", "timestamp_created": 1704496636, "timestamp_updated": 1704496636, "voted_up": false, "votes_up": 40, "votes_funny": 3, "weighted_vote_score": "0.768721818923950195", "comment_count": 10, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1707785914, "developer_response": "Hello,\n\nThank you for reaching out. It's important to clarify that using cheating software on alternate accounts does not safeguard your main account from being banned. Our systems are designed to detect and address cheating behavior across all associated accounts. We strongly advise against any form of cheating or using unauthorized software to gain an unfair advantage. Fair play is integral to maintaining a positive gaming environment for all players.\n\nBest regards,\nJoshua"}, "100423256": {"recommendationid": "100423256", "author": {"steamid": "76561199082793726", "num_games_owned": 24, "num_reviews": 3, "playtime_forever": 7581, "playtime_last_two_weeks": 0, "playtime_at_review": 77, "last_played": 1654995235}, "language": "english", "review": "Would be a great game if you could build somewhere. Sadly you cant build within 400 miles of someone who has a land claim down and apparently they are everywhere but invisible at the same time. Its literally impossible to build a base. None of the servers say when they were wiped so servers could be hundreds of days old and you wouldnt even know . Its very frustrating me and a teammate got a bunch of stuff and went to place a base down and cant build anywhere. The land claim should be taken out and the building prevelige range needs to be reduced. There is no reason i shouldnt be able to build across a river 300 yards away form someone", "timestamp_created": 1633250042, "timestamp_updated": 1633250042, "voted_up": false, "votes_up": 43, "votes_funny": 6, "weighted_vote_score": "0.75015634298324585", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1633255077, "developer_response": "Hi there,\n\nWe've seen a massive influx of players, so we've made some adjustments to the land claim system in the back-end to decay inactive claims a lot better.\n\nFurther land claiming adjustments will be made in upcoming patches to help with players finding land a lot easier as well.\n\nThanks a lot for your feedback!\n\nRegards,\nJoshua"}, "124463847": {"recommendationid": "124463847", "author": {"steamid": "76561199251921614", "num_games_owned": 83, "num_reviews": 70, "playtime_forever": 163, "playtime_last_two_weeks": 0, "playtime_at_review": 163, "last_played": 1666866059}, "language": "english", "review": "---{Graphics}--- 8/10\n☐ Masterpiece\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Will do\n☐ Bad\n☐ Awful\n☐ Paint.exe\n\n---{Gameplay}--- 9/10\n☐ Try not to get addicted\n☐ Very good\n☑ Good\n☐ Nothing special\n☐ Ugh\n☐ Bad\n☐ Unbearable\n\n---{Audio}--- 10/10\n☑ Eargasm\n☐ Very good\n☐ Good\n☐ Decent\n☐ Not too bad\n☐ Bad\n☐ Earrape\n\n---{Audience}--- 10/10\n☐ Kids\n☑ Teens\n☐ Adults\n☐ Everyone\n\n---{PC Requirements}--- 8/10\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{Story}---10/10\n☐ Doesnt have (Not counting historical stuff)\n☐ Something isnt nothing I guess\n☐ Not great\n☐ Average\n☐ Good\n☑ Lovely\n\n\n---{Game Time}---8/10\n☐ Long enough for a cup of tea\n☐ Short\n☐ Average\n☐Long\n☑ Depends on u\n☐ Playing the whole game in one sit\n\n---{Price}--- 8/10\n☐ Just buy it\n☐ Worth the price\n☑ Free to play\n☐ Maybe if u have some spare money left\n☐ Not recommended\n☐ Dont throw money into a trash can\n\n---{Bugs}--- 8/10\n☐ Never had any\n☑ Minor bugs\n☐ Few bugs\n☐ Can get annoying\n☐ Ruining the game\n☐ The game itself is a big terrarium for bugs\n\n---{Overview}---\nI recommend this Game ★★★★\nNote: Those reviews are based on my opinions :)", "timestamp_created": 1666871153, "timestamp_updated": 1668198796, "voted_up": true, "votes_up": 45, "votes_funny": 5, "weighted_vote_score": "0.740953266620635986", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "134620040": {"recommendationid": "134620040", "author": {"steamid": "76561199368706131", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 93, "playtime_last_two_weeks": 0, "playtime_at_review": 93, "last_played": 1676949560}, "language": "english", "review": "Ive seen the bad reviews and I 100% agree this game is a broken mess monopoly scheme by the developers. Save your time... I notice anytime a bad review gets posted these stans jump in and leave 3 liner \"good reviews\" these same people who are apart of the 25 player a day player base who only play this game 24/7. Quit flooding out the bad reviews with false good reviews because youre asked to on the official discord. Steam needs to remove this mess of a game from the market, it's a borderline scam. 1 Year since last season update/ Server wipe and still selling and pushing people to buy the current season pass which isnt worth it on a dead game. Also you will be banned for any kind of opinion or for even asking when the server wipe is coming, save your time and play a game that isnt run by crybabies. Real games with Real devs dont ban players due to an opinion, thats so incel like. But 0/10 dont get this game it's a broken mess of a game, lags, textures glitch out and is full of Hackers who the devs allow to play the game and wont ban for some reason.", "timestamp_created": 1678743506, "timestamp_updated": 1678743506, "voted_up": false, "votes_up": 38, "votes_funny": 2, "weighted_vote_score": "0.736827254295349121", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "100523668": {"recommendationid": "100523668", "author": {"steamid": "76561199123691431", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 942, "playtime_last_two_weeks": 0, "playtime_at_review": 898, "last_played": 1633385473}, "language": "english", "review": "Dear XERA: Survival game dev's,\n\nThe game is great, amazing idea and trash execution, but that isn't a bad thing. I love the aspects of the games and how they're meant to work, but when those aspects become meaningless because of loophole finding, cheating players it really makes the game unplayable. For example, I joined a server that I had never joined before with a friend of mine, we searched for hours after finding good equipment to place our land claim and start a base of operations for our ever increasing squad numbers. WE COULD NOT FIND A SINGLE SPOT TO PUT DOWN A LAND CLAIM. I am usually a nice and friendly person, but when players abuse game aspects it pisses me off, I believe this should be a HIGH PRIORITY for the game dev's and that they should put everything else to the side until this annoyance is dealt with. Another problem is hacking and toxicity, when players have the ability to shoot you from across the map and then that singular shot insta-kills you, I believe that that is considered a major problem. I have less problems with hacking than I do with manipulation of game rules though, game dev's if you see this PLEASE fix the land claim issue as soon as possible, otherwise this game is unplayable and I will uninstall and leave another review telling players that issues can't be worked out well.\n\nWith Swell Wishes,\nPaul (EvTreeXIVIX)", "timestamp_created": 1633383732, "timestamp_updated": 1633383732, "voted_up": true, "votes_up": 27, "votes_funny": 2, "weighted_vote_score": "0.732559740543365479", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "50893989": {"recommendationid": "50893989", "author": {"steamid": "76561197991317687", "num_games_owned": 598, "num_reviews": 47, "playtime_forever": 423, "playtime_last_two_weeks": 0, "playtime_at_review": 192, "last_played": 1559083553}, "language": "english", "review": "warz at home", "timestamp_created": 1558985428, "timestamp_updated": 1659112220, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.72406005859375", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "100516420": {"recommendationid": "100516420", "author": {"steamid": "76561199188613002", "num_games_owned": 48, "num_reviews": 6, "playtime_forever": 372, "playtime_last_two_weeks": 0, "playtime_at_review": 372, "last_played": 1633297086}, "language": "english", "review": "PLEASE OMG PLEASE REMOVE LANDCLAIMS ITS  SOOOO FRUSTRATING> we have to walk and travel miles and MILES to find a little bit of land to claim then we are raided asap.\nit is so easy to get turned off especially for new players, we cant even build a home.\ntake a note from RUST its exciting for its raids and battles, why don't they have land claim ? BECAUSE ITS BORING AND STRESSFUL.\nWould be actually interesting to play if there was no land claim the whole land is taken by AFK players that are so Over Powered.remove this and then u got a game worth investing time in.", "timestamp_created": 1633373811, "timestamp_updated": 1633373811, "voted_up": false, "votes_up": 35, "votes_funny": 2, "weighted_vote_score": "0.72143709659576416", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "120997783": {"recommendationid": "120997783", "author": {"steamid": "76561198070151891", "num_games_owned": 308, "num_reviews": 9, "playtime_forever": 776, "playtime_last_two_weeks": 0, "playtime_at_review": 703, "last_played": 1661095543}, "language": "english", "review": "The best way i can describe this game in its current state is... Annoying. Its a truly unfortunate review, because its so close to being good.\n\nMost of the stuff i take issue with could just be tweaked, major changes are not needed.\n\nThe Gunplay - Honestly, the best part of this. Though most guns kick too much to use in first person, they work pretty good in third person. The most annoying part of the weaponry is the durability. You can run three or four mags through an ar-15 and nearly be done with the thing, even coming at 75% dura. There is a repair system, and a nearly useless weapon level system, but finding a new weapon is much easier than finding the tools and materials to repair a weapon that does 0.2% more damage. \n\nThe looting - Dear god the looting, tedium at its finest. Most of it is holding e to search crates, and getting the notification its empty. When you do find something, its never exciting. Even looting through military locations, half the crates have a single screwdriver, or wrench, or other redundant tool/mele weapon. When its not loot you already have, or a single water bottle, you might get lucky enough to get a few bullets or a gun, not like those bullets are going to last you long.\n\n\nThe Enemies - The most annoying part, Dayz syndrome at its finest. The most basic enemy taking 5-7 bullets to take down. You could always use mele, but there isnt a reliable way to avoid damage when doing this. The enemies are somewhat unique, Robots that take more damage when you shoot them in the glowing core, right in the middle of their chest. Coming in three glitchy variants. \nRed - The most basic, found everywhere across the map. Taken down with relative ease, and not dealing that much damage. Though when i say \"ease\" I do mean dumping 10 bullets into their chest and hoping that their jagged, super fast movements didn't bob their core too much.\nBlue - What usually would be called the Hunters, or something of the sort. Higher health, much higher damage, spawns only at night (and certain monuments) and barely gets staggered. These things can take nearly a 30 round mag of 9mm right to their core all the while charging you down. \nGreen - The tank. And the most annoying of all. These things are truly tanks, Mega high health, Mega high damage, and an armored exterior protecting their cores. There is no way to solo these things without glitching them. No matter the armor your wearing, they WILL three shot you. They will run just as fast as all the other bots, taking fire from 2-3 people, and NEVER STOP. they will never get staggered, never slow down. The only true thing to fear in this game.\n\nQ : So, how do you deal with these bots? \nA : well, it seems as if the Blue and Green droids cant open doors, so if your looting higher teir areas, most places with doors are safe havens. \nQ : Well okay, but what if i want to kill them? Bring ammo. You think you have enough? Wrong. These things take MAGS of ammo to take down, especially if you want to kill the tanks. \nQ : Well okay, I have ammo, what now? G L I T C H E S. DO NOT take these droids on fairly. Trap them behind doors, exploit their AI so they cant hit you on a table, keep shooting them so they loop in the same spot when they cant reach you. This is true TENFOLD for the tanks. They will kill you in moments, you cant stagger them, and you run slower than them with your guns out. \n\nSo, what do i suggest? well, \n- Increase weapon damage/Decrease droid health. Pvp felt alright in regards with weapon damage, just the droids are annoying.\n- Change looting a bit, either decrease the amount of item crates, or make it so that things actually spawn in the crates. And change looting tables a bit. I don't want to be finding metal pipes in a gun crate, and guns in a materials warehouse.\n- Update the enemies, i'm talking new animations, new path finding, generally a new polish. With the way they move, Its hard to hit them most of the time. Mainly attributed to the fact they don't have a turning animation. All they do is kind of magically pop over to where they need to look, and for movement all they really have is a basic walking animation, and a basic running/angered animation. But even when they have spotted you the most they can do now is walk at you in a straight line and try and \"hit\" you with a janky animation. Its not clear whether they can actually hit you from where your standing, if you can strafe them, or if its always going to hit. There should also be something more unique to the enemies, I've got a few basic ideas.\n\n- the cores instead of headshots is an interesting idea, although it doesn't seem like enough. Maybe instead of just dealing more damage, make it so its an insta kill, but higher tier areas add on layers of armor. You could even counteract this by adding in armor piercing ammunition for the richer players. And for tanks, they already have multiple cores. Slow them down a bit, add in a few extra moves, maybe ranged, and make it so you must shoot out all the cores to kill them. \n\n- You could lean into the robot idea a bit more, Shoot off limbs to cripple them, then move in for the kill. Make different weapons more effective for this. For example, the shotgun isnt great as it is... But if it has the potential to blow off an arm or leg in one shot? Well now, that's great! take an axe to the knee? Maybe it wont chop off a solid steel leg, but it can damage it! Slow robots down to make it easier to kill them. you can go pretty far with this.\n\n- make these things DANGEROUS. Decrease spawns, but make it so any one of these things could kill you. The most basic enemy as it is, well you can just punch it out with your flimsy little flesh arms. These things could be the killing machines they're made out to be, and if you dont come prepared, and shoot accurately, your completely done for.\n\n- Lean heavier on the stealth end, maybe the front end is tankier, but the back has a large core that will stun or kill them. or sneaking up to them with an axe, or a new specialized hacking device is an insta kill. you can even go so far as to add a reverse targeting device. Use that tank to clear out the rest of the monument, or DESTROY YOUR ENEMIES!  \n\nTheres so many things that this game can do to make it great, but its just uninspired. Basic. Tired and done before.\nBut it is playable. Passable for a free game. Just be ready for a ton of jank.", "timestamp_created": 1661090567, "timestamp_updated": 1661090567, "voted_up": false, "votes_up": 37, "votes_funny": 4, "weighted_vote_score": "0.721248805522918701", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "78334077": {"recommendationid": "78334077", "author": {"steamid": "76561198320377259", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 25668, "playtime_last_two_weeks": 0, "playtime_at_review": 25668, "last_played": 1567316470}, "language": "english", "review": "If you like wasting money and waiting years with no real progression, this is the game for you! game has been dead for almost a complete year", "timestamp_created": 1603971990, "timestamp_updated": 1603971990, "voted_up": false, "votes_up": 85, "votes_funny": 13, "weighted_vote_score": "0.719923257827758789", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1603998215, "developer_response": "Thank you for taking time to share your thoughts on XERA: Survival.  Over the past year we have added multiple new features including new progression systems that you might have missed out on.  Seeing as the last time you logged in was at the beginning of September 2019, we would like to have you try the game again in the current state to get your thoughts on the features that have been implemented and provide feedback on what we can do to make the game better in your eyes.\n\nOur team is always happy to brainstorm ideas with the community so feel free to share your ideas once you've had a chance to experience everything we've been able to add over the past year.\n\nCheers"}, "116009956": {"recommendationid": "116009956", "author": {"steamid": "76561198351231550", "num_games_owned": 66, "num_reviews": 24, "playtime_forever": 3598, "playtime_last_two_weeks": 0, "playtime_at_review": 3598, "last_played": 1653515397}, "language": "english", "review": "wallhacking cheaters no anticheat no response for support new update same shit SHITTY TRASH ABUSE YOUR PLAYER BASE WITH UNLIMITED WAYS TO GET HACKED ON SHIT GAME SHIT SHIT SHIT", "timestamp_created": 1653515464, "timestamp_updated": 1653515464, "voted_up": false, "votes_up": 21, "votes_funny": 10, "weighted_vote_score": "0.707214295864105225", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1654700407, "developer_response": "Hi there,\n\nOur team is committed to providing a cheat free environment and utilizes multiple technologies to detect and ban cheaters including Easy Anti-Cheat and our own in house solutions.  We also provide in game tools for players to report others they suspect to be cheating.  All reports are reviewed within 12 hours of the report and to date we have banned over 5500 cheaters.\n\nWhile we appreciate your concern, we can assure you that our team is highly responsive to all cheat reports and takes action as necessary on anyone that is found to be cheating.\n\nFeel free to reach out to us at support@xeragame.com with any concerns."}, "95333376": {"recommendationid": "95333376", "author": {"steamid": "76561198208279771", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 34082, "playtime_last_two_weeks": 0, "playtime_at_review": 10208, "last_played": 1637171232}, "language": "english", "review": "Good game. Just needs more players.", "timestamp_created": 1625755253, "timestamp_updated": 1625755253, "voted_up": true, "votes_up": 25, "votes_funny": 1, "weighted_vote_score": "0.704404175281524658", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "100730793": {"recommendationid": "100730793", "author": {"steamid": "76561199130728042", "num_games_owned": 1, "num_reviews": 2, "playtime_forever": 5724, "playtime_last_two_weeks": 0, "playtime_at_review": 4233, "last_played": 1640805039}, "language": "english", "review": "Great game, lots of content - but guess, what comes with every upcoming survival game? Chinese cheater invasion", "timestamp_created": 1633704630, "timestamp_updated": 1633704630, "voted_up": true, "votes_up": 21, "votes_funny": 11, "weighted_vote_score": "0.703258812427520752", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "105155207": {"recommendationid": "105155207", "author": {"steamid": "76561198035889588", "num_games_owned": 131, "num_reviews": 11, "playtime_forever": 1496, "playtime_last_two_weeks": 0, "playtime_at_review": 937, "last_played": 1682779292}, "language": "english", "review": "Rust, but it's free!", "timestamp_created": 1638554657, "timestamp_updated": 1638554657, "voted_up": true, "votes_up": 18, "votes_funny": 9, "weighted_vote_score": "0.701189815998077393", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "102278288": {"recommendationid": "102278288", "author": {"steamid": "76561198171558105", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 7076, "playtime_last_two_weeks": 0, "playtime_at_review": 6033, "last_played": 1656652873}, "language": "english", "review": "Game is kinda bad. u can abuse so meny buggs , and the community is so toxic, supports dont asnwer if u need help. It seems that u can buy cheats to be \"god\" at this game. we built a big 36 square reinforced base, and we put 28 turrets around the house, and we got raided. none of the turrets shot. none of the walls was broken , and somehow they managed to take all the loot what was well hidden around 36 squres. So how is it possible that you can take a loot out of house without destroying the walls. It was not possible to jump from helicopter on to our base.\n\nSo the point is, i think u should not put any money or none of your time in this game . If you grind so many hours in this game, same will happen to you ,if u ask help wtih questions you dont get any asnwer. There is no point to grind in this game, because if u lose the loot to cheaters they wont get banned, and you wont get your loot and wasted time back.\n", "timestamp_created": 1636140522, "timestamp_updated": 1636140522, "voted_up": false, "votes_up": 24, "votes_funny": 4, "weighted_vote_score": "0.696139872074127197", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "108506057": {"recommendationid": "108506057", "author": {"steamid": "76561198942754788", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 8622, "playtime_last_two_weeks": 0, "playtime_at_review": 7868, "last_played": 1653702249}, "language": "english", "review": "For a game that costs nothing, Xera surprised me. I find myself sinking hours at a time into it, whether i'm playing PvP or PvE, which gives a relaxing play style. This game has a lot of potential in the coming years, so definitely give it a try, the only thing you can waste is your time.", "timestamp_created": 1642822090, "timestamp_updated": 1642822090, "voted_up": true, "votes_up": 17, "votes_funny": 1, "weighted_vote_score": "0.690622091293334961", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "50844800": {"recommendationid": "50844800", "author": {"steamid": "76561198023591324", "num_games_owned": 664, "num_reviews": 42, "playtime_forever": 1501, "playtime_last_two_weeks": 0, "playtime_at_review": 159, "last_played": 1633563853}, "language": "english", "review": "Serious Early Access Review (Will update as necessary) \n\nGame play - Go in, Loot, Shoot, Scoot.\nGame does have a level system with very light crafting system currently\n12 Guns, Not counting the Drone\nCosmetics (Not currently in yet I think? I havent seen them anyways)\n\nPros: \nGame runs pretty smooth and I don't seem to have many optimization issues at all.\n\nGun play is just fine imo\n\nMap Size - 4x4km \n\nCOMPOUND EVENTS - Compound events are AWESOME brining in events in the game allowing players to fight over the compound for 2 loot boxes (so far for two loot boxes) by killing the surrounding AI (35 is the most ive seen so far on a compound event) \n\nAirdrops - Plain and simple, Airdrop events that drop packages.\n\nLots of Loot\n\nHelicopter at Safezones to travel across , you can jump out and parachute towards a location via the Helicopter\nThe AI hurt like they should with MANY different looks and types of AI\n\nCrafting\n\nCons:\nLots of Loot - Now ive added it to both as I feel you can grind the good weapons pretty easily, or atleast just stock up on ARs/smgs/etc  So all depends on your opinion about it.\n\nThe AI as they hurt like they should are slow and easy to kill. Most guns, Including AR and Pistol, Can two shot them in the head, making the AR and more powerful weapons more useless against the AI unless its a boss ofcourse\n\n\nA lot of the buildings look the same aside from defining features  aka  Lumberyard reuses building but is unique with logs and other defining features in the area. \n\n - - - - - \nThe price is 20 dollars. As the game is a lot of fun in its current state it could get stale really quick without friends and if the servers die down\nCurrently two servers were nearing full and I ran into a player multiple times, so you should have no trouble running into people if you are wanting to PvP.\n\nMuch recommended, but do remember not a lot of content as of NOW.", "timestamp_created": 1558818773, "timestamp_updated": 1558818841, "voted_up": true, "votes_up": 25, "votes_funny": 0, "weighted_vote_score": "0.680228769779205322", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "95601358": {"recommendationid": "95601358", "author": {"steamid": "76561198025301039", "num_games_owned": 0, "num_reviews": 89, "playtime_forever": 496, "playtime_last_two_weeks": 0, "playtime_at_review": 496, "last_played": 1626095163}, "language": "english", "review": "Was fun for a min, but US servers are full of Chinese cheaters now. Teleport to you, drop a grenade on your buggy and kill you in PvE servers. Game is still in EA, but the map is rather dull and not eventful. Many other games that haven't been in EA even 1 year have a much bigger, more lively map. Looting unbalanced and is far too easy. Like everyone in the world, their cousin AND grandmother all carried gun suppressors and optics cause they are every 5 feet you go. I will say the building system is at least not bad. That is in its beginning stages so much is still needed to be added like tier 2 work benches.", "timestamp_created": 1626096026, "timestamp_updated": 1626096026, "voted_up": false, "votes_up": 20, "votes_funny": 2, "weighted_vote_score": "0.671090304851531982", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1626976561, "developer_response": "Hi there!\n\nThank you for taking time to share your feedback.  Our team is working around the clock to ensure a cheat free environment and over the past week, more than 1000 cheaters have been banned.  We appreciate your concerns and encourage you to report anyone that's suspicious by using the in game reporting tool so we can continue to remove players that are cheating.\n\nAlso something we want to help with is clarifying that there are actually 3 tiers of workbenches in the game already!  The way you upgrade a workbench is to equip a hammer, and aim at the tier 1 workbench.  From there, right click until you see upgrade appear on the hammer menu.  You can then upgrade your workbench to the next tier.\n\nWe hope this helps and feel free to reach out to us with any other thoughts and ideas and we're always happy to listen.  Our official discord is at https://discord.gg/xera\n\nCheers"}, "102730395": {"recommendationid": "102730395", "author": {"steamid": "76561198238525242", "num_games_owned": 21, "num_reviews": 1, "playtime_forever": 4286, "playtime_last_two_weeks": 0, "playtime_at_review": 4286, "last_played": 1635890315}, "language": "english", "review": "Chaina people have cheets, no one is reacting when they are reported. Dont get this game!! wod be very good if they had some anti cheet.", "timestamp_created": 1636834023, "timestamp_updated": 1636834023, "voted_up": false, "votes_up": 23, "votes_funny": 7, "weighted_vote_score": "0.669613480567932129", "comment_count": 2, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "50824945": {"recommendationid": "50824945", "author": {"steamid": "76561198010966399", "num_games_owned": 166, "num_reviews": 3, "playtime_forever": 1023, "playtime_last_two_weeks": 0, "playtime_at_review": 60, "last_played": 1561934079}, "language": "english", "review": "First impression:\n- Smooth frame rate, combat, hit detection\n- Arcade style shooter\n- Plenty of variations of items for an EA\n- Cool events and NPC sessions around the world\n- Decent sized world if which gives a nostalgic type of feel if you've played Just Survive\n\nMore to come, maybe.", "timestamp_created": 1558771697, "timestamp_updated": 1558771697, "voted_up": true, "votes_up": 32, "votes_funny": 1, "weighted_vote_score": "0.666844189167022705", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "143506781": {"recommendationid": "143506781", "author": {"steamid": "76561199455252207", "num_games_owned": 10, "num_reviews": 1, "playtime_forever": 6290, "playtime_last_two_weeks": 0, "playtime_at_review": 6273, "last_played": 1703015641}, "language": "english", "review": "This game is great for people with lots of time, it's incredibly grindy and fun for a time. One of the biggest issues I have is that it is exceedingly difficult to get anything better than a UMP-9 or a MP5 once you manage to get something like a G36 or one of the 2 types of scars you will get killed by someone with thousands of hours and they'll take everything you own, and your dignity. It has AI in the form of purely melee only robots who you can outrun with ease and cheese them with a buggy so they can't hit you, and it has \"bandits\" that are not worth the trouble finding or doing a Reactor Core event for unless you have a mission to kill them. The game-play is very linear in it's progression until you need to find any of the USBs needed to progress further. The Civilian Bunker Data USB is impossible to find from helicopter crashes (which is the only place I managed to find it) and only gives you access to a bunker that gives higher tier weapons, of which you will definitely lose instantly. The other 3 USB sticks are for one thing called the Crater that give next to nothing unless you get a level 3 access to mine Xoidite-H ore to make the only explosive in the game that does any noticeable damage to structures and even if you get it, it is confined to one server so you can only raid on one server. That's ONLY if you manage to find ANY of the Crater USBs. The only real way to get any of the USBs for the Crater is to buy them from the Survivor Exchange (a player driven economy where people can buy items and sell what they find) for exorbitant prices that are unachievable for the average player. That's only the start, farming for a base is VERY tedious and getting a wood base is easy enough, but getting anything more than that, like a stone or metal base, you have to farm for hours. The only stone/metal/sulfur/copper/silver/gold mining tool is a pickaxe (besides the wood and stone variants) that can be a ground pickup or be found in a box. The servers pretty much wipe once a year, so good luck against all the other multi-thousand hour players who have no life and have had months and months to build up and get gear. Raiding is damn near impossible as I hinted at earlier in the review, with a very limited selection to raid with including Xoidite Explosive Charges, C4, and grenades. Doing 500, 150, and 25 damage respectively with a basic wood wall having 500 health you can see the difficulty in raiding. One of the only good aspects are the 3 modes of transportation, a non-controllable helicopter that travels between the Settlements, a one seater ATV, and a 3 seater buggy. One of the main problems that are stated in other reviews is the extremely low playerbase so i won't go into too much detail on that. \n\nTLDR:\n\nDon't bother unless you have 5 friends to play with.", "timestamp_created": 1691309426, "timestamp_updated": 1691309426, "voted_up": false, "votes_up": 13, "votes_funny": 2, "weighted_vote_score": "0.661682069301605225", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "102730322": {"recommendationid": "102730322", "author": {"steamid": "76561198268930801", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 5746, "playtime_last_two_weeks": 0, "playtime_at_review": 5454, "last_played": 1682094942}, "language": "english", "review": "Have big problem with cheathers. And dont waste time on this game.", "timestamp_created": 1636833912, "timestamp_updated": 1636833912, "voted_up": false, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.659746766090393066", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "59456675": {"recommendationid": "59456675", "author": {"steamid": "76561198243128366", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 100533, "playtime_last_two_weeks": 0, "playtime_at_review": 46269, "last_played": 1640029956}, "language": "english", "review": "Hi Guys,\n\nSo i have been putting this off for a long time and feel like i am ready to submit an accurate review unlike all these negative less than 10 hour reviews!\n\nApproaching 800 hours now i can honestly say that the development team put their heart and soul into this game, they read EVERY single message and review and will respond within 24hrs. There is a fantastic discord setup with a suggestion channel which shows that they care about the community and their ideas; many of these suggestions have already been implemented in the game!\n\nThe PvP side of this game is addictive as the movement, hit reg, weapons and healing is 10/10 with each weapon being well balanced. This helps to provide some fast paced and intense action followed by relief when you finally get that loot safely stored away. Also cheaters are next to non existent with regular scans and a high end detection system blocking all cheats within 24hrs; i know this is a big issue in other games and can kill the fun in PvP.\nPvE has an important place in this game also as the environment is beautiful and well optimized, allowing you to play in high settings with good fps and creating fantastic opportunities for some great photos. Tip: use a drone, go first person and hide HUD.\nNew events are regularly being added and the map has had some rework to enable players to constantly be in action and make the game enjoyable. ATVs have improved in a HUGE way which is something other games have failed to do, the vehicles can cause multiple issues and perfecting them shows the true hard work and dedication from developers.\n\nThere is already HUGE hype building around this game with talks of base building around the corner and more customization options for your character and their outfit. I believe that base building will be the reason this game blows up!\n\nI would strongly recommend that people take a minute to read ALL of these reviews and see for themselves that the ones complaining and submitting negative reviews are nothing more than salty kids that refuse to give the game a fair chance. This game is in Early Access and already has much more to offer than some of the biggest games out there!\n\n\nMuch Love,\n\nJay Rossi (Rocket Man)\n", "timestamp_created": 1575761777, "timestamp_updated": 1575761777, "voted_up": true, "votes_up": 35, "votes_funny": 3, "weighted_vote_score": "0.6573600172996521", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "128736920": {"recommendationid": "128736920", "author": {"steamid": "76561198184615042", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 8600, "playtime_last_two_weeks": 0, "playtime_at_review": 8576, "last_played": 1700190516}, "language": "english", "review": "Has amazing potential but is going to waste right now. You have multiple full clans allying together, playing with multitudes of stashed explosives. You become a lapdog or get raided every night.\n\nThere needs to be a better system so people can't create 10 ALT accounts to store infinite loot- Level requirement for backpacks? Nothing crazy but enough to prevent a lvl 1 account to store 80kg worth of loot. \n\nYou can also log out inside the crater lab and free farm batteries/duct tape etc. every 20 mins without having to use another card. Just bring 100 rad pills and leave your alt in there all day, walk out with 50 c4. Another ridiculous exploit. Make a logout feature or something to push logged out accounts outside. \n\nThere are so many problems like these and I can't tell if the devs dont know or simply dont care. Potentially a great game but its currently unplayable. \n\nand its been 7 months! Wipe the game!\n\n", "timestamp_created": 1671295212, "timestamp_updated": 1671295212, "voted_up": false, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.651194870471954346", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "132960930": {"recommendationid": "132960930", "author": {"steamid": "76561198272559876", "num_games_owned": 4, "num_reviews": 122, "playtime_forever": 304, "playtime_last_two_weeks": 0, "playtime_at_review": 286, "last_played": 1699053522}, "language": "english", "review": "DayZ from Wish.", "timestamp_created": 1676545599, "timestamp_updated": 1676545599, "voted_up": false, "votes_up": 18, "votes_funny": 14, "weighted_vote_score": "0.650747060775756836", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "101749313": {"recommendationid": "101749313", "author": {"steamid": "76561198096170268", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 7031, "playtime_last_two_weeks": 0, "playtime_at_review": 5663, "last_played": 1635778599}, "language": "english", "review": "UPDATE 1st November 2021: Major, game breaking abuse is possible in the game. Apparently it is possible to clear the pincodes of enemy player's base doors and windows. This renders the game unplayeable, since enemies can walk into your base and take all your grinding profits. The devs dont seem very interested in looking into this, despite multiple players reporting this issue. I uninstalled the game for now, will be back if this issue is completely fixed. \n\nUPDATE END, original positive review below:\n\nNice survival grinding game with the typical friendly, helpful and toxic players in appropriate proportions. The game has still a lot of QOL to be improved, and the tiny dev team is working hard on it. \n\nXera: Suirvival is a chill game for those who like to loot, grind and get kicks from finding the rarer supplies. The tech tree is straight forward and manageable. At first the objective of the game is not quite clear. Yet it is simple, like in any survival game: to live long and prosper. \n\nSo at first you start with the very basic stick collecting and food gathering. After you got the basic tools and weapons you start to feel the need to settle down. You will want to establish a base for protection of yourself and the precious, hard earned belongings. At your base you can also upgrade and mend your gear, as well as craft gear that cannot be found in the world like C4 explosives. To get your basic base and gear set up takes about 10-15 hours gaming time. \n\nAfter a lot of hours and making some battle buddies, you are ready to go out and raid other player's bases. Or you can focus on being a hedgehog and create the impenetrable fortress. Or you can complete the challenges around the map to get rewards like better weapons and armor.\n\nThe game offers sufficient amount of action for those who want to fight. But before you get to this point, you'll want to get at least some body armor and something else than a handgun!", "timestamp_created": 1635416241, "timestamp_updated": 1635780119, "voted_up": false, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.649862945079803467", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1637628612, "developer_response": "Thank you for sharing your thoughts.\n\nOur team has investigated your report of being able to remove pin codes from objects and there is no evidence of this happening.  The only people who are able to add or remove pin codes are those who placed the original object.\n\nWe hope this helps clarify any confusion and feel free to reach out to us via our official discord if you have any questions."}, "50998375": {"recommendationid": "50998375", "author": {"steamid": "76561198013927029", "num_games_owned": 464, "num_reviews": 3, "playtime_forever": 334, "playtime_last_two_weeks": 0, "playtime_at_review": 117, "last_played": 1660474837}, "language": "english", "review": "Overall I like the game.\n\nBut 4 player groups are ruining experience for solos and 2 player groups. \n\nEdit: There are now experimental servers added without grouping system enabled to make it easier for solos.", "timestamp_created": 1559413893, "timestamp_updated": 1560718717, "voted_up": true, "votes_up": 18, "votes_funny": 2, "weighted_vote_score": "0.648918390274047852", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "50867554": {"recommendationid": "50867554", "author": {"steamid": "76561198199720173", "num_games_owned": 601, "num_reviews": 33, "playtime_forever": 333, "playtime_last_two_weeks": 0, "playtime_at_review": 60, "last_played": 1690707951}, "language": "english", "review": "As of right now i wouldn't say it's worth 16,79€ but the potential is there, also reminds me of The WarZ/Infestation so please don't pull a sergey", "timestamp_created": 1558890370, "timestamp_updated": 1558964982, "voted_up": false, "votes_up": 53, "votes_funny": 18, "weighted_vote_score": "0.642539083957672119", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "100149461": {"recommendationid": "100149461", "author": {"steamid": "76561198088099660", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1220, "playtime_last_two_weeks": 0, "playtime_at_review": 470, "last_played": 1634380840}, "language": "english", "review": "Not just your average shoot and loot,  Only just played a couple of days but  my time so far has been some of the most enjoyable time gaming ive had all year", "timestamp_created": 1632912344, "timestamp_updated": 1632912344, "voted_up": true, "votes_up": 14, "votes_funny": 3, "weighted_vote_score": "0.641574084758758545", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "50828656": {"recommendationid": "50828656", "author": {"steamid": "76561198017013349", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 755, "playtime_last_two_weeks": 0, "playtime_at_review": 95, "last_played": 1559368531}, "language": "english", "review": "Very Fun with an active dev in the game chat talking to people and receiving feed back and answering questions !", "timestamp_created": 1558780948, "timestamp_updated": 1558780948, "voted_up": true, "votes_up": 33, "votes_funny": 4, "weighted_vote_score": "0.640315413475036621", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "54695898": {"recommendationid": "54695898", "author": {"steamid": "76561198012240814", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 5438, "playtime_last_two_weeks": 0, "playtime_at_review": 5438, "last_played": 1561898508}, "language": "english", "review": "the team thinks they lack players because of missing content but the truth is the gameplay itself is the problem, their so called ingame events are campfests, you have 0 mechanics to fight against campers and the ttk is so low that a camper can only win \n\nwhen you die, you have to respawn in safezone to gear up and wait for a helicopter to get back to the action/your friends -> BUT the helicopter is random and might fly in a complete different direction -> so you can either wait inside the other SZ and try again or play a walking simulator \n\nnobody plays this game anymore - it died quicker than any warz / iss clone i can remember -> not even 10 different players within 24 hours\n\nafter 90 hours of playtime i highly recommend to NOT buy this since it literally feels like a scam at this point", "timestamp_created": 1566205915, "timestamp_updated": 1566206291, "voted_up": false, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.638914227485656738", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "55697272": {"recommendationid": "55697272", "author": {"steamid": "76561198006175988", "num_games_owned": 0, "num_reviews": 105, "playtime_forever": 66, "playtime_last_two_weeks": 0, "playtime_at_review": 66, "last_played": 1571624992}, "language": "english", "review": "Been to 2 servers, no loot whatsoever, killed several robots with metal pipe. Some guy dropped ar15, then I found some 5.56 ammo, but ar15 still shows 0 rounds.\nCompletely pointless at this point, but they did not hesitate to add crates and some some other microtransactions.\nAnother wasted developer time.", "timestamp_created": 1571625229, "timestamp_updated": 1571625229, "voted_up": false, "votes_up": 39, "votes_funny": 4, "weighted_vote_score": "0.638280093669891357", "comment_count": 4, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1571642268, "developer_response": "Hi there!\n\nThanks so much for trying the game out during the free weekend!\n\nThe AR-15 takes .223 rounds, this is so we can control the spawn rate. It is also because the AR-15 can take different rounds. \n\n\"The difference in the round itself: the NATO round is a little hotter. The case is the same size, but the powder charge, projectile and also rifle specifications differ. As a result, make sure to check your AR-15 to see which it’s chambered for, as not all AR-15 rifles sold to civilians are the same.\"\n\n\"The standard loading is NATO SS109 (aka M855) which uses a 62-grain projectile. The powder charge for that round is on the hot side, which is loaded to chamber pressures around 62,400 psi in a rifle chambered for 5.56mm NATO. In a rifle chambered for .223 Remington, the round produces chamber pressures upward of 70,000 psi, if going by SAAMI (the Sporting Arms and Ammunition Manufacturers Institute) standards.\n\nBy contrast, .223 Remington tends to produce lower chamber pressures between 52,000 and 55,000 psi, going by SAAMI specs. Therefore, 5.56mm NATO ammo isn’t safe for use in a rifle chambered for .223 Remington, but .223 is OK in 5.56. Thus, powder charge is the main difference between 5.56 vs .223 cartridges.\"\n\nFeel free to read more on the difference here: https://www.thetruthaboutguns.com/5-56-vs-223/\n\nHope this clears it up!\n\nCheers"}, "153287980": {"recommendationid": "153287980", "author": {"steamid": "76561199446949786", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 4587, "playtime_last_two_weeks": 0, "playtime_at_review": 2484, "last_played": 1712162116}, "language": "english", "review": "full of cheaters and admin abusers this is why the game has 50 players max laying in the world", "timestamp_created": 1702205869, "timestamp_updated": 1702205869, "voted_up": false, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.638009071350097656", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "78326225": {"recommendationid": "78326225", "author": {"steamid": "76561197968756327", "num_games_owned": 977, "num_reviews": 39, "playtime_forever": 446, "playtime_last_two_weeks": 0, "playtime_at_review": 273, "last_played": 1605916443}, "language": "english", "review": "[h1] The Machine Takeover: DayZ With Robots [/h1]\n\n[b] Who Will Like It [/b]: Those who enjoy survival games with permanent item loss (DayZ & SCUM) but prefer a more arcade-y feel and smaller map.\n\n[b] Who Won't Like It [/b]: Those who want more tactical combat, a larger map, or don't enjoy fighting robotic enemies.\n\nIt's easy to see screenshots of XERA: Survival and immediately think it's another \"survival crafting asset flip\". I bought it with extremely low expectations and can honestly say that I was dumbfounded by the quality and attention to detail. \n\nSo what is it? XERA is an open world survival game with PvP and PvE elements. It's primary gameplay loop is similar to that of DayZ, except on a much smaller and \"arcade-y\" scale. The map is generously filled with loot, robotic enemies (Humanoids), and in-game events that trigger periodically over the course of your session. These events add a very \"alive\" touch to what could have otherwise been a very static game world. They are broadcasted frequently through your comm system and add optional (and rewarding) challenges to your session.\n\nYour character gains experience for every action (looting, killing enemies, completing events, etc) and levels accordingly. Players have two \"Base Camps\" that act as HUBS where they can deposit looted items into a Global Stash for safekeeping, purchase/sell items, repair equipment, and pay for a helicopter ride across the map. These HUBS also act as safezones and recharge hunger, thirst, and health levels while inside. \n\nDeath in XERA is not as frustrating as it's predecessors. Upon being killed, all loot/gear is dropped and can be reclaimed within 15 minutes of respawning. Death does not reset your character level, nor does it deduct items from your Global Stash. This system adds a very refreshing \"mobility\" and \"permanence\" to a genre where headshots usually end 15 hours of progress and start you from scratch.\n\nIt performs fantastically too. Only in very rare instances did I encounter frame drops and usually maintained 60-70 FPS throughout. Character motion is fluid and can seemlessly alternate between 1st and 3rd person viewpoints. Firearms are abundant and pack a fun punch against the robotic foes, who often amass in large numbers, especially in the denser areas.\n\nXERA also has an extremely generous crate system that rewards the player with weapon cosmetics each time a level is gained. I typically despise when games implement this, but here, it isn't stupidly obnoxious or greedy. The option to purchase crates is there, but not in your face. Lots of awesome skins are gained just by playing, with the option to even grab some through the Steam Marketplace at insanely low prices. I ended up grabbing 2 or 3 Halloween skins that cost about 12 cents each. \n\nLastly, I cannot praise the development team enough here. They are extremely responsive in forums and Discord to any and all feedback. In a few occasions, they even hopped into my server just to chat and wish me a fun session. As an indie dev team, this communication goes a long way in establishing trust with a consumer. From what I have seen, these guys love what they do, and it shows in their interaction with the players. Hats off to the team.\n\nThe only downside here is the low player base. That being said, the small community that is routinely active is extremely friendly and a joy to play with. It is my hope that more players gravitate toward the game as it continues improving.\n\nWould I recommend XERA? Absolutely. It's a fresh take on the survival genre: One that is not obnoxiously large, difficult, or punishing as those before it. It offers a wealth of things to do and smooth gameplay to make those things enjoyable. It offers themed events (with themed loot) and is backed by a staff of passionate and friendly gamers that love what they do. As long as the low player count is not a turn off, you are in for one wild and satisfying ride.", "timestamp_created": 1603956233, "timestamp_updated": 1610095792, "voted_up": true, "votes_up": 24, "votes_funny": 2, "weighted_vote_score": "0.636279821395874023", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "148511080": {"recommendationid": "148511080", "author": {"steamid": "76561198162153970", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 5004, "playtime_last_two_weeks": 0, "playtime_at_review": 5004, "last_played": 1697751728}, "language": "english", "review": "People duping items, hacking, glitching is rampant. there is no way to protect a base from raiding if you're not online 24/7. it takes about 5 minutes to raid a base when you're geared. the explosives to do it are hard to get in mass, near impossible...except people can dupe so once they get a couple no base is safe. \n\ntoxic community, inactive devs/mods...unless you say something negative on their discord about the game... they ban you for that. don't waste your time. its free for a reason", "timestamp_created": 1697754483, "timestamp_updated": 1697754483, "voted_up": false, "votes_up": 9, "votes_funny": 2, "weighted_vote_score": "0.636171102523803711", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "78551202": {"recommendationid": "78551202", "author": {"steamid": "76561198069870915", "num_games_owned": 0, "num_reviews": 31, "playtime_forever": 95, "playtime_last_two_weeks": 0, "playtime_at_review": 95, "last_played": 1603746479}, "language": "english", "review": "Played for 30 minutes. Hat to do some errands came back and when I tried to loggon again it said my account has been disabled. No email no message I went to their website and sent a ticket to find out whats going on. over a week and no responce. steam gave me a refund..thanks steam. can't have every game go from early alpha to full release. Thanks again.", "timestamp_created": 1604263047, "timestamp_updated": 1604263047, "voted_up": false, "votes_up": 44, "votes_funny": 5, "weighted_vote_score": "0.629519820213317871", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1604270294, "developer_response": "Hi Gene,\n\nI looked into your issue and an email was sent to our team on October 26th at 4:46PM.   Our team sent an email  at 4:56PM that same day requesting additional information since the steam id you provided did not show up in our records.  On October 27th, a follow up email was sent and we never received a response. \n\nUpon looking at your account, we do not show that any account restrictions have ever been placed to restrict access to any of our servers.  We are happy to look further into the situation if you want to shoot me a direct email at support@xeragame.com.  You can also reach out to me directly via discord at https://discord.gg/xera (User: IcedYoshi), and I can resend you the emails that were sent at the time when your ticket was opened.\n\nWe apologize for any misunderstanding and hope to hear from you soon to learn more about your situation.\n\nCheers"}, "116348925": {"recommendationid": "116348925", "author": {"steamid": "76561198091882478", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 30677, "playtime_last_two_weeks": 0, "playtime_at_review": 20025, "last_played": 1687168491}, "language": "english", "review": "I bought this game for seasson 1, and played 2 seassons, it was ok. Then came back to seasson 5, played a decent amount and enjoyed it, lack of content, but the stuff implemented was fine. A couple days ago, I tried to play the just released seasson 6, and patch notes were: we changed 2 little things in-game, but we added a new seasson pass, 234554 new skins, new crates, new boxes, new weapon skins, etc. Tried to play, but the game was exactly the same as the last seasson, nothing changed at all, they have given priority to useless stuff instead of improving the game.", "timestamp_created": 1654115119, "timestamp_updated": 1654115119, "voted_up": false, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.627268612384796143", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "78364536": {"recommendationid": "78364536", "author": {"steamid": "76561198071606129", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 77403, "playtime_last_two_weeks": 4, "playtime_at_review": 3561, "last_played": 1713115296}, "language": "english", "review": "Great game, just needs some players and more time.", "timestamp_created": 1604009648, "timestamp_updated": 1604009648, "voted_up": true, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.622393250465393066", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "50912313": {"recommendationid": "50912313", "author": {"steamid": "76561198104364804", "num_games_owned": 237, "num_reviews": 34, "playtime_forever": 587, "playtime_last_two_weeks": 0, "playtime_at_review": 98, "last_played": 1559402852}, "language": "english", "review": "Actually pretty fun, definitely some hints of old H1Z1 and DayZ along with Escape From Tarkov's loot saving system. \n\nLong way to go in terms of development, it's hard to even say it's anything more than an Alpha at this point, but as long as the dev keeps at it I'm sure it'll have a decent playerbase.\n\nAlso, I wouldn't play it without friends.", "timestamp_created": 1559059935, "timestamp_updated": 1559059935, "voted_up": true, "votes_up": 17, "votes_funny": 2, "weighted_vote_score": "0.620827257633209229", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "50856358": {"recommendationid": "50856358", "author": {"steamid": "76561198002831257", "num_games_owned": 725, "num_reviews": 5, "playtime_forever": 2406, "playtime_last_two_weeks": 0, "playtime_at_review": 759, "last_played": 1560150831}, "language": "english", "review": "Well Goddam, they've done it. They have revived the Genre, if you were a fan of games like WarZ/Infestation/Nether this will be straight up your alley. \n\nIf you think this is some nice little PVE against robots type game you're dead wrong, you will get attacked by a player or several players, it's part of the game and it's what makes it so damn special,  the risk of losing everything in your backpack at all times, the rush of killing a player and discovering he had fantastic loot and the hype of opening a crate and getting a rare item.\n\nIt's extremely polished for an Early access game and there's plenty of players to have a good time, robots aren't super complicated but they're damn satisfying to shoot. Map is small enough to not be a walking simulator, but big enough so you won't constantly find people ready to kill you.\n\nIf you like the constant threat of pvp and risking your loot (Well, whatever you're carrying) you'll love this game like I do.", "timestamp_created": 1558860456, "timestamp_updated": 1558940725, "voted_up": true, "votes_up": 30, "votes_funny": 3, "weighted_vote_score": "0.616861581802368164", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "55703759": {"recommendationid": "55703759", "author": {"steamid": "76561198047985807", "num_games_owned": 2421, "num_reviews": 161, "playtime_forever": 35, "playtime_last_two_weeks": 0, "playtime_at_review": 30, "last_played": 1571669971}, "language": "english", "review": "This is one of the worst games I've ever played. \n\nDo they really need to set up a free weekend for this? Better to hide it...", "timestamp_created": 1571669966, "timestamp_updated": 1571669966, "voted_up": false, "votes_up": 21, "votes_funny": 7, "weighted_vote_score": "0.614366769790649414", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "143509943": {"recommendationid": "143509943", "author": {"steamid": "76561198941312515", "num_games_owned": 18, "num_reviews": 7, "playtime_forever": 867, "playtime_last_two_weeks": 0, "playtime_at_review": 284, "last_played": 1702716960}, "language": "english", "review": "A poor man's Rust; what do you expect? Keep your expectations low. Other than that an okay game.", "timestamp_created": 1691313909, "timestamp_updated": 1691313909, "voted_up": true, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.608686268329620361", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "69794008": {"recommendationid": "69794008", "author": {"steamid": "76561197961123178", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 7857, "playtime_last_two_weeks": 0, "playtime_at_review": 7842, "last_played": 1603911992}, "language": "english", "review": "Xera was/is suppose to replace what a lot of people from another game lost and thats WarZ. For some they thought it to be a trash game but others really enjoyed the combat/pvp.\n\nThis game has had some improvements over the time and after revisiting since launch recently, it still lacks the aspect that people liked in WarZ. The Easy looting and the ability to get guns and 3rd person pvp with a barricade to give you the ability to make plays and push other people. \n\nI can say this game still needs a good hand of improving, Ill keep revisiting to see if anything changes for the better.\n\nCons: Guns are hard to come by.\nRobots can be a tad annoying with how they just jump to counter you standing on anything.\nAmmo and supplies are scarce, making it tough to actually enjoy pvp.\nRespawn's are kind of janky but its like they are still trying to give people a chance to make a come back for their gear but it lacks.\n\nPros: Movement is fluid and doesn't get stuck and lag behind\nHitboxes are pretty good, no janky bullshit with it.\nGetting around the map isnt too much a hassle.\nRegenerating health from food bar", "timestamp_created": 1590431053, "timestamp_updated": 1590431053, "voted_up": false, "votes_up": 9, "votes_funny": 1, "weighted_vote_score": "0.608111321926116943", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1590444810, "developer_response": "Thank you for taking time to write a review.  Your feedback is very helpful for our team and we certainly will take it into consideration for future updates.  \n\nIn regards to having a barrier for protection, we have added sandbag barriers that can be crafted and deployed in order to help players be able to have added protection when engaging in combat.  If you get a chance to try these out, feel free to send us your feedback and thoughts at support@xeragame.com.\n\nWe appreciate your time and don't hesitate to reach out to our team members via discord with any additional ideas you might have.\n\nCheers"}, "148356896": {"recommendationid": "148356896", "author": {"steamid": "76561199149812428", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1663, "playtime_last_two_weeks": 0, "playtime_at_review": 1663, "last_played": 1697311774}, "language": "english", "review": "very good for free ,be ready to be mad at players tho.", "timestamp_created": 1697491875, "timestamp_updated": 1697491875, "voted_up": true, "votes_up": 10, "votes_funny": 3, "weighted_vote_score": "0.606131613254547119", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "94636360": {"recommendationid": "94636360", "author": {"steamid": "76561199005167525", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 8818, "playtime_last_two_weeks": 0, "playtime_at_review": 893, "last_played": 1626170323}, "language": "english", "review": "HIGHLY RECOMMEND this - good take on survival, base building, fight for resources / weaponry genre. \n\nEspecially recommended if you enjoyed any of the \"Titov\" games. WarZ / I:SS Etc. Get in game now!", "timestamp_created": 1624949272, "timestamp_updated": 1624949272, "voted_up": true, "votes_up": 16, "votes_funny": 2, "weighted_vote_score": "0.605895340442657471", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "50852945": {"recommendationid": "50852945", "author": {"steamid": "76561198053306820", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 503, "playtime_last_two_weeks": 0, "playtime_at_review": 439, "last_played": 1598698570}, "language": "english", "review": "Pretty good game if you enjoy PVP with enough PVE content inbetween encounters", "timestamp_created": 1558848766, "timestamp_updated": 1558848766, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.605518043041229248", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "78500791": {"recommendationid": "78500791", "author": {"steamid": "76561197992012153", "num_games_owned": 3045, "num_reviews": 161, "playtime_forever": 359, "playtime_last_two_weeks": 0, "playtime_at_review": 88, "last_played": 1628750782}, "language": "english", "review": "I can't really see the direction the game is going, you know the end goal of its design. Even after reading through their open developer roadmap Trello.\n\nIt appears to be following in the footsteps of failed PvP/PvE survival sandbox games like WarZ, H1Z1 (survival) and all those similar early 2010's DayZ copy-cats.\n\nLacking proper implementation currently are skills, base building, in-depth crafting and interesting PvE fights. As it stands this game is a mediocre PVP sandbox with little-to-no players to PVP with.\n\nMy question to the developers is: Why follow the same path of many failed games before you? Do something to stand out? You have a couple of interesting ideas: the helicopter runs I thought was one of them. The current gameplay loop is quite tedious and does not excite me when most enemies die in 2 headshots.\n\nEDIT: For the sale price if you have some friends definitely pick up the game and have a spin, once there is more PVE content with the bases etc as the developer has responded you'll have a much better time. I'll check the game out again in a few patches and update accordingly.", "timestamp_created": 1604199620, "timestamp_updated": 1604730437, "voted_up": false, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.604367256164550781", "comment_count": 2, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1604727207, "developer_response": "Hi there,\n\nThanks for taking the time to write a review. It’s unfortunate that you cannot see the end goal for the design of the game. As you mention – the upcoming content is listed on our roadmap. Although we don’t go into exact detail on all the upcoming features due to competition – but I can assure you that everything that we work on we attempt to add to the genre, rather than copy. We are always working on ways to re-define the genre and I think that our implementation of base building will be a first for this genre. \n\nAs you also mention, “lack of implementation” is just a stage of early access. Everything you mention is being worked on, including skills, base building and more crafting options. We also have a lot of PVE content on its way with base building – for example protecting your base from humanoid raids.\n\nTo answer your question – we are not following in any path of “failed games”. We have always made an attempt to be unique in any way we can – being the first survival humanoid apocalypse game for one. We have lots of other content which in your playtime (1.5 hours) you would have not come across. Our focus is progression and longevity and levelling up unlocks new content (which you would not have been able to access straight away). \n\nI recommend that you try the game again in Season 4 as there will be more content that will be more aligned with what you are looking for in the game.\n\nThanks again for trying the game out.\n\nRegards,\nJoshua"}, "113366262": {"recommendationid": "113366262", "author": {"steamid": "76561198812174506", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 8648, "playtime_last_two_weeks": 0, "playtime_at_review": 8648, "last_played": 1649137301}, "language": "english", "review": "My husband and I enjoyed the game play and the survival and building aspect of this game. As for the pvp with other players go, this was absolutely mind boggling how it takes so much time and effort to build a base up to metal and someone just comes along and destroys it in seconds after wasting days and weeks all of that time in game to build it. Agree with others its a toxic environment that stacks everything against new players because they really don't know where to go or the controls and the higher up players can just destroy the new bases and use exploits to take you out in seconds. You can't find out where the bandits are to get past the missions because they rarely spawn. You dont get to keep your seasonal loot if you find it - other people just come and take it so theres no point in obtaining it and everything just gets wiped anyways. You work hard for nothing essentially. There's no good items given in the season to make it worth playing either. If you can't keep it what is the point?! Uninstalled this game after we played for over 6 months because it isn't worth the amount of time you have to spend building and upgrading to have it destroyed. PVP should have some of that aspect but should not be stacked against new players and safeguarded against hacking/exploiting. It's basically work hard, spend hours of work WASTING TIME with no real progress to build into over time or make it worth playing.", "timestamp_created": 1649138499, "timestamp_updated": 1649138499, "voted_up": false, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.604152798652648926", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "139754558": {"recommendationid": "139754558", "author": {"steamid": "76561198338026466", "num_games_owned": 63, "num_reviews": 15, "playtime_forever": 56, "playtime_last_two_weeks": 0, "playtime_at_review": 56, "last_played": 1686259360}, "language": "english", "review": "Too close to another land claim", "timestamp_created": 1686259393, "timestamp_updated": 1686259393, "voted_up": false, "votes_up": 10, "votes_funny": 12, "weighted_vote_score": "0.603127598762512207", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "100788185": {"recommendationid": "100788185", "author": {"steamid": "76561199067093970", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1514, "playtime_last_two_weeks": 0, "playtime_at_review": 899, "last_played": 1634240064}, "language": "english", "review": "Slaps like my sister stuck in the washing machine...", "timestamp_created": 1633792886, "timestamp_updated": 1633792886, "voted_up": true, "votes_up": 12, "votes_funny": 27, "weighted_vote_score": "0.601190805435180664", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "100045697": {"recommendationid": "100045697", "author": {"steamid": "76561198293056205", "num_games_owned": 74, "num_reviews": 6, "playtime_forever": 1718, "playtime_last_two_weeks": 0, "playtime_at_review": 1454, "last_played": 1640829366}, "language": "english", "review": "LOW SPEC FRIENDLY AND FINALLY! A SURVIVAL GAME WITH NO ZOMBIES!\nI'm very happy I found this. The devs are awesome (very involved with the community). It's such a relief that my GTX 960 can handle this game SURPRISINGLY GOOD. The game itself feels good, I love everything about it and I'm glad to be a part of it.", "timestamp_created": 1632758355, "timestamp_updated": 1632758355, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.600252330303192139", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "101965473": {"recommendationid": "101965473", "author": {"steamid": "76561198116500370", "num_games_owned": 21, "num_reviews": 9, "playtime_forever": 42075, "playtime_last_two_weeks": 4, "playtime_at_review": 4516, "last_played": 1713455370}, "language": "english", "review": "I Like This Game! I'm old H1Z1 Just Survive Player and XERA: Survival is something the same! Playing PVE Only!\n\nDon't forget to add CB Radio!", "timestamp_created": 1635690161, "timestamp_updated": 1635690161, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.600232303142547607", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "100491329": {"recommendationid": "100491329", "author": {"steamid": "76561198171208411", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1873, "playtime_last_two_weeks": 0, "playtime_at_review": 1873, "last_played": 1633338731}, "language": "english", "review": "Too many cheating Chinese, they jump from the ground to the roof, they use aimbot program to kill other players using pistol from 100 meters distance. Fuck those trash Chinese hackers!!!", "timestamp_created": 1633340937, "timestamp_updated": 1633340937, "voted_up": false, "votes_up": 11, "votes_funny": 5, "weighted_vote_score": "0.598958373069763184", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "50959476": {"recommendationid": "50959476", "author": {"steamid": "76561198062898111", "num_games_owned": 0, "num_reviews": 40, "playtime_forever": 17, "playtime_last_two_weeks": 0, "playtime_at_review": 17, "last_played": 1559235773}, "language": "english", "review": "saw the term \"loot box's coming soon\" on the main menu. \n\nUninstalled it.", "timestamp_created": 1559236263, "timestamp_updated": 1559236263, "voted_up": false, "votes_up": 157, "votes_funny": 71, "weighted_vote_score": "0.598489046096801758", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "154095334": {"recommendationid": "154095334", "author": {"steamid": "76561199180928451", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 123, "playtime_last_two_weeks": 0, "playtime_at_review": 123, "last_played": 1697909045}, "language": "english", "review": "Nothing wrong with this dying game. But absolutely pathetic excuse of a development team. \n\nFirst you ban people without rhyme or reason, ban them from the discord, then IP ban them so they cant submit support tickets. Then when you go public with a negative review on steam less than 36 hours later people finally start doing their jobs. Amazing how the world works. Its like you two want your game to die. \n\n\nDevs got butthurt that I used their real names in a steam review then not 24 hours later they banned my account. After months of silence. Let that sink in. :)\n\n****UPDATE 2/21/2024****: \n\nJosh, Its crucial to adhere to the voice of your community when someone asks \"when is the wipe\". There wont ever be a wipe, many of us are convinced. If you truly cared about this game and LISTENED to the community, youd have already fixed the issue thats causing you to \"not wipe the game\". Theres people trying to help you, and you wont accept it. Instead, youre milking xcoin purchases to fund whatever alt projects you have going on behind the scenes, while also losing players. (Ill remind everyone here player count has been below 100 avg. monthly players since SEPTEMBER OF 2022)\n\nYou want the instructions on how its done, you know exactly who to contact, and you wont. \nWhy continue to waste time? No, its not the cheaters, its not the duplicators, its not the auto clicker users, its the solo developer who cant seem to put time and effort into fixing lines of code in a game people have cared about for years. I'm sorry, but if you consider me using an auto clicker to craft 1000+ planks sitting AFK an \"unfair advantage\", maybe you should reevaluate your TOS. I've been doing it for years, and you finally caught me. *slow clap*\n\nBe honest with your community. They need it. Stop having Yoshi telling people \"I know just as much as you all do\" That is the most slap in the face response to xera lovers.  \n\nI hope you get your head out of your ass and into those C++ books, seems like you're stuck. ¯\\_(ツ)_/¯", "timestamp_created": 1703204048, "timestamp_updated": 1708516613, "voted_up": false, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.598480939865112305", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1707786010, "developer_response": "Hello,\n\nThank you for bringing this to our attention. It's crucial to adhere to the terms of service of our game to ensure fair play for all participants. Using software to gain an unfair advantage violates these terms and compromises the integrity of the gaming experience for others. We take such breaches seriously and will take appropriate action to address them. We appreciate your understanding and cooperation in maintaining a fair and enjoyable gaming environment for everyone.\n\nBest regards,\nJoshua"}, "50831733": {"recommendationid": "50831733", "author": {"steamid": "76561198111968405", "num_games_owned": 2283, "num_reviews": 209, "playtime_forever": 305, "playtime_last_two_weeks": 0, "playtime_at_review": 136, "last_played": 1663490792}, "language": "english", "review": "Valve should really implement neutral review, just like in this case. Game is not bad nor good at this point.\nBefore pro's and con's you should know that this remind me the most of Rust, no there is no building feature, there is crafting but it's very poor and limited.\nWhy Rust? You will know first time you get in decently populated server. For example if you enter server with 20 players not even mentioning full server of 40 people, not only that you won't be able to find and loot any weapons but you will be killed on sight.\nCamping kids game at it's best. Maybe developer should implement something like from Fallout 76 that items/npc's respawn on new player entering zone. This way it's very unbalanced, but ok, it's early access so it's forgiven.\nI won't mention any of bugs since they are not gamebraking, but there are, a lot of them.\nAt current state maybe it would be best to play with a friend or two, just to save yourself from unnecessary rage :)\n\n[b]Please be aware that these mentions are just for current state of the game, I may update review on later date![/b]\n\n[b]Pro's;[/b] \n\n+ For EA game is surprisingly running very smooth, never droping below 90fps\n+ Steam intentory cosmetics\n+ Price, I think its fair comparing it to other games of this genre\n+ Potential to be great game\n+ Global stash (very promising feature)\n\n[b]Con's;[/b]\n\n- Global Stash (risk of loosing everything on server wipes,updates etc)\n- Mostly asset stock models in game \n- Lack of assets (like interior of buildings, outdoor, vehicles, items), well lets just say it needs more of everything  :)\n- Map is too small for 40 players playing it at same time, then game becomes shooting practice at live targets.\n- Achievements not working\n- Developer reviewing his own game. ...really dude?! Not cool\n\n\n\n\n[b]TL;DR[/b]\nYeah you can give it a try for this price and support development, HOWEVER do it with friend/s. It's not very enjoyable alone.\n\nI'm giving it negative review to keep  up the balance, it does not deserve mainly positive reviews at current state, especially since devs reviewed  their own game^^", "timestamp_created": 1558788341, "timestamp_updated": 1558789013, "voted_up": false, "votes_up": 23, "votes_funny": 7, "weighted_vote_score": "0.598028361797332764", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "95526376": {"recommendationid": "95526376", "author": {"steamid": "76561198841387906", "num_games_owned": 2134, "num_reviews": 228, "playtime_forever": 550, "playtime_last_two_weeks": 0, "playtime_at_review": 550, "last_played": 1606109573}, "language": "english", "review": "Give my money back", "timestamp_created": 1625995772, "timestamp_updated": 1625995772, "voted_up": false, "votes_up": 42, "votes_funny": 33, "weighted_vote_score": "0.596062242984771729", "comment_count": 15, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "113018146": {"recommendationid": "113018146", "author": {"steamid": "76561198413189521", "num_games_owned": 797, "num_reviews": 202, "playtime_forever": 6161, "playtime_last_two_weeks": 0, "playtime_at_review": 6153, "last_played": 1700503300}, "language": "english", "review": "⠄⢸⣿⣿⣿⡇⣏⣾⡞⡯⣥⣽⣷⡘⢶⡀⠡⣌⡔⢣⣿⣿⠄⠄⠄⠄⠄⠄\n⠄⢸⣿⣿⣿⣷⢹⡖⠬⣚⣛⣯⣭⣛⢂⣙⠦⠈⡇⣾⣿⣿⡆⠄⠄⠄⠄⠄\n⠄⠘⣿⣿⣿⣿⢰⣾⣿⣿⣿⣿⣿⣿⡼⣿⣿⣷⡆⣿⣿⣿⣧⠄⠄⠄⠄⠄\n⠄⠄⣿⣿⣿⣿⠘⡿⢛⣿⣿⣿⣿⣿⣧⢻⣿⣿⠃⠸⣿⣿⣿⠄⠄⠄⠄⠄\n⠄⠄⣿⣿⣿⣿⢀⠼⣛⣛⣭⢭⣟⣛⣛⣛⠿⠿⢆⡠⢿⣿⣿⠄⠄⠄⠄⠄\n⠄⠄⠸⣿⣿⢣⢶⣟⣿⣖⣿⣷⣻⣮⡿⣽⣿⣻⣖⣶⣤⣭⡉⠄⠄⠄⠄⠄\n⠄⠄⠄⢹⠣⣛⣣⣭⣭⣭⣁⡛⠻⢽⣿⣿⣿⣿⢻⣿⣿⣿⣽⡧⡄⠄⠄⠄\n⠄⠄⠄⠄⣼⣿⣿⣿⣿⣿⣿⣿⣿⣶⣌⡛⢿⣽⢘⣿⣷⣿⡻⠏⣛⣀⠄⠄\n⠄⠄⠄⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⠙⡅⣿⠚⣡⣴⣿⣿⣿⡆⠄\n⠄⠄⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⠄⣱⣾⣿⣿⣿⣿⣿⣿⠄\n⠄⢀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢸⣿⣿⣿⣿⣿⣿⣿⣿⠄\n⠄⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠣⣿⣿⣿⣿⣿⣿⣿⣿⣿⠄\n⠄⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠛⠑⣿⣮⣝⣛⠿⠿⣿⣿⣿⣿⠄\n⢠⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⠄⠄⠄⠄⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠄\n⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⠄⠄⠄⠄⢹⣿⣿⣿⣿⣿⣿⣿⣿⠁⠄\n⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠏⠄⠄⠄⠄⠄⠸⣿⣿⣿⣿⣿⡿⢟⣣⣀\n⠄⠄⠄⠄⠄⠄⠄⠄⠄juicy ass⠄⠄⠄⠄⠄⠄⠄⠄⠄", "timestamp_created": 1648559748, "timestamp_updated": 1648559748, "voted_up": true, "votes_up": 59, "votes_funny": 28, "weighted_vote_score": "0.593897581100463867", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "107632822": {"recommendationid": "107632822", "author": {"steamid": "76561198826497398", "num_games_owned": 171, "num_reviews": 19, "playtime_forever": 916, "playtime_last_two_weeks": 0, "playtime_at_review": 916, "last_played": 1580429204}, "language": "english", "review": "Bought this when it launched early acess & then it started 2 die..of course they make it free after charging every1 $20 for it -_-", "timestamp_created": 1641689899, "timestamp_updated": 1641689899, "voted_up": false, "votes_up": 9, "votes_funny": 8, "weighted_vote_score": "0.592393755912780762", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "156372368": {"recommendationid": "156372368", "author": {"steamid": "76561199169578040", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 13771, "playtime_last_two_weeks": 0, "playtime_at_review": 13771, "last_played": 1653749750}, "language": "english", "review": "This game is a mental breakdown survival game, basically rust but less polished and stuff like that, it makes you lose everything upon death and its so unforgiven but very enjoyable to play cause you will get to meet some nice and bad players along the way just pray you dont encounter any hackers or a green dot Robot otherwise you're doomed.\nNow to my personal opinion, i enjoyed this game a bit too much when it was released and i dont regret a single minute that i spent in it, been a while i will revisit it again to see if the reason why i quit ( chinese ) is still there and ill update this review", "timestamp_created": 1705752837, "timestamp_updated": 1705752837, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.592166543006896973", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "94658293": {"recommendationid": "94658293", "author": {"steamid": "76561198045267457", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 2451, "playtime_last_two_weeks": 0, "playtime_at_review": 345, "last_played": 1635594790}, "language": "english", "review": "I was sceptic at first. But then I was like Wow what a game. I usually dont like survival games but dang what fun I had playing Xera. Was streaming it live and found a few bugs but it wasnt enough for me to stop playing.  Exploration solo or with a friend is exciting. They have pve and pvp servers which is nice if you just want yo play a chilled game or go for kills against other players. Im glad I got talked into playing this by a friend.", "timestamp_created": 1624974909, "timestamp_updated": 1624974909, "voted_up": true, "votes_up": 20, "votes_funny": 1, "weighted_vote_score": "0.591128349304199219", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "52564215": {"recommendationid": "52564215", "author": {"steamid": "76561198186686429", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 835, "playtime_last_two_weeks": 0, "playtime_at_review": 453, "last_played": 1562322366}, "language": "english", "review": "Overall I really like this game, the PvP and PvE elements are really fun, but a few things I would like to see implemented are the following:\n\nFurniture, the houses lack any kind of furniture so it seems like every house in the game was just built and nobody has moved into them.\n\nMore NPCs, I would love to see NPCs that give quests, challenges or some random hostile/passive NPCs that roam around, like mercenaries, raiders, or maybe some friendly traders.\n\nMore drivable vehicles, the only vehicle currently is the ATV and it is a cool vehicle, but there are many vehicles that are just laying around on the map like Humvees, sedans and more, that could be drivable vehicles.", "timestamp_created": 1561923196, "timestamp_updated": 1561923212, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.590271592140197754", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "96319148": {"recommendationid": "96319148", "author": {"steamid": "76561198074758355", "num_games_owned": 920, "num_reviews": 15, "playtime_forever": 2283, "playtime_last_two_weeks": 0, "playtime_at_review": 1699, "last_played": 1675446770}, "language": "english", "review": "Warning: Stay away, Hacker's inside.\n\n\nNote: \nIn 12 hours my group had a nice Base and some good stuff inside.\nIn 30 minutes 2 hackers destroyed and looted everything we had.\n", "timestamp_created": 1627171114, "timestamp_updated": 1675200590, "voted_up": false, "votes_up": 12, "votes_funny": 3, "weighted_vote_score": "0.589537322521209717", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "60329405": {"recommendationid": "60329405", "author": {"steamid": "76561198167380567", "num_games_owned": 220, "num_reviews": 28, "playtime_forever": 12466, "playtime_last_two_weeks": 0, "playtime_at_review": 3029, "last_played": 1640145233}, "language": "english", "review": "Activate Steam achievements thats all", "timestamp_created": 1577033563, "timestamp_updated": 1609593164, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.58928227424621582", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "95590544": {"recommendationid": "95590544", "author": {"steamid": "76561198274700944", "num_games_owned": 0, "num_reviews": 48, "playtime_forever": 27671, "playtime_last_two_weeks": 0, "playtime_at_review": 944, "last_played": 1705061965}, "language": "english", "review": "𝐺𝑜𝑜𝑑 𝑔𝑎𝑚𝑒, 𝑠𝑜𝑚𝑒 𝑡ℎ𝑖𝑛𝑔𝑠 𝑛𝑒𝑒𝑑 𝑏𝑒 𝑓𝑖𝑥𝑒𝑑 𝑎𝑛𝑑 𝑎𝑑𝑑, 𝑠𝑜𝑚𝑒 𝑚𝑒𝑐ℎ𝑎𝑛𝑖𝑐𝑠 𝑎𝑟𝑒 𝑓𝑢𝑛 𝑎𝑛𝑑 𝑖𝑛𝑡𝑒𝑟𝑒𝑠𝑡𝑖𝑛𝑔, \n𝐶𝑜𝑚𝑒 𝑑𝑖𝑠𝑐𝑜𝑣𝑒𝑟𝑦. 𝐷𝑜𝑛'𝑡 𝑓𝑜𝑟𝑔𝑒𝑡 𝑖𝑡'𝑠 𝑖𝑛 𝑑𝑒𝑣𝑒𝑙𝑜𝑝𝑚𝑒𝑛𝑡, 𝑐𝑜𝑚𝑒 ℎ𝑎𝑣𝑒 𝑠𝑜𝑚𝑒 𝑓𝑢𝑛 𝑎𝑛𝑑 𝑏𝑒 𝑙𝑖𝑡𝑡𝑙𝑒 𝑏𝑒 𝑝𝑎𝑡𝑖𝑒𝑛𝑡, \n\n𝑊𝘩𝑒𝑟𝑒 𝑖𝑠 𝑡𝘩𝑒 𝑡𝑟𝑎𝑖𝑛 ? 𝑐𝘩𝑜𝑜-𝑐𝘩𝑜𝑜 ! \n𝐶𝘩𝑎 𝑐𝘩𝑎 𝑐𝘩𝑎 𝑐𝘩𝑎, 𝑐𝘩𝑜𝑜 𝑐𝘩𝑜𝑜 𝑡𝑟𝑎𝑖𝑛,\n𝑅𝑜𝑙𝑙𝑖𝑛𝑔 𝑢𝑝 𝑡𝘩𝑒 𝑐𝘩𝑜𝑜 𝑐𝘩𝑜𝑜 𝑙𝑎𝑛𝑒...\n\n𝑆𝑜𝑚𝑒 𝑎𝑛𝑖𝑚𝑎𝑙𝑠 𝑐𝑎𝑛 𝑎𝑙𝑠𝑜 𝑝𝑢𝑡 𝑙𝑖𝑓𝑒 𝑜𝑛 𝑡𝘩𝑒 𝑚𝑎𝑝.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=2548408353\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=2548411265\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=2822089638\n", "timestamp_created": 1626081687, "timestamp_updated": 1703168793, "voted_up": true, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.588474392890930176", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "120815752": {"recommendationid": "120815752", "author": {"steamid": "76561198212508229", "num_games_owned": 80, "num_reviews": 3, "playtime_forever": 1202, "playtime_last_two_weeks": 0, "playtime_at_review": 1174, "last_played": 1660793572}, "language": "english", "review": "if you want a game that's almost as toxic as rust you've found it. yes you will find good players that will help you but unfortunatly if you're a new player be prepared for alot of dieing to people who feel shooting people is the whole point of the game. I was highly disappointed because my first impression was very good, but after spending more time being shot at killed and waiting 30 seconds to a minute just to respawn I'm highly disappointed i understand pvp is a very big aspect of the game but new players have little to no chance to thoroughly enjoy what the game has to offer", "timestamp_created": 1660793561, "timestamp_updated": 1660793561, "voted_up": false, "votes_up": 17, "votes_funny": 1, "weighted_vote_score": "0.588244080543518066", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "55681172": {"recommendationid": "55681172", "author": {"steamid": "76561198872201952", "num_games_owned": 117, "num_reviews": 6, "playtime_forever": 1232, "playtime_last_two_weeks": 0, "playtime_at_review": 816, "last_played": 1596390325}, "language": "english", "review": "Personally, for a game in alpha with only 1 man under the hood, this is actually quite a fun time.\n\nXera, though basic right now, still offers a small handful of things to do while the game is still in alpha.\nSo far I've seemed to find that there are 3 main activities. This would be grabbing supply drops, looting downed helicopters, and clearing these almost like \"outposts\" filled with enemies which then reward you a small bit of cash and 2 supply drops. There's also bunker events which I am yet to figure out, that require you to have a key to the bunker to gain entry and are also timed.\n\nYou will spend heaps of time on this game running around aimlessly looting random things and bringing them back to base so you may bank/sell/restock to your hearts desire. I personally find games like this, to be much more addictive with the banking system, allowing you to bring your gear to any server, and gear up at your hearts content.\n\nThe XP system isn't fantastic, and at this point in time seems quite experimental, as you gain skillpoints but have no use for them yet. Leveling does grant you a few small benefits right now, however, such as opening up some crafting recipes you can make use of on the go.\n\nGun play in this is practically non existent. Wherever you shoot, your bullet will travel instantly, but this is okay in a game like this. It makes PvP a little more interesting, plus makes PvE grinding a breeze when you learn the ropes. \n\nThe character movements are rather lackluster, nothing special, same with the ATV driving mechanics, however do not let this stop you. The game is in Alpha, and as I had stated above, only have the main developer under the hood with a small supporting staff. The idea is here, and I see the effort that's starting to go into the game, so because of this I will be purchasing the game before the f2p weekend ends.\n\nGrab a friend and give it a go, can't hurt to try it for free.\nI will be following the support on this game, hope to see nice things.", "timestamp_created": 1571546399, "timestamp_updated": 1571546611, "voted_up": true, "votes_up": 25, "votes_funny": 2, "weighted_vote_score": "0.586527884006500244", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "52259122": {"recommendationid": "52259122", "author": {"steamid": "76561198061328689", "num_games_owned": 59, "num_reviews": 2, "playtime_forever": 327, "playtime_last_two_weeks": 0, "playtime_at_review": 327, "last_played": 1559226470}, "language": "english", "review": "I dont know if this game has changed but I bought it in hopes it would have everything it mentioned but it was missing A LOT of pieces. I even gave the game some time to do some updates due to it being Early Access. Tried refunding it but Steam wont do it due to I have 5.5 hours on it.\n\nMy one major beef with this game is that the safe zones arent guarded so people camp right outside and just kill you over and over again. The only way I see this being fixed is if they implement guards like Rust has at safe zones.\n\nReally wish I could get a refund for this\n\nTO THE DEVELOPER - if possible a refund would be great. You guys need to seriously fix alot of the issues. Would really appreciate a refund.", "timestamp_created": 1561856954, "timestamp_updated": 1565219247, "voted_up": false, "votes_up": 7, "votes_funny": 4, "weighted_vote_score": "0.586513340473175049", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "149805428": {"recommendationid": "149805428", "author": {"steamid": "76561198009220137", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 1084, "playtime_last_two_weeks": 0, "playtime_at_review": 195, "last_played": 1707139009}, "language": "english", "review": "It's pretty much an asset flip trying to be a combination of DayZ and Rust which, let me very clear here, failed spectacularly. This came out in 2021 and thus far has seen very little in the way of improvements, gameplay, bugfixes, etc. There are literally like five pvpve servers and 1 pve server with barely anyone playing on any of them. It's desperately trying to seem relevant with the inclusion of Twitch drops but without actual improvements in gameplay... well it's just bland and unappealing. \n\nIf you like it, you like it, but, unfortunately, I just don't. Maybe if they do something with it I might come back to it again but for now it's getting uninstalled and forgotten about as it did back in '21.", "timestamp_created": 1699525621, "timestamp_updated": 1699525621, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.585774242877960205", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "69516652": {"recommendationid": "69516652", "author": {"steamid": "76561197995091807", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 3480, "playtime_last_two_weeks": 0, "playtime_at_review": 1708, "last_played": 1631545745}, "language": "english", "review": "Good game for its price. It is worth playing only with friends, if you like a similar genre then even for a decent time", "timestamp_created": 1590025676, "timestamp_updated": 1638012852, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.583975374698638916", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1590121293, "developer_response": "Thank you for taking time to review XERA: Survival!  We're glad you're enjoying the game and look forward to seeing you for Season 2!"}, "55723860": {"recommendationid": "55723860", "author": {"steamid": "76561198115674135", "num_games_owned": 0, "num_reviews": 23, "playtime_forever": 709, "playtime_last_two_weeks": 0, "playtime_at_review": 209, "last_played": 1572781159}, "language": "english", "review": "Tried for free weekend, here to stay. It's fun AF. Excited to see where this goes.\n\nPros:\nRuns Well\nSmooth Gameplay\nSimple Mechanics\nCombat works really well (If your shot should hit it does, unlike in some other games (Tarkov?)\nBalanced Loot Spawns / Economy / Progression\nGlobal Inventory\nPVP/PVE Encounters\nBalanced PVP Mechanics (Safe Zone + Anti combat-logoff works well)\n\nCons:\nGameplay loop can get repetitive if playing alone\nCan't prone (I think this is actually a pro. People can't slither around like snakes 24/7)", "timestamp_created": 1571788612, "timestamp_updated": 1571788612, "voted_up": true, "votes_up": 13, "votes_funny": 3, "weighted_vote_score": "0.583705544471740723", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "90911815": {"recommendationid": "90911815", "author": {"steamid": "76561197963923901", "num_games_owned": 0, "num_reviews": 29, "playtime_forever": 33, "playtime_last_two_weeks": 0, "playtime_at_review": 33, "last_played": 1619373476}, "language": "english", "review": "If this came out in 2005 as a free Half Life 2 mod, I would have been impressed. For a 2019 game with a price tag of greater than free, I can't say it's worth it.", "timestamp_created": 1619374336, "timestamp_updated": 1619374336, "voted_up": false, "votes_up": 23, "votes_funny": 6, "weighted_vote_score": "0.58358156681060791", "comment_count": 2, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1619465951, "developer_response": "Greetings!\n\nThank you for taking time to share your thoughts on XERA: Survival.  We are sorry to learn that you did not enjoy playing.  With your review, you didn't mention specifics on how we can improve the game and we would like to learn more about your thoughts on what would make it more enjoyable for you.  As we have a major update coming within the next few weeks, we would certainly like to have you revisit the game once we've added the new map along with base building, the missions system, and more!\n\nFeel free to send us your ideas and our team is happy to spend some time chatting with you.  Our team can be reached via discord at https://discord.gg/xera or through email at support@xeragame.com\n\nWe look forward to collaborating with you soon!"}, "57007794": {"recommendationid": "57007794", "author": {"steamid": "76561198126122704", "num_games_owned": 106, "num_reviews": 18, "playtime_forever": 268, "playtime_last_two_weeks": 0, "playtime_at_review": 247, "last_played": 1628440642}, "language": "english", "review": "Xera Survival is your basic survival game that inside relies on robots instead of zombies or mutants. \n\nit's not bad, it just gets kind of boring. The robots all have the same models, the gunplay isn't really too unique. The game like I said isn't bad it just feels very generic and dated for 2019, I do understand it's EA still but there's a still a long way to go , I'll watch it still to see if it gets better , but atm it's fun for like 20 mins.", "timestamp_created": 1573501917, "timestamp_updated": 1573501917, "voted_up": false, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.582894265651702881", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "50962550": {"recommendationid": "50962550", "author": {"steamid": "76561198071372063", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 589, "playtime_last_two_weeks": 0, "playtime_at_review": 554, "last_played": 1559444180}, "language": "english", "review": "Better version of Warz / new z / day z if you enjoyed those games.\n\nCan get decent loot quick, helicopter to be able to land anywhere basically at anytime is very nice, happy snipers aren't common or else would be annoying for new players to get started.\n\nMy favorite feature is the nearby or safe settlement spawn straight to helicopter landing somewhere, reason is that it makes it way easier to play with you friends and not having to run to find each other which was one of the most annoying things in war z / new z.\n\nRobots & the super robot is not too hard to kill so makes it good for people who have a hard time at shooters.\n\nVery nice graphics and runs really smooth, wish there was more central servers perhaps & considering this is in alpha this is pretty good, cannot wait for the future of this game especially since I heard there will be quest and etc.", "timestamp_created": 1559249010, "timestamp_updated": 1559249070, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.581820785999298096", "comment_count": 8, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "106129383": {"recommendationid": "106129383", "author": {"steamid": "76561198395968142", "num_games_owned": 86, "num_reviews": 8, "playtime_forever": 41, "playtime_last_two_weeks": 0, "playtime_at_review": 41, "last_played": 1639771880}, "language": "english", "review": "I was somewhat enjoying this game at first until I tried to make a house. All of the spaces were claimed and when I found one, I was sniped. But that was after like 30 minutes of searching. I feel like the rules for buildings should be greatly reduced, or players should just be allowed to build anywhere without a claim sign (In other words, remove the claim sign). Other than that, I somewhat enjoyed my time killing other players/npc's and looting.", "timestamp_created": 1639948574, "timestamp_updated": 1639948574, "voted_up": false, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.581749081611633301", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "104550549": {"recommendationid": "104550549", "author": {"steamid": "76561198315864951", "num_games_owned": 119, "num_reviews": 50, "playtime_forever": 1720, "playtime_last_two_weeks": 0, "playtime_at_review": 472, "last_played": 1640816932}, "language": "english", "review": "It's very fun and recommendable as a free game, but there could be better gun play and better Anti Cheat.", "timestamp_created": 1638110161, "timestamp_updated": 1638110161, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.580152690410614014", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "50950337": {"recommendationid": "50950337", "author": {"steamid": "76561197971200039", "num_games_owned": 0, "num_reviews": 21, "playtime_forever": 678, "playtime_last_two_weeks": 0, "playtime_at_review": 397, "last_played": 1563096030}, "language": "english", "review": "The best way to describe this game is that it feels like a arcade version of DayZ. Doesn't take hours to gear up, move across the map, or to find a battle which is great. Gunplay is very similar to H1Z1 and feels fine. My only complaint would be no first person only servers but Dev has already said they are coming. All in all a fun budget game.", "timestamp_created": 1559192008, "timestamp_updated": 1559192008, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.579293966293334961", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "77760428": {"recommendationid": "77760428", "author": {"steamid": "76561198121875778", "num_games_owned": 147, "num_reviews": 73, "playtime_forever": 692, "playtime_last_two_weeks": 0, "playtime_at_review": 624, "last_played": 1630897273}, "language": "english", "review": "I played this game near release a year ago and it was pretty fun at the time for what it was just right now it is literally unplayable since it averages 2 players every month. the devs are still updating it suprisingly so maybe one day they'll attempt to revive it with some sponsors or something which would be interesting to see!", "timestamp_created": 1603027761, "timestamp_updated": 1603114962, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.579217314720153809", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1603094590, "developer_response": "Thank you for taking time to review XERA: Survival.  We have a major update coming this week and would love for you to give things another chance as a lot of players are waiting for the upcoming wipe before jumping back in.  There are a lot of new and exciting things coming which we outlined in our development blog that was posted last night.    Seeing as the last time you played was in May of 2019, there has been a lot of content that you have missed out on enhancing the PVE experience during low population times.  Our team is always happy to chat with you on your thoughts and ideas. Feel free to reach out at any time at support@xeragame.com and we look forward to seeing you try things out during Season 3.\n\nCheers"}, "107601417": {"recommendationid": "107601417", "author": {"steamid": "76561199143172333", "num_games_owned": 1, "num_reviews": 4, "playtime_forever": 941, "playtime_last_two_weeks": 0, "playtime_at_review": 190, "last_played": 1642188126}, "language": "english", "review": "Good game fun with friends.", "timestamp_created": 1641658174, "timestamp_updated": 1641658174, "voted_up": true, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.578278720378875732", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "95488502": {"recommendationid": "95488502", "author": {"steamid": "76561198202895519", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 16219, "playtime_last_two_weeks": 0, "playtime_at_review": 397, "last_played": 1709323175}, "language": "english", "review": "Similar to H1Z1 Just Survive.   Base building, raiding, and looting.... but not exactly the same as JS", "timestamp_created": 1625941994, "timestamp_updated": 1625941994, "voted_up": true, "votes_up": 11, "votes_funny": 2, "weighted_vote_score": "0.577690660953521729", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "55703278": {"recommendationid": "55703278", "author": {"steamid": "76561198108438355", "num_games_owned": 401, "num_reviews": 12, "playtime_forever": 84, "playtime_last_two_weeks": 0, "playtime_at_review": 84, "last_played": 1571638932}, "language": "english", "review": "[h1]How to Spot an Unambitious Gaming Company:[/h1]\n\n[b]Early access game with skins crate rather than focusing on the actual game[/b]", "timestamp_created": 1571667455, "timestamp_updated": 1571667455, "voted_up": false, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.577664315700531006", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "100357589": {"recommendationid": "100357589", "author": {"steamid": "76561198010116029", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 97, "playtime_last_two_weeks": 0, "playtime_at_review": 90, "last_played": 1633168650}, "language": "english", "review": "Well this game is poorly planed by the DEVS! \nFrom Australia there are 3 servers 2 PVP and 1 PVE all PVP servers have highly ranked players and they all roam around the 3 safe compounds where new people spawn. Once a new player leaves the compound in about 5 minutes you are dead and lost every thing. Starting again is pretty much point less! I do not recommend any one from Australia playing on the PVE servers, you will get slapped.\n\nIt's great to get killed 4 times in a matter of 30 minutes by groups of 2 or 4 all ranked 10x more then you.\n\n", "timestamp_created": 1633168114, "timestamp_updated": 1633168114, "voted_up": false, "votes_up": 10, "votes_funny": 6, "weighted_vote_score": "0.577650666236877441", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "104633722": {"recommendationid": "104633722", "author": {"steamid": "76561199209685054", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 2338, "playtime_last_two_weeks": 0, "playtime_at_review": 1741, "last_played": 1652652404}, "language": "english", "review": "It was quite an enjoyable game to just hop on and get lost for hours in with friends, or by yourself.", "timestamp_created": 1638145951, "timestamp_updated": 1638145951, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.577374577522277832", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "51301616": {"recommendationid": "51301616", "author": {"steamid": "76561198005153694", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 12503, "playtime_last_two_weeks": 0, "playtime_at_review": 12475, "last_played": 1561898508}, "language": "english", "review": "I played the game a lot, gave it a real chance but this is not a survivalgame and not a PVP game.....\nThis is just a camp corners simulator and groups bash everything bullshit.\n\nLooting feels boring, the robots are no threat, they are just annoying and PVP means play as 4 or camp in a corner.\nThe dev wants the game to be like this, so there won´t be a change to that and the nonexistent playerbase speaks for itself.\n\nGame is garbage and will stay like this..........sadly.", "timestamp_created": 1560921292, "timestamp_updated": 1560921292, "voted_up": false, "votes_up": 17, "votes_funny": 1, "weighted_vote_score": "0.576948046684265137", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "123480860": {"recommendationid": "123480860", "author": {"steamid": "76561198052288149", "num_games_owned": 0, "num_reviews": 32, "playtime_forever": 925, "playtime_last_two_weeks": 0, "playtime_at_review": 898, "last_played": 1665201387}, "language": "english", "review": "Over 14 hours played and my character is level 11; so can offer a quick early review.\nIf you’ve played RUST and many other Survival games, you’ll jump into this one easy.\nSince its free and I played quite bug free and didn’t pay a cent, I can give this a thumbs up – nothing to lose by checking it out.\nBUT\nIt needs a lot of tweaking and just more!!..., to really keep me or many others engaged for a long time.\nSurvival mechanics aren’t harsh; just food, drink, HP, radiation and you can run for eternity, since not needing stamina.  Which is handy because if you don’t find a limited Buggy or AV, it quickly becomes a running simulation…   Crafting is fine but I've found some issues with the progression.\nLooting is OK, but I feel compared to other similar games in this genre is will likely fade in the sunset; unless they implement some amazing game play.\nBesides the bots near cities and a few reindeer in couple of areas the wilderness in void of all life…. Nothing at all!   Be nice to have to run from or hunt a wild boar, wolf or something..\nSince most servers are low population, players seem more on the helpful than toxic side; while great for starters, its does take away conflict and extra excitement. \nHope the Devs give this one some much needed love & care..\n", "timestamp_created": 1665143504, "timestamp_updated": 1665143504, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.575142502784729004", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "143556483": {"recommendationid": "143556483", "author": {"steamid": "76561199482493745", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 6986, "playtime_last_two_weeks": 0, "playtime_at_review": 6965, "last_played": 1703566544}, "language": "english", "review": "ITS FUN for people who don't got jobs", "timestamp_created": 1691365106, "timestamp_updated": 1691365106, "voted_up": true, "votes_up": 12, "votes_funny": 7, "weighted_vote_score": "0.572458207607269287", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "129863365": {"recommendationid": "129863365", "author": {"steamid": "76561199466450189", "num_games_owned": 24, "num_reviews": 11, "playtime_forever": 23359, "playtime_last_two_weeks": 0, "playtime_at_review": 998, "last_played": 1684508120}, "language": "english", "review": "---{Graphics}--- 8/10\n☐ Masterpiece\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Will do\n☐ Bad\n☐ Awful\n☐ Paint.exe\n\n---{Gameplay}--- 9/10\n☐ Try not to get addicted\n☐ Very good\n☑ Good\n☐ Nothing special\n☐ Ugh\n☐ Bad\n☐ Unbearable\n\n---{Audio}--- 10/10\n☑ Eargasm\n☐ Very good\n☐ Good\n☐ Decent\n☐ Not too bad\n☐ Bad\n☐ Earrape\n\n---{Audience}--- 10/10\n☐ Kids\n☑ Teens\n☐ Adults\n☐ Everyone\n\n---{PC Requirements}--- 8/10\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{Story}---10/10\n☐ Doesnt have (Not counting historical stuff)\n☐ Something isnt nothing I guess\n☐ Not great\n☐ Average\n☐ Good\n☑ Lovely\n\n\n---{Game Time}---8/10\n☐ Long enough for a cup of tea\n☐ Short\n☐ Average\n☐Long\n☑ Depends on u\n☐ Playing the whole game in one sit\n\n---{Price}--- 8/10\n☐ Just buy it\n☐ Worth the price\n☑ Free to play\n☐ Maybe if u have some spare money left\n☐ Not recommended\n☐ Dont throw money into a trash can\n\n---{Bugs}--- 8/10\n☐ Never had any\n☑ Minor bugs\n☐ Few bugs\n☐ Can get annoying\n☐ Ruining the game\n☐ The game itself is a big terrarium for bugs\n\n---{Overview}---\nI recommend this Game ★★★★\nNote: Those reviews are based on my opinions :)", "timestamp_created": 1672586927, "timestamp_updated": 1675604131, "voted_up": true, "votes_up": 14, "votes_funny": 6, "weighted_vote_score": "0.572053015232086182", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "146065819": {"recommendationid": "146065819", "author": {"steamid": "76561199375864278", "num_games_owned": 65, "num_reviews": 21, "playtime_forever": 261, "playtime_last_two_weeks": 0, "playtime_at_review": 261, "last_played": 1678586317}, "language": "english", "review": "amazing game the only things i want added is private servers, more waepons, more enemny variety (like zombies or wolves), and hunting", "timestamp_created": 1694363338, "timestamp_updated": 1694363338, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.570173382759094238", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "51326236": {"recommendationid": "51326236", "author": {"steamid": "76561198018805388", "num_games_owned": 73, "num_reviews": 14, "playtime_forever": 12157, "playtime_last_two_weeks": 0, "playtime_at_review": 3879, "last_played": 1690698663}, "language": "english", "review": "It's an early-access game, so what does that REALLY mean? It means things are going to change. These changes might be bad, such as recoil, and if they are bad, they are reverted, as recoil was. The dev team is small, but they talk to their community to gauge what's working and what isn't. This game is like Nether, NewZ, and PUBG rolled into one, but much more polished from the start than any of those games were (even on PUBG's AAA title budget). Give them time and it'll be something fun to murder 12 year-olds on. Just give this game some time and a chance.", "timestamp_created": 1560991439, "timestamp_updated": 1561615714, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.569270849227905273", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}}, "query_summary": {"num_reviews": 6, "review_score": 5, "review_score_desc": "Mixed", "total_positive": 1456, "total_negative": 760, "total_reviews": 2216}, "cursors": {"AoIIPwNl7X77v9cE": "Mon Apr 22 23:48:42 2024"}}
