{"reviews": {"157110413": {"recommendationid": "157110413", "author": {"steamid": "76561197975532010", "num_games_owned": 188, "num_reviews": 3, "playtime_forever": 40, "playtime_last_two_weeks": 0, "playtime_at_review": 40, "last_played": 1396253572}, "language": "english", "review": "This was the first early access game I'd ever purchased.  Because of that I have sideways nostalgia for it.  I also learned to do some research before buying early access ; ).  They gave it some effort, but it just couldn't follow through.", "timestamp_created": 1706524413, "timestamp_updated": 1706524413, "voted_up": false, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.583968997001647949", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158138455": {"recommendationid": "158138455", "author": {"steamid": "76561198045778100", "num_games_owned": 247, "num_reviews": 132, "playtime_forever": 523, "playtime_last_two_weeks": 0, "playtime_at_review": 523, "last_played": 1498994511}, "language": "english", "review": "One of many early access games that were never finished by the devs. It may not have the EA tag anymore but the game is not finished in any sense and is full of bugs.", "timestamp_created": 1707720146, "timestamp_updated": 1707720146, "voted_up": false, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.566178441047668457", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "162833299": {"recommendationid": "162833299", "author": {"steamid": "76561198136193367", "num_games_owned": 195, "num_reviews": 17, "playtime_forever": 3905, "playtime_last_two_weeks": 0, "playtime_at_review": 3905, "last_played": 1478669649}, "language": "english", "review": "I can't believe I paid 30 dollars for this crap a decade ago and now it's free to play.  Such garbage.", "timestamp_created": 1713058858, "timestamp_updated": 1713058858, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.517121493816375732", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "157585012": {"recommendationid": "157585012", "author": {"steamid": "76561198028692737", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 540, "playtime_last_two_weeks": 0, "playtime_at_review": 540, "last_played": 1457844861}, "language": "english", "review": "Pathea Games?  More like Pathetic Games.\n\nCould have been great.  Then they left it unfinished.", "timestamp_created": 1707061579, "timestamp_updated": 1707061579, "voted_up": false, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.514159202575683594", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "9435795": {"recommendationid": "9435795", "author": {"steamid": "76561198042266743", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 1215, "playtime_last_two_weeks": 0, "playtime_at_review": 1098, "last_played": 1395291238}, "language": "english", "review": "Has a lot of potential and plays very smoothly for an alpha build. Quests and item collection work well, although melee combat is wonky (due to lack of damage animation for monsters, you have to watch the health bar). Building and terrain shifting with various tools is surprisingly functional; I didn't focus on building at first, but it's pretty easy to dig yourself a cave to hide out in, or build some platforms to get around plateaus. Vehicles and item building is also easy; the built-in creator is both powerful and simple to learn and use.\n\nDisclaimer: I wanted to play this game mainly as a wilderness survival game at first, but a couple of things I noticed in singleplayer (story mode) made me reconsider. I wouldn't call these problems since they're mainly design choices, but they're worth noting.\n\n1. \"Surviving\" in the sense of keeping your character fed/healthy is trivial; you can carry something like hundreds of thousands of items on your person (including a couple of vehicles).\n2. The main difficulty in the game comes from combat, which feels frustrating; you can upgrade your armor, but it seems to do little to prevent most large creatures from taking out >1/4 of your health each blow, and there's no simple way to dodge if you're stuck in melee (say, against a flying enemy with an AOE ground attack and who's faster than you).\n3. Due to infinite NPC shop storage and basically-infinite inventory, the story mode game sometimes feels like \"kill x monsters for meat (currency)\", buy next tier of supplies from vendors, do quests to get to new vendors, repeat\". To be fair, it's pretty much the entry point for new players, so the parceling out of goods is understandable; it lacks the urgency a survival-oriented game might have, though.", "timestamp_created": 1394600503, "timestamp_updated": 1394768968, "voted_up": true, "votes_up": 500, "votes_funny": 2, "weighted_vote_score": "0.924507856369018555", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "32314702": {"recommendationid": "32314702", "author": {"steamid": "76561198032528294", "num_games_owned": 0, "num_reviews": 100, "playtime_forever": 3229, "playtime_last_two_weeks": 0, "playtime_at_review": 3229, "last_played": 1497046691}, "language": "english", "review": "\"There's such a severe lack of polish,\" is something I've uttered many, many times while playing this game.  Most of the bad things you may have read about it are probably true, as are most of the good things.  It's all going to boil down to what kind of gamer you are, and how much patience you have.  \n\nI'm not exactly sure why a sandbox crafting/exploring game is so heavily formatted to be like an asian mmo.  Everything from the UI design, the grinding, the bad voice acting, to the game flow of doing all the quests in one area and getting sent to another and doing it all over again.  I spent years playing that sh*t, and PE doesn't win any points with me for using it.  The story is actually pretty decent, but is badly delivered because of the limitations of this format.  \n\nCombat is clunky, at best.  Hitboxes are awful.  AWFUL.  From early in the game you'll be sent against absurd \"bosses\" that are usually impossible to kill at the time you receive these quests, or at the least without a great deal of grinding.  \n\nI'm going to be blunt: the game isn't finished.  There are people who will argue that a tacked-on sequel-bait ending to the story technically means the game is done.  But not if it's still somewhere in a Beta state, if you ask me.  \n\nAnd yet..... Somehow.....  The game has some bits of real magic in it.  \n\nWhen you crash land on the planet, everything is new and vaguely terrifying.  Is that a tiny stegosaurus?  Is that a large, ferocious plush bunny?  Animals roam this MASSIVE totally destructible voxel landscape in multiple biomes, and apart from some weird fetish the devs obviously had for multiple eyes, all of the alien species are distinct from each other.  There's some REALLY good visual design here - it just happens to be badly optimized.  \n\nThe soundtrack is almost equally decent, although there are strange long periods of total silence because the game doesn't have enough ambient noise to compensate.  The game even has an integrated way to listen to your own music while you play.  \n\nAnd the crafting.  Ohhhhhh the crafting.  We're not just talking about things you can make, and orient when building a colony.  We're talking a brilliant creation system where you fabricate basic parts, and then add material pixels however you like.  People have made all sorts of things in various categories, from flying pirate ships to weapons and armor from other games/films/real life.  I didn't dig too deeply since I stuck mostly with templates, but there's a lot here.  You can even go back and edit your creations later.  THIS is the meat of the game.  You run your colony, you hunt, farm, mine, and make stuff.  If that's not really your jam, the other elements of the game aren't going to do it for you.  \n\nIt doesn't quite last.  Not all of it.  At some point you've been to every biome.  You've seen every species and kicked its *ss.  You have so many raw materials you hardly ever need to harvest anymore.  Colony management can be just as clunky as most of the rest of the game.  At some point you'll just want to wrap up the story, and the story will delay you, usually in the form of travel, or grinding.  I'd estimate there's probably about 40 hours of story, and no, it doesn't end in a good way.  But if you like to make things and do all that other sandboxy stuff, you'll be entertained for much longer than that.  The game has alternating moments of \"Wow, that's kind of amazing,\" and \"Wtf happened?  Was an intern in charge of this?\"  \n\nThere's some good stuff here, it's just that the devs bit off more than they could chew.  Word on the grapevine is they can't do any major code changes for PE, but they're taking on other projects to get funds for PE 2.  I look forward to it.", "timestamp_created": 1497092298, "timestamp_updated": 1497092690, "voted_up": true, "votes_up": 139, "votes_funny": 5, "weighted_vote_score": "0.891169548034667969", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "84757573": {"recommendationid": "84757573", "author": {"steamid": "76561198029869760", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 305, "playtime_last_two_weeks": 0, "playtime_at_review": 204, "last_played": 1625588666}, "language": "english", "review": "Its an unfinished, boring and dissappointing game. I bought this back in 2014, checking in on it yearly if it became any better, but gave up after about 4 years of nothing happening. Just came back after 2 years to see the game is free to play now. So I paid 25 euros for an unfinished game in hope of being able to play sometime in the future, which is abandoned and also its free now. F.U. Devs.", "timestamp_created": 1610755430, "timestamp_updated": 1610755430, "voted_up": false, "votes_up": 114, "votes_funny": 2, "weighted_vote_score": "0.889921426773071289", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "14928996": {"recommendationid": "14928996", "author": {"steamid": "76561197981552286", "num_games_owned": 0, "num_reviews": 48, "playtime_forever": 5920, "playtime_last_two_weeks": 0, "playtime_at_review": 4359, "last_played": 1505980087}, "language": "english", "review": "So I have put quite a few hours into this now, which gives me enough of an impression to actually write this. That is not to say that time played by default makes my opinions correct, or at all helpful, but I will try.\n\nSo I have been keeping an eye on this game since pretty much the start, maybe 2 years, not sure. But so far I have noted these key points.\n\nThe Developers:\n#The developers seem quite dedicated.\n#They seem ambitious, almost to a fault but not quite.\n#They are a recent announcement to upgrade to unity 5 shows they wish to improve even what seems to be set in stone. \n#They are slow, but they are also detailed, few game crushing bugs have ever popped up.\n#They are a small team, and not as vocal with their community as I would like. \n(keep this last one in mind when I describe the game, as it means alot when it comes to visual assets.)\n\nThe Game:\n#Graphics are pretty good in some ways, but a letdown in other.\n#The art style for humans leaves them feeling a little less real, and can be seen as a little cartoonish\n#Character customization leaves a lot to be desired but has come a long way since earlier versions.\n#Animation leaves a lot to be desired but it has been already announced they are going over the animations from scratch and making very impressive leaps, set to be released in 0.90 along with Unity 5 engine.\n#Combat is currently clunky, ranged weapons are your only real weapon, use a bow at first but aim for a laser weapon ASAP and a large supply of batteries. Combat in melee is not an option at the moment but in a recent video they have shown great progress in the combat system coming in 0.90 Unity 5 update.\n#AI is parted into what seem to be factions, often you will see animals fighting in clear and defined rolls of hunter and prey, truly one of the fantastic parts of this game.\n\nAs for my impression of the game as a whole?\nI like it, I played through all the story that is currently there, and when I hit that first message saying I could not take this mission because it was not currently complete, I was left begging for more.\n\nHowever I do worry the 0.90 update will require a total restart of my play through, but with all I have learned, and baring major changes, I will be able to do everything even better and even faster next time round, I know where you hid my aluminum you sly dogs!\n\nI would buy this game again, but there is one fact I must stress to all consumers. So please read this and take it to heart.\n\nThis is an early access game, you may end up with something you did not expect, it may be bad, it may be good, it may be total trash, but you knew this going in, you paid for an unfinished untested product and it is your risk alone to take!", "timestamp_created": 1426564579, "timestamp_updated": 1428339196, "voted_up": true, "votes_up": 90, "votes_funny": 1, "weighted_vote_score": "0.876311779022216797", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "13024734": {"recommendationid": "13024734", "author": {"steamid": "76561198005478926", "num_games_owned": 0, "num_reviews": 94, "playtime_forever": 2576, "playtime_last_two_weeks": 0, "playtime_at_review": 2420, "last_played": 1487984887}, "language": "english", "review": "Pros: Nearly unlimited creativity. Want to fly a Millenium Falcon? No problem! Even if you are not very creative, installing other peoples wondrous works is as easy as drag and drop.\n\nExploring is fun! Some cool scenic locations as well as hangliding through alien canyons. \n\nStoryline is solid. From the intro with Carl Sagan's quote to the mystery behind this planet, I really craved more.\n\nCons: Everything that comes with alpha. Bugs mostly that range from annoying (falling through the ground) to storyline breaking (Mainline npcs turn invisible). \n\nDespite there being over 200 different animals, most of their animations and actions are too similar. Runs up to me, swings claw defines most animals (not all though).\n\nOverall, this game is great and worth the buy. You can put a couple hours into it or hundreds, there many possibilities.", "timestamp_created": 1416555626, "timestamp_updated": 1416555626, "voted_up": true, "votes_up": 82, "votes_funny": 0, "weighted_vote_score": "0.865124404430389404", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "10356515": {"recommendationid": "10356515", "author": {"steamid": "76561198000700248", "num_games_owned": 657, "num_reviews": 13, "playtime_forever": 12082, "playtime_last_two_weeks": 0, "playtime_at_review": 5752, "last_played": 1471056143}, "language": "english", "review": "This is definitely a great game with a bright future. Even though it's in Alpha, it still has a lot of content and things to explore. \n\nThe in-game creation editor allows you to make pretty much whatever your heart desires in terms of weapons, shields, vehicles, and decorations. I was never an artsy kind of guy in terms of drawing or modeling, but it is fairly simple to figure out how to work the controls for the editor. Also, there is a small built-in tutorial along with of a bunch of help amongst the community.\n\nThere is also a build mode that allows you to place blocks and build structures. Unlike many other games of this type, it allows you to build multiple blocks at once through dragging vertically / horizontally, and offers you various shapes such as cubes, spheres, cylinders, cones, and much more. Along with this, you can also enter a free-view mode, which makes building much easier to control and look over.\n\nI haven't played the single-player campaign to its fullest yet, but it has been nice so far. I have primarily been playing on my multiplayer server with a couple of friends, and have been creating and exploring for many hours. Personally, the game is much more fun when you have others to play with, since you can go on adventures or see what others created themselves.\n\n[b]To server owners:[/b] I personally prefer hosting a server from the game itself by going to Multiplayer > Host. I say this because the server controls are a bit iffy right now, and from what I understand, the \"correct\" way to shut down the server is to find it in the multiplayer list, select it and hit 'Delete'. With this being the case, the admin of the server is whichever character created it, and thus, they are the only ones who can do the process stated above. However, when hosting it from a .BAT file or whatnot, there is no specified character as an owner. As such, the only way I've found to shut it down is to either just exit out of it, or kill the process if using batchmode. Of course, there could be something I'm missing entirely, and I'm sure this will be refined more in the future.\n\nI'm rambling now so I'll just start to rap this up with some of the current, noticeable issues\n\n* Crafting currently seems to be split up between singleplayer / multiplayer, e.g there's some stuff you can apparently craft offline but not online...doesn't really affect gameplay that much though\n\n* The camera can feel kind of unrealistic and annoying to control, but they're supposedly redoing it entirely in the next update, so we'll see\n    * First and third person are both options (use scroll-wheel to change between perspectives / zoom in and out)\n\n* Entities (players, vehicles, mobs, etc) can sometimes fall through the world (primarily when in vehicles going at fast speeds for players [~100+ Km/h])\n\n* NPCs appear to multiply in multiplayer each time the server is restarted (e.g. a town will spawn all of it's NPCs...server restarts...those NPCs spawn back, on top of another set of NPCs.)\n   * Their town decorations seem to do the same (some houses end up with 5 doors on top of eachother, etc)\n\n* Along with that, objects such as turrets sometimes don't spawn in or fall through the world when spawning in in multiplayer\n\nOver all, as many other reviews have said, this is an Alpha game. If you buy it, expect some bugs and crashes. That's why there is a notification telling you this game is in Alpha. I myself have only encountered a couple bugs in game and maybe one crash or two. However, I don't know how other people's computers will handle it and what their experience may be like. All I can say is that if you don't want to deal with bugs or possible crashes, then I'd suggest waiting a while for it to become a bit more stable and then buy it. \n\nCurrently, I'd rate it a 10/10 for an Alpha build, as it is honestly much more than I would've expected.", "timestamp_created": 1401978471, "timestamp_updated": 1401979540, "voted_up": true, "votes_up": 123, "votes_funny": 1, "weighted_vote_score": "0.860546231269836426", "comment_count": 8, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "9434885": {"recommendationid": "9434885", "author": {"steamid": "76561197992928723", "num_games_owned": 0, "num_reviews": 23, "playtime_forever": 5399, "playtime_last_two_weeks": 0, "playtime_at_review": 4368, "last_played": 1480098858}, "language": "english", "review": "Edit: 11/17/2016\nWell here we are, Release.  If you can call it that, While i understand the pressure the Devs are under to get the game out, It was still undercooked.  That being said, Considering some of the updates its had before this, its very playable!  Bugs? Yes! Multiplayer issues? Yes!  Enough of them to break the game? NO!\n\nA big plus as well is they have promised to keep working on the game, bug fixes, stability ect. for at least 6 months, which i think was the time table for release anyway.  So its not going to be a Doublefine situation where they say \" Fuck it, you all deal with making it better!\"\n\nEdit:2/5/2016\nIts been a real rollercoaster for this one, went from good to unplayable and back a few times now, buts its getting nothing but better as time goes on it seems.  To all of the ppl that say its a \"dead\" game that will be in EA forever, I guess they havent seen the recent improvments that just pulled it out of one of the low points i spoke of above.  Ive seen even thru the low points the devs do their best to get patches and content out...the game may not have a large player base ATM, but its far from dead and poised to be great!\n\nOld review that still stands:\nThis is the game I wanted from StarForge.  This review is wrote in haste, i think i have maybe 3 hours into the game, and just in survival mode at that.  Game includes a Story mode and multiplayer.  So as of right now, the game does show a few bugs, most of which i have been able to over look, and one game breaker when trying to load into a saved game, not sure what caused it but i can imagine being 20 hours in and BAM, saved game corruption.  But becuase of the future i can see for this game, every bug can be overlooked ATM IMO.  Still I would call this a early beta if i didnt know better. So the best way i can compare this game to others you might know is a SCI-FI Minecraft with Better Graphics, the ability to create your own Weapons ( completely design swords and sheilds from scratch ), and design your own Helis and Cars, Recruit others to the bases you create.  You can mine for minerals, hunt monsters, but its set up where you could not have to do one or the other.  Meat is used as Currency, so hunting can get you what you need to build anything.  Or mining can get you the \"meat\" you need buy selling ores.  Needless to say, im fairly impressed with this one.  Playable and fun in Alpha, Thats hard to do....GOOD JOB.", "timestamp_created": 1394589511, "timestamp_updated": 1479408985, "voted_up": true, "votes_up": 331, "votes_funny": 0, "weighted_vote_score": "0.859157741069793701", "comment_count": 18, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "38327903": {"recommendationid": "38327903", "author": {"steamid": "76561197997915910", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 3446, "playtime_last_two_weeks": 0, "playtime_at_review": 3344, "last_played": 1513603087}, "language": "english", "review": "This is a fun game, with a lot to do, but it is not complete. It is full of bugs, performs extremely poorly (980ti, i5-7600K, 32gb RAM: 1080p <40fps), the movement is jerky and janky, going into first person causes a vibration effect... I came back to this with my friend the other day and the list of bugs goes on. \n\nBefore I get into the problems, Planet Explorers does lots of things you can't really do in many other games, at least all in one application:\n\n- Voxel-based world, so you can dig out the ground and tunnel to your heart's content. \n- Build very easily, with a very detailed system that can allows you to make some really interesting structures. This combined with the ability to dig gives you a ton of creative freedom.\n- The world is cartoony, but very pretty. \n- The music is fantastic! The sound and atmosphere in general is terrific, though it wanders away sometimes, see in bug list below. \n- You can create your own custom weapons and vehicles with a very detailed crafting system, where even the types of materials you use have their own properties. So you could, say, make an airship out of marble but it'll be incredibly heavy. So cool! You can also download many of these off of the workshop. That's terrific. \n- Fun co-op story content. It's hard to get a good story-based co-op experience that fits this sort of game-structure, these days. You can get a lot of open-world cooperative titles, but you won't necessarily be getting a story. \n- Lots of voice-acting though... It's mostly laughable in terms of performances. However, I kind of like it, along with the cartoonish style I find it charming. Really, though, it's not great. \n- Make a world-spanning train system customized the way you like (wow). \n- Create a colony with a crazy amount of choice in how you'll do it: on top of a mountain, in the sides of a giant cliff where you've carved homes into the side of the cliff's face, underground, on platforms over the ocean... \n- The glider pack and jet pack are genuinely very fun to use. \n- Can tame and ride various animals (though I have yet to try this). \n\n\nHowever... Wow. Bugs. I'm not sure you can say this is out of Early Access, and they're already onto another title.\n\nHere's a quick list I made in the last hour or so, because I'm frustrated. These are bugs from jus this morning:\n\n- Gerdy floats around 20 feet in the air above her bed. \n- The movement is very janky, with weird vibrations. \n- Going into first-person is uncomfortable because your character's idle movements cause the camera to make idle movements. \n- Can't get into that first medical bike vehicle. We've read that it's just a bug with that bike, but if we continue playing just to find out that all vehicles are bugged I'm going to be PO'd. \n- I'm running a i5 7600k, 32gb ddr4, geforce 980ti. PE runs like garbage. Though it runs perfectly at first, it will drop to a steady 40fps at 1080p and mostly-high settings. I've turned down a lot of options and.... it's still janky as heck. \n- When I shut down PE - my PE server keeps on running. This would be fine if I could actually access it, but it's just sitting there in the background doing it's thing and I have to end-task it. That's super, super lame. \n- If I host a server, go into it, and then exit back to the lobby it won't let me re-join my own game for several minutes. It just tells me that game's already running. I then have to search for my own server and join it, it won't let me otherwise. \n- If I then go and close said server, there's no visual indication I've done so. I click \"close\"... but nothing on the screen changes so I wind up checking if it actually did it or not. You couldn't even be bothered to tie a sound effect to pressing the close button?\n- When I exit PE it thinks it's still running. Have to shut it down in the BG or restart Steam! If I try to get back in it says it's already running. \n- When you turn down the volume, but flick your mouse over menu options, it \"forgets\" your volume settings on those activation sounds. \"clickclickCCCCLLLLLLIIIIIICCCCCCCKK\" SUPER FUCKING LOUD. Ear-hurting loud. I'm using the volume controls so I can hear my buddy over Discord, so this is an awful problem. \n- As soon as you come near Chen it starts playing Japanese music LOUDLY. You can't hear what he's saying. If it's meant as a joke it doesn't come off that way - it seems more like Pathea doesn't know how to handle sound levels. \n- You sleep with your eyes open. Couldn't get us to close our eyes?\n- Campfire's scale appears to be too large, even in terms of texture.\n- When you make armor it goes into the equipment tab not your armor tab!!!\n- Grammar: in Carter's inventory, you can buy \"the poisonous blood\". First of all, none of your other items have \"the\" in the title. Secondly, all the others have capital first letters. \n- Want to swap items on hotbar? They just overwrite. Seems small, but this is a simple thing to do.\n- I thought, at first, your poor collision models were funny. I see all these giant structures I'd like to jump on, but I just lamely clip right through solid objects. So crappy. \n- Atmospheric and musical sounds just go away sometimes, for a few minutes. It's akin to a talented but distracted child just wandering out of the room now and again, or suddenly singing too loudly (see sound bug below). \n- Breaking up stacks... Can I just please hold shift or something? \n- Stuttering!!!!!!! The game just plain stutters every 20-30 seconds. I haven't been able to find a fix for this. It's definitely, 100% game-related, I'm a 3d animator/dev myself and I'm watching the performance statistics.", "timestamp_created": 1513354262, "timestamp_updated": 1513362565, "voted_up": false, "votes_up": 70, "votes_funny": 6, "weighted_vote_score": "0.858237981796264648", "comment_count": 8, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1513411682, "developer_response": "Hi, can you clarify if all of these bugs are in single player or multiplayer? We'll go through them one by one and see if we can duplicate.\n\nThe issue with the stuttering might be caused by terrain rendering, can you try standing at one place and see if this still occurs?"}, "53436217": {"recommendationid": "53436217", "author": {"steamid": "76561198241866938", "num_games_owned": 666, "num_reviews": 2, "playtime_forever": 4261, "playtime_last_two_weeks": 0, "playtime_at_review": 4261, "last_played": 1550685347}, "language": "english", "review": "I really liked this game but im disappointed that its gone F2P after having to pay for it. Maybe the devs can give us a steep discount for PE2 to those who bought PE or even free to make up for it.\n\nUpdate: dev responded with their future plan to offer a discount for people who paid for PE and free alpha much appreciated o/", "timestamp_created": 1562194799, "timestamp_updated": 1562233461, "voted_up": true, "votes_up": 103, "votes_funny": 2, "weighted_vote_score": "0.852371394634246826", "comment_count": 28, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1562204783, "developer_response": "Actually, that is what we're planning to do, we'll offer a discount to all players who bought PE for PE2 as well as let them play the alpha for free."}, "23677701": {"recommendationid": "23677701", "author": {"steamid": "76561197994451612", "num_games_owned": 635, "num_reviews": 20, "playtime_forever": 43996, "playtime_last_two_weeks": 0, "playtime_at_review": 37394, "last_played": 1562350943}, "language": "english", "review": "Planet Explorers stands proud as having the most creative freedom of any fleshed sandbox/survival game I've ever seen. From mining the terrain to collect resources, to crafting, colony creation and NPC recruitment, to being able to build your structures, weapons, armor, helicopters, jets, motorcycles and tanks, and even your very own Kitchen sink how you wish. \n\nPE utilizes a fully minable voxel world, along with a building and creation system that lets you bring your imagination to life. \n\n[b]*The voxel creation system.[/b] You can build weapons, vehicles, and even armor through a voxel creation system that let's you shape, color, and even texturize. Not only create them, but use them ingame for their determined roles.\n\n[b]*Colony NPC recruitment.[/b] While there are plenty of games out there that have colony management, It's noteworthy to mention that recruiment in PE is about finding randomly generated npcs (aswell as pre-made npcs if you're playing story mode), that you can recruit into your colony for different roles. You can have them farm, gather resources, upgrade equipment, or patrol your colony to protect it from assailants. You may equip them as you wish, and even recruit them as followers to acompany on your journey. They all have unique appearences along with names (The names list is a bit short at the moment though..). They also come with their own sets of skills that you can have them train other colonists to have aswell.\n\n[b]*Sandbox Creative Storymode.[/b] This is a big one.. Pathea has created a sandbox creation game that includes a storymode, without any cut functionality from adventure mode. Not only have they done this, but they've also gone and made it multiplayer. You can either play this on a public server, or host a private game with friends only!\n\n[b]*NPC combat AI.[/b]\nMonsters have been programmed to act according to what they are, rather than a default all-round AI slapped onto everything.. One creature will not engage the same as any other. Birds will keep distance, and swoop at their pray, or come in close temporary for a close range attack before swooping away..  Different bird creatures will even do this differently than others.. Not only do they have their own AI packages, but they also have their own animations specifically designed around them. \n\nHumanoid NPC's, followers and colonists, utilize the different tools and weapons you give them based on situation. For example, you can give a follower a sword and shield, and they will engage into melee, until their hp gets low, in which they will withdraw a distance from the enemy. If you've given them a ranged weapon aswell, they will draw their bow or gun and continue firing at the enemy from a distance, while they heal. If they have an axe in their inventory, they will aid you in cutting down trees.\n\n\nIf you have an inkling for design, and would love to see your very own creations have a purpose and use in a sandbox world, Planet Explorers is a must!", "timestamp_created": 1466468102, "timestamp_updated": 1480035285, "voted_up": true, "votes_up": 92, "votes_funny": 2, "weighted_vote_score": "0.851435363292694092", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "31510825": {"recommendationid": "31510825", "author": {"steamid": "76561198006682026", "num_games_owned": 0, "num_reviews": 21, "playtime_forever": 18397, "playtime_last_two_weeks": 0, "playtime_at_review": 7455, "last_played": 1499088261}, "language": "english", "review": "I bought Planet Explorers during a sale and did not touch it for a long time, but as soon as I started I just wanted to continue playing. There are not that much games that keep me playing long into the night.\n\nI think this game is a highly underrated one. You can mostly compare it to Minecraft, but with Story mode and built using an older version of Unity Engine (but still looking good enough for me). \n\nCompared with \"hardcore\" survival games like 7 Days to Die, the survival aspect is not developed that much. You need to eat but not trink, you need to defend your camp but the game gives you strong weapons to do that. So it is not that \"hardcore\" but a lot more relaxing, and that's a good thing for me. You can enjoy exploring the land, hunt some animals, grow plants, build houses.... I like it.\n\nThe base building system is easily the best I ever saw in any game. You can choose between blocks or voxels to place, you can choose shape (round, triangle, cube etc...), size and texture of the blocks, you can place several at once, rotate them, you can undo your last few placed blocks... you can even save complete buildings as blueprints to quickly build a copy of it. Absolutely awesome.\n\nAnd I'm not even starting with the ingame item creation editor. Do you want to design your own sword, gun, vehicle or helicopter? Do you want to customize it completely, pixel by pixel? You can, if you are creative enough (I'm not. :)) Every creation has some fixed parts that need to be placed (a sword needs a hilt), the rest is up to you. The damage of the sword comes from the material you choose (wood swords are worse than steel swords) and from the amount of material you use.\n\nCombine this with NPCs that offer quests (you that you have a reason to do or craft something) you get a survival/exploration/base building game that offers great value for your money. I even like it more than Minecraft.\n\nSure, it could use some polishing. Unity 4 games should not drop below 30 frames (7 Days to Die Alpha 10-11 never did using this engine), there should be options to change color saturation (everything looks a bit bright and colorful for my taste) and programming could be a bit more smooth (first game start after PC is started is without problems and the game runs smooth, but if I quit the game and restart it, second start takes forever and ingame autosaves makes the game freeze for about 3 seconds. I need to shut down the PC completely to fix that). But hey, it's only 20 Euros... I leave more money at the cinema for a two hours movie and popcorn.\n\nMultiplayer is very entertaining (coop story mode and sandbox mode) but suffers from some sync problems. Sometimes you miss some of the other players animation, if you talk to an NPC the other does not see the dialogue, and setting up a dedicated server is a little bit tricky, but it works. Too bad that no one seems to play this game online any more, so you need to bring a friend or two.\n\nShort form: I'd give this game 8/10. There are a lot of games on Steam that are worse and more expensive.", "timestamp_created": 1493748216, "timestamp_updated": 1493748216, "voted_up": true, "votes_up": 75, "votes_funny": 2, "weighted_vote_score": "0.847663283348083496", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "96763986": {"recommendationid": "96763986", "author": {"steamid": "76561198156028842", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 7126, "playtime_last_two_weeks": 0, "playtime_at_review": 7126, "last_played": 1499031565}, "language": "english", "review": "I feel the tears whelm up in my eyes over what this game could have been. It could have been one of the greats but it was abandoned and left to in decay. Forever this will stand as a stark reminder on why you should caution at early access games because they just might be the next planet explorers.", "timestamp_created": 1627839226, "timestamp_updated": 1627839226, "voted_up": false, "votes_up": 64, "votes_funny": 1, "weighted_vote_score": "0.845444262027740479", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "22797220": {"recommendationid": "22797220", "author": {"steamid": "76561198034328445", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 4679, "playtime_last_two_weeks": 0, "playtime_at_review": 4603, "last_played": 1470337820}, "language": "english", "review": "This one is difficult...\n\nIn [u]previous versions[/u] we got a game that was almost feature complete and had working graphics with legible font. Combined with an interesting story, albeit not complete, this game showed great potential.\n\nI played 50 hours and thought 'Great Ill look into this again when the story is done'.\n\nNow I'm [u]back after about a year[/u] and I found this:\n[list]\n[*]Worse graphics with illegible font and horrible normalization of the sound (which has great voice acting). Now I can't tell what the characters a saying and I can't make out the story anymore\n[*]Some freedom in the item creation system removed, fx. max one barrel in one gun (I guess it's now more realistic, but also less fun)\n[*]Long loading times and also closing time of the game is extreme\n[*]The time to exit to desktop is extreme\n[*]Hardly any new features were added, apart from a half complete skill system, which takes the gameplay down a whole different track from where it came from. The game wasn't RPG'ish previously, and to be honest I don't think it should be\n[/list]\n[u]Conclusion[/u]\n\nAll this forces me into the conclusion that the developer either lost interest or lost financing.\n\nThe developers will have to take steps toward completing the existing story content, and build a flawless GUI or at least a decent GUI.\n\nAlso they should probably optimze the game code. Particularly reduce load and close time.\n\nAs it is now I just can't recommend the game. It's not done and the developer didn't achieve anything significant over the course of a whole year.\n\nI do still think the potential is there, and the existing content is still good. So if you want to check it out, you should wait to get the game on sale.", "timestamp_created": 1462382025, "timestamp_updated": 1462382151, "voted_up": false, "votes_up": 150, "votes_funny": 2, "weighted_vote_score": "0.842515170574188232", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19231964": {"recommendationid": "19231964", "author": {"steamid": "76561197994996821", "num_games_owned": 0, "num_reviews": 92, "playtime_forever": 3317, "playtime_last_two_weeks": 0, "playtime_at_review": 3218, "last_played": 1548468523}, "language": "english", "review": "Open ended sandbox, storyline exploration crafting game. Build a base, populate and grow it.  Make weapons, vehicles etc.  Explore the world and search for resources such as ores and plants that are found in certain terrains, then use them to craft everything you need based on schematics you earn or buy from npc's.\n\nWhat it does right, it does very right.  What it does wrong, is horrifically bad.\n\nYou can craft almost anything you can imagine.  Guns, vehicles, buildings, etc.  You make them.  All of them.  There are very few premades available in the game so you must make what you want or find the plans another player made.  If you are creative, you can make almost anything.  If you aren't and don't find other players plans, you shouldn't bother with this game.  A year ago, there were numerous ISO's for everything you could imagine, but now there are very few since updates have broken previous ISO's and creators stopped making and updating them.\n\nVehicles include cars, bikes, planes, helicopters, boats, submarines, etc.  They all share one thing in common.  Movement with them sucks.  Real bad.  Helicopters can't seem to fly above the trees and that would be fine if they didn't get stuck on the trees if you hit one.  The ground is so uneven that any ground transport bounces all over the place and hits everything in sight, or just flat out gets destroyed from bouncing and hitting the ground constantly.  Turning vehicles is not as easy as you would think and often times hitting an object, backing up turning, then turning more going forward still results in you hitting the exact same object.  Vehicles can get stuck on the ground, on the plants, on rocks, etc.  Most areas of the map are actually faster to walk through than attempt to use a vehicle.  Drive into anything and your vehicle gets damaged.  Park near a predator and they will attack your vehicle until it is destroyed or they die.  Fly a helicopter into a flying creature you didn't see because of lag and who knows, maybe it stalls and you drop to the ground and die while your helicopter blows up into pieces and leaves you stranded there.\n\nThe map is a limited use abstract with very little details but does allow fast movement between discovered points.  The scanner map shows you more of the terrain, but is very difficult to decipher if you are looking for ore and quickly becomes useless if you are digging into a ore vein since it clutters up rapidly.  \n\nLighting is almost useless since personal lights point directly forward with no means to use them to light up areas above, below or to the side of the character.\n\nNPC ai is getting better but followers still get stuck on terrain sometimes and can easily be lost when you are crossing a long distance.\n\nCombat is very basic with melee attack only or manually shooting a weapon.\n\nMost quests are easily completed but some hunting quests give you only a name of a creature that is useless if you haven't been playing long enough to figure out what the different creatures are.  Some creatures for hunting quests are also difficult to find since they can be very rare creatures or travel around a lot.\n\nUpdates are fairly slow in coming, but progress has been significant in the last year.   Crashes still happen fairly often but autosave keeps you from losing more than a couple minutes of progress so they are a minor problem.  \n\nOverall, the potential for this game is great, but it does need more work to be really enjoyable.  Mostly the vehicle controls and ground smoothing hamper the game at this point.  When it takes forever to walk from known areas to new mission areas, it gets tedious fast when you know a vehicle would be faster, but are so not worth the trouble to use.", "timestamp_created": 1448277529, "timestamp_updated": 1448277529, "voted_up": false, "votes_up": 166, "votes_funny": 10, "weighted_vote_score": "0.841371893882751465", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "41541265": {"recommendationid": "41541265", "author": {"steamid": "76561198038051417", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 43297, "playtime_last_two_weeks": 0, "playtime_at_review": 24656, "last_played": 1709879503}, "language": "english", "review": "[url=https://steamcommunity.com/app/237870/discussions/0/3288067088104099365/]Full review here.[/url].  Stupid character limit.\n\nAfter owning this game for five years and watching most of the development cycle I finally finished story mode last night.  I've also put quite a few hours into the game so I guess it's time to write a review. A quick list of pros and cons:\n\nPros:\n[list]\n[*]Amazing creation system.  Create aircraft, ships, submarines, ground vehicles, character equipment, buildings, even FURNITURE, for crying out loud, down to the last minute detail.\n[*]Share your creations with others and download theirs.\n[*]100% deformable terrain.  You can mine and terraform to your heart's content.\n[*]Decent storyline.\n[*]Beautifully hand-crafted story mode world and procedurally generated worlds up to 40km x 40km.\n[*]A variety of distinct biomes, each with its own terrain, flora, and fauna.\n[*]Lots of fun weapons and gadgets\n[/list]\n\nCons:\n[list]\n[*]Lacks the polish you'd expect to see from a 'finished' title.\n[*]No mod support of which I'm aware.\n[*]Combat system feels halfway done and not very satisfying.\n[*]Vehicle mechanics are unrealistic and clunky, especially submarines.\n[*]End game balance issues.\n[*]Voice overs and localization need work.\n[*]Optimization issues.\n[/list]\n\n[b]The TL;DR is that Planet Explorers is a sci-fi survival sandbox of the purest form.  It's a creator's paradise.  It has futuristic technology and pew pew.  And it's finished, but not really finished.  What started as an ambitious project somewhere along the way collided head-on with the realities of game development.  The result is a game that's fun to play but leaves you wondering what it would be if they'd had the time and money to finish it.  Normally I'd pan a 'finished' title so lacking in polish, but I can't recommend PE strongly enough.[/b]\n\nWhen the developers announced the final release of Planet Explorers in 2016 I was angry.  I'd watched for years as this game went through development and though the progress wasn't as fast as any avid player would have liked, it was steady.  When the final version was released it still contained lots of half-finished features and bugs that had plagued the game throughout its development.  It seemed at the time like they were just throwing their hands up in the air and saying, \"Screw it, let's put a wrapper on it and call it done.\"  That impression stayed with me until last night.  \n\nAfter finishing the storyline I read others' thoughts on how it ended.  In [url=https://steamcommunity.com/app/237870/discussions/0/276237094331797388/]one comment thread[/url] I saw, one of the developers explained the situation:  They had wanted to continue development but the reality of the industry is that you have to have cash to do so.  Consequently they had to move on to another project to keep the bills paid.  \n\nIt also occurred to me after reading this that all through the development process the team had been more communicative than most development teams, not just posting dev logs but interacting with players and answering specific questions.  [b]My general impression is of a development team that loves this game as much as the players do and wanted just as badly as we did for it to be more than it ended up being.[/b]\n\nIt's because of this that while my review of an unfinished-feeling 'finished' title would normally be a screed about greedy producers rushing an unfinished product to market to milk the cash cow, in this case I sympathize.  I know that PE2 is a possiblity and I truly hope that they get to do it the way they wanted to do this one.  I'll be waiting, cash in hand.\n\nPlanet Explorers was an ambitious project that like so many other early access titles coulda, woulda, and shoulda but didn't.  Unlike many titles, however, I don't feel like it was because they didn't wanna.\n\nIf you like sandboxes, buy this game.  You can thank me later.", "timestamp_created": 1523980553, "timestamp_updated": 1523981745, "voted_up": true, "votes_up": 57, "votes_funny": 2, "weighted_vote_score": "0.840815603733062744", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23337387": {"recommendationid": "23337387", "author": {"steamid": "76561198124099425", "num_games_owned": 68, "num_reviews": 2, "playtime_forever": 74709, "playtime_last_two_weeks": 0, "playtime_at_review": 7269, "last_played": 1710915039}, "language": "english", "review": "Yesterday i came back to this game after a year or so away, and found it seemingly unplayable compared to older versions. I posted a bad review urging people to stay away from it until the devs fix the issues i was having (unresponsive keys/mouse) then something happened about 15 minutes after i posted that makes me change my recommendation to thumbs up. I got a message on steam from one of the devs (very quick response time) who told me how to solve the issues i was experiencing... very easy fix... reset key bindings to default ! I had never thought to do that as i have never changed keybindings on the game, but low and behold, instant fix. I have over 100 hours on this game and was / is among my favorites. Keep up the good work on this game and I want to thank developer zede05 for the quick response and help to make this one of my favorite games once again. VERY much recommended.", "timestamp_created": 1464834108, "timestamp_updated": 1464910793, "voted_up": true, "votes_up": 104, "votes_funny": 4, "weighted_vote_score": "0.837095975875854492", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "48339743": {"recommendationid": "48339743", "author": {"steamid": "76561198015245350", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1429, "playtime_last_two_weeks": 0, "playtime_at_review": 1351, "last_played": 1489802467}, "language": "english", "review": "I do not recommend anyone buy this game. The devs haven't released a patch in about a year, and the game is not finished. They have apparently taken everyone's money and run away to make other games.\n\nI did have fun in the earlier versions, but that was when updates were happening and I enjoyed seeing improvements. Somewhere along the way they just gave up and left us hanging...\n\nSteam should seriously revoke this developer's ability to sell games on their platform if this is how they treat their customers.", "timestamp_created": 1547524677, "timestamp_updated": 1547524677, "voted_up": false, "votes_up": 108, "votes_funny": 2, "weighted_vote_score": "0.836049139499664307", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "53345524": {"recommendationid": "53345524", "author": {"steamid": "76561197964542340", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 581, "playtime_last_two_weeks": 0, "playtime_at_review": 581, "last_played": 1490038177}, "language": "english", "review": "This game is a perfect example of the risks of buying early access titles. I bought this game just for the multiplayer, and now the multiplayer is gone forever, and they made the game free to play. Now they want us to pay again for the sequel. Not gonna happen. I also don't see them refunding anyone who purchased this one.\n\nHow about you give free licenses to Planet Explorers 2 to everyone that got ripped off by the first one? Might as well, I doubt many people will buy the second one after getting ripped off by the first.\n\nLet this also be a lesson to developers. Take multiple, redundant, off-site backups of your code.", "timestamp_created": 1562157134, "timestamp_updated": 1562157134, "voted_up": false, "votes_up": 216, "votes_funny": 8, "weighted_vote_score": "0.835821628570556641", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "14306937": {"recommendationid": "14306937", "author": {"steamid": "76561197977060919", "num_games_owned": 0, "num_reviews": 34, "playtime_forever": 5697, "playtime_last_two_weeks": 0, "playtime_at_review": 5559, "last_played": 1425872406}, "language": "english", "review": "Has incredibly powerful vehicle and weapon creation system. \n\nIf there's something you want to build you can do it! A tank? yes A truck? yes A spaceship? yes! Huge hand cannon? yes!\n\nAnd it won't look all blocky either!", "timestamp_created": 1422942843, "timestamp_updated": 1422942843, "voted_up": true, "votes_up": 67, "votes_funny": 13, "weighted_vote_score": "0.831671833992004395", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "28195250": {"recommendationid": "28195250", "author": {"steamid": "76561198039650710", "num_games_owned": 239, "num_reviews": 3, "playtime_forever": 3971, "playtime_last_two_weeks": 0, "playtime_at_review": 3857, "last_played": 1509734763}, "language": "english", "review": "It's a game I have enjoyed and think with continued development it could be pretty amazing. I wouldn't have described it as release quality however.\n\nBefore I say anything more I should probably say I only play offline/single player. With that said the one 'campaign' that ships with the game while not 100% bug free (And how many games are 100% bug free these days?) is pretty well done, the terrain is well made, the progression is steady and it doesn't take long to learn how to play and to reach your goals. There are one or two areas that could do with sharpening. \n\nA large amount of work is placed on the player to create their own vehicles. Yet the tools don't take into account mass, center of gravity, etc. And yet once plaed into the world both of these are pretty essential. Furthermore when using the templates that the game gives you to - I assume - get you started, they either come with parts you have yet to unlock, or don't work as expected. Case in point: The quest was to deliver an NPC to another area, she suggests that now you have unlocked some of the boat parts that you should build a boat to take her to the place she's going.\n\nI'm not a boat builder... so I used the templete provided within the system. The boat it produces looks amazing, however most of the parts used are still locked, having removed those parts or replaced them with the parts I can actually create, the boat will barely move without turning turtle. In the end I make a simple log raft that works pretty well instead.\n\nOften the obvious mistakes are like this, oversights as opposed to actual bugs or poor design decisions.\n\nThe game as it stands has three 'modes'. Campaign mode (as mentioned above), Adventure Mode & Creative Mode\n\nAdventure mode is as far as I can tell there to show you how much better campaign mode is. It's full of bugs and overall badly designed.\n\nCreative Mode is fun for about five minutes, until you realise that while you can build anything you want, you can't interact with the world as there are no animals or NPCs.\n\nThe game is officially now a full release, but if you want to try it in it's current state just pretend it's still in beta. It's not polished enough or infact complete enough (to my mind) to be called a finished product. It's given me some good enjoyment, and the system to design & buiold vehicles and weapons while not perfect can be quite a bit of fun. So do I recommend this game? Yes but with caution. Good sandbox game it is, finished it isn't.", "timestamp_created": 1480896514, "timestamp_updated": 1480896514, "voted_up": true, "votes_up": 60, "votes_funny": 2, "weighted_vote_score": "0.82809823751449585", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "13035655": {"recommendationid": "13035655", "author": {"steamid": "76561198034813352", "num_games_owned": 0, "num_reviews": 29, "playtime_forever": 8592, "playtime_last_two_weeks": 0, "playtime_at_review": 3641, "last_played": 1421548316}, "language": "english", "review": "It's crazy.  You run around killing things and getting better items like in any RPG-FPS thing, only it's a bit rogue-like in that you have no idea (at least at first) whether you've bitten off more thna you can chew.  Combine this with almost god-like powers to build things, both permanent fixtures and crafting useable items ranging from personal weapons to land, water, and air vehicles.  And no real documentation so you have to experiment, experiment, experiment.   Oh, and you can starve to death, too, unless you learn how to get food.  And once you get beyond these basics, there's a whole alien world to explore, quests, bosses, the works.   Fantastic concept and incredible freedome.  It can easily become a total time sink.", "timestamp_created": 1416632228, "timestamp_updated": 1416632228, "voted_up": true, "votes_up": 46, "votes_funny": 1, "weighted_vote_score": "0.819427728652954102", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "13130689": {"recommendationid": "13130689", "author": {"steamid": "76561198036161849", "num_games_owned": 511, "num_reviews": 44, "playtime_forever": 8370, "playtime_last_two_weeks": 0, "playtime_at_review": 4209, "last_played": 1657805973}, "language": "english", "review": "   Some of my freinds mocked me for picking this game up. They agreed (almost unanimously) that it looked like something a 12 year old would enjoy. Thats kind of what drew me to the game to begin with, its cutesy sci-fi theming. So they will not pick it up in case a friend of theirs sees it in their library and judges them non adults or some other social convention i dont fully understand.\n    Ill tell you what keeps me playing though, this game rocks! and dirts! and sands! and you can craft almost anything you can imagine. If the item you want is not something you can get a recipe from an npc for, then you can open the object creator and create it. if you have the materials in your inventory, you just export it to the game and BAM! your imagination, now realised. I mean anything too, need a weapon? no problem. need a car? no problem! need a chopper? no problem! need a town? easy as pie! \n   Admitedly, the object creator portion of this game could use some better tutorial in game... but there are a good number of youtube videos showing exactly how to use it (and some tips to using it more efficiently) so really the community has come together where the developers have delayed their efforts. \n   Remembering also that this game is still in alpha (currently at version 0.85a as of this writing), and plans to include items the fans have taken it upon themselves to create and share (tutorials, ISOs, and the like) may be in the works still, this game still plays really well. Ive had to restart the story a few times now, due to saves not being compatible with features added/removed in version patches, but i enjoy it (after the first few missions, anyway) each time since i generally notice something in the story line that i didnt pick up on before. \n   All in all, i would give this game 7/10. The music is shite (its easy enough to turn off though), and the grass is distracting at best (the blades are too fat, and obscure the terrain too well imho) but again, easy enough to turn off... The game plays well, but without these 2 features enabled looses a lot of its gloss (themed music that isnt annoying as all get out would increase immersion, and better grass would make surface deposits more visible). I would reccomend this game to anyone who likes this builder/survival genre. \n", "timestamp_created": 1417215946, "timestamp_updated": 1417215946, "voted_up": true, "votes_up": 52, "votes_funny": 1, "weighted_vote_score": "0.818094730377197266", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "30857589": {"recommendationid": "30857589", "author": {"steamid": "76561198009342411", "num_games_owned": 792, "num_reviews": 71, "playtime_forever": 4544, "playtime_last_two_weeks": 0, "playtime_at_review": 3669, "last_played": 1492107050}, "language": "english", "review": "It is very difficult to me give a straight Up / Down thumb.\n\nIf I can I would give it a MEH thumb.\n\nThe main problem of Planet Explorer is being ambitious but lacking on every aspect of the game, except the crafting system. \n\nThe developer worked hard to provide a full feature sandbox game: dozens of creatures, materials, terrain types, procedurally generated worlds, game modes including a coop story mode, a super detailed crafting system, quests, dungeons and a loot system integrated with the Steam Workshop.\n\nWhat you get is all these stuff but lacking the right amount of deepness, they feels like still in prototype stage.\nAll served with LOADS of bug, glitches and optimization problems.\n\nOnce I started a cooperative game with a friend of mine I had a great sense of wonder... we really wanted to get sucked in this game. Sadly that feeling dropped after about 16 hours of gaming.\n\nEverything got repetitive and pointless really fast. We found ourself stuck in repetitive tasks  (mostly mining) and playing separated.\n\nIn fact there is no reason to stick together, and even if you start playing willing to stay together, you'll end very soon wondering and doing tasks alone.\n\nWhy does it happens?\nIt happens for two reasons: \n1) it is hard to find your mates (they are showed on the \"big\" map but you don't get directional clues on the minimap, so you get lost in no time)\n2) it is pointless being together because every \"quest\" is easy enough to be accomplished alone \n\nEven Dungeons are best in solo. They are just repetitive corridors fulfilled of monster where you get the loot just running through the enemies (ignoring them) and picking up the the loot crates  (mobs and bosses never drop useful stuffs).\n\nThere is no real boss fight and when your colony is under siege, all the defensive work is made by the turrets you've placed all around.\n\nThere is no reason to do real coop. Even the exploration.\nYou can craft huge vehicles to carry all your party members... but ground vehicles are useless (they got stuck in the terrain every 30 meters) and flying vehicles are boring AS HELL.\n\n\nEven when  I found an entertaining way to travel (that is JetPack + glider) the exploration got boring pretty fast. You'll find soon that there is no real danger (you can overrun every creature), no real mystery and not a real rewarding aspect of exploring the world. Even the creatures are always the same. They can change shape and size but the behaviour patterns are the same used over and over.\n\nEven death is not a big deal in this game. You can't really die. You just respawn with everything you have. Damn.. at least take out my stuff and make me get it back where I've died.\n\n\nThe real fun I got from this game is crafting. The shame is that your creations will be used in this doomed and boring world.\n\nOk maybe this review ended to be too HARSH.\nPlanet Explorer is NOT really THAT BAD, but the lack of deepness and polish in almost every aspect of the game is annoyingly hurting.\n\nPlanet Explorer has A LOT OF potential but the developer needs to refine it A LOT more, because it still feels like an Early Access game.\n\nFINAL WORDS\n\nI don't regret buying it, IF it will get improvements.\n\nI hope I'll can give it a thumb UP as soon as possible.\n\nPS:\n\nI suggest the devs to focus on a single aspect of the game and heavily improve that, something that would keep up the desire of playing.\n\nMy idea is to add some unique creation scripts that you get by EXPLORING the world. You can find it by luck or by acquiring around (NPC shop or dungeon) some sort of clues about how to find them.\nAnd creating zones that need a vehicle to be explored.", "timestamp_created": 1490980548, "timestamp_updated": 1491001060, "voted_up": false, "votes_up": 70, "votes_funny": 5, "weighted_vote_score": "0.813577771186828613", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "12534860": {"recommendationid": "12534860", "author": {"steamid": "76561198014770826", "num_games_owned": 382, "num_reviews": 24, "playtime_forever": 7363, "playtime_last_two_weeks": 0, "playtime_at_review": 3831, "last_played": 1434513805}, "language": "english", "review": "One of the best games I have played that has to do with surviving, hunting, and crafting.\n\nDo you like jetpacks, gliders, parachutes? Cars, Helicoptors, Boats? All kinds of guns from using bullets to energy? Making monorail trains even? Then you got to get this game.\n\nComparing this game to other games out there, like Minecraft or Terraria/Starbound, this game is like those but plays even better, and with better graphics. Not to mention, you can either go for co-operative survival, or free-for-all/secretive teaming survival like you would in a game like Day Z. I should also mention, this game allows you to create your own items/vehicles that can be used anywhere in the game!\n\nI very highly recommend this game to anyone who has played any of the mentioned simular games to this, I bet you'll love it, no doubt.", "timestamp_created": 1413606566, "timestamp_updated": 1413606566, "voted_up": true, "votes_up": 71, "votes_funny": 0, "weighted_vote_score": "0.811564505100250244", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "10112349": {"recommendationid": "10112349", "author": {"steamid": "76561198049216744", "num_games_owned": 608, "num_reviews": 10, "playtime_forever": 1488, "playtime_last_two_weeks": 0, "playtime_at_review": 1453, "last_played": 1403323931}, "language": "english", "review": "[b][u]                                 Should you buy Planet Explorers?[/u][/b]\n\nLet me preface this quickly by saying a few things. I used to do almost nothing but\nplay Minecraft. I was running servers and had little free time to do anything else.\nWith that said, ever since then I have had an underlying desire to find a game that \nallowed an in-depth level of creativity while being set in a world that isn't Minecraft.\nI played Starbound for awhile, but I was craving the full 3D world that Minecraft had. \n\nAnyways, enough about Minecraft. My point is, I honestly believe that my search has\ncome to an end. \n\nThis game is amazing. It has the creativity aspect I longed for, it has the construction\nI wanted. It even has a sense of danger while exploring.\n\nFrom what I have played, it sucked me in, and hard. Now, I am not going to say this \ngame is without it's faults. All games have them and this is no exception. It can take \nsome time to figure everything out (I still haven't got it all), but that is part of the fun.\nIt still needs some optimization to fix some minor issues, but it is getting regular TLC\nand updates from the developers. \n\n[b][u]On to why this game is awesome:[/u]\n\n• You can build to your hearts content\n   • Buildings/Houses\n   • Vehicles (Cars/Flying)\n• You can mine deep into the planet for resources.\n• You can craft a massive amount of items\n   • Armor/Weapons\n   • Food\n   • Furniture\n• Jetpacks and Gliders!\n• There are HUGE Monsters to fight\n• Multiplayer!\n• The planets are gorgeous\n• There is a solo \"Story\" mode with missions\n• You can have companions\n• + A lot more![/b]\n\nSeriously, I feel this game has the potential to be the next big game to play with\nyour friends and shape the world to your hearts content. If you loved Minecraft \nand have been looking for something new to play. \n\n[b][u]BUY THIS GAME, DO NOT HESITATE![/u][/b]", "timestamp_created": 1400092355, "timestamp_updated": 1400092457, "voted_up": true, "votes_up": 103, "votes_funny": 1, "weighted_vote_score": "0.810674488544464111", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "12954885": {"recommendationid": "12954885", "author": {"steamid": "76561197975311924", "num_games_owned": 428, "num_reviews": 3, "playtime_forever": 2193, "playtime_last_two_weeks": 0, "playtime_at_review": 2176, "last_played": 1419114530}, "language": "english", "review": "Pro:\n- Open world\n- Active development\n- Active community\n- Can share and download things your create\n- Multiplayer is fun\n\nCons:\n- Huge distances to cover on foot early in single player game.\n- AI is not the best, path finding needs work.\n- Lack of terrain tools to work with. \n\nOver all PE is a fun and enjoyable experience, however some frustrations come up when NPC get stuck and you have to walk a half mile back to get them. Crafting is great and you can download creations that other players have made easily. If you are looking for an open world, good single player story, base building, resource gathering game, then PE is for you.", "timestamp_created": 1416073762, "timestamp_updated": 1416073762, "voted_up": true, "votes_up": 45, "votes_funny": 0, "weighted_vote_score": "0.804276406764984131", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "30573995": {"recommendationid": "30573995", "author": {"steamid": "76561198091515752", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 20835, "playtime_last_two_weeks": 0, "playtime_at_review": 10941, "last_played": 1539303621}, "language": "english", "review": "This! THIS is the direction open world sandbox games should be taking!\n\nI enjoy survival and crafting games, but the biggest problem most of them have is a total lack of purpose beyond simply not dying. \n\nThey usually very quickly become boring and repetative because in game life, even more than real life, mere continued existence is simply insufficient as a motivator for the endless tedium and overly-elaborate crafting systems that lazy developers throw at us in order to disguise the fact that there is only a sketch of a premise for these events to be occuring as they do, or worse, no premise for their game and the player's reason for being there at all.\n\nToo many times have I played such games and tossed them aside because it's just another \"I'm here, because I'm here, because I'm here, because I'm here...\" game. Pointless. Useless. Devoid of purpose or meaning. You may of course have that experience with this game too, if you wish to do so in Adventure mode, etc., but I prefer having some story.\n\nPlanet Explorers is not one of those pointless games. Playing through story mode once just racked up 96.8 hours of interesting and fun gameplay for me. \n\nWhile the dialogue and voice-overs themselves are bit on the amateurish side, the scope and breadth of the story as well as the concepts it seeks to convey are actually quite impressive even by triple-A title standards. Every effort you go to has a purpose. Has meaning. Right from the very beginning.\n\nConstructive purpose, no less. This is important, as most of these kinds of game when they have a premise at all, it is based solely around defense against onslaught by one kind of ravening hoard or other after the apocalyptic downfall of all human civilization. Usually lame-ass zombies.\n\nTo be sure, Planet Explorers also takes place in a post-apocalyptic world. It just wasn't our apocalypse, or our world. Yet.\n\nThe story has a little bit of everything. Humor and meloncholy sadness. Drama and light-hearted fun. Treachery, betrayal, vengeance. The triumph of hard-earned peace and safety along with the horrors and loss of a senseless war no one involved can afford.\n\nThe thrill of real exploration and survival in a harsh environment with the odds stacked against you from the start. Not because of one single reason or agenda, but because half a dozen agendas or more and the chain of events they set in motion converge to create an unforseeable disaster from the viewpoint of any one group.\n\nWhy are you chopping down a tree with this dinky little starting cleaver? Because old Gerdy was in the lifeboat with you and didn't fair as well in the crash. Now you have to craft a shovel to dig up the medical supplies that got buried when you came down.\n\nWhy are you bothering to design your own armed aluminum hovercraft in the creations editor? Because you can sneeze a hole in wood and besides, you want your colonists to look badass when they fly four of them in during their show of force for the Puja in your efforts to bring them to the negotiation table for a peace treaty.\n\nThe game actually strikes a very good balance in the players themselves between the impulse to get more done so they can see more of the story and the knowledge that they must pace themselves, or be caught unprepared at a crucial turn of events in that storyline. A story which has a lot of twists and turns that most often really are very much an unexpected surprise, which is almost always based around a 'Big Thought' concept.\n\nThat's hard to find in nearly any genre of entertainment these days, much less a survival/sandbox/crafting game. This is stuff you usually only see handled in any way by hard and high-level Sci-Fi novels. And even then, only rarely are so many disparate such concepts brought into play for one story.\n\nI would love to see the implied sequal made and would happily buy it in early access. \n\nThese developers did this the way games should be done. They created a world and a story, then built a game around that, rather than building a game, THEN hiring writer to give it an excuse for existing, automatically hobbling any creativity or flexibility in the resulting story, or it's method of delivery.\n\nI could be wrong about that, but even if I am, I must still credit them based on the grounds of their giving the writer(s) a great deal of freedom to tell an interesting story with their platform.\n\nI mean really, when was the last time you actually CARED about your NPC colonists in a game? Knew them by name, personality and profession? Sorrowed if they died, beyond a mere loss in your colony's efficency or production or some such?\n\nStory matters. Purpose in this kind of gameplay matters. Yes the game has some minor faults, but they are made less obvious and more minor because of the engaging story and sense of exploration. Easily overlooked.\n\nGame developers who wonder why their games are being ripped apart in reviews by players on techincalities of gameplay mechanics need to look at this game and realize that the reason it's happening to them, is because they have offered the players nothing else by which to experience or evaluate their games.\n\nNo Man's Sky being perhaps the most recent and glaring example of this downward trend on a lazy treadmill. A game which reached legendary status as and has subsequently become synonamous with the very concepts of nihilistic futility and uselessness of effort.\n\nThis game really does make you feel like you are exploring a new and interesting world, while still lacking in enough specific detail to allow players to fill in the blanks with roleplay if they like, or just fleshing out in their own minds for fun because the concepts and scenario are compelling to think about.\n\nThis game was on sale when I bought it, but it would be well worth the money to experience, even at full price. It's sadly pretty much one of a kind.", "timestamp_created": 1489775034, "timestamp_updated": 1489775034, "voted_up": true, "votes_up": 83, "votes_funny": 3, "weighted_vote_score": "0.804174542427062988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "35668723": {"recommendationid": "35668723", "author": {"steamid": "76561197989618817", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 1304, "playtime_last_two_weeks": 0, "playtime_at_review": 1101, "last_played": 1396059336}, "language": "english", "review": "When people talk about Early Access traps, this is one that comes to my mind. This thing isn't even in Early Access anymore but is very unfinished. Everything from game breaking bugs and UI issues to an incomplete campaign. The developer basically tagged it as finished and abandoned it to move on to the next project. DO NOT waste your money on this...\n\nEDIT: Came back to see how this game had progressed only to find it in an even worse state. Apparently due to some sort of accident with their servers, the multiplayer code got deleted. Don't know how you don't have something as important as that backed up on a hard drive and not just a server... but I guess sh*t happens. After of this, the game is now purely single player, has gone free to play, and the devs are supposedly releasing the source code for the game to the public. Accidental deletion aside, I still definitely don't intend on supporting this team on PE2, or any future project for that matter, and I recommend you don't either.", "timestamp_created": 1507846451, "timestamp_updated": 1562945743, "voted_up": false, "votes_up": 55, "votes_funny": 0, "weighted_vote_score": "0.802070319652557373", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "59686144": {"recommendationid": "59686144", "author": {"steamid": "76561198038114231", "num_games_owned": 169, "num_reviews": 20, "playtime_forever": 77993, "playtime_last_two_weeks": 21, "playtime_at_review": 60459, "last_played": 1712720415}, "language": "english", "review": "Planet Explorers I've spent over 1K hours exploring, crafting and building in a game world that can be played in Story mode to learn all the basic controls. Adventure mode for a vast array of world types for single player. Also has a build mode where you have infinite resources to use to design or tweak items in the creation Editor. It also use to have Multiplayer and Co-op playing modes. Due to a server crash which had controlled all multiplayer and Co-op, that lost all that data for those modes ... the game is now free to play.\n \nStory mode is probably advised to be used to learn all the controls, where for doing simple fetch quests you can be rewarded with scripts. For items you'll be able to craft or use. Most items or scripts could also be bought for money, if you find an npc that has a selling topic. Well actually the money at the start of the game is Meat so all enemies you kill increases your money. The story will lead you though the races and history of the Planet Maria that you have crash landed on. \n\nThe story is okay though most that happens is well broadcast beforehand.  Where your main role is building a colony to gather and train npcs in skills to help in defending the colony from attacks. Building a well defended colony with lots of defending turrets as well as reliable npcs. Planet Explorers makes digging tunnels or excavating underground bunkers easy, even diverting flowing water to your colony.  \n\nTo help with this the game has a creation engine in which you can create almost anything from weapons, vehicles, buildings even furniture all depending on inspiration. Something you have created, can be used at anytime if you have the required resources. So although you could craft a massive diamond sabre or golden crossbow you probably won't find those resources early in a story game. Though the games scanning engine helps to find and to dig down to the spot of the resources your looking for.\n\nThe story and quests are quite simplistic but it has a lovely vibe and has been fun to play, getting to use a glider and fly across the landscape can be quite rewarding.", "timestamp_created": 1576107546, "timestamp_updated": 1576107817, "voted_up": true, "votes_up": 74, "votes_funny": 6, "weighted_vote_score": "0.800587058067321777", "comment_count": 12, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "13228239": {"recommendationid": "13228239", "author": {"steamid": "76561198058465036", "num_games_owned": 0, "num_reviews": 34, "playtime_forever": 2168, "playtime_last_two_weeks": 0, "playtime_at_review": 1761, "last_played": 1425215330}, "language": "english", "review": "An excellent addition to the sandbox adventure/miner sub-genre, Planet Explorers is, in a nutshell, what people who fell for the hype over StarForge were and still are looking for.\n\nWhere Starbound is basically Terraria in space, Planet Explorers has that same relationship with Minecraft but manages to be better. While Minecraft uses block-based voxels to construct its landscapes, Planet Explorers uses OpenCL. This enables the terrain to be just as malleable as that of Minecraft, but look a damn sight better. Though admittedly OpenCL, being a prototype, has a few bugs, one of which is that vehicles travelling at high speed over rough ground have a tendency to clip through the terrain as of 0.85. That said, the bugs present in the alpha of Planet Explorers, albeit slightly frustrating at times, are easily more forgivable than those in [i]certain AAA games[/i] (*stares viciously at EA and Ubisoft*) and barely put a scratch into the rest of the game.\n\nStory mode is easily the best of the three game modes, the other two being Adventure (basically Minecraft Survival) and Build (creative mode). Beneath the magnificent visuals - not to mention the aliens themselves (which look [i]slightly[/i] less silly than those in Starbound) - there is a surprisingly well-crafted storyline with interesting lore and bright characters to explore. Item crafting in Story is tiered depending on how far you are into the story, with simple wooden equipment available for use at the start and more powerful armour and weapons being available for manufacture later on.\n\nSpeaking of crafting, Planet Explorers has what far too few games of this genre have in my honest opinion - a fleshed-out  and incredibly detailed item creation system that is easily mastered to boot. One can create a huge amount of useful, fully personalised items and vehicles - swords, guns, bikes, tanks, helicopters, boats and airborne dreadnoughts, to name but a few. Unfortunately, it is not possible to create custom tools or armour, and firearms are limited to pistols, assault rifles and laser rifles (but this might change soon). Nonetheless, Planet Explorers' powerful item creation system gives it a big leverage over other games of its genre.\n\nTo conclude: do I recommend this game? Of course I do. If you can forgive the glitches and bugs (take into account that this is an alpha, and not a fully released game yet), a wonderful sandbox adventure that has the potential to surpass even Minecraft in its scope awaits the lenient.", "timestamp_created": 1417714760, "timestamp_updated": 1417714807, "voted_up": true, "votes_up": 61, "votes_funny": 0, "weighted_vote_score": "0.80014723539352417", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "22495047": {"recommendationid": "22495047", "author": {"steamid": "76561197979924359", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 1244, "playtime_last_two_weeks": 0, "playtime_at_review": 1244, "last_played": 1428887102}, "language": "english", "review": "Simple reason for voting down: This game is stuck in early access hell. Many of this game's old problems still exist so very long after it was first released. I'm sad to say i'm not convinced the studio is/was serious about making this work, and every month that goes by with minimal development gives birth to similar games and projects.\n\nThe longer you guys wait, the less chance your game has.\n\nA game with great potential, possibly ruined by uncommitted developers.", "timestamp_created": 1460970970, "timestamp_updated": 1460970970, "voted_up": false, "votes_up": 108, "votes_funny": 6, "weighted_vote_score": "0.799344003200531006", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "102884494": {"recommendationid": "102884494", "author": {"steamid": "76561197981255486", "num_games_owned": 0, "num_reviews": 56, "playtime_forever": 1918, "playtime_last_two_weeks": 0, "playtime_at_review": 1918, "last_played": 1454737357}, "language": "english", "review": "The game is absolutely fun and a great idea, but the devs totally abandoned it. It is unfinished. Its a pity, because it was a great concept.", "timestamp_created": 1637075433, "timestamp_updated": 1637075433, "voted_up": false, "votes_up": 47, "votes_funny": 2, "weighted_vote_score": "0.797998189926147461", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "145689659": {"recommendationid": "145689659", "author": {"steamid": "76561198042659352", "num_games_owned": 379, "num_reviews": 31, "playtime_forever": 19756, "playtime_last_two_weeks": 0, "playtime_at_review": 19756, "last_played": 1514854281}, "language": "english", "review": "i joined this game in the alpha. i had not even looked at the news for it since January 2018. it is now 2023 and i am writing my review. with those disclaimers in mind here is my review. \n\nthis game had, and still has i think, the potential to be one of the greatest games ever made. and all of the mechanics needed to reach that potential are implemented. the problem is they are implemented terribly. the game is a buggy mess. i was super involved with the development. and when they announced it was feature complete i thought \"YES finally they will start knocking out the bugs.\" but they never did. you will see on my play time that i had a lot of fun with this game. but if you want a polished game don't play it. i held this game as a monument to the terrors of early access. i delayed buying their next game for years due to how bad this went. and i came here to finally write that negative review i meant to give. \n\nthen i saw it is free now! it doesn't change the disappointment of them saying \"we are abandoning it to do another game from scratch.\" but it does mean that any one reading this review should download this game and play it right now. is it a buggy mess? yes. are there sequence breaks and, near unplayable content? yes. is it an imperfect vision of what my ideal game to ever exist could be? VERY YES.", "timestamp_created": 1693884093, "timestamp_updated": 1693884093, "voted_up": true, "votes_up": 45, "votes_funny": 0, "weighted_vote_score": "0.796029388904571533", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "77058916": {"recommendationid": "77058916", "author": {"steamid": "76561197961375484", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 3206, "playtime_last_two_weeks": 0, "playtime_at_review": 1803, "last_played": 1602438435}, "language": "english", "review": "It is not great, it is not terrible, it is interesting.  Pathea is the poster child for what not to do during development all indie devs READ and LEARN from their mistakes. They were editing code on a live production server.  That server then failed a year after the person who did the coding for the mp server left the company. No backups and no idea how to make it work again wo a rewrite of the whole thing.  Such deplorable management of the company has now made it free to play. [Those who review bombed it due to paying for it and then loosing Multi player are rightfully angery but most write a crap review of \"nope\" or something stupid due to frustration.]\n\nThe content as it stands today is a bit rough but is very playable.  As i understand it the SP game is complete and due to procedurally generation it has some replay-ability.  the story that i have gone through so far is relitivly interesting and the things you can do in game and building wise are complete and fairly interesting.  \n\nThe world looks decent to good and there is a good bit of freedom in building.  I like making moats around my bases with pillars lining it so that when a very large creature spawns in the area and attacks my base has decent defence and can handle its attack. \n\n- procedurally generating the map on the fly with the size of map it is gets a bit frustrating some times as some vehicles can out run chunk generation.\n- no MP any more which was part of the KS pledge and had worked well previously.\n- graphics are a bit rough or unpolished? and probably would have seen some improvement if development continued.\n", "timestamp_created": 1601868255, "timestamp_updated": 1601868255, "voted_up": true, "votes_up": 42, "votes_funny": 0, "weighted_vote_score": "0.794561982154846191", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "15323423": {"recommendationid": "15323423", "author": {"steamid": "76561198003386037", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 21697, "playtime_last_two_weeks": 0, "playtime_at_review": 21286, "last_played": 1475717613}, "language": "english", "review": "You can see i am playing this game for quiet some time now; why do i have so many hours into the game? it's because i am working on cars and ships in the ISO editor most of the time, then go into build or story mode (where i mined enough items and build a colony that works pretty well) and test those creations. At the moment PE is a great construction platform where you can test your creations inside the game environment. \n\nThat said i am missing alot of tools to be able to make better shapes then you can create right now, or only in very difficult and complicated/timeconsuming ways. While i have alot of time and patience myself, i can see why many players don't really try to make nice looking creations, but only stuff 'to get the job done'. Physics are off too in the game, so that makes it even more complicated, for example leveling a ship so it doesn't tilt, or a car getting stuck on every little bump in-world ect. pp.\nI get more to the physics later on.\n\nThe Storymode is fun, because it shows you the mechanics of the game, and introduces you to the basics (and more). At first it can be a little bit confusing when you start in the ship over the planet, but with a little patience you can overcome that.\n\nI didn't play multiplayer very long, because it crashed all the time with memory overflow errors. guess i bought it at a time where they just updated the game from 0.86 to 0.87 and a major bug or bugs kept the game crashing for me. I don't want to get too much into detail what it was, but they fixed that pretty fast in 0.871 so it was playable again. That said, you will run out of memory in adventure mode fast when you travel around alot because the game is still 32-bit, which means that you only have about 3 GB of memory for the game, which is not enough for a long playtime, specially when traveling around alot. (The Textures don't  seem to be updated, they just get added until you crash when you run out of memory space.) I can play story mode in nearly best quality for a long time before things go wrong though.\n\nThe developers are working on a version they call 0.9 which has 64-bit and the new Unity 5 engine, which hopefully solves that memory problem. \n\nGameplay: (i am talking about story mode now, because that is what i usually play:)\n\nAlthough it is alot of fun to play the story, you can see and feel that there is still a lot of work to be done to get the game into more then an alpha stage. i don't really need perfect combat animations, ( they promise to change the combat in 0.9, we'll see), but the world, as pretty as it looks at first glance, becomes pretty uninteresting after a couple hours of gameplay. it just lacks a certain... detail here and there. I think i can explain that to myself reading from others that it's a small team programming the game. How much more detail there will be later on nobody can predict at this point. I also have to put in the fact that the game came out 2 years ago, but they are still working on it, so i see that actually as a positive aspect, keeping a small team in mind.\n\nHowever, there are huge differences in graphics quality that i cannot explain: The animals look GREAT, i mean GREAT GREAT... the area around them for now is more like average compared to them. The animations could be better, but for my taste are more then good enough to make them feel very much alive. The plants, trees and so on on the other hand don't move at all, they are like statues, and if you hit a smaller tree with your ride, it gets damaged and that small tree doesnt move at all getting hit by a 50 t  4x4 tank ;-) . \nPhysics are still lacking here big time, and that is only one example of the physics not really working right atm. I hope they fixe those things later on. \nThe currency in story mode is 'meat', which is... something getting used to. I suggested 'protein' for a supplement, and i got a response they consider it. We'll see :-)  (this is another indicator they take your input seriously)\n\nFrom what i hear they use cash or credit for multiplayer, which is something people just are more accustomed to in games... why just not keep it that way? I never played a game before that uses 2 different currencys in different game modes, and it just complicates things...\nI understand they want to make the story mode more like a survival game mode, but just using a currency that sort of suggests that isn't enough imho. Don't make currency you can eat... no other food at home? just eat some dollar bills! :-)\n\nThat gets me to the fact that i never really feel it being a struggle to survive. At all. You must be pretty dumb or very unlucky to die in story mode. (Running into animals you don't know if they attack or not for example... You can avoid those animals quiet easily.) You cannot starve to death, you just run out of stamina and you get slower. That's it. You cannot dehydrate, you don't need to drink. For me those are basics for a survival game, aren't they? \n\nI don't really see that myself as a big disatvantage, because i like to play in easy mode(s), so it's more of a relaxed gameplay rather then hectic fighting. Getting old.... ;-) But i am sure it will bother other people. Games like \"7 days to die\" do a better job on that: you take damage if you run out of food and/or water plus you run out of stamina while using tools, even more so when you are out of food.\ntalking about 7 days:\n\n [spoiler]On the flipside i don't like those zombies in 7 days (again personal preference), i would prefer dangerous animals that prey on you and that you cannot avoid as easily as in Planet Explorers. But that's another game and another story. I just hope that someday they make a game where the good parts of both games will come together the way i like to play a survival game... :-) [/spoiler]\n\nback to PE:\n\nSpoiler alert: [spoiler] The whole mode shows you how to build a colony at some point, and you can build a monorail later on, which keeps you busy for a while. But survival? Not really at this point. The colony system with planing / harvesting food seems unbalanced and not really needed at all atm, because you cannot die of starvation, you just run out of stamina, and you get slower, that's it. I have a pretty fast computer (i7 3.5 ghz with GTX 770 Nvidia), and my colony is down to about 25 - 30 frames now because of the farming simulation, That really shows it needs alot of optimisation. [/spoiler]\n\nI would prefer they start optimizing things (balancing, physics better framerates) and make the planet look more alive then filing on combat moves. But that is just a personal preference...\n\nI got this game for 50% only a little while ago for 12,50 dollars. (daily deal), otherwise i would have waited longer to buy it. I am happy i got it, i enjoy it alot, even with the shortcomings it still has right now, and as you could see i use it mostly to create stuff. Love that part to death. For 24.99 dollars it's still a good value if you enjoy the story part, which takes you about 20-25 hours to finish (rough guess, depends on many things how long you need for it), and i played that one 2 times alone, because you have the freedom to do it in many ways. Use your imagination.\n\nOh and one important tip: finish the missions one by one, that keeps you out of trouble with bugs. I don't want to go into detail because of spoiler alert and too long of a story :-)\n\nI hope you find my pov helpful, thx for reading!", "timestamp_created": 1428851204, "timestamp_updated": 1428855868, "voted_up": true, "votes_up": 40, "votes_funny": 2, "weighted_vote_score": "0.794451773166656494", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "30682684": {"recommendationid": "30682684", "author": {"steamid": "76561198042327429", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 2035, "playtime_last_two_weeks": 0, "playtime_at_review": 2035, "last_played": 1482571963}, "language": "english", "review": "As others have expressed, I really tried hard to like this game, but it all feels very underdeveloped and unrefined. After playing this game for over 30 hours or so, I wanted to compile a list of things that I had a problem with, for those hesitant about purchasing this game as I have.\n\n*LONG load times: Regardless of which mode you play on (Story, Adventure, Build), you'll find yourself having to fast-travel around the large maps provided. However, each and every time you fast travel, the game has to load in. I've experienced loading times as long as 5 minutes or more and in worst case scenarioes, even had to reload an autosave after the game froze \\ crashed. \n\nI understand that games do need to load in lots of data at a time, but having to wait so long just to get back to my colony is ridiculous and tiresome.\n\n*\"Story\" Mode needs more STORY and character development: I cannot stress enough that there needs to be more STORY in Story Mode. When you first begin Story Mode, it will give you an introduction cutscene showing you and a group of colonists travel the stars on board of a starship. Only moments later, some kind of event triggers and you and your shipmates get shot down and crash land on an alien planet, where you have to survive on. \n\nThe story then thrusts itself upon you as you pick up the pieces. The characters that you meet say that they have met you on board the ship you came in from, but use the stupid excuse that, \"Oh you must have hit your head and forgot who I am\" thing, over and over again. I'm sorry \"Gerdy\" and \"Dr. Allen,\" but I don't know who the HELL you guys are, as the game never gave me much of a chance to meet you prior to this event.\n\n*The voice acting is TERRIBLE: After the introduction cutscene in Story Mode, you'll quickly notice that after talking with the first NPC you see how robotic and how stale and flat-toned the voice acting is. Most people you talk with in conversation don't even sound like a human in real life voiced them; i.e. they sound like a voice similar to Microsoft Sam. It honestly sounds like the voice actors recorded in the bathroom stall at their studio \\ home. \n\nThis is an issue because with a game focused on \"Story\" and \"Character Development,\" it's really hard to get immersed with all these different characters you meet along the way with the dialog so bland and boring. Either hire more talented voice actors or allow us to read text-only dialog, like in Adventure Mode. \n\n*The same BGM (background music) over and over: You can count with one hand the amount of BGMs that are in this game, as there aren't many to go with. It's not so bad at first, but after a few hours you begin to resent the music so much that you eventually disable the music altogether. \n\n*The majority of the questing is BORING: If you've played an MMORPG before, you know the routine: go from Point A to Point B, collect and kill stuff, and turn the quest in. If that's something that interests you, though, then this game will be great for you, as there are a PLETHORA of these type of quests.\n\n*Monster fighting is BORING: Enemies come in 2 varieties, just 2: Charge and attack you straight on with maybe 1-2 abilities, or ARMAGEDDON TERRORS that shoot laser beams and missiles at you. \n\nThe enemies that just charge and attack you may have some abilities that also knock you around literally like a rag doll. Fight with enemies that use knockback are as follows: hit them a few times, dodge roll back, hit them a few times, etc. Repeat this and you win.\n\nThen there are some enemies that are like if Godzilla fused with a Gundam and proceed to start a mini-war with you. If you're playing on Normal like I did, they a virtually impossible to kill, unless you have great gear, a vehicle with weapons on it, or an hour or two in real life to spare taking it down.\n\nThat's not even to mention that one of the only \"difficult\" parts about the enemies is that some of them can take A LOT of damage, e.i. they are damage sponges. \n\n*Skill tree system extremely limits to what you can or can't do: In Story Mode, you don't have the opportunity to use the skill tree system as you are with Adventure Mode, so when I saw the option, I thought to myself, \"Oh cool! This should make the game more fun!\" ..... It didn't and made it pretty frustrating at times.\n\nThe skill tree system in Planet Explorers uses skill points that you can allocate to different skills, such as mining / chopping faster, gaining more materials doing those, doing more damage with weapons, etc. You get these skill points by killing monsters(2-8 SP each), mining(1-2 each node), chopping trees down(1-2 each tree), etc.\n\nMaybe you think to yourself, \"Well, the map is a pretty big place to just be walking around only, so I'll go get the parts and make a vehicle to ride around in!\" You take the time to gather everything you need, maybe even pimp out a custom vehicle ride in the vehicle creator. When you try to \"Export\" the vehicle into the game, though, you'll quickly realize that you need a specific SKILL to even Export something from the creator to in-game (which will cost you hundreds of skill points to farm up to that point). So say you farmed up everything and got the skill to Export the vehicle to the game. You place down your sweet ride and you're about to ride it, but OH WAIT! You need the specific skill to even DRIVE the damn thing (costs another 90 skill points). You see where I'm getting at?\n\nTo even do the most basic gameplay functions requires you to unlock specific skills within the different skill trees. Can't use your new tool or weapon? Get the skill for it. Can't use a specific type of building block or building block shape? Get the skill for it. So on, and so on.\n\nI have played many sandbox survival games for many years and this is the first time I've seen such a system as appalling as this system. If you're playing this game on Adventure Mode, make sure to uncheck this broken system and just stick with the default.\n\n*Food and sleep meter doesn't have much of an impact to gameplay: I never once felt, during my 30+ hours of playing, that the food and sleep meters had any significant consequence against me. I never had the thought that, \"Well, my food meter is almost depleted. I better go eat something before I starve to death.\" There's doesn't seem to be any weight or impact of the gameplay with the current food / sleep meters, other than just losing some stats temporarily.\n\n*NPC Followers and NPC colonists never shut up: This is just a minor point, but every time either an NPC follower or NPC colonists is in need of something, they will vocally tell you that they are in need of it. (I.e. \"I need more ammo!\" or \"I'm too sleepy to work!\"). They will NEVER SHUT UP about it until you give them what they want, much like a toddler does when they want a toy real bad. \n\n---------------------------------------------------------------------------------------------------------------\nI could go on and on about many different aspects about Planet Explorers, but the point I'm trying to come across is that this game needs MORE work on it. \n\nThere's lots of potential in this game, such as the in-game object / weapon / vehicle customization system (very easy to learn, fun to use), and the NPC followers with the colony feature (colonists can farm crops and material for you, base defense, building stuff, etc), but everything else around it needs refinement.\n\nIf what I said above didn't dissuade you, as a customer, in your interest to this game then I suggest you at least download the demo of this game before purchasing and find out yourself.", "timestamp_created": 1490263045, "timestamp_updated": 1490263045, "voted_up": false, "votes_up": 92, "votes_funny": 4, "weighted_vote_score": "0.794159173965454102", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "35402822": {"recommendationid": "35402822", "author": {"steamid": "76561198013101783", "num_games_owned": 0, "num_reviews": 122, "playtime_forever": 6711, "playtime_last_two_weeks": 0, "playtime_at_review": 6628, "last_played": 1533820918}, "language": "english", "review": "This is a half-finished game that ended on a mid-campaign cliffhanger.", "timestamp_created": 1506912441, "timestamp_updated": 1506912441, "voted_up": false, "votes_up": 47, "votes_funny": 2, "weighted_vote_score": "0.789786815643310547", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "12721882": {"recommendationid": "12721882", "author": {"steamid": "76561198000314864", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 11464, "playtime_last_two_weeks": 0, "playtime_at_review": 1277, "last_played": 1588190361}, "language": "english", "review": "After playing loads of Terraria, I was looking for something similar in 3D.\nTherefore I decided to try Planet Explorers, Fortress Craft Evolved, Space Engineers, and Starforge.\nUnfortunately I haven't tried Minecraft.\n\nPlanet Explorers is already very content rich and focused very much on crafting.\nThere are tons of different materials, many recipies come in different assembly possibilities (meaning you can craft the same item with different base-items). \nCrafting a base/colony and protecting it with automated systems is part of gameplay.\nYou can build vehicles, design own items (like vehicles, weapons, housing) for fast crafting in the gameworld in an easy-to-use editor.\nThere is currently a single-player-only story mode, which is fun to play and introduces you step by step into the different concepts of the game, while providing an interesting story.\n\nMultiplayer allows you to define your world. You can choose between Game Modes \"Build\" and \"Adventure\" - giving you different access to ressources (Build - as much as you can carry), recipies, and quests. This is combined with 3 different Game Types \"Cooperativ\", \"VS\", and \"Survival\". The difference between these types are how Teams are created for PVP. While in Cooperative, there is only one team, Survival offers no teams - everybody for themself, VS allows you to choose up to 4 teams.\nThis is combined with two options: infinite ressources and play with/without monsters.\nIn adventure mode - npcs offer random quests but with no story on the bigger scale.\n\nIn multiplayer you are currently limited to 3 character slots.\nThe character customisation is not yet very broad at the moment - but seems to be work in progress.\n\nAnother cool feature are the different monsters - ranging from very little to really huge.\nWith this the game gets a little the feeling of Final Fantasy.", "timestamp_created": 1414837179, "timestamp_updated": 1414839713, "voted_up": true, "votes_up": 38, "votes_funny": 0, "weighted_vote_score": "0.787510514259338379", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "43794166": {"recommendationid": "43794166", "author": {"steamid": "76561198049369341", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 10627, "playtime_last_two_weeks": 0, "playtime_at_review": 6342, "last_played": 1534143063}, "language": "english", "review": "I have been playing video games for over 25 years and this one holds a very special place in my heart,\nIt is rare that a video game is able to make me remember its scenery and occurences so vividly.\n\nI have put many hours into this game and remember when the intro song was added to the game,\nFor some reason it has the strongest nostalgic effect and makes me feel immediately at home,\n\nThis games depth doesnt disappoint me at all. The way the world is made is really nice. How different ores are mapped out over a massive landscape that doesn't have me teleporting all over is really amazing. I appreciate the scope and scale of the game. It is massive, and FEELS big. \nI even bought it for my wife and we play it alongside each other. It is so hard to describe the feeling this game gives. The ability to really freely create your world. I really enjoy the story mode as well. It really does feel like you really are exploring a planet.\n\nEnd of rambles I guess its 3:30am I just installed this game again after not having a computer for a year. I was at the intro screen and my wife got the biggest smile on her face. \"I love that game...and I wish that song was so much longer, it is beautiful\"\n\nPros\nVery immersive\nGreat unique animals\nOpen ended crafting and gear not limited by a class\nAble to have hirelings/bodyguards/NPC buddy that follows you and does chores and fights. Has own inventory\nIncredibly grand scale\nWell done quests and story\nMultiplayer\nSandbox build anywhere\nBeautifully drawn artwork\nGood replayability\nI have played it for years and it continues to improve\n\nCons\nIt's in my dreams! It feels real\nSometimes it is hard to focus on a flower to harvest it depending on camera zoom\nSome monsters straight up roll you because not all things are the same level range. Oldschool like that.\nStory mode is limited though it HAS expanded over time a lot.\n\nThis game plays like a book. It draws me in and makes me its friend. I have played so few games in my lifetime that I can close my eyes and see the other world in its entirety. The landscape, the trees and shrubs and flowers, the animals and different people. The music and the sense of exploration and discovery. Asherons Call, Landmark, and Doom 3.  Now Planet Explorers. These games, to me, sucked me into them, and I felt like I actually was there. I do not know why nor can I explain it. It just is.\nThis game is truly special. Thank you developers for creating this.\n\nI started playing this game in college and am now married with an infant daughter. We bought a blank parcel of land and are building our own homestead from nothing. I sometimes find myself humming the planet explorers title music.  Thanks for reading this very long not thought out but honest review.", "timestamp_created": 1532774309, "timestamp_updated": 1532774363, "voted_up": true, "votes_up": 68, "votes_funny": 2, "weighted_vote_score": "0.786920607089996338", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "117012551": {"recommendationid": "117012551", "author": {"steamid": "76561197986610134", "num_games_owned": 0, "num_reviews": 42, "playtime_forever": 1271, "playtime_last_two_weeks": 0, "playtime_at_review": 1271, "last_played": 1574783166}, "language": "english", "review": "Great potential, fun to play, and completely abandoned before it was done.", "timestamp_created": 1655281994, "timestamp_updated": 1655281994, "voted_up": false, "votes_up": 44, "votes_funny": 1, "weighted_vote_score": "0.785535156726837158", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "85728162": {"recommendationid": "85728162", "author": {"steamid": "76561198167772276", "num_games_owned": 5531, "num_reviews": 105, "playtime_forever": 11576, "playtime_last_two_weeks": 0, "playtime_at_review": 11309, "last_played": 1705868132}, "language": "english", "review": "After losing the code for multiplayer the devs made the game free to play. I understand the frustration of people paying money for a working product and to see now the singleplayer part  given away for free.\n \nOn the other hand I\"m enjoying the game a lot as I can do without multiplayer where some jackass shoots me on sight. \n\nThe game world looks truly alien and the map is huge. I clocked in 188 hrs in story mode and haven't seen everything yet and done all the quests. The creation editor allows you to create anything you can imagine - vehicles, weapons, armor you name it. In build mode you can build your home base looking as simple or intricate you want. I didn\"t  touch the subject of mining and resource harvesting in general yet. If you want to learn more watch a YT video.\n\nI highly recommend the game and hope someday a sequel will see the light of day.", "timestamp_created": 1612140836, "timestamp_updated": 1612140836, "voted_up": true, "votes_up": 51, "votes_funny": 3, "weighted_vote_score": "0.78441232442855835", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "70441102": {"recommendationid": "70441102", "author": {"steamid": "76561198039483107", "num_games_owned": 1352, "num_reviews": 77, "playtime_forever": 540, "playtime_last_two_weeks": 0, "playtime_at_review": 540, "last_played": 1477941487}, "language": "english", "review": "I bought it to support the developers, they stole the money and left.", "timestamp_created": 1591537541, "timestamp_updated": 1591537541, "voted_up": false, "votes_up": 61, "votes_funny": 3, "weighted_vote_score": "0.78324592113494873", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "12608837": {"recommendationid": "12608837", "author": {"steamid": "76561198047365507", "num_games_owned": 0, "num_reviews": 126, "playtime_forever": 6496, "playtime_last_two_weeks": 0, "playtime_at_review": 3819, "last_played": 1524416926}, "language": "english", "review": "Hi\n\nThis game got me captivated from the start, making the long grinding normally associated with sandbox games, a bit easier and faster, without taking \n\nanything away from the genre. Harvesting and collecting resources is still a grind, as it should be, but just much easier feel to it.\n\nThe next thing that really got me, is the very unique creation system. Yeah, you can take parts of a car, connect it with material of your choice, just \n\nthe way you want, and if physics permit, it will go. You will tripple your normal game time just playing with this, and it is not limited to cars, but \n\nmotorcycles, VTOLs, aircraft, boats, weapons, armours, buildings.... just about anything you can build in game, you can first create and paint in the \n\ncreation system.\n\nNow, all the game modes is not implimented yet, and there is a lot of bugs still, it is early access afterall, but it is already a great find and the \n\nsingle player story line is as captivating and immersive, even better than some AAA games. If I could add a double recommend, I would.", "timestamp_created": 1414150968, "timestamp_updated": 1414150968, "voted_up": true, "votes_up": 52, "votes_funny": 1, "weighted_vote_score": "0.782011985778808594", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "76578490": {"recommendationid": "76578490", "author": {"steamid": "76561198038892067", "num_games_owned": 3925, "num_reviews": 66, "playtime_forever": 3580, "playtime_last_two_weeks": 0, "playtime_at_review": 3580, "last_played": 1596387651}, "language": "english", "review": "How can a game of this quality fail while junk prosper?\nThats Steam for you.\nBought this game back in the day and i never regretted it.\nDont be fooled by the negative reviews, this game is good, quirky but good.\nThe developer/publisher decided to make it free once they ceased development for it and dropped the multiplayer servers.\nHow many other companies do that?\nThe only reason im writing this review is the anger against the injustice of the negative reviews, because this game doesnt deserve them.\n", "timestamp_created": 1601099463, "timestamp_updated": 1601099463, "voted_up": true, "votes_up": 70, "votes_funny": 3, "weighted_vote_score": "0.781547188758850098", "comment_count": 8, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "50277732": {"recommendationid": "50277732", "author": {"steamid": "76561198909315034", "num_games_owned": 111, "num_reviews": 18, "playtime_forever": 1568, "playtime_last_two_weeks": 0, "playtime_at_review": 1367, "last_played": 1608029087}, "language": "english", "review": "Okay the game is actually good, however “DO NOT BUY” !!\n\nWhy?\nI’ll tell you why...\nThe game is advertised as a multiplayer online and LAN game so we got two copies.\nNow after a few hours of LAN play, the developers of this game decided to apparently shut down the lobby (intentionally or not) but It has been like this for days. \n\nYou see they say it has LAN play but this is a lie they have a monopoly on how, when or if you get to setup your own LAN game to play multiplayer. They “grant” you this ability (LAN) only if you go through their lobby system. And that’s “if” you can connect to their lobby. Guess what? They can close it for good if they haven’t already done so which means you will never be able to play online again even though it’s advertised that it has multiplayer. \n\nRegardless of the fact that it’s an older title their lobby should remain open forever, especially if they are still collecting money from selling it and not fulfilling their promises at the steam store where they are stating it’s a multiplayer game. \n\nSteam itself is encouraging them because it’s sold on steam store and they will not give us a refund! Now that these devs have broken multiplayer and have locked us out of the experience I’m stuck with it. I’ve since then have read in older post that it’s typical of them to have lobby connection problems and people getting locked out of their multiplayer game. It’s been 4 days and the lobby has not returned.\n\n So now I’m stuck with a single player game I have no interest in because it’s no longer multiplayer.\n Once again, do not get this if you plan on playing it as multiplayer.  You have been warned! Sad because the game was rather good, but I hate being lied to in order to take my money saying it’s multiplayer then suddenly cutting us off. This is theft we have been robbed blind! \n\nGo figure when the situation is the other way around when some people get illegal cracked games the devs cry fowl ball and more than often want to create a law suit on people but this is hypocritical, they can rob people but people can’t  rob them.\n\n That’s okay I see how this double standard works! I don’t condone piracy but some developers deserve it. I won’t spend money with these devs anymore! Will boycott their brand of games. Unless I get a game free as a birthday gift, because they already jacked us up for $20 for two copies of the now broken multiplayer game.", "timestamp_created": 1555996792, "timestamp_updated": 1556072096, "voted_up": false, "votes_up": 35, "votes_funny": 2, "weighted_vote_score": "0.781408071517944336", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "29232010": {"recommendationid": "29232010", "author": {"steamid": "76561198001129731", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 439, "playtime_last_two_weeks": 0, "playtime_at_review": 422, "last_played": 1517473310}, "language": "english", "review": "I don't recommend this game at all.  It feels like Pathea rushed development on this to hit their publish date so they can just get it out of the way and work on their new game, Protoform.  I'm not sure why so many developers think that they can handle the development of multiple titles, but it is very frustrating.  I'm sure that the developers will continue to address persistent bugs through updates and patches, but now that they're moving full steam ahead on their new game, I seriously don't expect them to stay on top of delivering the game that they initially promised two years ago.", "timestamp_created": 1484339969, "timestamp_updated": 1484339969, "voted_up": false, "votes_up": 64, "votes_funny": 0, "weighted_vote_score": "0.78090357780456543", "comment_count": 9, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "24108533": {"recommendationid": "24108533", "author": {"steamid": "76561197966276338", "num_games_owned": 1882, "num_reviews": 94, "playtime_forever": 601, "playtime_last_two_weeks": 0, "playtime_at_review": 206, "last_played": 1495078605}, "language": "english", "review": "Open ended sandbox, storyline exploration crafting game. Build a base, populate and grow it. Make weapons, vehicles etc. Explore the world and search for resources such as ores and plants that are found in certain terrains, then use them to craft everything you need based on schematics you earn or buy from npc's.\n\nWhat it does right, it does very right. What it does wrong, is horrifically bad.\n\nYou can craft almost anything you can imagine. Guns, vehicles, buildings, etc. You make them. All of them. There are very few premades available in the game so you must make what you want or find the plans another player made. If you are creative, you can make almost anything. If you aren't and don't find other players plans, you shouldn't bother with this game. A year ago, there were numerous ISO's for everything you could imagine, but now there are very few since updates have broken previous ISO's and creators stopped making and updating them.\n\nVehicles include cars, bikes, planes, helicopters, boats, submarines, etc. They all share one thing in common. Movement with them sucks. Real bad. Helicopters can't seem to fly above the trees and that would be fine if they didn't get stuck on the trees if you hit one. The ground is so uneven that any ground transport bounces all over the place and hits everything in sight, or just flat out gets destroyed from bouncing and hitting the ground constantly. Turning vehicles is not as easy as you would think and often times hitting an object, backing up turning, then turning more going forward still results in you hitting the exact same object. Vehicles can get stuck on the ground, on the plants, on rocks, etc. Most areas of the map are actually faster to walk through than attempt to use a vehicle. Drive into anything and your vehicle gets damaged. Park near a predator and they will attack your vehicle until it is destroyed or they die. Fly a helicopter into a flying creature you didn't see because of lag and who knows, maybe it stalls and you drop to the ground and die while your helicopter blows up into pieces and leaves you stranded there.\n\nThe map is a limited use abstract with very little details but does allow fast movement between discovered points. The scanner map shows you more of the terrain, but is very difficult to decipher if you are looking for ore and quickly becomes useless if you are digging into a ore vein since it clutters up rapidly. \n\nLighting is almost useless since personal lights point directly forward with no means to use them to light up areas above, below or to the side of the character.\n\nNPC ai is getting better but followers still get stuck on terrain sometimes and can easily be lost when you are crossing a long distance.\n\nCombat is very basic with melee attack only or manually shooting a weapon.\n\nMost quests are easily completed but some hunting quests give you only a name of a creature that is useless if you haven't been playing long enough to figure out what the different creatures are. Some creatures for hunting quests are also difficult to find since they can be very rare creatures or travel around a lot.\n\nUpdates are fairly slow in coming, but progress has been significant in the last year. Crashes still happen fairly often but autosave keeps you from losing more than a couple minutes of progress so they are a minor problem. \n\nOverall, the potential for this game is great, but it does need more work to be really enjoyable. Mostly the vehicle controls and ground smoothing hamper the game at this point. When it takes forever to walk from known areas to new mission areas, it gets tedious fast when you know a vehicle would be faster, but are so not worth the trouble to use.\n\nEDIT: I have played over 100 hours before I got this game on Steam.", "timestamp_created": 1467722969, "timestamp_updated": 1470341993, "voted_up": false, "votes_up": 78, "votes_funny": 3, "weighted_vote_score": "0.78036201000213623", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "34763796": {"recommendationid": "34763796", "author": {"steamid": "76561197985745942", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 892, "playtime_last_two_weeks": 0, "playtime_at_review": 892, "last_played": 1487855673}, "language": "english", "review": "The game could have been excellent, however it suffers from mercurial developers who refuse to complete it because it won't make them more money, like typical avaricious early access indies they have no loyalty or care for the people who bought their game early on in good faith that it would be completed.\n\nDo not buy this game and be very wary of Pathea's future projects as it's very likely they will be abandoned once they feel like they have enough money to cut and run as well.", "timestamp_created": 1504642277, "timestamp_updated": 1504642277, "voted_up": false, "votes_up": 58, "votes_funny": 2, "weighted_vote_score": "0.778233587741851807", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "137144070": {"recommendationid": "137144070", "author": {"steamid": "76561198071124188", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 7148, "playtime_last_two_weeks": 0, "playtime_at_review": 7148, "last_played": 1565028965}, "language": "english", "review": "You may wonder why I have over a 100 hours in this burning bag of crap. That's because at one point it wasn't crap. Years ago before it was abandoned and still receiving updates, there was a genuinely nice game. I'm a sucker for open world CaC RPG's, always have been. And when I first saw this and played it, I was impressed with its procedurely generated voxel world. It was like a more realistic version of Minecraft, but with aliens guns & vehicles. \n\nBeing able to make your own swords and guns in the editor and make them stronger with different materials was a real treat. I hadn't done anything like that before in any other game at the time. But as months went on, the updates got worse and worse. Making bad changes, lots of nerfs and reworks. Like the devs didn't know what they wanted to make or do with the game. And then eventually, abandoned. \n\nHere we are now, the game is free but arguably worse than the older version I played back then. The older version was more wacky in the editor with what you could make. I remember making Gut's Dragonslayer and destroying enemies with it due to its weight and size. But in this modern version you would swing it much, much slower, barely at all due to the weight nerf. I remember putting 4 barrels on a gun to make a minigun, and it would do alot of damage because of it's size and extra shots. But now guns can only have 1 barrel. \n\nBland, boring, The magic is gone. Just a rotting carcass of unkept promises and ambitions. Destined to be removed from steam eventually as many failed made free games do. Sad it turned out this way.", "timestamp_created": 1682210432, "timestamp_updated": 1682210432, "voted_up": false, "votes_up": 41, "votes_funny": 1, "weighted_vote_score": "0.775311589241027832", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "29504589": {"recommendationid": "29504589", "author": {"steamid": "76561197983125091", "num_games_owned": 1509, "num_reviews": 18, "playtime_forever": 7055, "playtime_last_two_weeks": 0, "playtime_at_review": 6141, "last_played": 1491855370}, "language": "english", "review": "I've had this game for years and I pick it up and play it now and again to see how far it's come along. I usually play for a few hours, put it back down and wait for a few updates, because it's still the same buggy mess. Well, now I find out it's no longer in early access, but the game is still extremely unpolished. I know they will still release updates, but it is NOT a finished product in my eyes.\n\nOther than that, the game has/had a lot of potential. Visually it's different from other similiar games, the crafting is really cool because you can make custom items and even share them on steam workshop, you are able to shape terrain, the way you build has a lot of potential, it's not prefabricated walls, you place them block by block, giving you the freedom to build incredible things. I wish these guys would have had the funding or team to bring this to it's full potential, but as it is now as a \"full\" game, I simply can't recommend it.", "timestamp_created": 1485448293, "timestamp_updated": 1485448293, "voted_up": false, "votes_up": 64, "votes_funny": 1, "weighted_vote_score": "0.775194346904754639", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "99500814": {"recommendationid": "99500814", "author": {"steamid": "76561198035495353", "num_games_owned": 0, "num_reviews": 34, "playtime_forever": 12, "playtime_last_two_weeks": 0, "playtime_at_review": 12, "last_played": 1420030988}, "language": "english", "review": "Abandonware. \n\nCould have been great.", "timestamp_created": 1631885911, "timestamp_updated": 1631885911, "voted_up": false, "votes_up": 48, "votes_funny": 1, "weighted_vote_score": "0.774616241455078125", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "32401833": {"recommendationid": "32401833", "author": {"steamid": "76561197978655244", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 28629, "playtime_last_two_weeks": 0, "playtime_at_review": 26164, "last_played": 1532416324}, "language": "english", "review": "Oh, Planet Explorers. The potential you had.  When it first popped up, it seemed like a decent Minecraft clone, with some MMO bits for good measure. And it even has a thing which allows you to design your own vehicles! ( Seriously, aside from prefab wheels and an annoyingly large cockpit, you make the rest out of voxels, and you can even use your own materials!) I've lost hours and hours to that vehicle creation system. \n\nBut the game itself? Pretty bland, actually. The characters are dull, the voiceovers are pathetically awful, and the AI is just... Well, the 'I' doesn't stand for 'intelligence' here. \n\nThere's also graphical issues aplenty, weird inconsistencies with the characters ( Like for eaxmple how some have voiceovers and some do not, some will give you the same quest over and over again, etc.) Also, the weather seems to sporadically decide whether your structures can block water or not. Vehicles randomly flip for no reason, and there's no way to adjust the turning radius of the cars. Flying is.... Interesting, to say the least. \n\nIt's really a shame with a lot of this because the story ( And there IS a story) gets interesting as you get deeper into it. Sadly I've never gotten much past the desert because of the bugs. And the vehicle creator ( Which makes more than just vehicles, by the way) has some huge potential. Or had. It doesn't seem they're doing any work to it at this point. As it sits it's pretty good. \n\nI'd love to give this game a recommend, especially if it was still considered alpha/early access.... But it seems this is the complete game, and as such, I'm going to have to not recommend it, for now. Change my mind, Pathea. Make your game shine.", "timestamp_created": 1497405985, "timestamp_updated": 1497405985, "voted_up": false, "votes_up": 34, "votes_funny": 3, "weighted_vote_score": "0.770426034927368164", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "107986410": {"recommendationid": "107986410", "author": {"steamid": "76561198021479262", "num_games_owned": 87, "num_reviews": 12, "playtime_forever": 80, "playtime_last_two_weeks": 0, "playtime_at_review": 80, "last_played": 1503689825}, "language": "english", "review": "Paid for the game. They took the money didnt finish the game and now its free.", "timestamp_created": 1642171631, "timestamp_updated": 1642171631, "voted_up": false, "votes_up": 38, "votes_funny": 0, "weighted_vote_score": "0.767733871936798096", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "71795249": {"recommendationid": "71795249", "author": {"steamid": "76561197999784924", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 5247, "playtime_last_two_weeks": 0, "playtime_at_review": 5247, "last_played": 1497641845}, "language": "english", "review": "I supported this game on Kickstarters.\nThey dragged their heels, shat out a half-arsed copy, slapped the 1.0 on it and then went to make My Time at Portia.\nTo put salt into the wound they now made it Free To Play.\n\nMy advice: Avoid the game and the developers like the black death.", "timestamp_created": 1593598084, "timestamp_updated": 1593598084, "voted_up": false, "votes_up": 62, "votes_funny": 2, "weighted_vote_score": "0.762813568115234375", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "22366444": {"recommendationid": "22366444", "author": {"steamid": "76561198085530007", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 18668, "playtime_last_two_weeks": 0, "playtime_at_review": 17399, "last_played": 1536060684}, "language": "english", "review": "This is one of the best games I have ever played. It is a mix of survival, RPG and voxel crafting/building. The story is very good (although it can be played sandbox mode) and the crafting possibilities are almost endless. You can custom design everything from armour, weapons and vehicles to building panels and decorations, imported textures/skins and all.\n\nEventhough the building/creative aspect is massive, you can download other player's creations if you are not creative yourself.\n\nIt is still in developement so there are things simply unfinished like the story mode and it has some bugs and optimization issues but these get better with every patch and the devs are very active. The game has been around for years, but it is HUGE. Even the current content is more than any other EA I know of and it is getting bigger.\n\nThe gameplay is super fun, unique and rewarding. Where other games hold back, this game goes all out and does it in a balanced way. You start out with nothing but wooden tools, but not far into the game you will have a jet pack, glider, ground vehicle, helicopter, laser rifles, diamond swords, NPC followers, pet drones and more.  \n\nAlthough the random gen adventure maps need much improvement (and they are being improved) the handmade story map is beautifully made. The flora and fauna are beautiful. The art style is amazing. The creatures are plentiful, well animated and roam in packs that will make you stand in awe as heards of multiple types of creatures roam on the screen simultaneously. \n\nThe resources are balanced and getting them is not grindy. The ratio of docile to agressive creatures seems right and even after hundreds of hours of play I still see a new creature or new plant that I hadn't seen before almost every time I play. There are dozens of different plants and animals.\n\nThe biomes are beautiful, diverse and will keep you well immersed, from the grasslands to the desert to the jungles with luminescent plants that really make you feel like you are on an alien planet reminescent of Pandora.\n\nThere are so many aspects to this game that I could write a small novel just fleshing out a full review and I still wouldn't hit on every point. BUT the game is streamlined enough, has a tutorial system worked into the story mode and has an intuitive enough interface that it does not seem complicated or hard to learn for beginners.\n\nI can't wait to see this game develop and am glad to get in on the relatively early stages.\n\nI would love to see the flight controls have more freedom. Hopefully strafing with A and D will be added as well as rolling with Q and E and directional rotation with mouse movement (like a standard flight simulator) but the relatively basic flight controls aren't really that big of a deal but they could be a lot better.\n\nI recommend playing the story mode to new players as it has a built in tutorial (the story quests cleverly teach you the controls and mechanics of the game) and the map is much more beautiful and optimised. The random gen sandbox maps are pretty bad in comparison and may leave a less than great first impression, but they are procedurally generated and are being improved.\n\nOne can simply play the story mode map as a sandbox by just doing whatever they want and finding the NPCs manually (instead of following the questline to them) to buy the recipes for advanced crafting.\n\nFirst person mode can be accessed by pressing F5 twice. (hitting it once removes the mouse cursor and allows normal third person movement). Although first person mode works alright, it needs some improvement.\n\nRemember that the game is in developement and the story is not yet finished atm (you will eventually hit a dead end) and some colony management mechanics are not finished either. BUT there are already more mechanics in the game than pretty much every other EA survival/crafting game and many hours of fun can be had with the story mode especially since you can play it as a sandbox.\n\nPE can be played single player OR multiplayer, offline on a public server or private coop with friends. Admittedly, setting up a private VPN server is a little tedious as it is not implemented natively yet, but it can be done and I did it just by wathching a youtube tutorial. Even the story mode can be played multiplayer.\n\nYou will not be disappointed with this game if you like the idea of a mixture of survival/crafting/rpg and understand what an EA is.\n\nEven if PE didn't develop any further than it currently is, I definitely got my money's worth and will continue to play it for hundreds of hours, but the devs are not showing any signs of slowing down. PE is headed towards another major release milestone soon and I can't wait.\n\nCheck out my gameplay of PE on my twitch past broadcasts or watch me play live at www.twitch.tv/thresholdseven", "timestamp_created": 1460424065, "timestamp_updated": 1460429548, "voted_up": true, "votes_up": 56, "votes_funny": 3, "weighted_vote_score": "0.761999547481536865", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19928141": {"recommendationid": "19928141", "author": {"steamid": "76561197979754703", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 5698, "playtime_last_two_weeks": 0, "playtime_at_review": 5663, "last_played": 1458089727}, "language": "english", "review": "((i love this game but the world generator is in a horrible state atm :( ))\n\nOk i have played .9 and i am very happy to say that the world gen is fixed as far as i can tell! the fact that we can play story cooperatively is awesome, there are many different game modes worth many hours of game-play! also im getting close to 70 frames on \"Fantastic\" graphic settings, i believe the devs were right to rework the game. in my eyes a0.9 is a great success although a little late.... still a great release!\n\nUpdate: Wtf Devs??????????????", "timestamp_created": 1451023341, "timestamp_updated": 1695782901, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.755958259105682373", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "39350102": {"recommendationid": "39350102", "author": {"steamid": "76561197987292682", "num_games_owned": 949, "num_reviews": 320, "playtime_forever": 6290, "playtime_last_two_weeks": 0, "playtime_at_review": 3064, "last_played": 1520228068}, "language": "english", "review": "01/18/18 EDIT: After 40+ hours of game I hit a game breaking \"known\" bug. I'm still having a blast playing this, but I'll adivse any new players to keep a bunch of saved games to fall back to in case of hiting a bad bug.\n\n[h1]Like Starbound, but 3D[/h1]\n\nI don't get why this game has a \"Mixed\" reviews score. The game is a huge voxel sandbox, with lot's to do and a great crafting system. It's not a FPS, or a shooter for that matter, but an exploration game. There's lots of action, but it's not the core of the game and falls short of many first or third person shooters. First person camera doesn't work very well (I never use it), but those are all the cons I can think of. Other than that, this game is an immersive exploration adventure, with a great creation system (you can design literally anything and put it in game), a simple crafting system, survival gameplay (sleep and hunger). I wholeheartedly recommend this game, if you are out for adventure, not for shooting/action.\n\n[b]Pros[/b]\n\n[list]\n[*] Huge voxel world to explore, that can be procedualy generated.\n[*] Story, adventure and creator modes, so you can customize your game a lot.\n[*] Land, air and water vehicles. Including the glider, jetpack and scuba gear.\n[*] Decent melee and shooting gameplay (not great, but playable).\n[*] [b]Amazingly easy to use \"Creator\", where you can make anything and put it in the game, or download other ppl's creations and use them.[/b]\n[*] Survival gameplay, you have \"hunger\" and you need to sleep.\n[*] Amazing alien flora and fauna, kinda cartoony, but cool.\n[*] Unobtrusive crafting system, similar to Starbound's but easier.\n[*] Multiplayer.\n[/list]\n\nCONS\n[list]\n\n[*] Rough in some edges.\n[*] First person camera is kinda jiggy.\n[*] Bad pathfinder for NPC, which is fixed by \"teleporting\" them every time they are stuck, which is hilarious to see at times.\n[*] Shooting/action part of the game is not excellent. You also get \"invisible walls\" (glitches) sometimes in the jungle.\n[*] Some bugs.\n[*] Heavy on resources.\n[*] game breaking bugs, KEEP MANY SAVED GAMES!\n[/list]\n\nI'm playing this on Ubuntu 16.04, with an nVidia GTX 1080 GPU, and the game runs smoothly in \"fantastic\" graphics. [b]I appreciate the efforts the devs made to release this for Linux[/b]", "timestamp_created": 1515966206, "timestamp_updated": 1516310317, "voted_up": true, "votes_up": 44, "votes_funny": 1, "weighted_vote_score": "0.75527721643447876", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "114979191": {"recommendationid": "114979191", "author": {"steamid": "76561198046677747", "num_games_owned": 238, "num_reviews": 4, "playtime_forever": 186, "playtime_last_two_weeks": 0, "playtime_at_review": 186, "last_played": 1486075521}, "language": "english", "review": "Everyone has a kickstarter mistake and this is mine.", "timestamp_created": 1651745017, "timestamp_updated": 1651745017, "voted_up": false, "votes_up": 46, "votes_funny": 8, "weighted_vote_score": "0.754239976406097412", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "48617353": {"recommendationid": "48617353", "author": {"steamid": "76561198089793596", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 13124, "playtime_last_two_weeks": 0, "playtime_at_review": 12173, "last_played": 1521510567}, "language": "english", "review": "Plain and simple: The devs abandoned the game unfinished.", "timestamp_created": 1548717759, "timestamp_updated": 1548717759, "voted_up": false, "votes_up": 52, "votes_funny": 2, "weighted_vote_score": "0.753969848155975342", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "32307857": {"recommendationid": "32307857", "author": {"steamid": "76561198097348844", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 10975, "playtime_last_two_weeks": 0, "playtime_at_review": 9866, "last_played": 1497705879}, "language": "english", "review": "This game has so much potential to being a really great game.\nWhat this game has:\n1) You can build\n2) You can mine\n3) You can create vehicles like cars, planes, boats etc\n4) You can create your own weapons and armor\n5) You can ride on monsters or animals\n6) You can build up or create a colony\n7) It has multiplayer and single player modes\nWhat this game needs\n1) It needs to optimize the world rendering speed in adventure mode because when you are flying a jet at 236kmhp you will encounter that your jet will be stuck in place while the world is rendering the lands and other stuff\n2) It needs to improve first person camera it's not good at all\n3) It needs to add usable accessories for the guns like the sniper it needs a working scope or else it's not a sniper just a powerful rifle\n4) The aircraft controls need to change, like it needs roll, pitch and yaw.\n\nDo I recommend this game yes I do it's a fun game and I hope the devs finish this game.\n\nSpecs I have when I was playing this game\nIntel core i7 6700\n16 GB of DDR4 RAM\nGTX 1070 HOF\nWindows 10 Pro 64bit\nSo rendering isn't a problem on my end the game needs to be optimized", "timestamp_created": 1497066247, "timestamp_updated": 1497066247, "voted_up": true, "votes_up": 37, "votes_funny": 1, "weighted_vote_score": "0.752874851226806641", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "48227814": {"recommendationid": "48227814", "author": {"steamid": "76561197979391069", "num_games_owned": 309, "num_reviews": 35, "playtime_forever": 5115, "playtime_last_two_weeks": 0, "playtime_at_review": 4354, "last_played": 1599657040}, "language": "english", "review": "Ok, so you've left this game unfinished... At least give your supporter a copy of \"My Time At Portia\" as compensation.", "timestamp_created": 1547142697, "timestamp_updated": 1547142697, "voted_up": false, "votes_up": 75, "votes_funny": 5, "weighted_vote_score": "0.750976800918579102", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43883569": {"recommendationid": "43883569", "author": {"steamid": "76561198062708423", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 4569, "playtime_last_two_weeks": 0, "playtime_at_review": 4118, "last_played": 1651656881}, "language": "english", "review": "If you can get past the goofy models and animations, the bizzare, disjointed story, the awful voice acting, and the occasional bugs/lag issues, this game is beautiful. It's the best game I've ever played in the open world survival-craft genre. \n\nCons:\n-humans are badly modeled and animated\n-little story, very confusing\n-iffy framerate sometimes\n-bad voice acting\n-bad friend ai\n-multiplayer lag (also you'll have to find a friend, there's no active community)\n\nPros:\n+long, well paced tier progression in terms of materials and enemies\n+MASSIVE map which has a lot to do\n+beautiful environment which feels very alien. The environment never really gets old and there's always more cool features to discover.\n+tons of interesting enemies with different mechanics\n+enemies stay difficult as you progress\n+resource collecting & building both work smoothly\n+resources come from a wide variety of sources\n+scanner makes mineral collection interesting; you explore the map to find deposits of rare materials, rather than just digging and hoping you get a vein\n+design your own weapons and vehicles both visually and mechanically\n+design a colony, upgrade it, delegate tasks to colonists, etc. (useful but not necessary for doing well)\n+most of the bugs are a lot more entertaining than annoying (ie, animals folding into goofy positions)\n+huge crafting system\n+you have a massive inventory which sorts its self so you dont need to manage any type of 'banking'\n+well paced and enjoyable to play\n\nOverall: \nOn the surface this game isn't very enticing, but as soon as you dig your teeth into the game and start exploring in ernest, there's a wealth of content which is immersive, engaging, and incredibly creative. I probably spent half of my time in this game aimlessly exploring the world. I've covered less than half of the 'island,' and enjoyed every moment of it. This game is a hidden gem and I suggest you check it out.", "timestamp_created": 1533174650, "timestamp_updated": 1533174650, "voted_up": true, "votes_up": 28, "votes_funny": 2, "weighted_vote_score": "0.750641107559204102", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "33254828": {"recommendationid": "33254828", "author": {"steamid": "76561197995561077", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 3730, "playtime_last_two_weeks": 0, "playtime_at_review": 3470, "last_played": 1499150029}, "language": "english", "review": "Planet Explorer's is a beautiful game, with interesting game mechanics but an unfinished feeling the entire gaming experience.  It's a great game if you have the patience for it-the dev's also appear to be constantly updating the game so hopefully this game will improve. \n\nFirst off, the game has a steep learning curve and doesn't fully explain many mechanics in the game.  And just enough bugs and glitches to have you wondering if this is a game glitch or just a mechanic that's not fully explained.  For this game I found that google was my friend and often looked up problems I encounter in the storymode. \n\nThe building, mining, collecting resources are fun. You have a tool/weapon progress that starts at simple wooden tools and progresses up the technologicl tree as better resources become available. Although this too feels unfinished, as if they intended to release a few more higher teirs of tools and weapons but never released them. \n\nAs you can see by the pictures, you can craft some amazing things. Custom vehicles, weapons, etc except again there's a large learning curve and it's not very practical. Let me explain. So you wanted to craft a new gun, you collect the necessary parts, enter the creation system and start designing the actual lines of the gun. You make the gun look amazing, except due to the wierd rules of the creation system, your amazing looking gun does little to no damage.  After spending a good chunk of time designing a gun that looked neat but did no damage I entered the creation system. Put all the gun parts in the area and filled the entire area with diamond block. My \"gun\" was a big block of diamond with a barrel sticking out of it, that did 600 damage.  Vehicles also seem to full of problems. Driving cars take high amounts of durability damage along with a plague of other problem that make traveling with vehicles nto really worth it. Which sucks because the map is large and things are really spread out.\n\nThe Jetpack and glider were my bread and butter for transportation. \n\nThe storyline wasn't anything special at first, although they threw a few interesting curve balls and twists. I felt like the game ended in a satisfying way, although the overall experience felt like something was missing. Honestly I'd love to see what this game company can do with their second Planet Explorer game. \n\nPerformance. I had no problem running on max settings, although I noticed that regardless of my settings when NPC colonists would sleep for the night the game were stutter and freeze with performance issues. Upon looking online it looks like this is a fairly common problem. \n\nThe colony system is an interesting one. They are actually useful at maintaining your colony and will do a variety of tasks. Although the AI isn't very good, NPC would often hangout underwater or walk off tall buildings/cliffs. Various machines that you can build inside your colony have different functions; some of those functions are finished while other's I suspect will be changed in future patches. \n\nAlthough this review is full of criticisms that game is fun, the storyline can be interesting and underneathe all the flaws the game is really amazing. But there's alot of flaws, you need patience to play this game.  \n\nAt first I recommend this in the review and then after a few days comtempllation I reversed my recommendation. It's a great game at it's foundation, but it's not there yet. If the game was still in early access my review would be different. I realize that although I did have fun, it's not likely that I'll replay the game again.", "timestamp_created": 1499215689, "timestamp_updated": 1499398047, "voted_up": false, "votes_up": 50, "votes_funny": 0, "weighted_vote_score": "0.750553488731384277", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "18926147": {"recommendationid": "18926147", "author": {"steamid": "76561198058971699", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 361, "playtime_last_two_weeks": 0, "playtime_at_review": 318, "last_played": 1446887275}, "language": "english", "review": "A beautiful mess, and the reason I'll never buy another \"early access\" game on steam again. \n\nPRO\n- enchanting atmosphere, real alien planet feeling, vivid colors, everything is alive\n- nice music complements the beautiful scenery\n- crafting is great (can make vehicles, weapons, etc.)\n- you can fly, glide, jump, soar--- \n- you can CANCEL QUESTS!! (Skyrim, are u listening?!?!) \n\n\nCON\n- crash, burn, freeze like no other game\n- has been in development for ages and no end in sight\n- QUEST BUGS such as:\n    - get stuck in a quest coz NPC \"doesn t recognize you\"\n    - unfinishable quests\n    - self-repeating quests (you finish it and then the same NPC \n       asks you to do the EXACT same quest again...)\n    - You never know if you did something wrong, or just bug\n   \nLike when I had to protect my village from monsters and they just kept coming. \nAfter a while it became suspicious --- and when I looked it up online it turned out\nthey were supposed to stop after 3-4. I killed like 3-400 and they still kept coming. bull*hit. \n \nMany times you have to escort NPCs (hate these in every game but especially here) and they\njust get stuck in the environment, or worse, simply disappear. Even when you escort them, sometimes\nthey dont seem to recognize this and they just keep following you ad infinitum. \n\nSUM\nI really love this game and it shows so much promise and I absolutely love the atmosphere. \nUnfortunately development has been...slow... and mostly unreliable. They seem to be more concerned with\nadding flashy stuff than making the game playable. At this point it feels more like an editor than a game. \nThis game could be so much if it could ever get finished....\n\ntldr: \nadd to your wishlist, buy when it s done\n\n\n\n", "timestamp_created": 1446888715, "timestamp_updated": 1446888715, "voted_up": false, "votes_up": 172, "votes_funny": 17, "weighted_vote_score": "0.746269702911376953", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "29797222": {"recommendationid": "29797222", "author": {"steamid": "76561197990025482", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 4662, "playtime_last_two_weeks": 0, "playtime_at_review": 4662, "last_played": 1486541311}, "language": "english", "review": "Backed this game way back in 2013, tried running it on my potato, gave up, forgot about it.\n\nInstalled it on a whim and 75hrs later... wow! \n\nNow, let's start with the bad: This is definitely [i]not[/i] a buttery smooth polished triple-A game. Planet Explorers has every mark of an over-ambitious idea that the developer struggled to fulfill. \nGameplay is a tumorous mass of many different systems that range from kinda fun to passable to downright infuriating. I could pick nits for days: The durability system is rage-inducing. The combat could use a [i]lot[/i] of tweaking. The creation system, while cool in and of itself, has only a marginal effect on gameplay.\nThat said, there is about as much jank and brokenness here as there was in Skyrim or FO3 at release, and those [i]were[/i] triple-A titles with a similar premise.\n\n\nNow that I took a dump on the game, here's why you should get it: [b]Do you want to feel like a Planet Explorer? Get this game.[/b] Planet Explorers gets a thumbs up and a permanent spot in my \"good games\" bookmarks because it captures the joy and wonder of exploration. Up until the very end of the story playthrough, the game consistently delivers moments of \"whoa, this is awesome,\" or \"what the hell is [i]that[/i]? I should poke it and see what happens.\"  \n\nThere are several different biomes - not a new concept. Yet, unlike those of some other games, the biomes of Planet Explorers actually look, feel, and sound different. There is an astounding amount of (visually) unique flora and fauna. The landscape is sprinkled with several landmarks and points of interest that are [i]not[/i] marked on your map until you find them (unless it's for a quest). Sure, my companion NPCs may be teleporting repeatedly into midair behind me, but I don't care because I'm hang-gliding through a massive freakin canyon with like three kinds of weird lookin' birds flying around and HOLY FUCK IS THAT AN [spoiler]ALIEN DAM[/spoiler] UP AHEAD?!\n\nA word on the story: It's actually pretty good, and, dare I say, engaging! The pacing of the story is interesting as it progresses from pure survival, to exploration, to colonization. There are a few twists and memorable moments. I was also pleased that, despite the glitchiness of the game systems, I did not run into a single case of the story getting stuck or quests getting messed up.\n\nTL;DR: The gameplay systems are quantity over quality due to overreaching ambitions, but the atmosphere is freakin A+ good. 8/10, would explore again.\n\nAside: The original kickstarter for this game asked for only $100k, and got $140k. Comparing this to all the KS's that got millons and produced jack diddly (looking at you, Broken Age), I'm impressed with what these guys managed to pull off. I'm sure they had other sources of funding, but the fact that they managed to spin up with so little is still impressive.", "timestamp_created": 1486629054, "timestamp_updated": 1486629224, "voted_up": true, "votes_up": 44, "votes_funny": 0, "weighted_vote_score": "0.744808435440063477", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "14089781": {"recommendationid": "14089781", "author": {"steamid": "76561198080019448", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 3845, "playtime_last_two_weeks": 0, "playtime_at_review": 3145, "last_played": 1514974521}, "language": "english", "review": "This game is really fun for an early access, although I waited until a steam sale and got it for 14.99 (gotta save those shekels, oy vey!).\n\nIt's like minecraft with great visuals set on some planet with dinosaurs. And jetpacks, planes, boats and bikes. That you build, from scratch in a CAD editor that is actually very simple to learn. It also has a story.\n\nIt has bugs, nothing too major apart from pathing issues with NPCs. \n\nI give it 9 out of 10 yarmulkes.\n\n", "timestamp_created": 1421798295, "timestamp_updated": 1421798295, "voted_up": true, "votes_up": 75, "votes_funny": 73, "weighted_vote_score": "0.744377613067626953", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "35119095": {"recommendationid": "35119095", "author": {"steamid": "76561197967375861", "num_games_owned": 1304, "num_reviews": 104, "playtime_forever": 1527, "playtime_last_two_weeks": 0, "playtime_at_review": 1527, "last_played": 1505692940}, "language": "english", "review": "Abandonware. Dev is working on his next future abandoned project.\n\nGame breaking bugs stop all progression.\n\nThe resolution from the dev? Restart a new game.\n\nSo 25 hours into my save game and I should restart for a CHANCE at the bug not occuring again.\n\nYa....no thanks.\n \nFix your damn game.\n\nThe bug is still present since March of 2017. http://board.pathea.net/index.php?topic=9837.0", "timestamp_created": 1506050247, "timestamp_updated": 1523583630, "voted_up": false, "votes_up": 86, "votes_funny": 1, "weighted_vote_score": "0.743661820888519287", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1522636845, "developer_response": "Thanks for the feedback, would you be able to send your save files to admin@pathea.net, we will look into this, it will be really helpful : D"}, "26727879": {"recommendationid": "26727879", "author": {"steamid": "76561198015569520", "num_games_owned": 157, "num_reviews": 30, "playtime_forever": 3609, "playtime_last_two_weeks": 0, "playtime_at_review": 3609, "last_played": 1480107931}, "language": "english", "review": "I have a really strange feeling about this game. I enjoyed it, thus thumbs up, but I would be really careful about recommending it to anyone. Unless you know you are into such games, don't buy it. It has nice storyline, and I spent hours downloading and tweaking helicopter models, but there is not much beside that. \n\nThe main supposed feature of the game - dig anything, build anywhere and whatever you want - it is not there. Yes you can dig up any terrain, but there is little sense doing that. You need to dig mines for resources. slowly with wooden tools first, then faster and faster, as you progress through iron, steel, diamond and ultimately CheatEngine universal digging tool, giving you literally billions of any resource in a couple of seconds, because farming in singleplayer is not something I fancy doing during this couple of free hours that I can spare for gaming. \n\nApart from mines, there is nothing to dig for. I never found any caves apart from those from the plot, I never needed to build a bridge, dam or any other stuff that took hours of my time in Minecraft. \n\nYou can design literally any vehicle, item, armor, weapon, but this design is but a skin. Mechanics-wise that will still be the very same default game object, just reskinned and with tweaked numbers. Vehicles are treated as single objects with HP. You can make a dumb sheet of steel with driver, weapons and engine just sitting on top, or you can make an intricate APC with components shielded by armor, and both these variant will work exactly same. When HP drops to 0, it explodes, can't damage a weapon, engine, or kill the driver. \n\nFunctional buildings are all pre-made, so you just dig resources and 'buy' a power plant, which is just an object. I remember fun I had, designing monster plants in MC (where you literally build a facility with real output from irrelevant stuff that was not specifically meant for that purpose), nothing of the like here. Building a colony is little fun after you figure that you just need enough even land to place a bunch of buildings-objects together, but can not really design anything meaningful by yourself. \n\nGuess were it not for the story, I'd spend way less time in the game, and I have no idea what I'd do in it now. The story does it though, long, catching, true-like, with well-written texts. So, if you are looking for an adventure, that should be fine. If you want advanced Minecraft, it's not that. Not that at all.", "timestamp_created": 1479717705, "timestamp_updated": 1479718372, "voted_up": true, "votes_up": 49, "votes_funny": 5, "weighted_vote_score": "0.743133723735809326", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "37981112": {"recommendationid": "37981112", "author": {"steamid": "76561198027865629", "num_games_owned": 453, "num_reviews": 7, "playtime_forever": 4712, "playtime_last_two_weeks": 0, "playtime_at_review": 4712, "last_played": 1504757148}, "language": "english", "review": "I'm at a 50/50 split on recommending this game. \n\nI had fun with it! \nDespite getting stuck in trees, phasing through walls, and breaking questlines (plus the reloading of save files a fair few times) it had it's moments. I built a bunker-like settlement buttressed with automated defences; I've jetpacked up mountains just to glide off the peak and into a canyon or follow a river; I rode a monorail through an alien forest and expanded it across some grasslands.\n\nIt would be a great game it if was ever finished and polished.\n\nAs it is now I will recommend it only if you have the patience to deal with the bugs/reloading/googling-how-to-fix-things. \nIf so, you will most likely have a decent experience with a few high points. \nIf not, you'll probably become frustrated and wonder why this still isn't marketed as Early Access.", "timestamp_created": 1512147626, "timestamp_updated": 1512147719, "voted_up": true, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.742932617664337158", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "72729864": {"recommendationid": "72729864", "author": {"steamid": "76561198072331805", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 20812, "playtime_last_two_weeks": 0, "playtime_at_review": 14813, "last_played": 1706706149}, "language": "english", "review": "I'm only writing this now because I'm seeing a whole lot of undeservedly negative reviews, but for the right kind of person this is an absolute gem. The only thing I really hate about it is that the map is procedurally generated and then as you explore and change the terrain voxels and build stuff it gets saved and loaded instead of regenerated, which means it takes longer and longer to load your save game the more you explore.\n\nHOWEVER I paid full price and it was worth it. I feel like unless you're playing story mode, building colonies is almost kinda pointless but I played well over 200hrs in survival and it was amazing. The worlds are huge, immersive, and actually exciting to explore. There's a thrill to finding and exploring dungeons, wondering if you'll get those recipes or loot you're hoping for. Enabling the skill tree allows you to go from a humble peasant getting killed by the smallest creatures to a war machine fleet commander taking on entire alien towns in your massive invulnerable flying fortress bomber that you designed yourself. It's like a futuristic RPG/city builder/survival game in one.\n\nThis game had so much potential that it was on its way to being the best game in existence and I'm really disappointed and confused as to why it was abandoned but even after all these years if I didn't have anything more important to do I would totally still give in to my urge to play again. Would 100% recommend.", "timestamp_created": 1594816630, "timestamp_updated": 1594816630, "voted_up": true, "votes_up": 50, "votes_funny": 3, "weighted_vote_score": "0.74095618724822998", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "68919593": {"recommendationid": "68919593", "author": {"steamid": "76561198084622747", "num_games_owned": 171, "num_reviews": 114, "playtime_forever": 516, "playtime_last_two_weeks": 0, "playtime_at_review": 516, "last_played": 1544940266}, "language": "english", "review": "As an Early Access project, this game had some really great ideas, and great potential.  I am a builder and in November of 2016,  I was very impressed with the systems and design materials, even though it needed polishing and optimization.  Workshop support was minimal, but it was there.  I took a long break to let the Devs finish their project.  \n\nFast-forward to May 2020.  Looks like it is \"Finished\" in a rather new definition of the term.  You simply remove the Early Access tag and walk away. \n\nI guess the price is right.  It is now a \"Free-to-Play\".  Unfortunately, I paid for the game before it was abandoned.  \n\nThumbs All The Way Down.", "timestamp_created": 1589138839, "timestamp_updated": 1589148413, "voted_up": false, "votes_up": 31, "votes_funny": 0, "weighted_vote_score": "0.739941716194152832", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "47845477": {"recommendationid": "47845477", "author": {"steamid": "76561198055533323", "num_games_owned": 504, "num_reviews": 131, "playtime_forever": 804, "playtime_last_two_weeks": 0, "playtime_at_review": 804, "last_played": 1545855887}, "language": "english", "review": "WARNING: This game prevents you from being able to refund it.\n\nI played it last night and left my computer on. When I came back in the morning, I noticed that the game had a zombie process running in the background which caused me to have 13 hours logged. https://i.imgur.com/XNfG98X.png", "timestamp_created": 1545855967, "timestamp_updated": 1545855967, "voted_up": false, "votes_up": 89, "votes_funny": 8, "weighted_vote_score": "0.738274633884429932", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "11368486": {"recommendationid": "11368486", "author": {"steamid": "76561198013980703", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 2532, "playtime_last_two_weeks": 0, "playtime_at_review": 2328, "last_played": 1534463828}, "language": "english", "review": "I think the game is worth it in its current state, you can build cars, aircrafts, boats, and different buildings in the world, so the creative part of the game is 100% playable and very enjoyable in my opinion. If you only want to build and build and build you should definitely get this game. But you can't really do much with the stuff you built (in survival/adventure) because of performance issues, so if you only want to play survival you may want to wait until they fix the performance related problems/release a 64bit version. I played my world in adventure mode for over 15 hours before I stopped because it just became unplayable. It happanes after some time, the game will constantly run out of memory and will run at 10-15FPS (it starts at 60 and gets worse and worse as you build, mine and do stuff). I have an i5-760, 12GB of RAM and a GTX 770, for reference.", "timestamp_created": 1406073722, "timestamp_updated": 1406073722, "voted_up": true, "votes_up": 39, "votes_funny": 0, "weighted_vote_score": "0.735304951667785645", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "20435915": {"recommendationid": "20435915", "author": {"steamid": "76561198032767908", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 1572, "playtime_last_two_weeks": 0, "playtime_at_review": 1558, "last_played": 1452387363}, "language": "english", "review": "Ive owned this game since it came out almost 2 years ago, and I originally reviewed it as positive.  I cannot in good conscience recommend this game anymore to anyone.\n\nThis game has (had) huge potential to be a good game.  It's voxel based, doesn't focus on graphics, and would be incredibly easy to add content to (presumably).\n\nThat being said, I've waited 2 years for major changes to the game and they never came.  Workshop content and build sharing is fun, but to be point blank the devs let this game stagnate to the point where it's been outstripped by miles, by too many other survival/builder games.  We went over 1 year without an update, 1 year.", "timestamp_created": 1452387176, "timestamp_updated": 1452387176, "voted_up": false, "votes_up": 100, "votes_funny": 4, "weighted_vote_score": "0.73315894603729248", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "13360176": {"recommendationid": "13360176", "author": {"steamid": "76561198093083218", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 1097, "playtime_last_two_weeks": 0, "playtime_at_review": 969, "last_played": 1437495141}, "language": "english", "review": "Exactly what I've been looking for!\n\nI have been in a state of distress ever since seeing some pre-release footage of 'No Mans Sky', and this has filled that hole perfectly! A massive, wonderous, and dangerous open world crafting game with far more posibilities than I've had time to explore. Explore, farm, build, fight! This is a great game to play alone or to get stuck in with some friends, as you form a squadron of jetpack lunatics zooming around the map!\n\nEven as a early access game, it's a solid 8/10", "timestamp_created": 1418552440, "timestamp_updated": 1418552440, "voted_up": true, "votes_up": 36, "votes_funny": 1, "weighted_vote_score": "0.732330024242401123", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "121996667": {"recommendationid": "121996667", "author": {"steamid": "76561197993174609", "num_games_owned": 0, "num_reviews": 39, "playtime_forever": 8253, "playtime_last_two_weeks": 0, "playtime_at_review": 8253, "last_played": 1466061340}, "language": "english", "review": "Abandonware", "timestamp_created": 1662756253, "timestamp_updated": 1662756253, "voted_up": false, "votes_up": 38, "votes_funny": 3, "weighted_vote_score": "0.731420934200286865", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "55622190": {"recommendationid": "55622190", "author": {"steamid": "76561198043629614", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 28828, "playtime_last_two_weeks": 0, "playtime_at_review": 1127, "last_played": 1697910188}, "language": "english", "review": "[h1]Seriously, why all the hate?[/h1]\n\nYes, there is no multiplayer. Seeing that I got it for free after the devs scraped multiplayer, I can't really blame people for being upset when that was a feature they had been using and enjoying. That said, single player is very much alive and well, and the world is simply [b]AMAZING![/b] I've played Minecraft, Terraria, Space Engineers, and Empyrion, lots of sandbox games, but I feel Planet Explorers nails what I've always felt was missing from those other sand box titles: A purpose for all the resource gathering and crafting. Yes some of us play those games for the sheer joy of building stuff. Kuddos to you guys, I'm not one of them. Do I enjoy building things? Yes, to a certain extent or else I wouldn't be playing these kind of games. However, after a while, it just starts to feel like a job. Here, the crafting isn't about building a castle that I lose interest in 1/4 of the way in. It's more about helping your fellow colonists survive in an unforgiving alien environment so they can help you not just survive but thrive there.\n\n[b] Things that I loved about this game: [/b]\n[list]\n[*] [b] The Ambience: [/b]  Seriously, the scenery and creatures here are marvelous to take in. Some creatures are fine, and there definitely some you don't want to screw around with, especially when you're just getting started. \n\n[*] [b] NPCs! [/b] I don't care much for multiplayer games, in fact I go out of my way to not play a popular game that is strictly multiplayer. I don't want my hard work to turn into a farm for an overly powerful A** HOLE. But as I learned from Space Engineers and Minecraft, the world feels a lot emptier and more lonely without semi intelligent NPCs. In addition to filling out the world, these NPCs really are HELPFUL. You need to work with them to trade, and learn scripts from them. (Scripts are how you learn new crafting recipes. Without them, you're stuck with your starter gear.) You perform quests and you get or learn valuable info. Once you've helped some warriors enough, they will permanetely follow you. (Very helpful since this world can be very dangerous.)\n\n[*] [b] Single Player Story: [/b] The Single player story is very immersive, and I would definitely recommend any new players to start there. I did the tutorial, wasn't that helpful. But the story, they walk you through the game mechanics. (They're quite different from any of the other sand box games I've previously built.)\n[/list]\n\n[b] What didn't I like or care for? [/b]\n[list]\n[*] [b] Mining: [/b] While I am loving the purpose they've given me for resource acquistion and crafting, harvesting those minerals can not only be difficult, but just straight up a pain in the butt. You eventually have access to ore scanners. YAY! Except they're buried deeeep underground. Like worse than finding diamonds on Minecraft. Took me forever to find coal and petroleum. Then once you do find them, I tried build a winding tunnel down, except I always seemed to miss the minerals. If you're reading this, just don't do that. Dig straight down once you see you're standing directly over an ore deposit.  (Counter intuitive if you played minecraft I know.) Getting out is easy, fast travel and then you don't have to worry about digging yourself out of the hole you dug. Pun intended.\n\n[*] [b]Scripts:[/b] I have a love hate relationship with the scripts. They were a serious pain at first because I just wanted to find a way to get started immediately, dig and find those high quaility ores and get instantly strong. Doesn't work like that with this game. You have to cultivate relationships with the NPCs, once you've done enough to help them, they teach you scripts or you can simply buy some from some of them. \n\nAll in all, this is  a fantastic game, with a lot of potential. Even if the devs are done working on it, it stands pretty well on its own. I can understand if the previous community is upset, but don't let that dissuade you if you've been thinking about picking it up, especially right now while its free.", "timestamp_created": 1571183963, "timestamp_updated": 1571184265, "voted_up": true, "votes_up": 64, "votes_funny": 5, "weighted_vote_score": "0.731136500835418701", "comment_count": 11, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "135177313": {"recommendationid": "135177313", "author": {"steamid": "76561197970920246", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 11279, "playtime_last_two_weeks": 0, "playtime_at_review": 11270, "last_played": 1679520576}, "language": "english", "review": "I bought this game back in probably 2012-2014, back when it was in early access, and I enjoyed it a lot.  It wasn't a perfect game, but it was still enjoyable, and bought a lot of new ideas to the Survival genre that hadn't yet been done.  It can get buggy, but I don't recall any bugs being game-breaking, just make sure you keep regular saves.\n\nThe game is abandoned, and the multiplayer was never finished.  The Developers had a rough time updating the game engine to a newer version of Unity a while back (other game devs had the same issue with that particular update), and just as they got their footing again, they lost most (if not al)l of their source code.  That leaves the game in the current state - Singleplayer is rough around the edges but very playable, but a very rough Multiplayer.\n\nWith the game being free, it's still very worthwhile to grab it and check it out.", "timestamp_created": 1679511756, "timestamp_updated": 1679511756, "voted_up": true, "votes_up": 25, "votes_funny": 1, "weighted_vote_score": "0.730658113956451416", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "28333182": {"recommendationid": "28333182", "author": {"steamid": "76561198171317593", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 7486, "playtime_last_two_weeks": 0, "playtime_at_review": 6859, "last_played": 1512824436}, "language": "english", "review": "I have a little more than a hundred hours on this game, so I feel confident to give a complete review on it.\nThe cons: Although it's been released, it still feels a lot like an early access because of little bugs and weird behavior of some feature. Here some examples: \n- Water behave weirdly. It is in infinite quantity (like in Minecraft) and therefore is not always very realistic. Water passes right through wall and any placed block so when it rains, it rains inside houses...\n- NPC are brainless (e.g. they dive of cliffs and roofs without care), have the weird ability to pass through walls and the uncanny habits to always end up where they will most bother you.\n- the world is beautiful on the surface but in adventure mode you will have things like sand on roof of caves, patiently waiting (without falling down mind you) for you to mine it. In general caves are plain unrealistic (and there is no cave-in so mad miners can feel free to dig and dig and dig)\n\nThe good:\nThe concept is truly great and I SO wanted a solo game like wurm or rising world where you could built towns that would not be just empty ghost towns and where NPC actually do some work in it (farming, processing)\nThe replicator concept is great and work really well\nOverall, I do not regret buying this game because it is fun and has all the things I really was searching for. But it really feels like it needs some polish to feels less like an early access and more like a finished game (with the potential of a blockbuster). I do hope that its release doesn't mean that it will stay like that and that patches will be released to fix all that needs to be fixed. Anyway, it is already fun the way it is, so I won’t cry if there is no meaningful patches in the future.\n", "timestamp_created": 1481576752, "timestamp_updated": 1481576752, "voted_up": true, "votes_up": 34, "votes_funny": 2, "weighted_vote_score": "0.730592548847198486", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "25101360": {"recommendationid": "25101360", "author": {"steamid": "76561198007247977", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 6554, "playtime_last_two_weeks": 0, "playtime_at_review": 6554, "last_played": 1472161193}, "language": "english", "review": "If you are looking for a survival exploring game with an interesting storyline this is the game your looking for whole your life.\n\nI fell in love with this game the first time i came to know of it 3 years ago.\nIt was a long wait for a stable game (that didnt wrecked your savegames ;) ) but now its just fantastic.\n\nExplore, build, create vehicles for ground-sea-air, gather resources, farm, base management, interact with NPCs, experience an amazing journey in the world of planet explorers.\n\nThis game is worth every penny and even more!!", "timestamp_created": 1471991821, "timestamp_updated": 1471991821, "voted_up": true, "votes_up": 29, "votes_funny": 0, "weighted_vote_score": "0.729599952697753906", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44874317": {"recommendationid": "44874317", "author": {"steamid": "76561198107188595", "num_games_owned": 66, "num_reviews": 2, "playtime_forever": 1242, "playtime_last_two_weeks": 0, "playtime_at_review": 1024, "last_played": 1537627851}, "language": "english", "review": "I was really excited about this game when I first got it. Since launching, it's given me trouble, most of which I've experienced in the last 24 hours. \nUpon buying, I played it for a few hours, wasn't extremely impressed with gameplay, etc., but was very much looking forward to the potential of world-building, as I did find the mining system to be satisfying and unique. After this experience, I neglected the game for a good while because of reasons. \nA few weeks ago I decided to give it another shot, as I was looking for this type of crafting, world-building game to play at the time. But alas, my save was gone. Honestly, not a huge deal, as I wasn't that far into the story, so I somewhat regrettably made a new character to start again. This save however, I had put much more time into (give or take 12 hrs, the majority of my game time overall). I was feeling much better about progressing the story and thinking about all the cool things I'd get to build later. After saving and auto-saving many times throughout, I had scratched that crafting itch and put it away for a few weeks.\nYesterday I launched the game yet again, and, to my chagrin, no saves... I think, \"Alright, I'll go in and find the saves location and load it that way.\" Nope. Nothing there. I see nothing online to help. I see online that before a certain release (.8 ?), saves shouldn't be deleted anymore, but here I am, V1.1.3, and everything is gone. Needless to say, I am very disappointed. And now, somehow, Steam registered the game as if it was running for longer than it has, tacking on an extra 4 hours, which in itself is not an issue, however if I decide to get a refund might cause a problem.\nI've gone to the website to see if there's a support page, but all it is is a small list of questions about what type of game it is, and whether or not your computer can run it, nothing Support-related. I also see they \"hoped\" to launch in 2015... So the support page is not even a support page, there are no forums, as the link leads to an error page, which I feel is a huge mistake for any up-and-coming game devs. There is the Steam page, but that is often nothing but an annoyance to navigate.\nI understand there have been some staff changes at Pathea, but I'd have liked if things were more up-to-date in late 2018, and functioning so that I don't have to make a new character very time.\nUnfortunately I cannot recommend this game as it is. So far, it has a LOT of work to be done.", "timestamp_created": 1537629820, "timestamp_updated": 1537629820, "voted_up": false, "votes_up": 35, "votes_funny": 6, "weighted_vote_score": "0.728746712207794189", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "95289913": {"recommendationid": "95289913", "author": {"steamid": "76561198001121480", "num_games_owned": 639, "num_reviews": 31, "playtime_forever": 7692, "playtime_last_two_weeks": 0, "playtime_at_review": 7692, "last_played": 1525309569}, "language": "english", "review": "It's disappointing that Pathea never properly finished the game, though with them losing the multiplayer code I guess it's understandable.\n\nThe game was left in a janky state, with performance problems, lack of final polish, easily broken quests(though they are also in turn easy to fix, no game breakers here), a story that's left forever in a cliffhanger and so on and so forth.\n\nBut still...\n\nI did have a lot of fun playing it while it was still in development and on after the final release. The system for crafting vehicles is possibly the most flexible I've ever seen and while base building isn't as flexible, it's functionally complex enough, though you will need to work extra hard to get your base to resemble any other architecture but soviet brutalism.\n\nI certainly never felt like I was cheated out of twenty euros.\n\nIs the game good? Yes and no. It's certainly atmospheric and the plot is interesting enough. But as I said above, the lack of polish can often be jarring.\n\nIf the game was still sold for 20€, it would be a bit of a ripoff, but it's free now, so all you can lose is a bit of time.\n\nIf you enjoy survivalcrafters and can overlook the jank. you can certainly have fun with this game.", "timestamp_created": 1625700055, "timestamp_updated": 1625700055, "voted_up": true, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.725654721260070801", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "31021720": {"recommendationid": "31021720", "author": {"steamid": "76561198117191419", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 6581, "playtime_last_two_weeks": 0, "playtime_at_review": 5066, "last_played": 1492543055}, "language": "english", "review": "This game in a word: Ambitous. There are a lot of things I love about this game and its a shame that it isn't more popular. Being honest here, I thought the game was still in early access. Its definitley a bit rough around the edges but its still pretty enjoyable. \n\nLikes:\n-Fantastic Crafting System\n-Custom Vehicles and Gear that you get to make in an easy to use editor\n-huge variety of flora and fauna, all excellently modeled\n\nDislikes: \n-Audio design is kinda shit(a lot of the sound effects are awful)\n-Textures aren't as high resolution as I would like\n-Cringy main menu music(seriously, who puts vocals in a video game soundtrack???)\n\nNotes: I've never seen voxels used in this way before. The level of customazation is over the top. However, in adventure mode the terrain can do some very weird things like make spikes and ridges out of nowhere that make no sense. Also the caves are quite boring. I'm not fond of the Sexed armor/clothing, I was trying to go more androgenous with my character but now she's running around in a skimpy hunters outfit because she can't wear male clothing lol. \n\nFor the Devs: Excellent models, the terrian generation needs some tweaking, and you should fire whoever did you audio(lol). AND LET ME CROSS DRESS FFS!!!!!\n\n7/10- Can't do a Mulan\n\n", "timestamp_created": 1491670746, "timestamp_updated": 1491670746, "voted_up": true, "votes_up": 39, "votes_funny": 3, "weighted_vote_score": "0.724984228610992432", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "32115773": {"recommendationid": "32115773", "author": {"steamid": "76561198059718128", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 1413, "playtime_last_two_weeks": 0, "playtime_at_review": 1413, "last_played": 1496376448}, "language": "english", "review": "This game is actually a puzzle game.  How to finish the bugged quests to proceed forward.  It's really hard but fortunetely some of the AI mechanics are terrible so you can use that to your advantage.  \n\nOne puzzle I haven't figured out though is how the loading screen spends 50% of the time at 100%.  It's a toughy.", "timestamp_created": 1496352256, "timestamp_updated": 1496352256, "voted_up": false, "votes_up": 154, "votes_funny": 170, "weighted_vote_score": "0.724599778652191162", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "26513158": {"recommendationid": "26513158", "author": {"steamid": "76561198020874000", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 11634, "playtime_last_two_weeks": 0, "playtime_at_review": 11569, "last_played": 1477791030}, "language": "english", "review": "This game is a unique experience that you won't find elsewehere.  There are a lot of really cool aspects to it that make it fun and intriguing if you can get past some of the rough edges.  Whether you gets hours and hours of entertainment out of this game (like I did) or get annoyed with it probably just depends on what you're looking for in a game.\n\nIf you're looking for a game where you can explore, gather, craft, DESIGN & build at your own pace without worrying about frantic optimization and balance, this game is for you.  If you enjoy a mysterious and compelling story taking place in the early days of interplanetary travel, this game is for you.\n\nIf you're looking for a super-polished, combat-focused, silky-smooth gameplay experience, this game is probably not for you.\n\nOverall 8/10.\nHere's a breakdown:\n\nThe Good:\nSmooth voxels!  Rest in peace to damn ugly cubic voxels.\nCompelling story left me wondering what happens next.\nResource gathering, crafting, colony development, and customization is well-developed.\nThe environment visuals are pretty good considering almost everything is desturctible/interactable.\n\nThe Mediocre:\nThe music is well composed, but the lack of variety makes it a bit repetitive.\nCombat is passable, but not exceptional.\n\nNeeds improvement:\nVoice acting is not the best.  The engineer in me cringes at some of the mispronounced technical jargon.\nNPC behavior can be erratic at times, especially during quest transitions.\n\nI was certainly able to look past some of these underdeveloped aspects of the game and still derive a ton of entertainment and satisfaction playing it.", "timestamp_created": 1478751618, "timestamp_updated": 1478751766, "voted_up": true, "votes_up": 33, "votes_funny": 1, "weighted_vote_score": "0.723959684371948242", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "62965560": {"recommendationid": "62965560", "author": {"steamid": "76561198044863239", "num_games_owned": 380, "num_reviews": 15, "playtime_forever": 668, "playtime_last_two_weeks": 0, "playtime_at_review": 668, "last_played": 1504038394}, "language": "english", "review": "Abandonware, paid money for early access and it never got finished and is now free to play...", "timestamp_created": 1580829745, "timestamp_updated": 1580829745, "voted_up": false, "votes_up": 27, "votes_funny": 1, "weighted_vote_score": "0.722025454044342041", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "53231658": {"recommendationid": "53231658", "author": {"steamid": "76561197974741810", "num_games_owned": 617, "num_reviews": 25, "playtime_forever": 275, "playtime_last_two_weeks": 0, "playtime_at_review": 275, "last_played": 1420418249}, "language": "english", "review": "How do you accidentally delete code? Do you not have backups? This is an exit scam so you can get out of finishing the game.\n\nYou suck.", "timestamp_created": 1562099462, "timestamp_updated": 1562099462, "voted_up": false, "votes_up": 159, "votes_funny": 10, "weighted_vote_score": "0.720250189304351807", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "81305273": {"recommendationid": "81305273", "author": {"steamid": "76561198184897393", "num_games_owned": 0, "num_reviews": 653, "playtime_forever": 39, "playtime_last_two_weeks": 0, "playtime_at_review": 39, "last_played": 1606784963}, "language": "english", "review": "This game has/had so much potential.  Unfortunately it is unplayable with FPS in the 1-15 range.  Perhaps I will try it again in the future with newer hardware, despite the fact that my system exceeds the stated requirements. \n\n[h3]Additional Details[/h3]\n[table]\n   [tr]\n        [td]Operating System[/td]\n        [td]Ubuntu Linux 18.04 x64[/td]\n    [/tr]\n    [tr]\n        [td]CPU[/td]\n        [td]Ryzen 5 1500x[/td]\n    [/tr]\n    [tr]\n        [td]GPU[/td]\n        [td]GTX 1050, nvidia-410.104[/td]\n    [/tr]\n    [tr]\n        [td]Game Saves[/td]\n        [td]Automatically, manually whenever you want[/td]\n    [/tr]\n    [tr]\n        [td]Technical Notes[/td]\n        [td]Ran too poorly to truly test[/td]\n    [/tr]\n[/table]", "timestamp_created": 1606785181, "timestamp_updated": 1606785181, "voted_up": false, "votes_up": 26, "votes_funny": 5, "weighted_vote_score": "0.719438850879669189", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "28360821": {"recommendationid": "28360821", "author": {"steamid": "76561198056973185", "num_games_owned": 0, "num_reviews": 78, "playtime_forever": 571, "playtime_last_two_weeks": 0, "playtime_at_review": 571, "last_played": 1484143693}, "language": "english", "review": "TL;DR: Ambitious project with a lot of wasted potential and performance issues. Stay away unless you know that its a game you will enjoy (and have a strong pc.)\n\nIt's okay but since its appearance on Steam there have been so many survival games developed that it has sort of lost its charm.\nWhen the game started being developed it was a quite unique Idea and that's why so many people probably chose to support it. Unfortunately the devs inexperience became apparent after a while. \nThey obviously did their best to make a working game but in reality a few more experienced dev teams started doing laps around them with all the survival games out there.\nOn the postive side it has a pretty unique item creation system, which is basically a 3d modeling app inside the game.\nOn the negative side it still suffers from framerate issues and occasional instability (i wouldnt count on that getting fixed), and the graphics are reaaaally matter-of-taste (I dont like the style we ended up with at all unfortunately)\nI can not really recommend this game to the masses, if you have a very specific taste and like the functions this game has it might be worth it. Everyone else will have more fun with some of the more polished survival games out there.\n\nhere is a list of problems I've encountered.\n\nConstant microstutters even on \"fastest\" setting.\noccasional 1 second freezes-\nObjects pop in visibly on the horizon, vegetation is visible before the ground textures are shown which creates \"floating\" grass textures.\nPicture looks very blurry at high settings.\n\nMy System is \n\nWin 7\nI5 3350p\nRadeon R9 270x\n16 gb ram\n\nI can basically play anything on ultra (In some games I have to reduce Anti Aliasing)\n\nPossibly the game runs better on Nvidia cards (because of physics calculation) but a game should be optimized to run on any current system within reason.", "timestamp_created": 1481726685, "timestamp_updated": 1489751857, "voted_up": false, "votes_up": 94, "votes_funny": 6, "weighted_vote_score": "0.718650758266448975", "comment_count": 20, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "36650622": {"recommendationid": "36650622", "author": {"steamid": "76561198146119498", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 302, "playtime_last_two_weeks": 0, "playtime_at_review": 302, "last_played": 1422472721}, "language": "english", "review": "It is dissapointing to say this game is not worth your time. I spent 20 euros on this game 3 years ago, and it is interesting to see it has not evolved at all. The production values are very low, and it is thousands of miles off what it should have. Dont make the same mistake i did and keep the money for yourself", "timestamp_created": 1511200825, "timestamp_updated": 1511200825, "voted_up": false, "votes_up": 45, "votes_funny": 1, "weighted_vote_score": "0.718631505966186523", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "152027664": {"recommendationid": "152027664", "author": {"steamid": "76561197996126125", "num_games_owned": 351, "num_reviews": 14, "playtime_forever": 591, "playtime_last_two_weeks": 0, "playtime_at_review": 591, "last_played": 1490199598}, "language": "english", "review": "Barebones\nunfinished\nunpolished\nlost their own code\nlong times of radio silence\nabandoned with lame excuses\nmade it free\n\nNever will trust this developer again", "timestamp_created": 1700999574, "timestamp_updated": 1700999574, "voted_up": false, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.716324269771575928", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "41168280": {"recommendationid": "41168280", "author": {"steamid": "76561198045143734", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 3526, "playtime_last_two_weeks": 0, "playtime_at_review": 3155, "last_played": 1593734795}, "language": "english", "review": "Used to play it for a while cause the build mode was fun.\n\nGot on multiplayer and my friend couldn't even sit in the passenger seat of a car I worked for hours on for the both of us.\n\nRegarding the bug, a developer says:\n[i]\"This was corrected in the latest update, but, ah, that update broke something else and we went back an update... The fix is there, we just need to fix another issue before it's released.\"[/i]\n\nThey said this on [b]November 11th of 2016.[/b]\n\nAll they seem to be updating now is the story and co op of thus. Priorities seem a little distorted for this game and its developers, and I am extremely disappointed.", "timestamp_created": 1522463275, "timestamp_updated": 1522463298, "voted_up": false, "votes_up": 42, "votes_funny": 1, "weighted_vote_score": "0.715399503707885742", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "56120467": {"recommendationid": "56120467", "author": {"steamid": "76561198078391511", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 1937, "playtime_last_two_weeks": 0, "playtime_at_review": 1937, "last_played": 1468353156}, "language": "english", "review": "The developers lost their multiplayer code because of a server outage and made the game free to play as a consequence.\n\nI can not put my trust in a group, which is incompetent to the point that they have no idea what a \"backup\" is.\nIt goes without saying that it is mandatory to back up the game's code and it is laughable, that the developer managed to lose it's entire server code. I bought this product for 30$ and seeing it losing it's functionality AND becoming free is simply insulting.\n\nI highly recommend you to NOT support this developer in the future, unless this group manages to convince you in their ability to handle their projects in a professional way. \nThe studio is now developing Planet Explorers 2 and I advise you to stay away from it until they prove themselves (for example: using Steam Services for lobbies, direct connect that is unrelated to their MP listeners, information on what measures are employed for backup, etc.)", "timestamp_created": 1572601815, "timestamp_updated": 1572601815, "voted_up": false, "votes_up": 46, "votes_funny": 2, "weighted_vote_score": "0.714005172252655029", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "70957227": {"recommendationid": "70957227", "author": {"steamid": "76561198078400975", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 393, "playtime_last_two_weeks": 0, "playtime_at_review": 393, "last_played": 1438190474}, "language": "english", "review": "Paid $25 dollars, then they made game free and abandoned it. How nice!\n\nDon't support these devs.", "timestamp_created": 1592437564, "timestamp_updated": 1592437564, "voted_up": false, "votes_up": 42, "votes_funny": 1, "weighted_vote_score": "0.713834285736083984", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "48759514": {"recommendationid": "48759514", "author": {"steamid": "76561198026021677", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 556, "playtime_last_two_weeks": 0, "playtime_at_review": 556, "last_played": 1443029792}, "language": "english", "review": "Some potential when Early Access launched, now devs are on another project - current version is a half-finished proof of concept.\n\nBuying not advised", "timestamp_created": 1549310116, "timestamp_updated": 1549310116, "voted_up": false, "votes_up": 28, "votes_funny": 1, "weighted_vote_score": "0.712942063808441162", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "48639227": {"recommendationid": "48639227", "author": {"steamid": "76561197972986282", "num_games_owned": 0, "num_reviews": 21, "playtime_forever": 5125, "playtime_last_two_weeks": 0, "playtime_at_review": 4682, "last_played": 1549179912}, "language": "english", "review": "I had some reservations about trying the game given the reviews that the fact that it was never really finished.\n\nHowever, I was surprised at how good the game actually is. Despite some rough edges, it's entirely playable and quite fun. I think the game gets a lot of hate because of how much unrealized potential there is. There are just a lot of game systems that aren't fully utilized, or sometimes even used at all.\n\nThe creation engine and base building aspects are super powerful and something I hope to dig deeper into on a second playthrough or other game mode. If you're the kind of person who enjoys building stuff in minecraft, this will definitely appeal to you. It's especially cool that you can make functional vehicles, weapons, armor, etc.\n\nI do recommend this game, but with some caveats. If you like survival crafting and creative games, this is definitely a cool one and can be a ton of fun. I have really enjoyed my time playing it.\n\nHowever, you do have to realize that it's unpolished. Some of the interfaces are janky, a few quests have oddly specific requirements, some game systems and quests are unfinished, the graphics look out of date, the game has issues with crashes, etc. It plays like an early access game or day 1 release of a normal game. Don't buy this if you want a fully fleshed out, polished, bug free game.\n\nOn a final note, I am really, really looking forward to a possible Planet Explorers 2. Pathea seems to have learned and grown a lot given how My Time at Portia turned out. If they take another crack at Planet Explorers, it could be really incredible.", "timestamp_created": 1548822019, "timestamp_updated": 1548822019, "voted_up": true, "votes_up": 38, "votes_funny": 2, "weighted_vote_score": "0.711334526538848877", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "118092116": {"recommendationid": "118092116", "author": {"steamid": "76561198097567485", "num_games_owned": 2822, "num_reviews": 235, "playtime_forever": 35, "playtime_last_two_weeks": 0, "playtime_at_review": 35, "last_played": 1540606427}, "language": "english", "review": "Supported this many years ago when it was in early access, and while Pathea Games has gone on to make much better products, Planet Explorers is the reject of the family. While it technically works, none of it is fun. PE is clunky, bare, slow paced to the point it is boring, graphically dated, and the fact it is now free-to-play when it was once a paid for product leaves a sour taste in ones mouth. Overall, I do not recommend one to spend their time on this game; the major reason being that there are so many other great open-world survival crafting games more deserving of ones time. Thus, Planet explorers gets a score of 4/10 and is something one should avoid, even in its current free-to-play state.", "timestamp_created": 1656801753, "timestamp_updated": 1663602853, "voted_up": false, "votes_up": 31, "votes_funny": 0, "weighted_vote_score": "0.708641469478607178", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "53231793": {"recommendationid": "53231793", "author": {"steamid": "76561197989970487", "num_games_owned": 0, "num_reviews": 73, "playtime_forever": 6, "playtime_last_two_weeks": 0, "playtime_at_review": 6, "last_played": 1401487741}, "language": "english", "review": "Paid money for this during EA, then they deleted the multiplayer code and as a bonus thank you made the game free to play. Sure as hell won't support them in the future.", "timestamp_created": 1562099499, "timestamp_updated": 1562099499, "voted_up": false, "votes_up": 149, "votes_funny": 11, "weighted_vote_score": "0.70684516429901123", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "26489819": {"recommendationid": "26489819", "author": {"steamid": "76561197978962100", "num_games_owned": 2240, "num_reviews": 516, "playtime_forever": 395, "playtime_last_two_weeks": 0, "playtime_at_review": 395, "last_played": 1478637657}, "language": "english", "review": "It's finally here after over 2 years of EA! if you enjoy sandbox games this is a great one that also has RPG and adventure flowing in its veins.  Unlike most Sandbox games it also has a good story and questlines to follow. The developers are a small team but they have managed to put out a great product and have committed to continue bug fixing and patching after release.\n\nIf you enjoyed my review please consider following and joining my Steam group\n[url=https://steamcommunity.com/groups/MatureMindedGamers#curation]Mature Minded Gamers[/url]\nWe have free game giveaway's every month for all Members, just click Follow and Join!", "timestamp_created": 1478616322, "timestamp_updated": 1544717932, "voted_up": true, "votes_up": 51, "votes_funny": 4, "weighted_vote_score": "0.705647170543670654", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "35732928": {"recommendationid": "35732928", "author": {"steamid": "76561198042814444", "num_games_owned": 1913, "num_reviews": 90, "playtime_forever": 266, "playtime_last_two_weeks": 0, "playtime_at_review": 50, "last_played": 1509515277}, "language": "english", "review": "The worst purchase of my life. Unfinished and abandoned. Do not buy any of their present and future games.", "timestamp_created": 1508027213, "timestamp_updated": 1508027426, "voted_up": false, "votes_up": 37, "votes_funny": 1, "weighted_vote_score": "0.705262482166290283", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}}, "query_summary": {"num_reviews": 4, "review_score": 5, "review_score_desc": "Mixed", "total_positive": 2300, "total_negative": 1524, "total_reviews": 3824}, "cursors": {"AoIIPwOf7XTnkdkE": "Mon Apr 22 23:49:17 2024"}}
