{"reviews": {"158402565": {"recommendationid": "158402565", "author": {"steamid": "76561198098559551", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 411, "playtime_last_two_weeks": 0, "playtime_at_review": 73, "last_played": 1708187015}, "language": "english", "review": "It's a fun game, not loads of content but for the price I got it at (15$), it's alright. The survival mechanics are pretty lowgrade and nothing special but the world design is good and the gearing system and creature taming's decent.\n\nHowever— this game has 0 accessibility options and is kinda middling to begin with, which is why I'm voting it down. There's no way to disable motion blur, screenshake, scale up font sizes, nothing, and controller support is still a WIP. On console, it doesn't even have a UI scale option.\n\ntldr; if you don't need any accessibility options most titles consider basic, the game's okay, like 6.5/10. if you do need any kind of accessibility options, the game's terrible and you should skip it.", "timestamp_created": 1708033253, "timestamp_updated": 1708120150, "voted_up": false, "votes_up": 468, "votes_funny": 13, "weighted_vote_score": "0.791448533535003662", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161661794": {"recommendationid": "161661794", "author": {"steamid": "76561197991568673", "num_games_owned": 237, "num_reviews": 2, "playtime_forever": 2304, "playtime_last_two_weeks": 0, "playtime_at_review": 2304, "last_played": 1708291204}, "language": "english", "review": "Take out all the mystery and hidden stuff, and you end up with this. See that upside down boat over there? Whats underneath it? Nothing. See that cave over there? What's inside? Nothing. \n\nHope you enjoy ants, because they are everywhere. Over and over and over and over. \n\nI played this game for only a few days, then I had literally 0 interest in continuing. \n\nPS - Grounded is probably my favorite multi-player game of all time. I was SO excited for Smalland. Huge letdown.", "timestamp_created": 1711643269, "timestamp_updated": 1711643269, "voted_up": false, "votes_up": 82, "votes_funny": 4, "weighted_vote_score": "0.785083293914794922", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158403467": {"recommendationid": "158403467", "author": {"steamid": "76561199472799038", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 4524, "playtime_last_two_weeks": 0, "playtime_at_review": 4293, "last_played": 1708049188}, "language": "english", "review": " Beautiful game. Only complaints I have are…..\nBe able to build from storage chests! This one is huge for me.\nMore varied crafting items. It is disappointing when you find a new harvestable item and get the same resource. \nThe map is difficult to read. Since the game is so layered, finding a mark on the map that is underground can prove very challenging. \nI look forward to further updates.", "timestamp_created": 1708034352, "timestamp_updated": 1708034352, "voted_up": true, "votes_up": 36, "votes_funny": 1, "weighted_vote_score": "0.769100964069366455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161447823": {"recommendationid": "161447823", "author": {"steamid": "76561198027404997", "num_games_owned": 414, "num_reviews": 4, "playtime_forever": 2385, "playtime_last_two_weeks": 0, "playtime_at_review": 2385, "last_played": 1711074693}, "language": "english", "review": "Before I say anything else, I want to clarify I purchased this game after the 1.0 release and played NONE of the early access. I have no reference for where the game was, just what the devs/publisher decided to declare was a complete game. \n\nSmalland often gets compared to Grounded, which shouldn't be surprising but is somewhat misleading. It's the equivalent of saying that D&D is basically Lord of the Rings because they're both fantasy worlds. Thematically, Grounded is Honey I Shrunk the Kids, Smalland is Ferngully, and the difference in gameplay reflects each theme pretty well. \n\nOn my actual thoughts on the game, the quality of product I received from something that's out of early access is surprising. If you look at the post-launch roadmap, you can kinda see what I mean without playing the game at all: they plan to overhaul major mechanics of the game after saying it's done. In the climate of games entering early access every minute of the day and potentially never leaving, a full release is supposed to be a meaningful moment. The game should be COMPLETE, meaning everything works and works how you intend it to work. To release the game and then say \"we actually are going to completely change how taming works in a little bit\" is to declare the game isn't done and shouldn't be out of early access. If you expect a completely polished experience, as I believe you should receive from a game with a 1.0 in the corner, you will not receive that. Calling it 1.0 feels dishonest. \n\nI say the above to make clear my opinions of leaving early access too early. The rest of my review will read as though the above isn't true, knowing that the devs plan to update the game further. For all intents and purposes, let's pretend it's still in early access.\n\nResource gathering can be the worst part of a survival crafting game if it's too grindy, or resources are too difficult to move in large quantities. That isn't the case with Smalland. Even early on without the means to harvest later game nodes, it's not very difficult to gather large amounts of resources for building/crafting. Instead of encumbrance, you are only limited by the number of inventory spaces available, so running out and filling your inventory and getting back to base to drop stuff off is pretty painless. \n\nCrafting is also relatively forgiving materials-wise as well. A few consumables require pretty rare materials, but the lower tier consumables are so easy to craft and work well enough that the Greater healing potion for example isn't something you insist on having, especially since late game enemies will drop healing supplies anyway. Weapons and tools use a standard amount of materials to craft/upgrade, meaning Tier 1 weapons use a justifiable amount of T1 materials, and T3 items use a similar amount of T3 materials. Some games will say a stone pickaxe requires 2 wood and 2 stone but one made of iron requires 20 ingots and 30 hardwood or something, which is a much longer grind obviously. I don't feel like smalland has that issue of materials inflation. \n\nUpgrading weapons and armor is incredibly well done. Most weapons and armor sets can be upgraded to have stats similar to the highest tier available. If you love the poisoned mace, its actually cheaper to upgrade that to the next tier than it is to make the iron mace. If an armor set has a bonus you just can't live without, you can upgrade it to give you as much armor as the later tier armors. This makes choosing a playstyle and sticking with it easy enough, while still giving plenty of room to explore other styles without too much of a time/resource sink. \n\nRepairing things is free so long as you repair them before they lose a certain amount of durability. Even after that, not many resources are required to repair. Maintenance isn't too terrible. \n\nBase building is unique with the Great Trees mechanics. If you build a base on a Great Tree, you can then go to another Great Tree and teleport your entire base to the new tree without any time or resource cost. The issue I have with many survival crafters is the fact you spend a lot of resources building your first base up, and then realize you have a long journey to where later tier materials are available and are posed with the decision to either build a new base and abandon the first one, or have a network of smaller bases you store materials between. In Smalland, you can teleport your base to a tree closest to where you're currently farming/exploring on a total whim. This is my favorite aspect of the game without question, and I hope future survival crafters are taking notes on the QoL concept of base moving. \n\nCombat is unfortunately not the highlight of Smalland. In short, it is Baby's First Soulslike in the respect that enemies have large health pools and their attacks do heavy damage that require mastering the incredibly simple timing of perfect blocks or dodges. This of course gets mitigated entirely once you have late game armor and weapons. Enemies even the tier prior that would kill you in 2-3 hits suddenly can't hurt you enough to keep up with your health regen and you can drop them without emptying your stamina bar. The game's poor attempt at balancing for this seems to be granting every late game enemy poison damage. This is nothing more than a nuisance, not a challenge. \n\nLet's say you still give combat the fair chance it was supposed to have and don't just tank hits and spam LMB. Learning timing for perfect blocks is incredibly easy and forgiving. A vast majority of enemies have exactly one attack that's insanely telegraphed. I too often will meet a new enemy I've never seen before and never take a hit from them because I can learn the timing on the first attack. As the game throws more posionous enemies or swarms of enemies at you, combat can still feel satisfying enough to continue to later areas, but I wouldn't expect to ever really feel challenged in combat. Boss fights aren't even worth mentioning, other than those are typically the enemies that have 2 attacks instead of 1. One of them you dodge, the other you perfect block. \n\nTaming is a little silly. You unlock treats as you progress through the \"Story missions\" for better and better creatures. All you do is make the treat, attack that creature until it's below 50% health and press F. While I appreciate the taming process is expedited in comparison to something like ARK that demands real time hours for better tames, this process feels like it was slapped on last minute when the devs realized they forgot to put it in at all.  \n\nThe first mount you unlock is the grasshopper and has MASSIVE utility with its charged jumps. You can so quickly move around the map that it's not really worth swapping to the other mounts until you get flying ones. Pet combat is bad, they will attack  anything you attack and will die very quickly. You can tell them to wait somewhere instead of following you to avoid them joining you on a boss fight and dying in 2 hits, but there's currently an issue where sometimes telling a mount to wait will make them also not attack anything, even if they're being attacked. In short, I see why the post 1.0 roadmap includes a mount overhaul. My recommendation is to keep your grasshopper out of trouble until you unlock the damselfly, then only use the damselfly until you unlock the hornet. \n\nUltimately, Smalland has a lot of unique concepts and QoL mechanics that set it apart from other survival crafting games, but it's hard to justify calling it a full release and harder to justify a full release price. Combat is a means to an end at best, while base building and exploration carry the gameplay. It is an experience I don't regret spending time on, but would recommend waiting for a sale to buy, hopefully also after they get some of these post-launch updates implemented. There are too many survival crafters out there to waste money and time on, but this one is a decent change of pace that stands out on its own, so far.", "timestamp_created": 1711388826, "timestamp_updated": 1711388826, "voted_up": true, "votes_up": 29, "votes_funny": 0, "weighted_vote_score": "0.768596947193145752", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159403719": {"recommendationid": "159403719", "author": {"steamid": "76561198215068573", "num_games_owned": 78, "num_reviews": 18, "playtime_forever": 646, "playtime_last_two_weeks": 0, "playtime_at_review": 646, "last_played": 1709052613}, "language": "english", "review": "This is the \"1.0 Release?\"\n\nI bought this game the day it launched in EA.  I desperately want to love this game - but I can't play it.  \"Wait until full launch,\" I told myself, \"it'll be much better after they iron out the issues with it.\"\n\nTL;DR: It isn't.  It's just twice as expensive now.\n\nThe UI is ridiculously clunky, like something made in the late 90s. With patch after patch to add more and more CONTENT, one would think the devs would have a moment to have made a usable UI FIRST - but they chose not to.\n\nI literally can't get through character/world creation.  \"Full controller support\" my a$$.  It doesn't even have full M&K support!!  Some options, you have to use a keyboard, with no other option for gamepad users (like the name of your character or world).  Some options, the mouse refuses to click on, but the controller will select it.  Backing out of a menu is next to impossible with EITHER, and puts you at the top of the options list anyway, so good luck scrolling back through the terribly-designed UI once again to get to the wrong color hair your mouse/controller accidentally hovered over because the UI can't perceive what you're trying to actually select...\n\nI shelved this game for A YEAR expecting it to get better, and it's still unplayable, and now others who didn't buy it in EA have to pay $30 for it. \n\nAt least I got the EA price of $15.\n\nI LOVE the premise of this game.  I love the idea of playing as a Fae creature (I am a Pixie, after all).  Love the idea of being tiny, and exploring the \"fall of the giants (humankind).\"\n\nIt would be excellent - if they took a moment to make it playable, instead of only jacking up cost for a mediocre game even if it WAS still in EA.  For a full release?  This is crap.  Stinky, smelly, unplayable crap.\n\nHard pass.  Fix your game before you call it a 1.0 launch.  \n\nPlay Grounded if you want to be tiny and explore human things from ant size. Play Enshrouded or Vallheim if you want to build. Play Nightengale if you want to be in Fae realms. \n Don't pay for this game, guys.", "timestamp_created": 1709053504, "timestamp_updated": 1709055951, "voted_up": false, "votes_up": 85, "votes_funny": 3, "weighted_vote_score": "0.759651064872741699", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158415015": {"recommendationid": "158415015", "author": {"steamid": "76561198001782707", "num_games_owned": 0, "num_reviews": 64, "playtime_forever": 1894, "playtime_last_two_weeks": 0, "playtime_at_review": 1882, "last_played": 1708122540}, "language": "english", "review": "As far as open world survival craft coop/multiplayer games go, this is a solid buy.\n- Building bases is fun, and you can warp the whole thing in it's entirety to many new locations of current interest.\n- Coop/multiplayer works completely, and lets players level and progress at their own pace.\n- Fun combat, enemies, weapons, armor, and boss fights.\n- Flush believable and very detailed enlarged world.\n- Tons of crafting and rewards for progression.\n- You can tame, level up, call upon from a far distance, and ride the wildlife.\n- Flying and Tarzan swinging is a massive exploration crutch for this game, and totally fun.\n- Typical pesky annoying survival mechanics are balanced better, such as food prep for eating and equipment repairing, so you are not spending all your time at a crafting bench.\nBasically, this is the Ant Man survival RPG you didn't know you wanted.\n", "timestamp_created": 1708049476, "timestamp_updated": 1708049476, "voted_up": true, "votes_up": 31, "votes_funny": 2, "weighted_vote_score": "0.758123993873596191", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158162830": {"recommendationid": "158162830", "author": {"steamid": "76561198047599546", "num_games_owned": 232, "num_reviews": 17, "playtime_forever": 984, "playtime_last_two_weeks": 0, "playtime_at_review": 984, "last_played": 1703791125}, "language": "english", "review": "I thought I was scared of wasps and hornets. Now I know I am terrified.", "timestamp_created": 1707750098, "timestamp_updated": 1707750098, "voted_up": true, "votes_up": 61, "votes_funny": 76, "weighted_vote_score": "0.752617895603179932", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158776823": {"recommendationid": "158776823", "author": {"steamid": "76561198312187843", "num_games_owned": 0, "num_reviews": 30, "playtime_forever": 9132, "playtime_last_two_weeks": 0, "playtime_at_review": 7326, "last_played": 1709509774}, "language": "english", "review": "[h1]The Devs always looked forward and never looked back (but not in a good way)[/h1]\nI like this game, it has the potential to be one of the best survival games there is but right now that potential has consistently been fallen short of. Updates are released with content that always feels a little under-cooked and unpolished. The game community gives feedback, that feedback is not implemented and the devs go on to the next bit of planned content without addressing the issues brought up by the players.\n[h2]Pros[/h2]\nBuilding system works and you can make some fun and impressive bases. It's not the most in-depth or broad building in a survival game but it works well and I have no complaints.\nVisuals are great, very nice to explore and look around at stuff.\nTraversal of the land is fun, grappling hook, wings, different mounts lots of options and movement overall feels pretty good.\n[h2]Cons[/h2]\nRarity system has not changed since it was implemented, it is tied to the intelligence stat which in itself wouldn't be the worst thing but if you create a legendary piece of equipment you have to maintain a high int stat otherwise when you repair it the item will downgrade from legendary quality. No one liked this system many solutions were offered, no changes were made.\nArmor is still inventory when equipped, extra slots were added so it technically isn't taking up extra space but it shows a lack of skill that they couldn't make it disappear from the inventory when equipped.\nFactions seem dead on arrival the amount of time needed to invest into them to get rewards seems like a way the devs wanted to padd out the length of the game and the rewards you get from them despite taking ten times the time to create than any other piece of equipment are the exact same so they arn't even worth the grind. [spoiler] a perfect example of this is the sword Queen's Grace you get as a reward for completing the story of the game, it looks very impressive but has the exact same stats as the viper sword you can make yourself with the only difference being 5 block power. No unique effects or anything, very underwhelming for the reward for completing the game but par for the course [/spoiler]\nThat goes into rewards in the game. Rewards arn't worth the time investment, armor is all the same, weapons are all the same with no real differences between any of them especially since you can upgrade lower tier armor and weapons to be just as good as stuff you unlock at end game. There are no unique effects for weapons, no set bonus or gear effects for armor. \"It looks cool\" could define the entire design philosophy behind the game where differences between any piece of armor are really only surface-deep.\nAI for enemies is bad and has never been changed or improved. On 1.0 release the devs reduced the player damage which in theory makes combat harder but really it just makes it take longer. There are maybe three enemies in the game with decent combat AI that makes them do anything besides face tank all your attacks.\nThe devs finally added ranged attackers to the game, but only in the final zone, they needed to go back and add weaker variants to let the player get used to fighting them and also spice up older zones.\nThe tame system for getting mounts is undercooked, they constantly get in your way when harvesting rescources and there isn't a lot you can actually do with them with most being terrible at combat and rushing int without you telling them only to die. Not all species of tames are equal with their being clear better choices and ones you'd never take for any reason other than cosmetic.\nNot enough reasons to explore (traversal and exploration is one of the few well done and fleshed out things in the game but their arn't enough reasons to explore. There are a few cosmetic things scattered around, a few unlockable weapons, and a scavenger hunt to complete midway through the game but there is so much more that could be done here)\n\nI like this game, I'm not mad about its shortcomings I'm sad because it could be so much more. Right now I'd say this game is around a 5/10 game but if they fix just a few of these issues it could easily jump to an 7, 8 or 9 out of 10. \n", "timestamp_created": 1708401388, "timestamp_updated": 1708401657, "voted_up": false, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.723855972290039063", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160541821": {"recommendationid": "160541821", "author": {"steamid": "76561198168447825", "num_games_owned": 0, "num_reviews": 144, "playtime_forever": 3696, "playtime_last_two_weeks": 0, "playtime_at_review": 3696, "last_played": 1710386003}, "language": "english", "review": "First off, if you plan on playing this solo. Get something else. This game fells like it was made for groups of players, and punishes those playing by themselves. Besides, for this being a survival game, there really isn't anything amazing or makes this stick out from any other survival game. Honestly it felt like one of the more boring survival games I played. You run around in a giant world as a tiny smalling after humanity has died out, fighting bugs and living in trees. It is kind of fun getting pets, riding around on them, and exploring a large map, but that didn't last long and became fairly repetative  having to fight bugs every step of the way. Every single insect will stop what they are doing just to chase you down in groups. The story barely tells you where you need to go in order to progress the story. If I wasn't playing with friends, I would have been lost fairly early in the game. The game also tends to be overly grindy to craft recepies and equipment. Some requiring hundreds of items and hours of farming just to make and repair. The faction and world events are by far the most insulting for solo players. Each world even spawns every 20 minutes and only gives you 6 points, where you need 1000 points to rank up in a faction. Our group mostly ignored this, as it felt like a pointless end game goal to waste time on. The end area especially felt like you would have a hard time getting through by yourself. Every time one of us would die, we would have to wait for them to get all the way back to where the rest of the group is, hoping the enemy didn't spawn in already. The ending was also super anti-climatic. You get a new item, but there is no point in playing after that to even use it. The reward item is also barely better than what you could already make. 6/10 buy on discount", "timestamp_created": 1710453282, "timestamp_updated": 1710453282, "voted_up": true, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.718439638614654541", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158679245": {"recommendationid": "158679245", "author": {"steamid": "76561197997894373", "num_games_owned": 0, "num_reviews": 149, "playtime_forever": 749, "playtime_last_two_weeks": 0, "playtime_at_review": 435, "last_played": 1708371778}, "language": "english", "review": "It's a mixed bag. Great potential, but it REALLY needs some work.\n\nI really hope this game will get some updates, and not be a \"here's a 1.0 release, now we'll let it die\" game.\n\nThe good:\n- Graphics are pretty nice\n- World design is interesting and exploration-worthy\n- Music is SUPRISINGLY good !!!\n- Netcode is on point, no lag/desyncs/crashes\n- Building stuff works well\n- User interface is easy to understand and functional\n\nThe less good:\n- Animations are VERY clunky, and lack a lot of dynamism. You can't quite tell when you're hitting something or not\n- Pretty sure the climbing/ledge grab mechanic is just the same UE template used in Only Up, feels \"meh\"\n- Because of animations, the combat really feels poor and cheesy. Rolling and parrying is WAY too easy to feel rewarding.\nThere's some interesting aspects tho, but they definitely need improvements\n- Hitboxes are pretty bad, both for combat but also when gathering resources (you have to sometime look for a sweet spot to hit a rock with your pickaxe, otherwise you'll never it and swing in the void, or just mine some weird invincible hitbox of the rock... ?!)\n- No way to have shared map pinpoints accross players in coop.\n- No way to actually see your buddies in coop on the compass (you just have a lens flare when they're close, but if you get too far, you have to open the map to see them). EDIT: It's actually possible, you need to click on the player's icon on the map.\n- You can see your pet's health bar on the UI, but not the health bars of your coop friends. Why ?\n- You can't pet your mount, and need to nearly beat him to death before even getting a chance to tame him. This a dumb and useless mechanic, and the game doesn't even tell you about it\n- You can't heal your coop buddies, and actually, there's barely any coop interaction at all with other players, besides sharing resources at the base, sharing aggro in combat, and going pyjama party to skip the night, minecraft style\n- Exploit : [spoiler]You can cheese the hell out of of any tool's durability if you have enough wood to craft a workbench and repair everything constantly[/spoiler]\n\nSo yeah, It'd give it a 13/20. \n\nIt's been released to soon IMHO.", "timestamp_created": 1708303179, "timestamp_updated": 1708371861, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.694256305694580078", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158565625": {"recommendationid": "158565625", "author": {"steamid": "76561197962965165", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 822, "playtime_last_two_weeks": 0, "playtime_at_review": 822, "last_played": 1708205246}, "language": "english", "review": "1.0 release was rushed.  This is still early access.  Don't buy this game.\n\nI've been watching this game on early access for a while but I wanted to wait for 1.0.  I bought it the day it moved out of early access and I have been extremely disappointed.  There are so many bug (no pun intended).  I keep getting stuck at random places and having to kill myself to respawn.  There are tons of balancing and performance issues.  And the progress tiers are stupid.", "timestamp_created": 1708205647, "timestamp_updated": 1708205647, "voted_up": false, "votes_up": 36, "votes_funny": 0, "weighted_vote_score": "0.693632841110229492", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "162123080": {"recommendationid": "162123080", "author": {"steamid": "76561197989457926", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 823, "playtime_last_two_weeks": 0, "playtime_at_review": 823, "last_played": 1712107185}, "language": "english", "review": "We gave this game a second try seeing as it has reached \"1,0\" status and in our context (played 2 players) this is not \"release material\". There are a lot of issues with the polish of the game, initially I thought it was still in Early Access and dealt with it but after a while I've lost interest.\n\nHere are a listing of the most glaring issues that hindered my enjoyement, in no perticular order:\n- The path to the next point of progress is not clearly identifiable (and given you would be supposed to explore, the maps and it's contents is not that interesting and the movement within it is not enjoyable)\n- The spawning of creatures, even though necessary for prorer resource gathering, is extremely annoying.\n- To that effect, the resource gathering is very bland and repetitive with the only hopes of increased rewards being to find an area with more of them to collect - usually with harder creature spawns.\n- The fact the tree house building is linked to a specific character is a nice idea however this quickly becomes a problem when trying to share resources and build a common area. Inversely if you build outside of the tree to have a common area, you then need to move resources all over the map and this takes a long time (see second point above). There is no \"in between\" and to move from tree to tree you need to reach it (even if you've already been there and they don't stay marked on the map), so no \"fast travel\" to help solve this issue.\n- The item management is quite passable, The fact you can't craft from chests close by is also very annoying. In fact having to bring them over to \"crafters\" is also very annoying. All chests in tree bases should be accessible from any crafting structure within the tree and from the NPC crafters.\n- The combat is not fun - especially as soon as you're overcrowded by creatures where there's pretty much nothing you can do. The way you are locked into an attack sequence and cannot break it in any way makes it feel like a prediction game instead of a reaction game.\n- I'd like some more customization over the character.\n- I still have no clue how to assoicate clearly with factions or whatever. Right now we're guessing you have to do events as it's pretty much the only thing we didn't succeed yet, but after trying 2 and seeing the HP bars this is pretty much where we gave up on the game.", "timestamp_created": 1712162389, "timestamp_updated": 1712241613, "voted_up": false, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.656147003173828125", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "157249583": {"recommendationid": "157249583", "author": {"steamid": "76561198002869349", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 1677, "playtime_last_two_weeks": 0, "playtime_at_review": 1677, "last_played": 1702464906}, "language": "english", "review": "Smalland is an unfortunate title at this point because the game is very small with very little content. They need to increase the size of the game not the cost! I'd wait until Smalland gets a lot 'bigger'.", "timestamp_created": 1706698193, "timestamp_updated": 1706698450, "voted_up": false, "votes_up": 32, "votes_funny": 3, "weighted_vote_score": "0.628886103630065918", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1706806965, "developer_response": "Fair enough! Hopefully with 1.0 we can convince  you that we're there, we will continue adding to Smalland in the future to come :)"}, "161568741": {"recommendationid": "161568741", "author": {"steamid": "76561197992283108", "num_games_owned": 338, "num_reviews": 2, "playtime_forever": 1334, "playtime_last_two_weeks": 0, "playtime_at_review": 1334, "last_played": 1711496297}, "language": "english", "review": "I'm very sad that I cannot recommend this game. Me and my friends thrive on survival craft games, we love them.\n\nThe problem with this one is it really doesn't feel like it lends itself well to playing multiplayer.\nCertain materials are needed in such abundance for a single person (metal being the main culprit), but exist on the map in such a limited quantity that to fully equip a single person with a tier of gear will take many in-game days waiting for resources to respawn. Map markers aren't shared between players. Quest progress isn't shared between players. Every person needs to do every thing. \nPets are such a great idea, but currently their AI is to literally run into you, pushing you out of the way, or attack whatever enemy is in the vicinity, regardless of how quickly that enemy is going to kill the pet. That range seems to also not be affected by walls as pets will travel far through a maze to get to a fly on the other side of the wall.\n\nCombat is very simple, and relies on parrying to do well. Parrying is easy when fighting alone as most enemies have only 1 attack (some have 2, and bosses a few more). It is substantially more difficult with allies as aggro flip-flops willy-nilly and an enemy will spin in place to suddenly attack you instead of an ally. There are even a bunch of enemies that are re-skins of other enemies. Lizards and geckos are exactly the same. Bees/Wasps/Hornets all just have the basic sting attack. \nThere are just so many mechanics that are more annoying than add anything to the game. The lift to go up to great trees takes forever to come down and up. Pets frequently fall through the lift to go up great trees or get stuck in roofs or walls. The world is so large and finally gives you decent modes of transport only to take it away almost instantly in terms of next story-steps via a hawk and literal flak cannons. Great trees encourage you to build bases there, but they can be moved so it also encourages each player to have their own base, rather than encouraging players to build together. Recipes are locked to individual players, so for a player to unlock certain recipes they have to build the buildings. You can't pool resources to build one and let all use it for that reason. Then the codex is lacking in information on unlocking so figuring out how to tell other players what they need to do to unlock a recipe you have is difficult. Level ups increase health/endurance by 1, and speed/damage by 1%, and has an intelligence stat that I really cannot tell if it does anything meaningful. I'm level 30-something after many hours and at most I could potentially have 30 more hp and 30 more stamina. Let me have meaningful level ups! The quests are almost entirely (until many hours in) go kill this thing, then talk to this person.\n\nThey've got crafting and taming improvements in the roadmap, and you can tell there's a lot of love in the world so I'm sad to say I don't recommend it, but my main question is am I having fun, and I think the answer is no. I just want something to play with friends, so I'll keep playing it.", "timestamp_created": 1711530048, "timestamp_updated": 1712252164, "voted_up": false, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.625826776027679443", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158249456": {"recommendationid": "158249456", "author": {"steamid": "76561198257908517", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 4253, "playtime_last_two_weeks": 0, "playtime_at_review": 4253, "last_played": 1707850258}, "language": "english", "review": "It's very Valheim meets Grounded. i had a lot of fun. you can beet the main story without starting it which was amusing. there's a lot of different weapons and armor for collecting as well as things like chess pieces to collect and display. i think it does a good job showing how terrifying insects and the like are when they tower over you or are even just the same size. Plus you can ride a grasshopper.", "timestamp_created": 1707850442, "timestamp_updated": 1707850442, "voted_up": true, "votes_up": 14, "votes_funny": 3, "weighted_vote_score": "0.614097833633422852", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158564223": {"recommendationid": "158564223", "author": {"steamid": "76561198961055128", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 1962, "playtime_last_two_weeks": 0, "playtime_at_review": 1274, "last_played": 1708889375}, "language": "english", "review": "The game was so much fun till the new update. It heavily nerfed our weapons and made the game a lot less enjoyable.  Without any warning we were power scaled back and can hardly kill the most basic things at level 34. It feels utterly pointless now and my friends and I all feel defeated. For the short period of time we played this game we had so much fun. I'll miss you pre update smalland.", "timestamp_created": 1708204760, "timestamp_updated": 1708204760, "voted_up": false, "votes_up": 18, "votes_funny": 1, "weighted_vote_score": "0.613507866859436035", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1708348640, "developer_response": "Hey! We're sorry to hear, the nerfs shouldn't have hit that hard, we'll continue to look at balancing and review things"}, "158840385": {"recommendationid": "158840385", "author": {"steamid": "76561198066528980", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 1043, "playtime_last_two_weeks": 0, "playtime_at_review": 1043, "last_played": 1708466714}, "language": "english", "review": "Unfortunately, there is too little content for the price. The further in the game the more boring it becomes. Additionally, I would not call this game a coop, since there is no progress sharing.", "timestamp_created": 1708467219, "timestamp_updated": 1708467219, "voted_up": false, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.608744144439697266", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159262696": {"recommendationid": "159262696", "author": {"steamid": "76561197979996475", "num_games_owned": 1084, "num_reviews": 44, "playtime_forever": 465, "playtime_last_two_weeks": 0, "playtime_at_review": 465, "last_played": 1708882092}, "language": "english", "review": "So, the game itself isn't terrible. The grind for resources isn't awful, the repair system is forgiving, combat is really bare-bones but not altogether boring. Bug animations aren't Grounded-level but they're decent. Gear progression is interesting; your armor you're going to craft at NPCs and faction leaders with the right resources, and everything else you unlock as you pick up new resources or deploy new types of crafting/production stations. The experience seems to be tailored more around RPG/exploration and less on survival, which is something I really liked about Enshrouded. On the technical side, the game seems to run well and is fairly optimized despite some minor microstutter when loading in. It even supports DLSS. Altogether I'd put it as average or slightly above for the genre.  \nWhat's absolutely *terrible* is the faction contribution system and faction rewards. To my knowledge, contribution points can *only* be accrued by completing world events, which will often have you facing a large wave of a given type of insect. This can be challenging when playing solo, sure, but the real kick in the balls is the reward for completing said world events seems normalized around 6-9 points. When you consider world events are about 20 minutes or more apart, and reward prices (pieces of armor will run you around 30-40 each or so, same with wings, and unlocking a faction-specific buff looks like it costs a THOUSAND points), we're talking tens of hours of grinding world events just to accrue enough points for one faction's rewards.  \nThis needs to be tuned. This isn't an MMO or a live service game; there's no need to have that sort of grind unless it's to artificially inflate playtime to compensate for a lack of content... which is where I think this is at, given the relatively small size of the world map. There's the red flag, and it's dissuaded me from continuing. It feels as though the devs tried to push out a 1.0 as fast as possible, even though there's more content and major adjustments in the works according to the road map.  \nI'd honestly give this a neutral rating if I could, because I cannot in good faith give it a positive rating.", "timestamp_created": 1708883019, "timestamp_updated": 1708883019, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.604652822017669678", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1708891884, "developer_response": "Hey! We're sorry to hear that! I've made the team aware of the grind and the contribution system! Hopefully we can address that for you soon!"}, "158528740": {"recommendationid": "158528740", "author": {"steamid": "76561197974083400", "num_games_owned": 0, "num_reviews": 42, "playtime_forever": 2047, "playtime_last_two_weeks": 0, "playtime_at_review": 2047, "last_played": 1708173937}, "language": "english", "review": "It showed potential, but ultimately, the devs rushed the game out the door with minimal effort. \n\nFirst off, the grind in this game is incredibly tedious. Harvesting stuff takes longer than it should, and they even nerfed harvesting damage recently by exempting the player stat buffs from increasing harvest damage. You also need a metric ton of certain resources, and some resources are quite rare and require extensive searching.\n\nThe crafting is even worse, because there is little to no QoL to speak of. No crafting from storage that Grounded, Palworld, Valheim with a simple mod, and many more games in this genre, have. No pinning recipes to make it easier to pull out the right ingredients from your 10 chests. No hot deposit to nearby containers (Grounded has this). All in all, making the crafting process far more cumbersome than it ought to be.\n\nThe story is basically non-existent; some flavour text here and there. There is a mount system, which showed promise, but ultimately most of them are pretty useless. Only one I used more than a couple times was the grasshopper, but they have very low hp and die quickly.\n\nThere are still very annoying bugs present that were reported almost a year ago, such as an inredibly aggressive depth of field effect that resets to max every single time you go back to the menu, or restart the game. When gliding from your tree, you see nothing but a blur all the way around unless you manually adjust this setting every single time you play.\n\nI wouldn't bother with this one.", "timestamp_created": 1708175765, "timestamp_updated": 1708175955, "voted_up": false, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.60357213020324707", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1708210737, "developer_response": "Hey there! we're sorry to hear this, we know there's some stiff competition in the marketing and we're not giving up! We're continuing to work on crafting and the story (we mention it in our roadmap) and hopefully we can bring you back around!"}, "160750345": {"recommendationid": "160750345", "author": {"steamid": "76561199292741793", "num_games_owned": 43, "num_reviews": 2, "playtime_forever": 2068, "playtime_last_two_weeks": 0, "playtime_at_review": 2042, "last_played": 1711789635}, "language": "english", "review": "\n---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☑ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☑ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10\n\n---{ Author }---\n☑ https://vojtastruhar.github.io/steam-review-template \n", "timestamp_created": 1710671352, "timestamp_updated": 1710671352, "voted_up": true, "votes_up": 36, "votes_funny": 2, "weighted_vote_score": "0.600569307804107666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158467741": {"recommendationid": "158467741", "author": {"steamid": "76561197991464682", "num_games_owned": 310, "num_reviews": 177, "playtime_forever": 1736, "playtime_last_two_weeks": 0, "playtime_at_review": 272, "last_played": 1708365996}, "language": "english", "review": "This game has been one of the more frustrating \"Survival\" crafting games I've played in a long time.  The \"tutorial\" are these glowing owl statues that just have some text for various mechanics within the game.  As far as I can tell, you aren't pushed or required to actually do anything to progress through the tutorial phase of the game.\n\nWhat is an instant \"no\" as far as recommendation is how bad the combat is.  Enemies are LOCKED onto you, they literally slide around sideways across the surface as you move around.  Once locked on, the only way to avoid damage is to somewhat perfectly time your dodge-rolls or blocks.  If you don't, they will hit you regardless of how much range or if you're jumping....  because they are locked on, you will get hit.\n\nThe mounts are an interesting addition to this type of game, but they aren't balanced well.  You can (and should) get the Grasshopper first and very quickly in order to reduce many of the frustrations while playing.  You can pretty early \"cheat\" and find out how to get a flying mount pretty early which also makes a massive difference.\n\nThat said, mounts are also pretty clunky or janky at best.  You have to tell them to \"stay\" constantly other they will make it difficult to harvest resources since they try to sit on top of you while you run around.  They will \"bug out\" and run all over the place and aggro random stuff getting themselves (or you) killed.  Balance is also an issue, there are a few mounts that seem to have no purpose other than for people who want to just roleplay using a bad mount.  Grasshopper and bee for example are great.  Ladybug, spider, salamander (to name a few) are seemingly pointless?", "timestamp_created": 1708110389, "timestamp_updated": 1708205881, "voted_up": false, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.600516378879547119", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1708196169, "developer_response": "\nHey, thanks a ton for laying out your thoughts on the game. Sounds like you've hit some major road bumps, and we're bummed to hear that.Hopefully, you'll see some big improvements soon because we're tackling a lot of this stuff in our roadmap, we hope to see you again in the future!"}, "158610140": {"recommendationid": "158610140", "author": {"steamid": "76561197970978758", "num_games_owned": 0, "num_reviews": 70, "playtime_forever": 56, "playtime_last_two_weeks": 0, "playtime_at_review": 56, "last_played": 1708247533}, "language": "english", "review": "The game is poorly optimised and has some strange depth of field, motion blue, screen shake and a few other things happening, that leave me with a headache and dizzy. \n\nI had this since EA, and at that time I thought that some of the issues might be my older hardware, with a new system that exceeds the recommendations easily, I'm still still see the issues, and now with the full release, without the option to turn off a lot of the problem graphical issues, this gets the old thumbs down from me.", "timestamp_created": 1708247931, "timestamp_updated": 1708247931, "voted_up": false, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.597210228443145752", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1708345863, "developer_response": "We're very sorry about this.\nWe know that accessibility is a weakspot for us and we know we need to add some of these features in."}, "158444169": {"recommendationid": "158444169", "author": {"steamid": "76561197997680947", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 1335, "playtime_last_two_weeks": 0, "playtime_at_review": 1335, "last_played": 1708087165}, "language": "english", "review": "Clunky and thin, A lot of Qol issues like, \nThe F key is used to Interact+pickup items+mount tame... Which is about 90% of the game. So I spent more time accidentally mounting my grasshopper when I'm trying to pick up the 10,000th piece of nectar to feed my potion habit then I do anything else. \n\nThere is no balance in the combats at all, I'm either killing things in 3 hits or they kill me in 2, boring and frustrating and leads to WAY to much corpse retrieval.\n\nNo fast travel system of any kind (see last 2 points)\n\nThe \"compendium\" has no useful info and the NPCs that are the entire quest system are flat and uninteresting.\n\nI gave up after i got to the \"Endgame\" stuff and all it boils down to is harder enemies and now i need to find chess pieces...    \n\nNEEDS A LOT MORE WORK! Maybe after the polish this turd it will be more enjoyable. Maybe add some structure to tames and quests. Maybe give the NPCs some depth?  Maybe add a character creator with more then 6 options? Maybe explain why I should ever bother to put a stat increase into Intelligence as opposed to anything else?\n\nAll in all I give it 2/5*     Good idea with a terrible execution. NEEDS WORK! I will check back when it leaves early access and update if warranted.", "timestamp_created": 1708088120, "timestamp_updated": 1708088120, "voted_up": false, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.593093931674957275", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1708127612, "developer_response": "\nHey, thanks a bunch for taking the time to share your thoughts! We hear you loud and clear about those frustrations you're experiencing. Rest assured, we're on it, working to iron out those kinks and make the game smoother and more balanced. Your suggestions are super helpful, and we'll definitely be looking into them as we keep improving. Hopefully, you'll swing back by when we've made some updates and see how we're doing!"}, "158827670": {"recommendationid": "158827670", "author": {"steamid": "76561197993503758", "num_games_owned": 460, "num_reviews": 12, "playtime_forever": 3492, "playtime_last_two_weeks": 0, "playtime_at_review": 3492, "last_played": 1708378014}, "language": "english", "review": "Thats more neutral review. 1.0 is unfinished and rushed update without any QoL changes and empty endgame (both gameplay and locations, since they are made for the \"blue tit\" mount)\nThe game is good but its still EA as many already said.\nWithout guides its really interesting to discover everything by yourself, world is huge at first.\nBut there are too many small gameplay problems that could be fixed easly, but for some reason they nor. \n\nLike why you cant craft multiple times? I mean its anooying and its especially annoying when you get to the only \"gun\" in the game. You literally need to click 71 time to craft 10 ammo SEVENTY ONE!!!! (x10 sulphur, x20 saltpeter, x10(or x20) charcoal for powder, x10 powder, x5 charcocal for iron, x5 iron + x1 to craft ammo) to craft 1 banch of the ammo which you will spend faster than you craft it =) \n\nFighting is still boring after you get your first set of armor and weapons, block is useless you can just parry everything in the game with anything, so if you are good with timings you can beat the game with wooden sword.\n\nLeveling system does nothing impactfull, I 100% the game and I went full intelegence....well...I was crafting for 3 guys in my group and we crafted every single set and we only saw 3 rarity types and it was like only 20% of the gear I crafted, what is the point of that? Its like max 5% better than original stats + without intelegence you cant repair or upgrade your gear.\n\nRight from the start of the game you can unlock \"hornet treat\" aaand world is not that big anymore, with unlocking \"blue tit\" its even smaller... I mean thats one of the reasons why endgame locations feels so empty and boring.\n\nThe game was a diamond when it first came out, just tune few things, fix bugs and add new content, there was absolutly no need in adding and buffing such flying mounts they literally ruin all the fun of the exploring this huge world. At least add the setting to disable flying mounts. Blue tit must be disabled completly, hornet just a bit of the nerf to its stamina.\n\nCreature levels means nothing, leveling your \"pets\" means nothing.\n\nFactions are just pure crap. Why every single event gives you 6 points? Its like every ~30-40 mins you can farm 6 points. How the hell do you suppose to farm 1k for only ONE faction + farm for some gear to buy from them? 10 points for 5 hoods if I remember correctly, what is a point of that? You need hoods only in late game, in late game you get 5-10 hoods from the killing of NPC's + 5 hoods for 20 purite or w/e its called, that can be farmed like 500 in under 15 mins.\n\nFinal location with the final boss can be skipt entirely with blue tit, you can simply just fly straight to the boss.\n\nI mean just a few tweaks to all of that and the game would be perfect (still many tweaks for the endgame, since its super empty and boring).", "timestamp_created": 1708457004, "timestamp_updated": 1708457004, "voted_up": false, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.592356681823730469", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161754262": {"recommendationid": "161754262", "author": {"steamid": "76561198057563156", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1363, "playtime_last_two_weeks": 355, "playtime_at_review": 722, "last_played": 1712956862}, "language": "english", "review": "Game hasn't progressed much since buying the beta one year ago. Combat animations still appear as if the wacky inflatable tube man is swinging a sword around. UI can be buggy at times requiring a server restart. Game needs some serious polish for me to recommend it as a finished product.", "timestamp_created": 1711744873, "timestamp_updated": 1711744873, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.5908699631690979", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161126709": {"recommendationid": "161126709", "author": {"steamid": "76561198329939885", "num_games_owned": 30, "num_reviews": 5, "playtime_forever": 1889, "playtime_last_two_weeks": 0, "playtime_at_review": 816, "last_played": 1711735627}, "language": "english", "review": "lots of bugs", "timestamp_created": 1711088674, "timestamp_updated": 1711088674, "voted_up": true, "votes_up": 5, "votes_funny": 14, "weighted_vote_score": "0.585873067378997803", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160892474": {"recommendationid": "160892474", "author": {"steamid": "76561198358891376", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 5178, "playtime_last_two_weeks": 0, "playtime_at_review": 3806, "last_played": 1711224523}, "language": "english", "review": "10/10 from me on this game. im a builder at heart in games just love to build and make a sick place and sick places you can make indeed. The \"advance\" build option to move the pieces all around and rotate them to how you need is fantastic that ALONE has made love this game plus how easy and simple to sink or snap down structures. The tree house you get is super sick and you can build all in the branches just like you'd want to you can really go nuts with your building but you can also build all over the world which is fantastic. The world is really well crafted and i feel its something i havnt experienced in a game before. Now all that jazz was building but oh wait there is more the armors are really cool and unique i feel. In so many games there can be alot of armor options but only really 1 or 2 that look good and that you rock pretty much the whole game once youve unlocked them but not on this game there are like 6 i can think of that i have unlocked SO FAR that id totally rock even the lower level ones look super unique and creative. The quest and characters you met are pretty skitz and the weapons and tools are sick. Not gonna ruin it to much but one of the weapons you get is a scythe which is pretty neat nothing is better then grinding to get wings and a scythe then jumping off of your front porch way up in a great tree then flying down and messing up some punk ants on the ground. Gonna say it again i give this game a 10/10 the only thing i could humbly recommend to improve the game is a quest dialogue just something i could look at to see exactly what the last person i talked to said just so i dont have to go back to that person to ask again what they need/need me to do thats all.", "timestamp_created": 1710821596, "timestamp_updated": 1710821596, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.584415614604949951", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159220816": {"recommendationid": "159220816", "author": {"steamid": "76561198057064034", "num_games_owned": 0, "num_reviews": 49, "playtime_forever": 162, "playtime_last_two_weeks": 0, "playtime_at_review": 162, "last_played": 1708846213}, "language": "english", "review": "So this is, of course, just 3 hours-ish but, so far, the impression is...not great.\n\nThe combat is kinda stale-ish, lots of just rolling and parrying with no really varied movesets for combat. \n\nFood is...kinda pointless? Like, there's so much variety in things to eat, but there's no actual reason to HAVE that variety, all they do is give you nourishment. So, basically, just eat ant heads forever. In so many other survival games, what you eat matters. Valheim revolutionized this and many survival games are following in their footsteps. Smalland didn't. \n\nThere also doesn't really seem to be an incentive to build nice homes that I can tell. When I say that, I mean for example, some games have a mechanic where the more you decorate your house, the more bonus you get, like in Enshrouded, you gain a buff to your stamina, so you really start to dedicate making your homes nice and cozy to get the biggest buff you can. In this, it's mostly just to...avoid damage from storms/heat/cold. Make a shack with a fire, you're good. \n\nAnimations are...eh...Some bug attacks are just so fast that trying to dodge/parry them is more or less impossible, or their animation just doesn't play at all and you take damage from a stationary enemy. \n\nThere doesn't seem to be any ways to debuff your foes outside of fire and poison, so you don't really need to plan ahead for a majority of fights. Just pick the weapon they're weak against and smack them till they stop moving, basically. \n\nBug density is...intense. Really intense, I was fending off bugs more than exploring because there was just so many of them. They aren't hard to deal with, just annoying to keep fending them off.\n\nBuild from chests. Jesus christ, any survival game that doesn't have this feature drives me insane. I already know that if I continue playing, I'll need more resources, which means more chests, which means more organizing, Any time I'll want to craft something, I gotta find that thing in the exact chest. Let me spend 5 minutes just finding stuff in my own home, woo. Please, Enshrouded made a Magic Chest system specifically to fix this issue and it's absolutely stellar. Implement it, I beg of ya.", "timestamp_created": 1708846590, "timestamp_updated": 1708846809, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.582101345062255859", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158688670": {"recommendationid": "158688670", "author": {"steamid": "76561197981176523", "num_games_owned": 0, "num_reviews": 148, "playtime_forever": 797, "playtime_last_two_weeks": 0, "playtime_at_review": 797, "last_played": 1708312745}, "language": "english", "review": "I don't understand how a dev studio can leave early access with release 1.0 and not have a finished story. \n.....I didn't even get the \"end credits\" that I guess others have gotten.\nThis....could have been great. I waited with this on my wishlist ever since they released it in EA, I waited for a finished product. This is empty. This is sparse. This is a disappointment. I am so, so disappointed. \nGo play Grounded. Better in every single way.", "timestamp_created": 1708312936, "timestamp_updated": 1708312936, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.577836573123931885", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158829982": {"recommendationid": "158829982", "author": {"steamid": "76561198107894225", "num_games_owned": 67, "num_reviews": 1, "playtime_forever": 52, "playtime_last_two_weeks": 0, "playtime_at_review": 50, "last_played": 1709325213}, "language": "english", "review": "1-pet keep running to attack far enemy even after telling him \"wait here\" I try to use the whistle but no use, my pets keeps dying because of this\n2-clay spawn on Places I can't reach\n3-when I close the game and enter again I go back to my bed (not the last place I have saved)\n4-when I jump to the water while mounting, I get stuck by my pet body\n5-jumping spiders do 3x times damage it on attack (almost 50% of my hp)\n6-most of the time while mounting, my pet just keep stopping for no reason", "timestamp_created": 1708458695, "timestamp_updated": 1708458695, "voted_up": false, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.575107276439666748", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160912182": {"recommendationid": "160912182", "author": {"steamid": "76561198022185810", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 219, "playtime_last_two_weeks": 0, "playtime_at_review": 219, "last_played": 1710851256}, "language": "english", "review": "Its just not fun, it has the worst inventory management system, with your clothes and items that are in your tool bar in your bag as well, which is confusing and annoying tbh. trying to get anything at the start is just a grind....dying constantly to get even the basic items to progress just makes it meh.", "timestamp_created": 1710851383, "timestamp_updated": 1710851383, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.572304606437683105", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161159913": {"recommendationid": "161159913", "author": {"steamid": "76561198012185433", "num_games_owned": 0, "num_reviews": 59, "playtime_forever": 214, "playtime_last_two_weeks": 0, "playtime_at_review": 214, "last_played": 1697732366}, "language": "english", "review": "Dead feeling game. Huge world full of nothing but store-bought bug assets.", "timestamp_created": 1711118580, "timestamp_updated": 1711118580, "voted_up": false, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.567251741886138916", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159394202": {"recommendationid": "159394202", "author": {"steamid": "76561198050174307", "num_games_owned": 16, "num_reviews": 2, "playtime_forever": 9918, "playtime_last_two_weeks": 0, "playtime_at_review": 5634, "last_played": 1709848036}, "language": "english", "review": "Very nice game at all, i could write 80% pros & 20% cons, but what is important and why i would not recoment is price. I have several games with price bellow 20 EUR which you can play again and again for years because of 2 reasons, map in proceduraly generated and as such gives kind od new experience every time you start new game, and second reasons is they give at least 80-90% more content then Smalland.\n\nI payed 30 EUR, but for me real value compared with several other games i have would be 10 EUR or less.", "timestamp_created": 1709043746, "timestamp_updated": 1709043746, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.566710412502288818", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158570491": {"recommendationid": "158570491", "author": {"steamid": "76561198131870160", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 8269, "playtime_last_two_weeks": 0, "playtime_at_review": 2311, "last_played": 1709156176}, "language": "english", "review": "I love the story, fey folk or as we call them, the 'little people' have fascinated my people for at least a thousand years. This is the closest I will ever come to meet one of them, so thank you!\n\nAs for the game, it is challenging. It is a survivor game, that has, in my opinion, good arachnophobia accessibility options. That's a definite plus! Good fun, nice graphics, smooth gameplay.\n\nThe only criticism, is that the gear on my back takes up valuable space from my bag. That may need to be adjusted in future. Not particularly logical wearing a mask or a pair of leggings that is stuffed in your bag at the same time... But apart this minor annoyance, really good game, I can only recommend it!\n", "timestamp_created": 1708209123, "timestamp_updated": 1708209123, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.564759135246276855", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159257463": {"recommendationid": "159257463", "author": {"steamid": "76561198887069264", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 2895, "playtime_last_two_weeks": 0, "playtime_at_review": 723, "last_played": 1710636258}, "language": "english", "review": "A mix of Valheim and Grounded, the beautiful graphics, server customization capabilities, and quests to keep things moving makes this a fantastically fun game to play with friends.", "timestamp_created": 1708878845, "timestamp_updated": 1708878845, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.562071621417999268", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158576910": {"recommendationid": "158576910", "author": {"steamid": "76561197971255237", "num_games_owned": 688, "num_reviews": 34, "playtime_forever": 586, "playtime_last_two_weeks": 0, "playtime_at_review": 586, "last_played": 1708208105}, "language": "english", "review": "If you're looking for another survival crafting game, you can do worse than Small land. The gameplay is passable and there are cool features like taming mounts and pets, but the combat and content are limited currently. It still feels like it is in early access despite being officially released, and has a few nagging issues that make it hard to really connect with.\n\nThere isn't much guidance in the story, so if you like a more blind experience of exploration that is good - but someone like me prefers to have more direction in a game.\n\nNavigating the map is a little painful, every time you die you teleport all the way back to your last bed and there is no system of fast travel - so you'll find yourself hoofing it a lot.\n\nFinally, the durability is a little aggressive - constantly you'll have your items breaking on you with no decent way to repair them outside of carrying materials and dropping a crafting table. Allow us to turn off durability as a server option, or allow us to create patch kits to repair on the go. Anything to improve the situation with degrading weapons.\n\nNot the best game, but not the worst by a large margin. Pick it up if you love this style of game and you'll have a good time.", "timestamp_created": 1708213842, "timestamp_updated": 1708213842, "voted_up": false, "votes_up": 12, "votes_funny": 2, "weighted_vote_score": "0.559965014457702637", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159841167": {"recommendationid": "159841167", "author": {"steamid": "76561198833198400", "num_games_owned": 268, "num_reviews": 85, "playtime_forever": 180, "playtime_last_two_weeks": 0, "playtime_at_review": 177, "last_played": 1709559031}, "language": "english", "review": "🍀🍀🍀\nI find that there is just something so very charming when you play as a small person and you have to take on a big scary world full of stuff that just wants to murder you.\nThe game reminds me a lot of Grounded, and although they are quite similar in many aspects, it does stand out as a unique open world survival craft game.\nThe game recently transitioned from early access to full release, but there is still a certain \"jank\" to both the gameplay and performance of the game. It's nothing major, but enough to irritate you quite a bit if you care about it being completely smooth. I will delay playing this game more until it's been polished a bit further, however the game is still good even with some of those issues, so it warrants a positive review in my eyes. \n🍀🍀🍀", "timestamp_created": 1709558622, "timestamp_updated": 1709558622, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.555392324924468994", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "157923412": {"recommendationid": "157923412", "author": {"steamid": "76561199184193528", "num_games_owned": 17, "num_reviews": 12, "playtime_forever": 819, "playtime_last_two_weeks": 0, "playtime_at_review": 819, "last_played": 1682098498}, "language": "english", "review": "Needed a lot of updates and more content, but for what it was at the start was a decent little survival game. Hopefully with updates and more content to do it will be very addicting to play.", "timestamp_created": 1707485679, "timestamp_updated": 1707485679, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.554548919200897217", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158537750": {"recommendationid": "158537750", "author": {"steamid": "76561198023933346", "num_games_owned": 280, "num_reviews": 36, "playtime_forever": 1363, "playtime_last_two_weeks": 0, "playtime_at_review": 1363, "last_played": 1708116699}, "language": "english", "review": "Smalland is a game where the building is fantastic, but all other mechanics fall far too short.\n\nAn excellent building game, but a very weak survival adventure game.\n\nNot recommended at full price, wait for a heavy discount or further along in their \"post-launch roadmap\" to see if some of the worse mechanics and systems get revamped or redesigned", "timestamp_created": 1708183356, "timestamp_updated": 1708183356, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.551635861396789551", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1708347149, "developer_response": "Sorry to hear, we know this and are working to address it in the coming roadmap updates"}, "160906722": {"recommendationid": "160906722", "author": {"steamid": "76561198062319234", "num_games_owned": 316, "num_reviews": 15, "playtime_forever": 1998, "playtime_last_two_weeks": 33, "playtime_at_review": 1965, "last_played": 1713169797}, "language": "english", "review": "The premise for the game is good but from bugs to unfinished game systems it just isnt good enough and should still be in early access in its current state and is definitely not worth the money", "timestamp_created": 1710844769, "timestamp_updated": 1710844769, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.548809647560119629", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159743582": {"recommendationid": "159743582", "author": {"steamid": "76561198050390221", "num_games_owned": 465, "num_reviews": 19, "playtime_forever": 771, "playtime_last_two_weeks": 0, "playtime_at_review": 771, "last_played": 1708153480}, "language": "english", "review": "Needs more time in the oven. Idk what a \"post launch roadmap\" is but it sounds like stuff that should have been included in the 1.0 release. Compared to the recent survival game releases, this one does the least out of all of them. Pass.", "timestamp_created": 1709442570, "timestamp_updated": 1709442570, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.54626995325088501", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158566501": {"recommendationid": "158566501", "author": {"steamid": "76561197993816055", "num_games_owned": 299, "num_reviews": 48, "playtime_forever": 121, "playtime_last_two_weeks": 0, "playtime_at_review": 121, "last_played": 1680229288}, "language": "english", "review": "Devs of the game finished Early Access but releases the 1.0 version totally broken. Neither the hotbar actions works.\nFor sure I do not recommend this sh111t!", "timestamp_created": 1708206281, "timestamp_updated": 1708206340, "voted_up": false, "votes_up": 15, "votes_funny": 3, "weighted_vote_score": "0.545744657516479492", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159372245": {"recommendationid": "159372245", "author": {"steamid": "76561198826278687", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 2647, "playtime_last_two_weeks": 0, "playtime_at_review": 2459, "last_played": 1709497707}, "language": "english", "review": "Can't deny this game can be improved in so many ways but we are still enjoying it a lot. It is very fun to explore, we love that your way of exploring will evolve through the game and become more efficient.\nAs an enjoyer of survival games I appreciate when we feel how much we gotta stay alive in some situations and how hard it can get. It's frustration yet rewarding to have some things to lose in my opinion ( I got my spider killed so many times :\"V). Great game anyways\n\nFor the dev: \n- the purpose of factions should be improved\n- your tammed insects change their passive mode to attack mode on their own quite often and get o can get killed easily because of that, really need fixing\n- in our case, the other player never had my claimed three on his map for some reason\n", "timestamp_created": 1709012127, "timestamp_updated": 1709012127, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.54356849193572998", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "162384281": {"recommendationid": "162384281", "author": {"steamid": "76561198112825863", "num_games_owned": 0, "num_reviews": 23, "playtime_forever": 1393, "playtime_last_two_weeks": 0, "playtime_at_review": 1362, "last_played": 1712462043}, "language": "english", "review": "After seeing a YouTube video that got me into this game the quality and beauty doesn't dissapoint me which I'm impressed that the game looks really nice but besides this I just wish there was more stuff to do in this open world, like exploring dungeon like areas to get rewarded at the end because there are caves in this game but mostly all of them there's very little reason to go spelunking unless your in need of specific materials.\n\nalong with that but even though I enjoy hunting down bugs that are twice the size of me and landing successful parrys on them like it's nothing most of the time I just wish there were more human NPCs running around instead of the ones you encounter near the endgame.\n\nSpeaking of the enemies in this game I do have a couple of complaints about them, like a couple of the enemies would not even move a muscle while attacking pretty much not giving me any window of opportunity to deliver a parry before they strike or some enemies have way too quick of an that I can't even react quick enought in time before I get smacked also sometime and I don't know if this is an enemy hitbox issue because the bugs are constantly moving around to attack you or it's just the parry system istelf but sometimes the game doesn't register my parrying at all and allows the enemy to just hit right through it even though I've been keeping target on the same spot where the would swing from.\n\nBut yeah besides this and just lack of content this game has potential to be really good but sadly in its current I can't recommend this at the moment, but besides that I can't wait to see where we get down the road with this being early access and all because one thing I do wish one of this things to come early is more weaponry to play around with and maybe magic too.", "timestamp_created": 1712461139, "timestamp_updated": 1712461398, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.542357563972473145", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "162869486": {"recommendationid": "162869486", "author": {"steamid": "76561198886497932", "num_games_owned": 20, "num_reviews": 1, "playtime_forever": 5515, "playtime_last_two_weeks": 1373, "playtime_at_review": 4931, "last_played": 1713797483}, "language": "english", "review": "If you like open world adventure this is for sure the game for you. this game is like a gem in the ruff, how ever that saying goes. play this game!!!", "timestamp_created": 1713104937, "timestamp_updated": 1713104937, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.540636062622070313", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161614246": {"recommendationid": "161614246", "author": {"steamid": "76561198270936560", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 8050, "playtime_last_two_weeks": 122, "playtime_at_review": 6492, "last_played": 1713562841}, "language": "english", "review": "its been this long and the bees are still sitting under the tree attacking me right at the start whenever i try to go up my tree wow amazing", "timestamp_created": 1711579855, "timestamp_updated": 1711579855, "voted_up": false, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.540557861328125", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158739608": {"recommendationid": "158739608", "author": {"steamid": "76561198407860551", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 2930, "playtime_last_two_weeks": 0, "playtime_at_review": 2026, "last_played": 1708569054}, "language": "english", "review": "So far, LOVE this game. The landscape is fun and interesting, the creatures are cool, the variation for building is nice. The waypoint marker feature on the map is super helpful. Only real issue I've come across is the mount feature. Every time I enter the world, my mount is stuck in my house and I have to lead it back to it's paddock, so that could use fixing. Also, mount manoeuvrability on the lift. They bug out a bit. This is shortly after it's release from early access, so little things like that aren't unexpected. Over all, I'm really enjoying it!", "timestamp_created": 1708370116, "timestamp_updated": 1708370116, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.535634458065032959", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160180291": {"recommendationid": "160180291", "author": {"steamid": "76561197984427510", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 17451, "playtime_last_two_weeks": 0, "playtime_at_review": 16463, "last_played": 1710807798}, "language": "english", "review": "The grieffing is real, its so bad all the public servers are empty. We are all hiding in privates to keep our insects safe. If they allowed hte pets on our tree to be immuned to getting killed by other players you would actually see a commuity here.  I found a couple small communities that would love to explore the public settings, but...... it takes time to level up your insect to level 100, just for a grief-fer to be able to kill your pet in less then 5 mins and you have to do it all over .. and no retaliation to save it. or warning...  you just get a warning about your failer to protect the pet. if i were to grade this game, i would grade it a 3 ,only cause im forced to hide in private servers. if they fix there stupid idea of letting out pets die on our tree It could jump up to a 6 and if they gave us better angles for crafting and more items to craft with. it possibly can jump up to a 10 and consume my out of work life.  i love the concept. they just NEED to do alot of work,   The greiffers are pushing us to other games.", "timestamp_created": 1709989017, "timestamp_updated": 1709989017, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.531329929828643799", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "162471293": {"recommendationid": "162471293", "author": {"steamid": "76561198008759552", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 1543, "playtime_last_two_weeks": 0, "playtime_at_review": 1543, "last_played": 1712568423}, "language": "english", "review": "Going to say, this game didn't improve much over the years of it's creation. The content that was added feels like it was added for the sake of the players who were already at the end of the content. The upgrade system is useless apart from the point that they didn't bother to add armour between early mid game and the end game content. Combat is horrible, didn't get improved at all. It needs some sort of stagger system because combat is just a defensive battle of you waiting and dodging then getting two hits on the enemy and repeat until it's dead. Boss fights are very lacking and only have one to two attacks in their arsenal, it felt like basic enemies who mobbed you, like the flies, were way more annoying and harder to fight.", "timestamp_created": 1712569933, "timestamp_updated": 1712569933, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.526335477828979492", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160400406": {"recommendationid": "160400406", "author": {"steamid": "76561197975700598", "num_games_owned": 154, "num_reviews": 4, "playtime_forever": 5834, "playtime_last_two_weeks": 0, "playtime_at_review": 2146, "last_played": 1712154247}, "language": "english", "review": "Got this a long time back as an early access. Some friends and I enjoyed it. More recently, they finally added dedicated server and more content. We spun up a server and started playing again.\n\nTL:DR The game needs to cook longer. Its not quite ready.\n\nPros:\nBeautiful environments\nGreat concept\nDecent crafting\nRide-able insects\nDecent progression\nVery interesting armor designs\n\nCons:\nVery buggy/glitchy in full release\nMinimal acknowledgement of issues\nBasically no tutorial and rapid learning curve\nLittle explanation of many things such as items\nCombat feels bad and punishing even if you do it right due to desync\nExpensive when weighed against the problems\n\nLet them actually acknowledge and fix issues and it may be worth the price some day. For now, this another broken game that shouldn't be trying to charge more than $10. Maybe they'll pull a cyberpunk and fix most everything and be the game people love.\n\n\n", "timestamp_created": 1710264626, "timestamp_updated": 1710264626, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.525547444820404053", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "163221179": {"recommendationid": "163221179", "author": {"steamid": "76561197970683872", "num_games_owned": 0, "num_reviews": 204, "playtime_forever": 117, "playtime_last_two_weeks": 0, "playtime_at_review": 117, "last_played": 1700236423}, "language": "english", "review": "Funding from PC early access buyers just to pay for Quest VR development to make more profits, with NO PCVR development.\nThe absolute worse kind of people developing this, avoid.", "timestamp_created": 1713601740, "timestamp_updated": 1713601834, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1713775034, "developer_response": "Hey there! \n\nWe understand the review, but the smalland VR version is a completely separate game by a separate studio and didn't utilise any of the existing resources we spend on Smalland :)"}, "163211797": {"recommendationid": "163211797", "author": {"steamid": "76561198065283470", "num_games_owned": 106, "num_reviews": 4, "playtime_forever": 535, "playtime_last_two_weeks": 0, "playtime_at_review": 535, "last_played": 1702629501}, "language": "english", "review": "Should still be in early access with the amount of issues still plaguing it's \"1.0\" release.", "timestamp_created": 1713587809, "timestamp_updated": 1713587809, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160013274": {"recommendationid": "160013274", "author": {"steamid": "76561199213550503", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 4071, "playtime_last_two_weeks": 0, "playtime_at_review": 4071, "last_played": 1709782126}, "language": "english", "review": "Game is not bad, there is some stuff to do, building things needs work, you can only build on certain axis and not in any direction so lining things up with what's around you sucks.\n\nThere are still weird bugs/glitches. For example i was fighting Eadric, the maybe end boss, its as far as content goes for now i believe. Anyways, i got hit and knocked off the desk/counter and died against the wall and couldn't get my gear back. there is no where to stand or land on, it is a no building area as well.  It's all of my good gear, and that's what you get for not playing with cheats on, that let you keep your gear when u die. So I thought I could maybe reload, and get my scorpion to spawn to me and see if I could use the scorpion to get my stuff. I spawn back in all the enemies i killed are back, my scorpions health is still tanked. it dies, there goes 20+ hours of training my scorpion, lost my bird too, still can't find my shit, can't make it back up top because i have no good gear to get back there.  And now I'm done with the game because I basically have to remake everything and retrain pets and that's would probably take me way too long, just to try and beat the boss.\n\nDo Not Play without Keep your gear when dead.\n\nHonestly I would have recommended this but I am unsure if I should almost 68hrs of grind to lose it all because of glitches....  I guess you decide", "timestamp_created": 1709783194, "timestamp_updated": 1709783194, "voted_up": false, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159669196": {"recommendationid": "159669196", "author": {"steamid": "76561199475423559", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 11225, "playtime_last_two_weeks": 0, "playtime_at_review": 10843, "last_played": 1709852837}, "language": "english", "review": "Fun game my only issue is having random jerks killing your pets and no way to protect them. i wouldn't recommend this game, maybe if they fix issues like this first before thinking pvp maybe content for story is super short the resource grind it most of the game its more just a building game then survival can only have one pet fallow or protected only decent flyer is a annoying hard to control bird. yeah maybe change in future if they make improvements.", "timestamp_created": 1709367633, "timestamp_updated": 1709367633, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159035130": {"recommendationid": "159035130", "author": {"steamid": "76561199051195811", "num_games_owned": 180, "num_reviews": 11, "playtime_forever": 5063, "playtime_last_two_weeks": 0, "playtime_at_review": 2682, "last_played": 1709192784}, "language": "english", "review": "Fun game. Really enjoy the crafting and the exploring elements. Base building is pretty fun too. Bought it at 1.0 and have sunk about 44 hrs into it and more to come. It has a relax mode and a pause button. Big fan!", "timestamp_created": 1708671351, "timestamp_updated": 1708671351, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159006526": {"recommendationid": "159006526", "author": {"steamid": "76561198043564960", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 810, "playtime_last_two_weeks": 0, "playtime_at_review": 645, "last_played": 1708737895}, "language": "english", "review": "Ferngully, A Bug's Life, The Secret World of Arrietty, Epic. \n\nIf these any of these names strike a chord on your heartstrings and you play video games; this is for you, too.", "timestamp_created": 1708638664, "timestamp_updated": 1708638664, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158777975": {"recommendationid": "158777975", "author": {"steamid": "76561197984188333", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 5475, "playtime_last_two_weeks": 0, "playtime_at_review": 2614, "last_played": 1708695213}, "language": "english", "review": "While I do recommend the game as it is fun and engaging, not terribly a grind heavy game, and has a good deal of crafting and progression to keep you interested. However, there are some issues I have regarding the creatures you encounter. For instance a gecko is easier to deal with than a wasp and a wolf spider is easier to deal with than what they call a jumping spider. Big issue I have there is a wolf spider is a jumping spider and in this game is far larger than way they call a jumping spider. That makes he entire encounter backwards. I fear a smaller less intimidating creature, because it is almost impossible to dodge and over powered. So while there is a good deal of creatures, they are not terribly true to life. Another example, grey flies do piercing damage, and a fair amount at that. In reality flies are not able to bit let alone to pierce a victim. They spit an enzyme that helps breakdown food that is already dead/processed, much like human saliva. So Poison damage would be a better option. There is also not a great deal of guidance on where to find the next tier of resources so getting to higher tiers of the game can be a bit of a mystery. But I know we are at alpha 1.0 so at 40+ hours I am still going and hoping for great updates for the future!", "timestamp_created": 1708402305, "timestamp_updated": 1708402305, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159999212": {"recommendationid": "159999212", "author": {"steamid": "76561198004170234", "num_games_owned": 949, "num_reviews": 45, "playtime_forever": 820, "playtime_last_two_weeks": 0, "playtime_at_review": 820, "last_played": 1708508928}, "language": "english", "review": "I really enjoyed the first half of the game but its not finished which is very obvious once you hit the north side of the yard. They nearly had something special here but didn't make it unfortunately. \n\nI think every survival game should include the moving base concept, its a really good idea and makes me want to actually build something that isn't a box with crafting stations.", "timestamp_created": 1709764484, "timestamp_updated": 1709764484, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.522058844566345215", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159874649": {"recommendationid": "159874649", "author": {"steamid": "76561198087962798", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 3206, "playtime_last_two_weeks": 0, "playtime_at_review": 3204, "last_played": 1711845528}, "language": "english", "review": "Short but fun. Wish there was more to do because it is an awesome world to be in.", "timestamp_created": 1709598127, "timestamp_updated": 1709598127, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.522058844566345215", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158697727": {"recommendationid": "158697727", "author": {"steamid": "76561198136622158", "num_games_owned": 0, "num_reviews": 24, "playtime_forever": 1430, "playtime_last_two_weeks": 0, "playtime_at_review": 1091, "last_played": 1708398064}, "language": "english", "review": "This game is great, but it still does not seem finished? They have a road map of updates to come but it still seems to be early access build.", "timestamp_created": 1708323587, "timestamp_updated": 1708323587, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.522058844566345215", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158408390": {"recommendationid": "158408390", "author": {"steamid": "76561198027737581", "num_games_owned": 290, "num_reviews": 19, "playtime_forever": 219, "playtime_last_two_weeks": 0, "playtime_at_review": 219, "last_played": 1708033175}, "language": "english", "review": "I'm sorry, but this feels more like early access than actual early access games... \nPersonally I'm very disappointed and it feels like its enough content to keep you \"entertained and engaged\" for a bit over 2 hours, so you can't refund it anymore. \n\nIt does have potential and some solid basics, but... who knows, maybe in a year or so ?\n\nif you're really into this kind of theme + genre, try grounded instead\nif you're into the genre but not particularly picky about the theme, try enshrouded instead", "timestamp_created": 1708040742, "timestamp_updated": 1708040742, "voted_up": false, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.521964073181152344", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1708131535, "developer_response": "Sorry! We're going to continue working on Smalland, we haven't stopped just yet!\n\nHopefully we can make it worth your while in the future :)!"}, "158752275": {"recommendationid": "158752275", "author": {"steamid": "76561197978367331", "num_games_owned": 571, "num_reviews": 66, "playtime_forever": 3100, "playtime_last_two_weeks": 0, "playtime_at_review": 2405, "last_played": 1708621538}, "language": "english", "review": "I am currently at 40h as of this review and I am pretty sure I will put another 40h or more in before I exhaust the current content. People are complaining the content is light, I really don't see it. I am playing solo for the most part, sometimes co-op.\n\nThe game needs more tweaking but unless you are trying to speed run the available content you can expect 40+ hours. If you enjoy the game and spend some time playing the game instead of trying to blast though content as fast as possible I would say you could easily hit 150h+", "timestamp_created": 1708380389, "timestamp_updated": 1708380438, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.52173912525177002", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159915575": {"recommendationid": "159915575", "author": {"steamid": "76561198030642661", "num_games_owned": 55, "num_reviews": 5, "playtime_forever": 2775, "playtime_last_two_weeks": 0, "playtime_at_review": 2775, "last_played": 1709658188}, "language": "english", "review": "Since release of v1.0 the game is no longer playable for me, just dropped frames constantly, like playing on a computer from 1995.\r\n\r\nGTX1650\r\n64gb RAM\r\ni5 10400-F\r\n", "timestamp_created": 1709658298, "timestamp_updated": 1709658298, "voted_up": false, "votes_up": 3, "votes_funny": 2, "weighted_vote_score": "0.521450161933898926", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158868589": {"recommendationid": "158868589", "author": {"steamid": "76561197971167566", "num_games_owned": 1563, "num_reviews": 44, "playtime_forever": 3816, "playtime_last_two_weeks": 0, "playtime_at_review": 1755, "last_played": 1709790554}, "language": "english", "review": "Compared to Grounded, it has better graphics, better combat, and WAY better base building. Also traveling via catapult is stupid fun.", "timestamp_created": 1708495597, "timestamp_updated": 1708495597, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.521276593208312988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "163087439": {"recommendationid": "163087439", "author": {"steamid": "76561199031389651", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 2209, "playtime_last_two_weeks": 1480, "playtime_at_review": 2060, "last_played": 1713800098}, "language": "english", "review": "I LOVE THIS GAME. the music is magical and the world blends so well. Sad to say that the game was released in an unfinished state. My intentions are constructive criticism. there are so many signs that the game was not ready to be launched. One blaring sign is the early access tag in the menu. Not to mention the said updates coming around the corner. revamping crafting, taming. like i really want to play the game. i bought the game a year ago in early access when the tutorial was different. i noticed they had its offical release and played more. then i realized why theres going to be a crafting update. I made it close to end game and realized a massive power jump once you cross the broken bridge. I hope the devs are still working on this game. It got overshadowed by grounded which is a shame cause in terms of fun gameplay this blows grounded out of the water. Polish and ready for release? grounded won that fight.", "timestamp_created": 1713423366, "timestamp_updated": 1713423366, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.519999980926513672", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158797472": {"recommendationid": "158797472", "author": {"steamid": "76561198220574155", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 5343, "playtime_last_two_weeks": 0, "playtime_at_review": 5343, "last_played": 1708428472}, "language": "english", "review": "this review is more neutral then negative but i hope this way the devs see this. \n\nPros: the design and world is amazing. i had a lot of fun exploring this world and surviving. i really enjoyed the building and the tree bases. i didnt have any major bugs so far on my end either\n\nCons: the combat is meh. its hard to tell sometimes wich enemies can be killed easy and wich ones are too dangerous. the level doesnt really tell a whole lot about the enemy.  [spoiler] the endgame is underwhelming. when i fought the endboss i was excited to see the armor and wings. even the Whip looked badass. and whats the reward for finishing? a measly sword (great design but thats it) and new wings. the wings look great but thats also it. you save the kingdom for a sword that cant even do anything special. wow and why did i do that again? this whole update felt rushed as hell. please Devs this cant be it. you can do better im sure [/spoiler]", "timestamp_created": 1708428904, "timestamp_updated": 1708428904, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.519999980926513672", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158554522": {"recommendationid": "158554522", "author": {"steamid": "76561198040117234", "num_games_owned": 0, "num_reviews": 27, "playtime_forever": 1032, "playtime_last_two_weeks": 0, "playtime_at_review": 1032, "last_played": 1708009782}, "language": "english", "review": "Doesn't feel like a 1.0 release, especially when you look at what's planned for future updates. The redone \"tutorial\" is also pretty terrible, especially for the new players I've seen try to play.", "timestamp_created": 1708197318, "timestamp_updated": 1708197318, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.519471466541290283", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "163022003": {"recommendationid": "163022003", "author": {"steamid": "76561198043768778", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 1758, "playtime_last_two_weeks": 189, "playtime_at_review": 1758, "last_played": 1712981222}, "language": "english", "review": "Smalland is a criminally underrated game. It's hand crafted world is beautiful and each area feels new and fresh to explore. All of the armor sets look amazing and can be upgraded to keep your favorite sets relevant throughout your play through! It also does a great job at handling all the basics of the action survival genre. The building is great, the combat engaging, and the end game does a great job at breaking up the formula just enough to keep it fresh. Seriously, if your a fan of progressive, sandbox survival games give this one a shot!", "timestamp_created": 1713321445, "timestamp_updated": 1713321445, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.518518567085266113", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159373962": {"recommendationid": "159373962", "author": {"steamid": "76561198209334292", "num_games_owned": 338, "num_reviews": 12, "playtime_forever": 3266, "playtime_last_two_weeks": 0, "playtime_at_review": 2181, "last_played": 1710022365}, "language": "english", "review": "This is most beautiful game i ever plaed in \"mini word\". I like this game soo much, really u wanna try it. The graphics are really nice, the gameplay it's amazing. My normal type of game is not this one but, after i plated little from this game.. i can't stop playng it. I'ts soo nice story and gameplay.\nFrom long gameplay i see just one bug, sometimes i got stick in walls but in rare cases where i jump in the walls and here are holes. But after some movement u got unstuck. \nThis is my rate 10 of 10 game!", "timestamp_created": 1709014997, "timestamp_updated": 1709014997, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.518518567085266113", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158526272": {"recommendationid": "158526272", "author": {"steamid": "76561199428906245", "num_games_owned": 73, "num_reviews": 7, "playtime_forever": 5542, "playtime_last_two_weeks": 0, "playtime_at_review": 2294, "last_played": 1708790895}, "language": "english", "review": "Such an awesome game!!! Constantly amazed and thrilled! Thought I would end up comparing it to grounded but it doesn't even cross my mind while playing, they definitely have their own unique game.", "timestamp_created": 1708173379, "timestamp_updated": 1708173379, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.51754385232925415", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "162065067": {"recommendationid": "162065067", "author": {"steamid": "76561199185386513", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 180, "playtime_last_two_weeks": 0, "playtime_at_review": 180, "last_played": 1711926364}, "language": "english", "review": "love it \r\n", "timestamp_created": 1712094303, "timestamp_updated": 1712094303, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.517241358757019043", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158401816": {"recommendationid": "158401816", "author": {"steamid": "76561197987869552", "num_games_owned": 295, "num_reviews": 50, "playtime_forever": 3214, "playtime_last_two_weeks": 0, "playtime_at_review": 3214, "last_played": 1697528293}, "language": "english", "review": "Fun game but short for a survival game.   You'll get your moneys worth and easily 50+ hours out of it.", "timestamp_created": 1708032405, "timestamp_updated": 1708032405, "voted_up": true, "votes_up": 6, "votes_funny": 4, "weighted_vote_score": "0.516385376453399658", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158340755": {"recommendationid": "158340755", "author": {"steamid": "76561198245302466", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 1552, "playtime_last_two_weeks": 0, "playtime_at_review": 711, "last_played": 1708125069}, "language": "english", "review": "Did you grow up playing Pixie Hollow and wish you could play something similar? Then this game is for you, you get to be a tiny bitty pixie ish being and wear wings. Who doesn't love games where you get sparkly, shiny wings to glide slowly from tall heights! You also can live in a tree?! Make your own home tree. Its such a fun and cozy crafting survival game and I highly recommend it.", "timestamp_created": 1707958181, "timestamp_updated": 1707958181, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.515794456005096436", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159508541": {"recommendationid": "159508541", "author": {"steamid": "76561198051494572", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 17, "playtime_last_two_weeks": 0, "playtime_at_review": 17, "last_played": 1680130886}, "language": "english", "review": "Not a very smooth experience to play. Absolutely not ready for launch.", "timestamp_created": 1709172260, "timestamp_updated": 1709172260, "voted_up": false, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.515488505363464355", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1709547485, "developer_response": "Sorry to hear that! We're going to continue working on Smalland with more optimization, more improvements, more content to make it more worth your while! :)"}, "162821941": {"recommendationid": "162821941", "author": {"steamid": "76561198374521500", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 1511, "playtime_last_two_weeks": 1467, "playtime_at_review": 348, "last_played": 1713142087}, "language": "english", "review": "I love bougs", "timestamp_created": 1713043305, "timestamp_updated": 1713043305, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.514018714427947998", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158510269": {"recommendationid": "158510269", "author": {"steamid": "76561197995873939", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 226, "playtime_last_two_weeks": 0, "playtime_at_review": 226, "last_played": 1708155912}, "language": "english", "review": "[b]Wait till later in the 1.0+ roadmap. [/b]\n\nLarge swathes of unused areas with basically zero exploration reward: No hidden items, chests/caches, collectibles to hunt, etc..\nBad multiplayer integration: You literally can't use the base system with other players, it won't let them interact with your tree, you have to build camps on ground level (which is fine but wonky).\nBroken settings: DLSS causes terrible ghosting all over every moving thing, FSR doesn't work at all.\nBoring armor abilities: +3% resistance of one type that they want you to switch out every piece every time based on your boss, +2% move speed but you die at night, or just cold protection.\nWonky pets with boring taming mechanics: Grass hoppers jump ten thousand miles across the map and you just hope you don't land in a random puddle. Pets like lady bugs fleeing for their lives but you have to pull out a whistle to make them come back. \n\nThis definitely still feels early access and definitely should not have released in this state, but could be a good game in the future. Will update my review when we come back some day.", "timestamp_created": 1708156095, "timestamp_updated": 1708156633, "voted_up": false, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.513937652111053467", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "163105635": {"recommendationid": "163105635", "author": {"steamid": "76561198008805091", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 990, "playtime_last_two_weeks": 990, "playtime_at_review": 990, "last_played": 1713210847}, "language": "english", "review": "Nice game, still feels like it needs a lot of work, but can't wait to try it again in a year or two when it's more perfected :)", "timestamp_created": 1713450860, "timestamp_updated": 1713450860, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.513020813465118408", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158508510": {"recommendationid": "158508510", "author": {"steamid": "76561198347565000", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 11131, "playtime_last_two_weeks": 0, "playtime_at_review": 7741, "last_played": 1710108892}, "language": "english", "review": "This game is so incredibly fun. The settings are also highly customizable so it's really accessible if you need it to be easier or harder which I really appreciate. Both singleplayer and multiplayer are really enjoyable and it feels well balanced for an additional player. A few bugs, but so far the dev team has been great.", "timestamp_created": 1708154137, "timestamp_updated": 1708154137, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.508928596973419189", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161013328": {"recommendationid": "161013328", "author": {"steamid": "76561199206426191", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 1323, "playtime_last_two_weeks": 0, "playtime_at_review": 1323, "last_played": 1697162784}, "language": "english", "review": "I've played for a while and something feels dead. The enemies simply stand/float there and wait for you to come by. It's gameplay gets stale quickly, mostly because how dead the game feels always. NPC's are stiff, stand still with no voice overs. Not sure why, it really is beautiful, but I wouldn't recommend considering the better options out there.", "timestamp_created": 1710960472, "timestamp_updated": 1710960472, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.507667303085327148", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160230508": {"recommendationid": "160230508", "author": {"steamid": "76561198006889733", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 174, "playtime_last_two_weeks": 0, "playtime_at_review": 174, "last_played": 1710039283}, "language": "english", "review": "Was looking for Grounded, found Dark Souls. After about 3 hours frustration went through the roof and I uninstalled the game.", "timestamp_created": 1710039931, "timestamp_updated": 1710039931, "voted_up": false, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.502513110637664795", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160834526": {"recommendationid": "160834526", "author": {"steamid": "76561199164108745", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 72, "playtime_last_two_weeks": 0, "playtime_at_review": 72, "last_played": 1694163731}, "language": "english", "review": "I really thought this was going to be a fun lil survival adventure game. It's not that.", "timestamp_created": 1710758039, "timestamp_updated": 1710758039, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.501915693283081055", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160623980": {"recommendationid": "160623980", "author": {"steamid": "76561198817881859", "num_games_owned": 65, "num_reviews": 5, "playtime_forever": 5287, "playtime_last_two_weeks": 0, "playtime_at_review": 5287, "last_played": 1708018376}, "language": "english", "review": "to be honest 1.0 sucked real bad the final boss was terrible don't get this game keep your 20 dollers for something worth it trust me", "timestamp_created": 1710547367, "timestamp_updated": 1710547367, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.501915693283081055", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160487382": {"recommendationid": "160487382", "author": {"steamid": "76561199484602668", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 574, "playtime_last_two_weeks": 0, "playtime_at_review": 574, "last_played": 1703818360}, "language": "english", "review": "IMO, the game took the grindy parts of survival crafting games and made them not fun.\n\nEven if building just for art, the building should have more meaning than to simply exist because it doesn't even feel like you can create any form of art. Outside of art, there is no reason to build anything other than the crafting tables because you don't need protection from anything, and you can just teleport your buildings around the map for use.\n\nThe combat is not fun because it is too easy to cheese.\n\nTaming has potential but it is definitely not comparable to Ark by any means of entertainment or fun, so with high expectations(i.e. Ark expectations of entertainment), it feels terrible.\n\nThe story is not very well crafted but that's excusable for this genre and type of game, I only included it to compliment the fact that there is nothing fun about this game.", "timestamp_created": 1710385545, "timestamp_updated": 1710385545, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501915693283081055", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160369792": {"recommendationid": "160369792", "author": {"steamid": "76561198851596177", "num_games_owned": 75, "num_reviews": 3, "playtime_forever": 4504, "playtime_last_two_weeks": 0, "playtime_at_review": 3694, "last_played": 1710745176}, "language": "english", "review": "I really love this game. I tried it out originally when it first came out into early release last year and played for about a month or so. I took a nice long break and returned for the release of 1.0 . \nWhen I played last year i remember really loving the art and the feel of being a smallfolk. I have been playing again for about 26 hours in 1.0, and here are my thoughts:\nThe new tutorial is really good. It's super helpful and I was happy to see the great tree system explained early on. The way the bosses are laid out flows really well now and I have made a ton more progress in the time I have played again this week on a new playthrough compared to when I originally played. I love all the changes and I really love this game. The new factions and world events are fun, too! I do hope the devs consider awarding more then 6 points per an event soon, as that's the only thing I would change right now. It's too slow of a grind when the events are already pretty tough for the most part. \nThis game is beautiful, and the musical score is awesome! It has a whimsical feel and I can happily get lost in it for hours. I hope you enjoy it as much as I do.", "timestamp_created": 1710219556, "timestamp_updated": 1710219556, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158561056": {"recommendationid": "158561056", "author": {"steamid": "76561199235648481", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 2609, "playtime_last_two_weeks": 45, "playtime_at_review": 2563, "last_played": 1713411485}, "language": "english", "review": "The game is a lot of fun. really like the part. Where the big bird. Was attacking! ME..", "timestamp_created": 1708202615, "timestamp_updated": 1708202615, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "135776223": {"recommendationid": "135776223", "author": {"steamid": "76561198833670615", "num_games_owned": 0, "num_reviews": 30, "playtime_forever": 2669, "playtime_last_two_weeks": 0, "playtime_at_review": 323, "last_played": 1710535651}, "language": "english", "review": "HOLD F for fast pick up, you don't have to do it one by one :] I only mention this because I saw some people getting refunds thinking they had to pick stuff up one by one.", "timestamp_created": 1680227751, "timestamp_updated": 1680303669, "voted_up": true, "votes_up": 365, "votes_funny": 30, "weighted_vote_score": "0.95054250955581665", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "151864118": {"recommendationid": "151864118", "author": {"steamid": "76561198021609320", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 7047, "playtime_last_two_weeks": 0, "playtime_at_review": 6020, "last_played": 1711294754}, "language": "english", "review": "Jumping into Smalland I didn't know what to expect, I wanted to try out a new type of survival game. It looked promising from the trailer and turns out the more I played the more interested I was as I progressed more through the game.\n\nThe pros:\n\n- A theme that stands out, the world around you is mostly ordinary but it presents a good survival situation from your playable characters being very tiny. The world is vast with different biomes and an immersive atmosphere.\n\n- Easy to get into and understand, lots to learn as you play more. You got your health, stamina and hunger bars to manage as in many survival games and the rest is up to you to discover.\n\n- The freedom, as soon as you're out of the starting tutorial area you can do as you please and go mostly wherever you want. There are quests but the game doesn't hold your hand or force you to a specific route, the world is yours to explore as you want.\n\n- The combat is very satisfying, and I was pleasantly surprised by how developed it is. You can dodge, block, parry at the right moment to stun your enemies and there are different types of damage and weapons too. It adds a lot of variety to how you want to approach every combat situation.\n\n- You can customize your game exactly how you want, make it harder or easier, change the length of the season cycle as well as set the aggression of the creatures around you. There is something for everyone, be it a casual experience or a challenging word to survive in.\n\n- The building aspect, if you like making a good looking camp/base the game offers you a variety of different materials and decorations to choose from, but if not you can still keep it basic and its perfectly viable.\n\nThe cons:\n\n- The bosses and minibosses, I was hesitant to approach them on my first playthrough, but when I actually got around to fighting them I was disappointed. Most of them have one or two different attacks which isn't what I expected given how strong the combat with ordinary enemies started out. There are also creatures that I thought would just one shot you or you would need a special item to be able to beat them but that is not the case, you can just go in and defeat them if you have the health and potions to spare and you know how to block.\n\n- Mount imbalance, there are several creatures you can tame to ride and they help with travel and/or combat. But in the early to mid game I see no reason not to use the grasshopper over the others just because it has so much mobility and allows you to traverse the map very easily. It is a shame because it lessens the otherwise solid variety the game offers you.\n\n- A lack of greater reward for greater challenge: The amount of resources you obtain from fighting is the exact same on the easiest and hardest difficulties. It would be great if there were more drops or perhaps even unique drops to incentivize players who have conquered the wilderness already and want something more to go with a greater challenge.\n\nConclusion:\n\nGiven the price and what you get for it I definitely recommend the game. I give it a solid 8/10, it has a lot of good and a few bad things about it but overall its worthwhile if you're looking for a new survival game. As of writing this review the game is still in early access so a lot can change with time. And this is all my opinion so feel free to agree or disagree, thanks for reading my review!", "timestamp_created": 1700931037, "timestamp_updated": 1700931037, "voted_up": true, "votes_up": 193, "votes_funny": 3, "weighted_vote_score": "0.936165988445281982", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140913187": {"recommendationid": "140913187", "author": {"steamid": "76561197967935433", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 574, "playtime_last_two_weeks": 0, "playtime_at_review": 574, "last_played": 1680731104}, "language": "english", "review": "TLDR -  Grounded but fantasy instead of sci-fi, responsive devs embracing a collaborative Early Access\n\nWith that being said, the game is still in Early Access where as Grounded has released and is much more polished. However, this game has a rare experience of Early Access that doesn't always happen. The developers actually listen and have made core game play adjustments based on feedback. \n\nIn my experience with multiple Early Access games, developers tend to have their idea and refuse to budge off of it, which can be fine in many cases. They added in a parry system after early complaints of combat being shallow. They wanted the players to visit NPCs to craft certain armors, but player feedback lead them to allowing most armor crafting to be done by the player. They added in boundary markers for the movable treetop bases after players realized they could accidentally build outside of the allotted space and not realize it\n\nUltimately, the game is pretty fun with a solid gameplay loop. They're frequently updating as well as communicating with the player base what they're working on and accepting feedback and criticism to make a better product", "timestamp_created": 1688056054, "timestamp_updated": 1688056054, "voted_up": true, "votes_up": 290, "votes_funny": 7, "weighted_vote_score": "0.917826592922210693", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "138264942": {"recommendationid": "138264942", "author": {"steamid": "76561197993686720", "num_games_owned": 275, "num_reviews": 21, "playtime_forever": 1190, "playtime_last_two_weeks": 0, "playtime_at_review": 1086, "last_played": 1684085962}, "language": "english", "review": "Pretty good.\n\nSome people compare this game to Valheim and the comparison is somewhat valid. Progression and base building are very similar, if not identical. Combat is centered around dodging and blocking, there's no parry mechanic. Food doesn't give you health/stamina buffs, since there's a hunger/thirst bar. Food doesn't spoil, which is nice. Tools, armor and weapons can be repaired for free if they're not damaged too much. After a certain threshold you need some resources to fix them. Inventory is only slot restricted, items don't have weight. The game has RPG-like paper doll UI where items like tools, weapons and armor have to be equipped, unlike in Valheim where equipped items are still held in the inventory. This creates a slightly annoying issue I'll get back to later.\nGraphics and sound design are very respectable. Few issues with audio occlusion when you're in a player-made building, but nothing game breaking. Performance is really solid. I was getting +100 fps, locked 120 average, 1080p High without any FSR/DLSS on a 3070. All key mappings can be rebound, there's a FOV slider and all the jazz you'd expect from a PC game. Very good.\n\nIf you're not a big fan of spiders, there's an arachnophobia slider. At max value, the spiders' legs are not visible. But that's it.\n\nAnyways, off to the specifics:\n\nCombat:\n- You can't parry and there's no shield item which is weird because the game does support having two tools equipped at once, sooooo...?\n- Most encounters boil down to everyone's favorite mini-game of bar management, where you seemingly never have enough stamina to block/dodge and attack in time. Later in the game you meet enemies that apply poison DoT which pauses stamina regen for half a second each time you take damage, so the fights drag out even longer. There's stamina potions but I always forgot to use them, no idea if they're any help.\n- There's very aggressive input buffering/queuing, whatever you want to call it. Basically you can hold down LMB to keep attacking or using your tool instead of clicking. The problem is, if you don't let go of LMB right before the next swing, you've queued up another swing. This can make combat a bit unresponsive as your character does swings you didn't really want them to and you lose stamina.\n- Weapons have different damage types and enemies have weaknesses and resistances, but despite that I often found out that just spamming sword/axe is the best tactic.\n- Weapons, tools and armors have tiered upgrades. There are resources that require a tool of a certain tier to be gathered and this part works mostly as you'd expect. As far as weapons and armors go, I often didn't notice any difference when going from Tier X to Tier X+1. If you skip one tier, then the difference becomes noticeable.\n\nExploration:\n- Your character feels very slow, even when sprinting. Mounts can help with that tho.\n- The game's scale contributes to a feeling that you're not really making any progress, since most of the map looks very same-y (I got the same vibe from Grounded). In other games you can almost always notice how the scenery changes when you advance from one biome to another.\n- Your character can't swim so early on you're gonna have to get creative to get past certain obstacles. Later on you can tame a bug or craft armor with wings that makes moving around much more bearable.\n- There's no fast travel in a traditional sense. Your best bet to get home if you're far away is to quit to menu and and load back in. Later on you unlock a... Very creative tool to travel large distances quickly.\n\nSurviving:\n- Very basic. There's one bar for hunger and that's it. Food doesn't spoil, so you can just stock up on berries or whatever and you're set.\n- Unlike in Valheim, foods don't give buffs to HP or stamina. It's only function is to fill up the hunger bar, or give yourself a warmth boost during winter.\n\nBase building:\n- As mentioned before, very Valheim-y. You craft a hammer, put resources in your inventory and place building blocks one by one. If you messed up, deconstructing gives you all items back.\n- Snapping works very well.\n- There's an \"advanced rotate\" mechanic that allows you to rotate all pieces in each axis as you see fit. Very cool.\n- There's a decent amount of shapes of walls, roofs, windows etc., so if you're more creative than I am, you can make a nice base.\n- There's also furniture you can build purely for decoration, if you're into that.\n\nProgression:\n- You unlock new recipes by picking stuff up.\n- Certain recipes are unlocked after you kill a boss and deliver an item to an NPC.\n- There's no leveling in any form. No skill trees, no classes, nothing.\n\nOther things:\n- Decent amount of session customization. You can toggle peaceful mode, dropping your inventory on death. There's also multipliers for day/night cycle, seasons cycle, hunger rate, damage dealt to/by enemies and fall damage. Very nice.\n- Only punishment for death is you lose all items you didn't have equipped. There's no extra wear on tools/weapons/armor, no debuffs. You only lose your stuff and you can get it all back by going back to where you died.\n- Vast majority of mobs in the game are aggressive by default. Makes early-mid game exploration a bit of a pain, since it can be tricky to lose them.\n- ...but you can make them fight each other if you need to make a run for it or have a hard time fighting something.\n- Certain early game items (like a wood sword or a basic healing bandage) have to be crafted via crafting station. Why can hand-craft a torch and a club but not a sword, arrows or a hatchet?\n- No crafting directly from chests and no way to pin crafting recipes to the UI. I hope you like going through chests to pick up items you've written down in Notepad or something.\n- No batch crafting. Need to make 20 of an item? Get your autoclicker on.\n- Going to specific NPCs to craft armor is a strange choice. If I have to talk to an NPC to unlock a recipe, that's fine, you're rewarding exploration. But if you make me haul butt JUST to craft the armor, what's the point?\n- Since you have to equip weapons and tools from inventory to the paperdoll UI, your inventory can get very messy after some time. I like having things in order and it ever-so slightly bothers me if they aren't.\n- The grappling gun is hot garbo.\n- Bird surprise was not fun.", "timestamp_created": 1684025366, "timestamp_updated": 1684025366, "voted_up": true, "votes_up": 131, "votes_funny": 4, "weighted_vote_score": "0.9165915846824646", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "143295654": {"recommendationid": "143295654", "author": {"steamid": "76561198029584875", "num_games_owned": 0, "num_reviews": 41, "playtime_forever": 7657, "playtime_last_two_weeks": 0, "playtime_at_review": 4766, "last_played": 1704651311}, "language": "english", "review": "[b][i]Smalland[/i] - how is it, and how does it compare to [i]Grounded[/i]?[/b]\n\n[i]Smalland[/i] is an enjoyable, if unfinished, entry into the genre of Open World Survival Crafting. As of writing this review, [i]Smalland[/i] is in early access. It is actively being updated, with a new patch having dropped this morning. \n\nFirst, the bad. Normally, I would talk about bugs, but... well... you've seen what you are fighting. So let me say that there were almost no [i]unintentional[/i] bugs, and those may soon be gone. There are features that the game is [b]sorely[/b] lacking, most importantly in the area of preventing motion sickness. The game needs an FOV slider. Even more vitally, it needs the ability to turn of first-person head bobbing and the screen shaking during storms. And to allow flying mounts (particularly the blue tit) to hover. Without these, [i]Smalland[/i] is making a lot of players sick. \n\nThere are also QoL improvements that would be nice -- such as being able to craft multiple of an item at once -- but the game already has several good QoL features including sorting and depositing into chests according to content. And I have fair confidence based on the patch today that the desirable improvements will come in time.\n\nThat's it. That's all the bad, and there isn't much.\n\nNow for the really good!\n\nImmediate high points for a beautifully hand-crafted world in this age of procedural generation. And the world is brought to life with weather and changing seasons. \n\nIn any large open world, some sort of Fast Travel is a must. But [i]Smalland[/i] opts to offer alternatives to player teleportation. NPCs will teach you recipes to help tame certain animals, some of which you can ride. You can build catapults to launch you high into the air. Which is fantastic when combined with wings that allow you to glide. A good tree-top base with multiple catapults, and I was able to get almost anywhere in short order.\n\nDepending on which direction you travel, you can get those wings fairly quickly. This is a true open world, and with the exception of the late game zone, none of the areas are gated by progression. You can encounter the NPCs and areas in any order. NPCs stay in one place and have limited dialogue, often giving a quest and and/or moving the story forward. Plus, they unlock armor schematics, including those precious wings.\n\n(Sadly, until you get wings, your only Fast Travel option is to quit to the menu and then re-enter. This will put your character back at their spawn point, ostensibly the home you are crafting. I did this a [i]lot[/i].)\n\nOne of the coolest features of the game: While you can build almost anywhere, there are a bunch of great oak trees with very big building areas on top of them, well away from any threats. After you jumping puzzle your way up your first one, you unlock the ability to claim a tree as your own and make it where you build your house. The great oaks come with a cool hot air balloon that will take you up or down so you never have to do the jumping puzzle again.\n\nThe best part, though, is that you can you can claim another tree later and your entire base will move to that location, unclaiming the previous tree. This means you can move your house to areas you want to access quickly as you progress. It's like someone looked at the C.A.M.P. system from [i]Fallout 76[/i] and said \"Let's do that, but make it awesome.\"\n\nBase building in the game is beautiful! There are a delightful variety of building pieces, and the game includes an advanced rotation option that allows you to flip pieces about for a far greater building variety than in most OWSC games I have enjoyed ([i]Grounded[/i] included). Once I unlocked the highest tier building pieces, I started tearing down the ramshackle hodgepodge I had been living in and building my true player home. And it was glorious!\n\nGiven the BIG points of similarity -- that you are tiny and you are fighting bugs in an Open World Survival Crafting game -- it is nearly impossible to avoid comparisons between [i]Smalland[/i] and [i]Grounded[/i]. Both give you a lovingly hand-crafted world to explore from the point of view of someone very small. \n\nBut the feeling of the games are very different. [i]Grounded[/i] is polished and cartoony, with Mad Scientists wielding Weird Science in a nostalgia-inducing riff on the 1980's. [i]Smalland[/i] feels more somber. You are a member of a pixie-like race existing in the world post-humanity. Some apocalypse happened to the \"giants\" some time ago, and you neither know nor care what.\n\nYour mission is to scout out threats to your people in the hear and now. Something is making the insects more aggressive. And your Queen is dying and in need of an elixir to cure her condition. These are your concerns.\n\nThe world of [i]Grounded[/i] feels more solidly put together. The sense of scale is more consistent than in [i]Smalland[/i] where ants are several times the size of bottlecaps. In [i]Grounded[/i], practically everything was fully meshed. You could jump between blades of grass, climb ferns, and use mushrooms as archery platforms. In [i]Smalland[/i], most of the non-resource vegetation is only exists visually, and several things that do have meshes (like mushrooms) are designed so you slide off them.\n\nOverall, the game is definitely worth buying and trying if Open World Survival Crafting is your jam.", "timestamp_created": 1691027537, "timestamp_updated": 1691028756, "voted_up": true, "votes_up": 151, "votes_funny": 0, "weighted_vote_score": "0.914452910423278809", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "139903933": {"recommendationid": "139903933", "author": {"steamid": "76561197961466895", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 1515, "playtime_last_two_weeks": 0, "playtime_at_review": 1428, "last_played": 1686517182}, "language": "english", "review": "I bought this game for my son and I after playing Grounded together. 23 hours in and defeating 3 bosses this is my temporary opinion of it. (Keep in mind this game seems to be very early access but I see a lot of potential)\n\nPros:\n\nDoesn't feel like Grounded at all. It adds some things Grounded doesn't have such as portable bases in the form of Great Trees. Basically it allows you to move your entire bases across a decent amount of points on the map. Tamable critters, gliding (via armor), and flying (by mount). All 3 have their limitations and most end up feeling disappointing. The armor gliding though is near perfect. I use that as my primary way to travel.\n\nInstead of Cons since I presume a lot will change according to the road map I may end up regurgitating some recommended improvements.\n\nNeed to Improve:\n\n1) Combat system: It's okay but its bad. Some fine tuning on stamina drain on block/dodge is needed. You can barley manage to go any fight without taking damage and none of the fights feel good. Also would like to see shields and parry added. The way to fight right now seems to be attack, dodge, run around, repeat. \n\n2) Tames: Taming isn't as big of an issue as the tames themselves. I'm sure the Devs have heard this, I hope they find a way to fix this. The FOV when riding is doable but its bad. If some how they made ARK level tames in this... probably wishful thinking here. Buffs and utility is needed for the tames. FOV change is welcomed it feels too close. I'd also like to see having more than 1 tame at a time. If not of the same critter which I could see being too OP for the State of the game but 1 of each please.\n\nLadybug:  Health/Resistance buff needed. This is my #1 favorite tame just for the extra inventory, but because it dies so easily I have to make it not follow and use the whistle when I need it. Since it likes to run away like a coward and often gets stuck and dies. Perhaps give it the ability to fly away from dangers. \n\nGrasshopper: I don't get this bug, I'd rather walk, seriously. If jumping distance is the idea maybe have charge leap ability and set that to determine how much distance/stamina you gain/lose as result. The leap distance and nearly complete stamina drain makes it not worth it. What would make this bug really stand out is the leap ability with a glide. \n\nGecko: This guy seems okay at the level of progression. I'd like to see massive speed boost and maybe consider allowing him to scale vertical walls. Damage is fine, I feel like it should be more of a ground travel mount.\n\nWolf Spider: This guy is disappointing. The only thing going for this is ability to attack while riding. This guy needs a damage boost and ability to scale walls. The mount speed is good and if left alone would make Gecko more appealing as a traveler. \n\nI haven't tried the few other mounts left over so no comment on those. All of the tamables for sure need health/resistance buffs. They are too weak. Both the Gecko and Spider need dramatic heals after every fight against mid level+ bugs. IE. Water bugs, green beetles, wasps, etc.\n\n3) Potions: I finally got around to making these and some are useful but man the time it takes to consume them especially health potions is too long. I hope you guys are considering time it takes to consume these items. The bandages are fine and are my go to for heals. \n\n4) Quality of Life: We need auto sort badly, as well as storage labels. I would like to see auto sort buttons in both character inventory and storage boxes. Claimed Great Trees should be viewable on the map not just the one you are occupying. A way to distinguish them could be through different icon colors. Trail markers for ground level base locations. \n\n5) Progression: The Progression feels pretty good. My complaint though has to do with the items. As we gain access to better tools and weapons, I expected bigger jumps in this. The damage improved from wood - flint - chitin - metal felt too marginal. Also the durability, please fix this. It feels like the weapons/tools are being damaged at the same rate upon use. It's very noticeable when you are cheap like me building workshops every where just to repair after a few uses for free. The only difference I notice is the rate which you get your harvest due to the extra damage from better tools. A 450 durability Iron Pick Axe degrades as fast as a 450 durability metal pick axe. Might already be in the works but I hope to see item upgrades have equal opportunity. Chitin Hatchen and Spear... but then we get 3 Iron slash damage weapons?\n\nMap Size: I don't know the exact details. The world looks big but as you travel it you'd be surprised how far you can go in a short amount of time. It feels on par with Grounded. There does not seem to be any depth to the upper level of the map. All it really seems to be is just building on top of Great Trees. Most of the activity in the game takes place at the ground level.\n\nFor anyone with high hopes in this game, it might not be worth it for you right now. I'm not sure how the cost to game play ratio will turn out for me in this. For me this game was worth the cost but I don't expect it at its current state to meet the same cost to game play ratio as I got with Grounded. Hope to see this game grow and change for the better.\n\n\n\n\n\n\n\n", "timestamp_created": 1686506545, "timestamp_updated": 1686506545, "voted_up": true, "votes_up": 378, "votes_funny": 1, "weighted_vote_score": "0.909056305885314941", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "135866161": {"recommendationid": "135866161", "author": {"steamid": "76561198030702683", "num_games_owned": 967, "num_reviews": 161, "playtime_forever": 426, "playtime_last_two_weeks": 0, "playtime_at_review": 97, "last_played": 1704858795}, "language": "english", "review": "I happened across this while poking around an email I got from Humble Bundle about new releases and was surprised to find it flew under my radar. I am an avid player of Survival/Crafting games (my favorites including Valheim, 7 Days to Die, and Raft among others) and I try to keep up on the upcoming ones but while Nightingale and Return to Moria were definitely in my 'keep an eye on' list I hadn't even heard of this one until it's release.\n\nIntrigued by this however, I decided to give it a go, and I can say I'm quite pleased with my purchase.\n\nI've had some friends compare Smalland to Grounded in that both games offer a similar setting. You're someone very small living among the insects, where even blades of grass are akin to a mighty oak tree, but really thats where the comparison ends. So for those of you who HAVE played Grounded, here's where Smalland differs.\n\n1. [b]You Are Not Human.[/b] In Grounded you played a human child shrunk down to a height measured in centimeters. In Smalland, you're not now nor were you ever human. You play one of the \"Smallfolk\" who live in underground societies and view humans as \"giants.\" One other thing that differs is that Smallfolk have antennae that allow them to sense nearby enemies and resources (default key is V for this) which works as a \"scanner mode\" akin to the Detective Vision from the Batman: Arkham games.\n\n2. [b]The Setting Leans More Fantasy[/b]: In Smalland's story, the queen of the Smallfolk has fallen horribly ill and your king has charged you to travel to the surface (the Overland) and attempt to find a cure for her. Rather than science fiction like Grounded, this brings back many fond memories of old high fantasy comics I would read in my childhood back in the late 1980s and early 1990s (infact the character design reminds me more than a little of Elfquest.)\n\n3. [b]Weather Plays a Major Factor[/b]: In Grounded it was always a bright sunny day for the most part. You had to worry about the poison gas in the Haze biome or the extreme heat in the Sandbox, but thats it. In Smalland something as simple as a rainstorm can spell doom for your pint-sized protagonist as surely as an ambush by a swarm of hungry warrior ants. Get caught out in the elements without proper protective gear and watch your plucky pixie freeze to death.\n\n4. [b]Tame the Wild Grasshopper[/b]: Grounded had a little mechanic where you could tame small insects as pets, but Smalland takes it a step further. You can tame a grasshopper to use as a mount and ride it across the land as your faithful steed! I also noticed in the upcoming planned features that they are going to expand on this, perhaps even adding flying mounts. I did see a dragonfly buzzing around come to think of it...\n\nSo yes, while similar to Grounded, in terms of theme and feel its quite different on many counts. Bear in mind this JUST released on early access at time of writing (the first week of April 2023 for those coming in late) but after about an hour and a half of play I had to say it was a VERY promising beginning. Its nowhere near done yet, but I'll be watching this game with interest from here on out.", "timestamp_created": 1680342192, "timestamp_updated": 1680342192, "voted_up": true, "votes_up": 164, "votes_funny": 2, "weighted_vote_score": "0.890601754188537598", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141010757": {"recommendationid": "141010757", "author": {"steamid": "76561198003928997", "num_games_owned": 0, "num_reviews": 42, "playtime_forever": 2212, "playtime_last_two_weeks": 0, "playtime_at_review": 396, "last_played": 1689905288}, "language": "english", "review": "I love this game quite a bit so far, However the one thing that is constantly pissing me off is falling into water and insta dying. I just got a grasshopper and got flung into shallow water. We both died instantly. Bugs take a insanely long time to drown... so why is it instant here?", "timestamp_created": 1688169583, "timestamp_updated": 1688169583, "voted_up": true, "votes_up": 105, "votes_funny": 10, "weighted_vote_score": "0.880561590194702148", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "137198716": {"recommendationid": "137198716", "author": {"steamid": "76561198044177746", "num_games_owned": 187, "num_reviews": 6, "playtime_forever": 1823, "playtime_last_two_weeks": 0, "playtime_at_review": 972, "last_played": 1707169305}, "language": "english", "review": "I came into this game comparing everything to Grounded (I love games where you are tiny) and I was pleasantly surprised. It has a feel of Valheim meets Grounded in terms of building. Here are some pros and cons of the game.\n\nPros\nLots of content\nVisually stunning\nUnique in terms of armor crafting and mounting\nGreat combat apart from the blocking mechanic which is slow and useless as it uses up all your stamina, might as well just swing the enemy to death.\nBuilding is great - plus points for being able to move your base from tree to tree without starting over.\n\nCons\nCan't swim - ugh\nBlocking mechanism\nFall damage is too sensitive\nInventory and storage management isnt great - they could take a lesson from Grounded on this one.\nCompanions need to dial it down, regardless of putting the companion on \"stay\" they always insist on joining the fight and taking the aggro. 99% getting killed in the fight anyway... so frustrating.\n\nOverall this is a great game with little to no bugs (no pun intended). I'm really looking forward to the future content of this game and sure I will have many hours of fun with this.\n\nDefinitely recommend buying this if you are a fan of Valheim or Grounded.", "timestamp_created": 1682287260, "timestamp_updated": 1682288592, "voted_up": true, "votes_up": 95, "votes_funny": 0, "weighted_vote_score": "0.872162997722625732", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "136894503": {"recommendationid": "136894503", "author": {"steamid": "76561198040789649", "num_games_owned": 954, "num_reviews": 2, "playtime_forever": 1772, "playtime_last_two_weeks": 0, "playtime_at_review": 1505, "last_played": 1686457247}, "language": "english", "review": "Honey, I Shrank the Valheim!\n\nThis game is a lot of fun. Feels a lot like Valheim, but miniature. Similar to Valheim, you'll unlock new crafting recipes by picking up new materials, with some of them being locked behind tiered bosses. Unlike Valheim, doesn't have boats, but it does have gliding wings (once you unlock them) and insect/gecko mounts. The mounts are a little awkward or buggy (heh heh) to ride for now, and I didn't get much use out of them in their current state, but the gecko was pretty cool to keep by your side after the first boss because he's such a good fighter against the easy bugs while you're still fairly weak.\n\nThe bosses get fairly hard, but beatable with better weapons/armor/potions, in single player, but I haven't played in multiplayer yet to know whether they're easier, or if their difficulty scales up.\n\nBuilding is pretty fun, it has a variety of shapes for each of the building materials, as well as allowing a variety of rotation/locking which allows for some creativity. At the time of writing, there is no stress mechanic such as in Valheim.\n\nI haven't noticed any game-breaking bugs or anything of that nature, nor any placeholder items indicating that the game isn't finished yet, but I do expect this game to get bigger and better with updates.", "timestamp_created": 1681802783, "timestamp_updated": 1681802783, "voted_up": true, "votes_up": 120, "votes_funny": 10, "weighted_vote_score": "0.864778637886047363", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "136097951": {"recommendationid": "136097951", "author": {"steamid": "76561197978924651", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 2650, "playtime_last_two_weeks": 0, "playtime_at_review": 720, "last_played": 1684187106}, "language": "english", "review": "Lets start with bold letter....YES I KNOW IT IS EARLY ACCESS, MY WIFE AND I ARE NO STRANGERS TO EARLY ACCESS, ALPHA TESTING, OR BETA TESTING. This is to give you an idea of what I have seen so far. \n\nOk, honesty time. I have 12hrs in the game on a mulitplayer world and solo. Does the game have potential? Yes. Does it need improvements (but that is what early access is for)? Yes. My wife and I play lots of survival games (7Days, Icarus, Raft, Ark, Dinkum, Fallout, The Forest, Sons of the Forest, Green Hell, etc.)  \n\nHere are the issues I have found so far that need to be addressed: \n- DLSS setting makes things like grass and your weapon blurry when moving (using a 3090).\n- NPC chat menus are drawn out. As reference, when talking to the owl or fairy controlling the lift, its constant reassurance that, yes this is the action I want to take. \n- The world is VERY overpopulated with every insect that wants to kill you. As reference, just to go from a tree to an NPC you travel through and fight, two swarms of five wasps, two big red ants, five spiders, four cockroaches (just as an example and the enemies grow if its nighttime). \n- You cant swim in water which is fine, but there are areas you can't even build across to cross the water.\n- Jumping is very elongated. It has a long hang time and if you bump something while jumping it has a rough bounce back.\n- Multiplayer is purely an individual game. This means that if there is an objective (kill a beetle) it has to be done as many times as there are people in the server.\n- Recipes do not share while in multiplayer. As with above, all recipes have to be learned by every individual. This means food, weapons, building supplies, etc. \n- You cannot craft anything in you pocket after making the basic axe, club, etc. Not even bandages. This means no excursions into the wild as there is no way to make more bandages or fix your weapons without going back to your tree. (Higher tier weapons I get, but fixing your low tier wood tools and making bandages is basic pocket stuff.)\n- There is no indication on how much damage your structure has taken in the storms. You just have to go around with your hammer and try to fix every single item you've built.\n- There are no perks to level your character. \n- Riding insects prove to be more of a hassle than  they are worth as they cannot come up to your tree with you nor is there an option to use their attacks to fight things while navigating. You have to get off and fight with your gear while your insect tries to fight and is attacked. \n- There is no indication while building whether a wall or ceiling piece is structurally sound. The only thing you get is when you try to attach another item, it says not enough support. Well without an indication system, there is no way to tell which area needs to be reinforced. \n- You cannot (as far as my experiments have gone) add vertical supports from the base of your building up to your roof to add more supports. Think of Valhiem, 7Days, or Icarus where you can add vertical posts to add stability to your structure all the way up to the roof. \n- There is no tech tree to show how to progress further. Its a guessing game when you pick something up or build something if it will unlock more items. \n\nI think that is everything I have seen in 12hrs of play. It is a good start to a game. I do recommend the game as long as you can deal with some of the frustrations. I will keep playing and look forward to updates.", "timestamp_created": 1680625072, "timestamp_updated": 1680625072, "voted_up": true, "votes_up": 206, "votes_funny": 4, "weighted_vote_score": "0.864714086055755615", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "155985893": {"recommendationid": "155985893", "author": {"steamid": "76561198029200412", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 528, "playtime_last_two_weeks": 0, "playtime_at_review": 528, "last_played": 1705361652}, "language": "english", "review": "i like the game but the camera shaking makes me feel super dizzy , so i need to have a break after storms or the heavy attack from the basic sword. i wish you could toggle off the shaking its a huge issue for me. I get that the shaking is there so you feel SMALL but some people cant handle it and throw up all over the desk pls make a \"turn off\" button in the options", "timestamp_created": 1705258701, "timestamp_updated": 1711934703, "voted_up": true, "votes_up": 84, "votes_funny": 4, "weighted_vote_score": "0.85812830924987793", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "136228479": {"recommendationid": "136228479", "author": {"steamid": "76561198018528658", "num_games_owned": 863, "num_reviews": 36, "playtime_forever": 1591, "playtime_last_two_weeks": 0, "playtime_at_review": 1518, "last_played": 1703392679}, "language": "english", "review": "Survive the Giant's world as one of the Smallfolk, recently stirred from deep underground to take down the Insect Supremacy and conquer the overworld in this fantasy-survival sandbox game. Pluck grass, gather wood, have NPC's do the crafting of armor for you since you can't measure yourself for reasons... it's all here, and it's pretty good. Oh, did I mention, your base can travel with you in multiplayer games? Hopefully players can get armor set with wings that let them fly rather than just glide...\n\n[table equalcells=1]\n\t[tr]\n\t\t[th]🟦 What I like[/th]\n\t\t[th]🟥 What I dislike[/th]\n\t[/tr]\n\t[tr]\n\t\t[td]+ Visual design strikes a good balance between reality and fantasy, even if some scaling is off.[/td]\n\t\t[td] - Some of the scaling seems wonky, just don't think about it too hard (micrograss? oxygen?).[/td]\n\t[/tr]\n\t[tr]\n\t\t[td]+ Create a fae persona, with antenna that color code your marker in multiplayer, and then build a base on a tree to take it with you, show it off to friends, or serve up to griefers in pvp (they did patch).[/td]\n\t\t[td]- Do not plan on doing any swimming, as water over your head makes you drown.[/td]\n\t[/tr]\n\t[tr]\n\t\t[td]+ Much of this is pretty standard, but it's done well, and fits the themes so far.[/td]\n\t\t[td]- I like that NPCs are in, and crafting armor is something for them to do, but it's a bit strange that we build looms but can't weave clothes. Perhaps allow players to make cosmetic ones, or find some other niche to make NPCs relevant?[/td]\n\t[/tr]\n[/table]\n\n[h3]Gameplay + 0.5[/h3]\nYou're tiny, so tiny grasshoppers boldly fight you. Your objective is to survive, and maybe do some other things for your people while you're up here. To that end, gather, craft, set up a base, and fight stuff to gather, craft, and set up a new base somewhere else so you can fight stuff to... you get it. Progression has a few hiccups that aren't really well explained (like the rewards from boss turn-ins) and the middle to end gets a bit grind-heavy if you plan on doing any large structures (or build a lot on the ground - moreso if solo). These issues are also alleviated in multiplayer, where different weapons and targets increase survivability against insects considerably, thus allowing for better gathering returns.\n\nThe insects are actually pretty tough, and though you can block with weapons, there's no shields - your offhand can hold a torch however, which is great for night fights (otherwise plop a campfire down real quick - you don't take damage standing on it anyway!). Attacks have decent telegraphs, but it's almost always better to dodge backward than side to side, as many attacks still hit in a wide area, but lack lunge range to that distance. This changes slightly against some shoreline enemies, but by then you can cope a bit (start from range). Boss fights are done in the same way, and were challenging to overwhelming, but could be thwarted in various ways and were obviously meant for groups.\n\nBuilding in this game looks and feels pretty good as well. The hammer unlocks your pieces, and you have the basic foundations/walls/roofs starter package available in leafy green... leaves. It fits the theme, and looks decent with further upgrades later as well. I don't want to spoil too much, but the lighting options were also thematically pleasing - but they need to have their brightness level turned up, as they don't serve much point beyond accent lighting, and I'd like environmental lighting more akin to the basic torch as an option.\n\n[h3]Immersion + 1.0[/h3]\nThe game does a pretty good job setting up the basics and dropping a few lore tidbits as you find your footing in the world. Building armor and bases all keep the nature themes, and the size difference results in some silly things like blackberries the size of medicine balls or large, discarded keys serving as visual waypoints.\n\nBut no shields? No swimming? While it's been said these creatures lived underground and didn't get much exposure, I'd like to state that large bodies of water exist underground, too.\n\n[h3]Graphics + 0.5[/h3]\nThere's a slight artistic liberty taken with the otherwise semi-realistic style they have here, and I think it actually works better in motion than it does at a standstill - there are lots of little touches that make insect motion feel animated and tree branches sway. Structures for building also look detailed, and though limited in supply, various decor options add a pleasant touch.\n\n[h3]Audio + 1.0[/h3]\nAudio is crisp and well done, with enemies having nice chittering effects, flapping wings, and telegraphs when they sting. There's also a bit of effort put into the storms, which were a nice touch the first time and continued to sound powerful outside while I huddled in my shelter.\n\n[h3]Performance + 0.5[/h3]\nThere's some weird hitbox detection things: enemies cleaved split damage between them rather than taking total damage each, and anything on an elevation above or below can usually hit you, but you can't hit it.\n\nWe had some issues in multiplayer with disconnects early on, but the biggest issue we had was joining and not being able to see the host's map markers - or any map markers at all, while not being the host. Once you're familiar, this is slightly less of an issue, but as I first started the game after joining a friend on their world, this bug convinced me that there were no markers and thus no ways to help orient myself early on! I was pleased to learn later this wasn't the case (and they showed up when reconnected later), but it was a bit of a struggle early on.\n\n[table]\n\t[tr]\n\t\t[td][b]🔁Content/Replay[/b][/td]\n\t\t[td]High - There's a pretty straightforward quest line which is decent if short, but the path to seeing it through is riddled with smaller adventures, and that's where games like this shine - and this one is no exception.[/td]\n\t[/tr]\n\t[tr]\n\t\t[td][b]💰Pass, Sale, Buy?[/b][/td]\n\t\t[td]Buy - Did you like the concept of Grounded but preferred it played like Valheim? Get this today.\n[/td]\n\t[/tr]\n\t[tr]\n\t\t[td][b]👨‍⚖️Overall[/b][/td]\n\t\t[td]Score: 3.5 / 5.0 - It's Early Access, but this is a good showing for a survival sandbox.[/td]\n\t[/tr]\n[/table]\n\n[table]\n\t[tr]\n\t\t[th]🖥️ System Specs[/th]\n\t[/tr]\n\t[tr]\n\t\t[td]AMD Ryzen 7 3700X | NVIDIA GeForce RTX 2060 SUPER | 16GB RAM | SSD | 4k (3840 x 2160)[/td]\n\t[/tr]\n[/table]", "timestamp_created": 1680811284, "timestamp_updated": 1680811394, "voted_up": true, "votes_up": 56, "votes_funny": 2, "weighted_vote_score": "0.850484549999237061", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "135680977": {"recommendationid": "135680977", "author": {"steamid": "76561199476505021", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 62, "playtime_last_two_weeks": 0, "playtime_at_review": 62, "last_played": 1680101978}, "language": "english", "review": "finally a game that simulates my height and life struggles", "timestamp_created": 1680102037, "timestamp_updated": 1680102037, "voted_up": true, "votes_up": 287, "votes_funny": 384, "weighted_vote_score": "0.841574132442474365", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "139176896": {"recommendationid": "139176896", "author": {"steamid": "76561197966094415", "num_games_owned": 962, "num_reviews": 14, "playtime_forever": 386, "playtime_last_two_weeks": 0, "playtime_at_review": 326, "last_played": 1687889825}, "language": "english", "review": "[i]I started up the game again today to see whether the issues I highlighted were improved by the patch two weeks ago. \n\nConclusion so far: Eh... It's better than it was, but it has a way to go still. But then the Developers have made it clear they're planning to make that effort. \n\nIt took me this long to get to that because I had a serious motivation problem due to people constantly making posts saying that I was just complaining that the game was too hard (which, really, I'm not. I mean, FFS the game lets you tweak the difficulty of your world. It even has a peaceful mode where creatures are completely passive until you attack them first. If my problem with the issues I identified were 'it's too haaaaard' I'd just turn that on). \nTo the point that I started deleting comments that said nothing but that and started delaying playing the game to update my review, because I did not want there to be even a 0.0001% chance that some twerp telling me to 'git gud' believed they'd successfully bullied me into changing my review to positive if it turned out that the issues were fixed.\n\nBut then I realised that that isn't fair to the developers and, really, isn't letting them get to me like that just a different way of letting them win?\n\nSo... Yeah, here's the review edited for the current state of the game.[/i]\n\nI would avoid this for now.\n\nA lot of the positive reviews for Smalland talk about its potential and they're correct in that the game has a lot of potential to be really good in the future. But future potential is not the same as current reality.\n\nAs it stands, the game's map is very large and there's a lot to explore... But a large part of that size lies in verticality. The map is obviously designed from the point of view that as you progress you unlock mobility tools (there's armour pieces with wings that let you glide, a grappling hook and presumably the eventual option to tame flying mounts). Unfortunately, those mobility tools are both essential to making getting around the map less of a slog... And completely unavailable right at the start of the game. \nWhich means that for most of the early game, you have to get around by running everywhere.\n\nAnd running everywhere highlights several other problems:\n- There are way too many aggressive insects and once they aggro, they will follow you ridiculous distances. The only way to disengage from an insect that has decided it wants to attack you is to sprint away and it often takes between almost a full bar of stamina to [i]over[/i] a full bar of stamina to get far enough where they will stop chasing. \n[b]This is still the case. The chase range still feels quite a bit too high.[/b]\n- Even when you eventually get good enough gear to where you no longer have to run from the swarms of various species of Ants that litter the map, the combat system is bad enough that even if you have weapon that kills them in two or three hits, they will also hit you a bunch of times as you take them down. Which means that you're constantly drained of healing items and weapon/armour durability just getting from where you decided to build you base to where you want to explore or gather resources. And while these ants provide some useful starting foods, they don't provide anything else, so you're not exactly getting much in return for the resources you're wasting having to fight them just to navigate the map. \n[b]The parry mechanic has somewhat improved this. While it's not actually that effective against the ants I'm talking about in this point (since those are individually weak, but drain your resources because they swarm you so that you can't dodge or block one of them without opening yourself up to an attack from one of the others), those ants aren't a real threat anyway. It works wonders against the various Beetles, Gekkos and solitary Spiders you might run into.[/b]\n- The inventory is ridiculously small. Another negative review pointed out that this game requires a lot of grinding. This is largely due to inventory size. Resources stack up to a maximum of 30 (and many 'products', like cooked food or healing items, have a stack size that's smaller than that) and the toolbar is not a separate inventory. So... Each and every tool, healing item and food item you're carrying with you (with the exception of whatever tool you currently have in hand) takes up an inventory slot. And not only do different resources require different tools, but different enemies have different weaknesses that require different weapons and if you don't use the most efficient weapon for a given enemy, it takes a lot longer to kill them, which costs more durability on your weapons and armour and more healing items to keep yourself alive. All of this stuff you have to carry with you when you leave your base, so even if you stick to carrying solely the essentials for your journey and leave everything else in a (couple of) chest(s) in your base, your inventory will already be between a quarter and a third full.\n[b]The realisation I had as I was playing the game again is that in addition to all the tools and healing you have to carry, the inventory feels small because in gathering the resource you need, your inventory will also constantly get clogged up with resources that you don't need (or don't need as many of. This isn't an issue exclusive to Smalland, lots of similar survival builders have this, but that doesn't make it less of an issue, particularly when combined with the other factors.[/b]\n- {i[I'm condensing the bullet points on tames into one point, since that is the area that the developers seem most focused on in the future and it's what's most likely to drastically change over future patches. With the latest patch, tames are more durable and being able to have more than one tame waiting at your base is a huge boon. This is a good development. But (You knew there was going to be a 'but', didn't you?) the way that switching your active pet works does still have some QoL issues. You can very easily and cheaply craft a pet whistle that lets you call your active pet to you no matter where it is on the map and it will sorta teleport to you. But in order to switch your active pet, you have to go up to your current pet, tell it to stop being your active pet, then go to the pet that you want active and tell it to become active.  Logically this makes sense... \nBut in pure gameplay terms it means that if you want to go somewhere to gather a lot of resources with a ladybug, you'll have to go there on foot. And if you don't want to risk it getting killed by the hostiles you'll be passing on the way back to base, you'll still have to leave the ladybug out in the open somewhere and hope it doesn't get killed by randomly wandering hostiles instead. Tamed pets have double the hp of their untamed counterparts, but for a ladybug that's still not a lot of health.\n\nIn closing, Smalland has a lot of potential. but most of that potential lies in what the developers [b]can[/b] do with the world they've built and it remains to be see whether they [b]will[/b] do those things or not.\n\nHowever... They're really showing promise. \n\nIf you don't think any of what I've pointed out sounds like a problem, I can recommend Smalland for you. \n\nIf you do think it's a problem, I can't recommend getting it for now, but I [i]can[/i] finally recommend keeping an eye on the game, because I'm confident that the developers are dedicated to improving these aspects as much as they can. (And the only reason I don't recommend getting it now, despite my confidence that the developers want to improve it is that early access always has an element of uncertainty and while I fervently hope that the developers don't run into issues that leave them unable to get the game to its ideal state, I can't guarantee that and I would be steering people wrong if I acted like I could).", "timestamp_created": 1685306216, "timestamp_updated": 1687895912, "voted_up": false, "votes_up": 361, "votes_funny": 18, "weighted_vote_score": "0.827040135860443115", "comment_count": 32, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1685446568, "developer_response": "Hey there's a lot here that's super valid, in the coming updates we'll be addressing most of this in a symbiotic way to give you more inventory, mobility,  and travel options with a creature overhaul on it's way too!"}, "135674393": {"recommendationid": "135674393", "author": {"steamid": "76561198805825177", "num_games_owned": 0, "num_reviews": 46, "playtime_forever": 1705, "playtime_last_two_weeks": 0, "playtime_at_review": 782, "last_played": 1708049890}, "language": "english", "review": "I received a copy of the game from the publisher/developer about a week before release. Personally I've grown tired of early access survival games as many of them launch with very little content and ultimately end up taking much longer than initially planned to be completed.\n\nThat said Smallands has far more content at launch than most early access survival games I've played over the past 5 or so years. Here's a quick list of pros and cons from my time playing the game:\n\nPros\n\n- More than adequete amount of content for an early access launch\n- The map is much bigger than I expected\n- Combat is pretty solid with the only issue being movement can feel a bit floaty\n- There's a wide variety of building choices and building matters because items and structures will degrade over time if not under a roof\n- Progression feels good in the early part of the game and requires you to explore further out and take on tougher enemies\n- The game launched with a roadmap for the first major update as well as future content\n\nCons\n\n- The map can be hard to navigate as it has very little detail and there are many places with environmental barriers that can't be passed (i.e. rock walls that are too steep)\n- Death is punishing because you leave everything not equipped on your gravestone and you'll likely die to fall damage frequently if you aren't careful and due to the floaty movement of jumping\n- Game is planned to be finished in 6-12 months but based on how long it took to get to this point (5+ years of development including switching developers) I believe this estimate is far too ambitious\n\nI'll end it with this. If you like survival games and don't mind early access this game is worth playing right now. There's more than enough to do to justify the price. If you want a complete game and don't want to wait and see if updates occur as planned put it on your wishlist and check in periodically to see how early access has progressed.\n\nIf you want to see my full review of each of the games systems here's a quick video covering them: https://youtu.be/twZ2e5AI2FM", "timestamp_created": 1680095502, "timestamp_updated": 1680095534, "voted_up": true, "votes_up": 219, "votes_funny": 10, "weighted_vote_score": "0.804913878440856934", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "142524494": {"recommendationid": "142524494", "author": {"steamid": "76561198047886213", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 3503, "playtime_last_two_weeks": 0, "playtime_at_review": 3486, "last_played": 1689973578}, "language": "english", "review": "Okay, sooo my entry into the world was a bit rough... Terrified of everything around me, I ran for my life to the first npc beyond the elder's big tree. Absolutely everything tried to kill me along the way. Ants, roaches, bees, grasshoppers, and of course my least favorite, the water... Oh boy, the water. It was a struggle, but I made it. After finally reaching the first npc I was rewarded with some well earned crafting recipes, and to my surprise, the first of many unlocked armor sets.  This was the exact moment I became addicted to Smalland. \n\nSmalland is a beautiful balance between killing, crafting, collecting and bossing. There are bugs to tame and many bio-oms to explore. Quests to complete and respect to be earned as you strive to find the Elder's stolen seal. If you're scared of spiders I must warn you that there is a whole area absolutely filled with a variety of them. Let's not mention the matriarch spider boss... yikes. \n\nMy favorite aspect of the crafting system is the tree encampment system. If you claim and build a base at one of the tree encampments, that base can be teleported to other tree encampment locations, allowing the user to have a moveable base. This allows for quick bug kills and resource collection when you're ready to grind for your armor sets and workbenches.\n\nIf your friends tag along their character progress transfers across all locally hosted servers. This also includes tree encampments! When your friend builds a base at a tree encampment it can be teleported to ANY server's tree encampment. Pretty nice to not have to start over every time you join some friends. \n\nOverall, Smalland is a really great game with active devs looking to release a solid product. If you enjoy survival games you'll enjoy this beautiful game.", "timestamp_created": 1689945415, "timestamp_updated": 1689945415, "voted_up": true, "votes_up": 58, "votes_funny": 0, "weighted_vote_score": "0.803415656089782715", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141607517": {"recommendationid": "141607517", "author": {"steamid": "76561198209341581", "num_games_owned": 0, "num_reviews": 88, "playtime_forever": 4653, "playtime_last_two_weeks": 0, "playtime_at_review": 547, "last_played": 1708417685}, "language": "english", "review": "Kill wasps. Behead wasps. Roundhouse kick a wasp into the concrete. Slam dunk a wasps baby into the trashcan. Crucify filthy wasps. Defecate in a wasps food. Launch wasps into the sun. Stir fry wasps in a wok. Toss wasps into active volcanoes. Urinate into a wasps gas tank. Judo throw wasps into a wood chipper. Twist wasps heads off. Report wasps to the IRS. Karate chop wasps in half. Curb stomp pregnant wasps. Trap wasps in quicksand. Crush wasps in the trash compactor. Liquefy wasps in a vat of acid. Eat wasps. Dissect wasps. Exterminate wasps in the bug spray chamber. Stomp wasp skulls with steel toed boots. Cremate wasps in the oven. Lobotomize wasps. Mandatory abortions for wasps. Grind wasp fetuses in the garbage disposal. Drown wasps in gasoline. Vaporize wasps with a ray gun. Kick old wasps down the stairs. Feed wasps to alligators. Slice  wasps with a katana.", "timestamp_created": 1688829441, "timestamp_updated": 1688829441, "voted_up": true, "votes_up": 263, "votes_funny": 290, "weighted_vote_score": "0.797014474868774414", "comment_count": 27, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140746016": {"recommendationid": "140746016", "author": {"steamid": "76561198973009068", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 3790, "playtime_last_two_weeks": 0, "playtime_at_review": 1165, "last_played": 1708235627}, "language": "english", "review": "is good game can run away from, bug can kill bug, can befriend bug, can progress civilization through multiple ages of technology, can ride bug.", "timestamp_created": 1687802452, "timestamp_updated": 1687802452, "voted_up": true, "votes_up": 140, "votes_funny": 52, "weighted_vote_score": "0.796377956867218018", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "138574206": {"recommendationid": "138574206", "author": {"steamid": "76561198078738824", "num_games_owned": 0, "num_reviews": 17, "playtime_forever": 3518, "playtime_last_two_weeks": 0, "playtime_at_review": 1679, "last_played": 1685163004}, "language": "english", "review": "grounded and valheim had a cottagecore baby and i'm out here living my best aesthetically pleasing fair folk life", "timestamp_created": 1684535052, "timestamp_updated": 1684535052, "voted_up": true, "votes_up": 84, "votes_funny": 17, "weighted_vote_score": "0.79323190450668335", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141066868": {"recommendationid": "141066868", "author": {"steamid": "76561198074183793", "num_games_owned": 173, "num_reviews": 10, "playtime_forever": 2479, "playtime_last_two_weeks": 0, "playtime_at_review": 102, "last_played": 1703054757}, "language": "english", "review": "Less then an hour and Im already lost, have died 15+times ,and have a full inventory of all wood. Would buy again.\n\n[table]\n    [tr]\n        [th]Pros[/th]\n        [th]Cons[/th]\n    [/tr]\n    [tr]\n        [td]Fun[/td]\n        [td]Aggravating[/td]\n    [/tr]\n    [tr]\n        [td]Pet ladybugs[/td]\n        [td]No Idea how to get them[/td]\n    [/tr]\n    [tr]\n        [td]Tall trees[/td]\n        [td]Fall Damage[/td]\n    [/tr]\n    [tr]\n        [td]Bugs? :D [/td]\n        [td]BUGS D: [/td]", "timestamp_created": 1688232234, "timestamp_updated": 1688232451, "voted_up": true, "votes_up": 81, "votes_funny": 79, "weighted_vote_score": "0.792307615280151367", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "136559540": {"recommendationid": "136559540", "author": {"steamid": "76561198047645258", "num_games_owned": 0, "num_reviews": 24, "playtime_forever": 2977, "playtime_last_two_weeks": 1090, "playtime_at_review": 2977, "last_played": 1713235003}, "language": "english", "review": "**Updated for 1.0**\n\nI played through all of the early access content at launch and wrote a review in the hopes that the devs would fix the problems with this game, since it had a decent start. Now that 1.0 is released, I started over and played through all of the content AGAIN plus the new stuff, so you don’t have to. Long story short, nothing was fixed. So here is the updated review tearing it to shreds.\n\nLet’s start off with the elephant in the room – Palworld sent this game to abyss. It is better in every way you could possibly imagine. If Palworld is Ratatouille, Smalland is Ratatoing…. look it up. This is pretty evident when 22% of the player base reached the end of the launch content, but only 2% have done anything released after.\n\nHere is everything you should be aware of:\n\nThe Map\nI don’t really know where to start with this. It’s almost impossible to get across (pun intended) how unbelievably not-fun this map is to navigate. It feels like the developers made every attempt possible to make it more and more annoying to traverse. Ridiculous fall damage, can’t swim, and can’t climb are just the tip of the iceberg here. The biomes and caves are also complete fails.\n\nStatic World\nWhen you first enter the game, the world may feel alive, but it isn’t. All creatures have permanent set spawns & set spaces to occupy. Meaning you will literally find the same number of the same creature in the same spot 100% of the time. It makes finding certain creatures perfectly reliable, but makes the world unbelievably boring after a few hours.\n\nLack of Story\nThis might be the laziest attempt at a story I’ve ever experienced. There isn’t anything to talk about since a story doesn’t exist. No lore or things left behind by other Smallfolk, or the Giants from the past beyond a few non-interactive map features. Nothing to explain the nature of the world, no side quests, no secrets (except 2 not-so-hidden weapons that no one cares about).\n\nInventory\nPossibly the worst inventory I’ve seen in a survival game. No weight mechanics. All of your gear and quick select stay in your main inventory which takes away tons of space and is unsightly. The quick select is 10 slots but the inventory is 8 slots across, so organizing it is out of the question. OCD nightmare.\n\nCombat\nBad and boring. The only way to really make progress is to grind better gear and brute force with healing items and death scum. \n\nBoss Fights\nEasily exploitable aggro range, predicable moves, and progress is kept upon death. Can easily just run in, attack, die, & respawn close by - which just trivializes all of the fights. A 1.0 release without some kind of boss arena is just par for the course with this game.\n\nProgression\nGoing through the “story” is just talking to NPCs and fighting the previously mentioned terrible boss fights – with a few horribly tedious fetch quests traversing the terrible terrain.\n\nBuilding\nWhy do games always insist on using a god-awful building hammer? There is a normal crafting button that builds the first 5 items (including said hammer) then it is never used again. Everything with this dumb hammer that solely exists to take up a quick select slot. Placing structures is easy enough, but there really isn’t any point to the higher building tiers beyond creativity. Since the world is so static, it is trivial to find a benign location to build a base (or a tree) so why anyone would waste their time with anything beyond fiber structures makes no sense to me. \n\nCrafting\nHave to craft different items from a bunch of different crafting tables, and can’t craft from chests. I’ll state the obvious – it’s annoying.\n\nLack of Battle Mechanics\nYes, there is poison. But where is Bleed? Burn? Wound? Slow? We'll take anything else that isn't poison.  \n\nSurvival/Healing Options\nThe game has a quirk where if your “Food” bar drops below 70 then you no longer regenerate health. So, there is an incentive to always keep your food above 70. Basic food fills your food bar by 30. The “better” food fills more, but you never need more. So, the basic mushrooms are the only food you need to worry about the entire game, anything else is a waste of time.\nThe fiber bandages are fine for basically the whole game, then enemies start dropping better stuff for you.\n\nTree Bases\nNever saw the point. Being able to move your base around is cool, but it is so inconvenient traveling up and down the tree constantly. Plus the endgame areas don’t have trees, so it’s really useless. \n\nArmor\nRaise your hand if you’re tired of spending time creating the look of your character just for the mandatory generic armor sets to hide your efforts. I can say they did at least fix the part where we had to have the NPCs craft armor for us, but the gear is still generic and grindy.\n\nWeapons/Tools\nThe tool progression is really unbalanced in the beginning. Wood is too hard to come by before the flint hatchet. It’s also difficult and unintuitive to find the stone/flint/iron/clay you’ll need to make any progress in this game. Early tools should be more useful.\nWeapons are strange as well. There are a ton of weapons that do \"Edged\" and “Blunt” damage, but the game just seems to forget about “Pierce” damage somewhere along the way.  No Shields? Bows are all similar and have ridiculous grind for basically no improvement. What is the point of Fire Arrows that don't light anything on fire? The catapult is such a waste of time. Are we serious with how bad the Grapple Hook is? Most of the useful stuff you get is all the way at the end of the game, so you can’t even enjoy it.\n\nCharacter Customization:\nIt’s nice that this was added, but after playing through all of the content, it doesn’t feel like it does anything. The improvements are so minor, they barely affect the game-play at all. An afterthought feature implemented horribly.\n\nLack of Fast Travel\nYour only means of fast travel is to quit and reload since you always spawn at your set spawn point when you start the game and not at your previous location. This unintended cheese is the only way you’re getting around quickly in this game.\n\nTaming:\nAbsolutely pointless. The time it takes  to tame anything is nowhere near worth it. I seriously lol’d when I saw how ridiculous the requirements are for the bird. The devs really go out of their way to make it not fun.\n\nCreatures\nLots of repetitive creatures. There are literally 4-5 different hornets that are just rendered different colors and the beetles all have the same attacks. Feels so lacking after a few hours.\n\nTLDR: This game is maybe a 4/10 if taken in isolation. Its problems are noticeable, but it has its charms. When compared to other survival games, this stands as a complete failure.  If you are used to playing games with any polish or QoL features, this is basically unbearable. Palworld is a better game in every possible way and is also $5 cheaper. Get that! Avoid this at all costs.", "timestamp_created": 1681278136, "timestamp_updated": 1713244854, "voted_up": false, "votes_up": 499, "votes_funny": 22, "weighted_vote_score": "0.789503037929534912", "comment_count": 32, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "135716989": {"recommendationid": "135716989", "author": {"steamid": "76561197995391340", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 783, "playtime_last_two_weeks": 0, "playtime_at_review": 495, "last_played": 1680212608}, "language": "english", "review": "April Edit: As far as I can see it looks like the Developers are actually trying to improve based on Feedback, So i'll keep checking back on Updates and i'll likely return in the future when enough problems have been fixed.\n\nDeveloper - Just want to say Thanks for listening to your community and working on things we have issues with.\n\n----------------------------------------------\nMarch Original Post ----------------------------\nGame as is, I wouldn't recommend.\nI feel like most of the good reviews for the game are hoping for something better in the future, or were paid to leave a good review.\nThat being said....\n\n\nTLDR: Just feels like they didn't even test their core aspects in the game.\n\nPros:\n1) Really beautiful game\n2) Building currently.. is on par with most survival building games\n\nCons:\n1) **Worst Gripe about the game** Durability is a laughable joke, like what even.. who tested the durability of things and said, \"yep a-okay\". Why would you ever upgrade from a wooden sword, unless you plan to carry around the Material for a work bench to repair your weapon after literally EVERY fight.. \n\n2) Combat is clunky, You swing at an enemy next to you and miss, yet the enemy attacks from 50ft away and hits you. If you plan to block, you have to stop everything your doing and wait a good 2 seconds and time it perfectly, because the animation isn't accurate.\n\n3) Players are expected to travel wayyyy far south, past pretty tough enemies, to find Flint and Bark on the Beaches.. however, most enemies don't ever give up the chase, unless you find some where to cheese them. Once on the beach you can only mine Flint at first because Bark requires Flint tools, and good luck finding Seeds to make Seed oil, and refine wood.\n\n4) If you're playing alone, in your own world.. you cant pause.!?!? Why.. \n\nWhat would help the game currently?\n\n1) Pausing in single player worlds\n2) Durability fixes for all tools and weapons\n3) A better map, with clearer paths wouldn't hurt..\n\nHere's to hoping the game gets better with future patches & updates.", "timestamp_created": 1680145594, "timestamp_updated": 1681239333, "voted_up": false, "votes_up": 658, "votes_funny": 42, "weighted_vote_score": "0.783212602138519287", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1680274778, "developer_response": "Hello! Our team has taken this review to heart and we will be working to correct all the problems you're having, we're very sorry!"}, "135722746": {"recommendationid": "135722746", "author": {"steamid": "76561198150827620", "num_games_owned": 507, "num_reviews": 6, "playtime_forever": 520, "playtime_last_two_weeks": 0, "playtime_at_review": 362, "last_played": 1680397654}, "language": "english", "review": "For people having trouble with combat, use the \"V\" key to turn on antenna vision while looking at an enemy to see what weapon type they're weak against (edge, pierce, or blunt) then use the corresponding weapon type against them (sword, spear, or hammer). For healing, you can craft bandages at a workbench using just fiber and you also constantly regenerate health if your nourishment is above 70. A single ant head can be cooked in a campfire to make a meal that recovers 30 nourishment and gives you a buff that prevents nourishment loss for 3 minutes. Ant heads can be farmed at the lower level of the mine near the starting point.", "timestamp_created": 1680156514, "timestamp_updated": 1680156514, "voted_up": true, "votes_up": 47, "votes_funny": 0, "weighted_vote_score": "0.782591462135314941", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "135838879": {"recommendationid": "135838879", "author": {"steamid": "76561198043113526", "num_games_owned": 119, "num_reviews": 8, "playtime_forever": 878, "playtime_last_two_weeks": 0, "playtime_at_review": 716, "last_played": 1701674895}, "language": "english", "review": "Edit: Let me clarify something: It is negative because the things I did find negative are pretty game breaking - at least for me. You might not mind, but I do. If those things are changed I will change my review. Until then: It is negative because I do not think it is worth playing in current state. While bugs aren't the issue, it is missing a lot of things other early access games had at launch. Doesn't mean I think its horrible or bad or not worth it at all - it means in its current state, things are janky and rickety and some things are not currently worth it or missing and can make or break the game. Chill out. \n\nI'm almost on an \"Eh\" for this. That being said. Would I recommend it? Somewhat - but with caution.\n\nThe game is fun, it's beautiful. The bugs are realistic, the character models are pretty good and all around it's a fun game. \nSort of finished it, playing co-op the entire time with my husband. Here's my personal opinion/things I noticed.\n\nThe positive:\n\n-The buildings look good, it doesn't take much to build a relatively large base. The materials are easy to get and it didn't take too long for me to build it up.\n-Along with building: movable tree bases. Claim a tree, build a base, find another tree on the other side of the map? Base moves to that tree. It works well and is nearly seamless! Downside - the trees have a rideable blimp and if you're trying to get back to help a coop buddy, could be like a 5 min run just to get down from the tree\n-Seasons! So few of these games have seasons! Seeing everything covered in snow and worrying about weather was really cool! The map is beautiful!\n-Combat: The bugs are somewhat hard, but it wasn't terrible. It does tune to your  players so they get harder if you have a coop. So be careful venturing alone as suddenly you're fighting an enemny with nearly double the health alone\n-Armor: really cool looking, the weapons look nice, there is a nice variety with the animations being really good!\n-The pets are really, they have a use and there is mounts. More of that below\n\nThe not so good (though some of these could potentially be easily tweaked/fixed down the line\n-Water. It's mentioned. You can't swim. While this isn't necessarily game breaking, you die instantly if you fall in. That means if you fall in on accident by sliding off a rock you're dead. That's it. You have to find your body somewhere at the edge of that same rock. It's irritating considering the movement is somewhat floaty\n-Coop - while it works well, you dont' share progress. Example: Me and my husband killed a boss, only he got the loot, only he got credit. It wasn't an easy fight and we'd have to do it again for me to get the same credit. There is no way to group, no way to ally or anything. You are two players on the same map.\n-mounts/pets: There is mounts and pets you can get though they are relatively useless. You can tame a lady bug but it doesn't ave any more health than the wild ones do, in other words you can one shot it on accident or something else can. My first two tames were tossed into the water by a passing grasshopper that wasn't even attacking it directly. You can't control each other's tames or mount together on bugs that are pretty clearly big enough for you both, but minor gripe. Just means I can't rescue my husband's pet if he does since I can't move it.\n-Armor - isn't craftable. You have to find the npc, see what they need, leave, go across the map f**ing off 50000 miles to get the ingredients you need, come back to buy your armor. With some of them being cold/hot based some might be useless when it's winter since you're going to be freezing - though not a huge deal\n-gathering materials: the first big upgrade you need is way too hard to get being between a bunch of higher level/powerful bugs and it was a lot of dying trying to just get the first upgrade to be able to fight those bugs\n-bugs have weaknesses to weapon types (slashing, piercing, etc) not a huge deal, but it requires you to carry like 4-5 different types of weapons at all time. It gets annoying. Inventory space is somewhat limited so the first row of your inventory + food, healing items, any tools you need plus some extra building just in case items - 1/3 of your inventory is just necessities leaving you not much space for looting. Please, please please devs stop doing this! Let me have my 'tools' hotbar, at least one not count as inventory space and have it be just hotbar! Omg it'd solve so many annoying issues. It's like valheim where your equipped stuff stays in your inventory.\n\nOne final request/gripe I have that's more personal choice. I want the option to customize my server. Let me make drop rate higher, bugs easier, I don't want to drop stuff on death, days longer, seasons shorts, etc. Every other survival game allows this. Let me play my lan game how we want. If I want it super cheesy or if I want to suffer, let me choose.\n\nThat being said, I was in the original Alpha and bought this on release, and I'm still sticking by to hopefully see some changes. It's got amazing promise! Please please don't let us down!", "timestamp_created": 1680307079, "timestamp_updated": 1680390781, "voted_up": false, "votes_up": 198, "votes_funny": 6, "weighted_vote_score": "0.778436601161956787", "comment_count": 16, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "135987247": {"recommendationid": "135987247", "author": {"steamid": "76561197982668432", "num_games_owned": 1207, "num_reviews": 96, "playtime_forever": 722, "playtime_last_two_weeks": 0, "playtime_at_review": 53, "last_played": 1689399128}, "language": "english", "review": "Any new survival game I can play with my 77 year old grandmother is one I can endorse.", "timestamp_created": 1680469339, "timestamp_updated": 1680469339, "voted_up": true, "votes_up": 84, "votes_funny": 11, "weighted_vote_score": "0.772471785545349121", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141343985": {"recommendationid": "141343985", "author": {"steamid": "76561198060035913", "num_games_owned": 0, "num_reviews": 58, "playtime_forever": 4039, "playtime_last_two_weeks": 0, "playtime_at_review": 2697, "last_played": 1709265568}, "language": "english", "review": "I haven't showered in 3 days.", "timestamp_created": 1688529882, "timestamp_updated": 1688529882, "voted_up": true, "votes_up": 86, "votes_funny": 90, "weighted_vote_score": "0.755674302577972412", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157043430": {"recommendationid": "157043430", "author": {"steamid": "76561198023704624", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 15913, "playtime_last_two_weeks": 183, "playtime_at_review": 4764, "last_played": 1713799769}, "language": "english", "review": "I am Autistic.  I say this because my perception of the world and therefore the game may differ those who are not.\n\nThe Game settings I use are = Peaceful Creatures and No Inventory Drop on Death.\nI did not play open on-line, I played SSF (Solo Self Found) and Private Multiplayer with a few friends.\n\nBugs = I didn't find any game bugs in my play time.  YAY!\n\nIssues = \nIf you die in a river you lose your inventory (unless you opt out of this setting), it drops on the spot you die in the river, making impossible to retrieve.\nIf you jump and land on your pet, your stuck. the game has an \"unstuck\" feature but this results in your death and re-spawn at your re-spawn point which could be half the map away.\nIf you opt out of Storm Damage to buildings, some of your building still get damaged, mainly doors and crafting stations left outside.\nIf your sensitive to flashing screens, be aware this game has flashing images that cannot be turned off\nif your to camera shakes, be aware this game hast those that cannot be turned off\nIf you have any eyesight condition that changes how colours are perceived, you may find parts of this game unplayable without an aid or another person helping you.\nThe game has underground, ground level and fly mechanics, it can be very difficult to track down certain quest targets.\nin multi-player map markers are NOT shared\n\nAll the Good = \nany and all the controls can be re-mapped, I played with mouse and keyboard.\nresource gathering is easy and you can lose hours just gathering materials and building without progressing the quest-line. (about 6 hours for me :P )\nsolo player - is really good, you can mark your map for resource areas, where you built your houses / stash space\nprivate multi-player = see above issues, otherwise really good, creature get harder but not too much and resource gathering is increased dramatically.\ntrading is done by either dropping things on the floor for other players to pick up or\nyou can place the items in a stash chest and they can get them out of there.\n\nFinally, I did get frustrated along the way and had to use the Internet to find my way through the quest twice, not sure if that was / is due to my Autism or the game not providing enough information.", "timestamp_created": 1706450453, "timestamp_updated": 1708286920, "voted_up": true, "votes_up": 250, "votes_funny": 35, "weighted_vote_score": "0.743324697017669678", "comment_count": 34, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "135697125": {"recommendationid": "135697125", "author": {"steamid": "76561199029162475", "num_games_owned": 115, "num_reviews": 24, "playtime_forever": 1222, "playtime_last_two_weeks": 0, "playtime_at_review": 965, "last_played": 1708567565}, "language": "english", "review": "It's a great early access game. There's a peaceful and regular mode but hopefully more options will be added in the future. But for now if bugs feel overwhelming you can go peaceful at any time. Then they will only fight back if you attack them first.\n\nYou get a gravestone that holds you stuff when you die and you get to keep the item you're holding to do your death run back. This is less punishing than many survival games where you have nothing after death or where your stuff can fall all over and despawn. You can have many graves if you keep dying with stuff.\n\nExploration is rewarding and the environment very pretty. You can follow the quests by npcs or venture off into the unknown into the harder areas before you're ready. The game wont stop you but it's not the best action. You get better gear from npc quests. I love the different bioms so far.\n\nI love that it has seasons and weather. You get enough warning for a bad storm to erect a shelter to wait it out or return home if you're close. There are different armors to deal with the cold and hopefully they'll be some heat mechanic later as well to deal with maybe in certain areas if not in summer specifically. Fires warm you just fine it just takes a bit of time. There are also warming foods you can take with you to keep exploring. Don't start a boss fight if the weather isn't great since bad storm might happen.\n\nThere's a decent amount of choices in character creation. Maybe they'll add more. It doesn't matter that much since you will be covered by armor most of the time.\n\nMy only real gripe is there being no pause in single player. This is an issue since every time you log out you then spawn back at your base and would then need to cross the map again to where ever you were. This is a very real issue for some of us who are prone to interruptions. I really hope single player pause gets added.\n\nThere's lots of different building sets, tools and armors. It's free to repair things as long as the durability is still green. The lower it goes the more it'll cost. The materials to make a bench to repair are cheap and easy so you can repair in the field but most of the time you'll be fine if you repair each night.\n\nIt's beautiful and part of that is because not all foliage has collision. This is fine. Mammals are denser than insects even small ones. That leaf you wish you could stand on likely wouldn't hold you any way. I think this is far better than the plastic blades of grass in Grounded. I like a game that looks nice. And since I've seen some confused, the small \"grass\" all around is moss. It's even got those little spore things coming out of it.\n\nI feel plenty small in this. You fell like something naturally small which you are. You are a natural creature out in nature not someone who was shrunk down surrounded by human things. I think it's done well and the scaling is very consistent.\n\nThe story is very basic. The npcs just help you progress and provide minimal lore. It's more focused on the survival aspects which is fine by me but they do plan more npcs so maybe more will get added. If you want a new sort of survival game this is a good one.\n\nNo there's no swimming but there's literally no reason to have it. There's no under water labs or anything of use. You'd just use it to cross the \"rivers\" which would lessen the game since you'd not need to parkour across or find that log bridge. Maybe they'll add a late game water skimming mount in the future but I don't see a need for early game swimming and it would actually lessen the experience.\n\nIt's good to have some difficulties traversing the map on foot. It makes a tame to help you travel more valuable and the environment more challenging in a realistic  manor. You have to parkour up to claim the first tree base. This game is meant for the environment to be challenging.\n\nTames need work but that's on the road map. They need more health or armor or something but it's still fun to do. You just need to be careful with them. Use them for travel and keep them safe instead of for fighting. At least for now. You can only have 1 right now but they will add stables soon and then you can keep more. Right not the tame is tied to the character so spawns with the character into a world. So multiple would get awkward. The stable will allow tames to spawn with the base instead.\n\nOver all a good survival experience that needs some polish which it will get. The developers have been great in working with the community to get the game they want.\n\n", "timestamp_created": 1680118325, "timestamp_updated": 1680118325, "voted_up": true, "votes_up": 28, "votes_funny": 1, "weighted_vote_score": "0.742051839828491211", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "149046681": {"recommendationid": "149046681", "author": {"steamid": "76561198031409603", "num_games_owned": 0, "num_reviews": 42, "playtime_forever": 1779, "playtime_last_two_weeks": 0, "playtime_at_review": 942, "last_played": 1699027055}, "language": "english", "review": "I really enjoy this game and the graphics are lovely.  Where Grounded is fun because of the \"Honey, I Shrunk The Kids\" aspect for those of us from an older generation, Smalland is a whole world.  You're born into a world where you're tiny and everything makes sense.  Your people understand the world the way it is and have worked around it for generations.  It's really just a lovely game and I have a lot of fun with it.", "timestamp_created": 1698496929, "timestamp_updated": 1698496929, "voted_up": true, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.740500152111053467", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "136020505": {"recommendationid": "136020505", "author": {"steamid": "76561198287421011", "num_games_owned": 48, "num_reviews": 2, "playtime_forever": 5122, "playtime_last_two_weeks": 0, "playtime_at_review": 3413, "last_played": 1708318718}, "language": "english", "review": "Highly Recommend this game even though its early access, for the price and content in this game has been one of the best games to come out this year. For anyone who's into co-op games with friends and survival this one is for you. There have been no real glitches to the game and servers haven't dropped once since playing. Can't wait for the full release game to come out, I'm not going to spoil anything here as you have to play it to find out what's to come. 52 hours of non-stop action and fights. Big shout out to the developers of the game for making a friendly adventure survival game for all ages.", "timestamp_created": 1680524773, "timestamp_updated": 1680524773, "voted_up": true, "votes_up": 34, "votes_funny": 2, "weighted_vote_score": "0.738521039485931396", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "154986364": {"recommendationid": "154986364", "author": {"steamid": "76561198176029733", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 3200, "playtime_last_two_weeks": 0, "playtime_at_review": 3065, "last_played": 1704741203}, "language": "english", "review": "This game is very close to GOOD\n\nbelow are a few observations that with good community feedback will most likely either get better or be removed.\n\nIt does well:\nEnvironment - the look and feel of roaming the map is one of the strongest points of the game.\nCreatures and NPC's - the enemies and other characters in the game look great and are fun to fight \nMultiplayer - with 3/4 players this game runs smooth and is very good fun\n\nNeeds Improvement:\nAmber Valley - I know this is the final zone so is still under construction but the mob density is quite low and the area does not have much interesting stuff, makes farming materials in the area very dull.\n\nStat System - the stats system is a basic strength, dexterity, constitution, endurance and intelligence setup INT and DEX are currently not worth spending any points in at all they might change the game play but nit in any significant way where it matters, strength, health and stamina are so important the other stats might as well be removed.\n\nBoss Combat - general combat is quite simple and leads it self to farming materials (complex mob combat is a headache if all you one is item to drop) but the bosses are far to easy to kill, most bosses and large enemies have 2 attacks which the spam in a fixed order and most of these attacks do little damage. some thought and time into making boss fights far more impact-full would improve this game ten fold.  \n\nSound - this was a difficult one to criticise since the ambient music is great and insects do sound pretty cool, but the fight music and the creature sounds keep playing after combat has finished and this can be pretty annoying, also the game uses audio queues to indicate when to block and some times this goes out of sync, making you miss a block or 2.\n\nDoes Badly:\nCompendium - the compendium is a useless text dumps that does not contain any of the information the quest giver reveals during the game.\n\nItem Repairing - if you play with friends and one is specialising into INT then you most likely will not be able to use anything they make once the pass 20 points in INT, this is a weird design decision and the antitheses of what a co-op game is. this should be removed asap.\n\nController Support - only partial controller support, cannot really remap much and it completely skips any real way to use your hot bar (this makes taking pots or switching weapons during combat very difficult)\n\nOverall I really enjoy playing this game and am looking forward to many more hours of game play when it leaves early access.\n\nhighly recommend buying.", "timestamp_created": 1704125807, "timestamp_updated": 1704125807, "voted_up": true, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.738004505634307861", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "149622324": {"recommendationid": "149622324", "author": {"steamid": "76561197974243998", "num_games_owned": 0, "num_reviews": 136, "playtime_forever": 5185, "playtime_last_two_weeks": 0, "playtime_at_review": 2510, "last_played": 1710208355}, "language": "english", "review": "This game is very fun already, despite being in early release. I didn't try the PVP, but the PVE aspect with a friend is loads of fun. It reminds me of a video game version of \"Honey, I Shrunk the Kids,\" but without any humans. You enter the game already the size of an ant.\n\nThe map is huge and very well designed. You can gather and build like in all good survival games. In this one one you can also unlock schematics and recipes, and even the ability to tame wild creatures (lady bugs, grasshoppers, lizards, dragonflies, hornets, etc). Once tamed, they can help you fight and serve as a mount. The flying insects allow you to fly, which helps for quicker travel across the large map. \n\nI have about 40 hours and I've nearly finished the main storyline. I just unlocked the forbidden monument to the far North. I'm level 65, but even at high levels you still have to be careful not to take on too much at once. You craft your armors and weapons and tools, so almost none of the practical items in the game are acquired without crafting. The progression here is nice, but all monsters will respawn quickly, which detracts slightly from the immersion. There are also weather events, daytime/nighttime hours with different monsters for night versus day, and even seasons (summer/winter). \n\nRust is still my favorite survival game, but this is already my second favorite. It'll be interesting to see what new content Smalland comes out with prior to its release! In its current state, I'd already give it an 8 out of 10.", "timestamp_created": 1699229640, "timestamp_updated": 1699307770, "voted_up": true, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.726790189743041992", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "145681450": {"recommendationid": "145681450", "author": {"steamid": "76561198058121612", "num_games_owned": 0, "num_reviews": 46, "playtime_forever": 1739, "playtime_last_two_weeks": 0, "playtime_at_review": 1739, "last_played": 1693843436}, "language": "english", "review": "It is very similar to Grounded, but made by a small studio, so, simply put, Grounded is better. That been said, this game is very nice and enjoyable. If you liked Grounded, I strongly recommend playing this one, it is similar to Grounded, but is different enough for you to love it. The solutions for traveling are better than Grounded's, being able to move your base around is awesome and it is pretty much as good as Grounded in many other aspects (like combat, how interesting the story is, base building and overall progress). I think that, although Grounded is better overall, this game is shaping to be very close when it is done, which is amazing, considering it is indie.", "timestamp_created": 1693869712, "timestamp_updated": 1693869712, "voted_up": true, "votes_up": 60, "votes_funny": 13, "weighted_vote_score": "0.717136561870574951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "137619469": {"recommendationid": "137619469", "author": {"steamid": "76561198053123611", "num_games_owned": 0, "num_reviews": 41, "playtime_forever": 3396, "playtime_last_two_weeks": 0, "playtime_at_review": 2004, "last_played": 1697205856}, "language": "english", "review": "Anyone who is old enough to remember an old commodore 64 game called Beneath the Root will love this game. For those of you who weren't born when that was around this game is about killing insects as well as taming them for transportation. It is about climbing giant trees and building fabulous tree houses. It is about crafting armor so you can take on tougher insects. It is about surviving when you are just insect size. Oh, and the graphics are great.", "timestamp_created": 1682950985, "timestamp_updated": 1682950985, "voted_up": true, "votes_up": 19, "votes_funny": 2, "weighted_vote_score": "0.700184941291809082", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "135816493": {"recommendationid": "135816493", "author": {"steamid": "76561198024306628", "num_games_owned": 498, "num_reviews": 11, "playtime_forever": 817, "playtime_last_two_weeks": 0, "playtime_at_review": 416, "last_played": 1703287724}, "language": "english", "review": "Finally a game that shows my real life struggles.. \n\nIf Grounded and Valheim had a baby", "timestamp_created": 1680285185, "timestamp_updated": 1680285185, "voted_up": true, "votes_up": 25, "votes_funny": 4, "weighted_vote_score": "0.696793854236602783", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "135923124": {"recommendationid": "135923124", "author": {"steamid": "76561198972668173", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 903, "playtime_last_two_weeks": 0, "playtime_at_review": 362, "last_played": 1696782077}, "language": "english", "review": "As a Survival Genre Fan this game is awesome. The building, crafting and finding new material to unlock new recipes is just like Valheim and I love it. The big trees act like a base outpost and essentially bring your base to you ( with the exception of mounts, they stay where you leave them).  \n\nThe BIGGEST CON is the combat system. It is so bad that I will dodge TWICE as the enemy is attacking to the right and the enemy just clips through objects and makes a complete 90 turn to hit me. They have auto-aim and it is not fun at all. If I dodge it is to avoid an attack, pretty simple. BUT in this game it doesn't matter. Just note I am using the vulnerable weapon and best armor I can acquire to this point in the game. I like a challenge but this is a really bad combat system. I know it is in Early Access so I hope they improve the combat system and auto-aim enemies.", "timestamp_created": 1680399986, "timestamp_updated": 1680569136, "voted_up": false, "votes_up": 120, "votes_funny": 11, "weighted_vote_score": "0.696493625640869141", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "136563263": {"recommendationid": "136563263", "author": {"steamid": "76561198078965920", "num_games_owned": 0, "num_reviews": 34, "playtime_forever": 3728, "playtime_last_two_weeks": 0, "playtime_at_review": 2491, "last_played": 1683991774}, "language": "english", "review": "[h1]Smalland has potential, but doesn't fully use it yet.[/h1]\n\nI've finished the game after almost 40hrs and had fun overall. Yes, it has Early Access problems, but 20 bugs (in sale) are okay.\n\n[u]Graphics[/u]\nHands down, this game looks awesome! The world is beautiful, the armor sets look cool and the base building parts match the theme very well and harmonize with each other. I really like the art style overall, but the character model is just 'okay'. \nYou don't see your character ingame (not even the antenna) because of the full body armor without the option to hide the helmet. \nThe environment is full of life, we even have storms and seasons, which I really like. And no, they do not 'come out of nowhere'.\n\n[u]'Story' and Quests[/u]\nThe first big downside is the 'story'. A survival game doesn't neccessarily need a story, but if you decide to put some in it, then please develop it. We have no clear beginning, no common thread, nothing. All we get is \"my key got stolen. In this chest we have the elixier we need for our queen. Go find my key.\" [spoiler]I still can't figure out how that big bug could steal a key without anyone noticing it.[/spoiler] The NPCs that helps us to find the thief have no story at all. All we get here is \"I have problems with this boss monster. Go kill it for me, thanks\" Again, you do not need a story in survival games, but the devs decided to add one and failed hardly. For me, it could have been enough to have some background story of the smallfolk or why the world doesn't have any giants anymore. [spoiler]For example, why is there a big sceleton in the swamps? Lisandra could have some background knowledge about it, but well...[/spoiler] \nThe quest rewards after killing the bosses are questionable. Okay, I get a receipt how to craft a kibble to tame an animal, but why tf do I still need to go the NPC to craft the reward armor? Just give the receipt, I'll do it by myself as well. \n\n[u]Survival[/u]\nThe survival aspects are overall fine to me. If your character is hungry, you'll loose health over time and stamina instantly. As long as you're above 70% hunger level, you regenerate health (but way too slow). In winter you need cold resistance armor or warm food to keep yourself warm, otherwise you'll loose health overtime without the possibility to heal it, same during storms. \nThere is no buff food or other any other method to miprove your character's skills like cold resistance, improved health regeneration or less stamina drain. \n\n[u]Controls[/u]\nMovement feels smooth, especially flying is really well made. Movement during combat is clunky asf. Enemies are way too fast, faster than the sprinting player, which means you cannot flee without taking damage. \nEverything drains stamina, jumping, sprinting, dodging, attacking, gathering. Which itself is okay imo, but the amount of stamina is too high imo. \n\n[u]Combat[/u]\nAs mentioned before, combat is clunky. If you decide to simply walk away while the enemy is charging an attack, you'll get anyway, eventho you walked 10meters away. The enemy will glitch to hit you regardless, therefore you have to spent stamina to block/dodge. \nThe player is way slower than the enemy, which means to charge an attack results in taking damage or not hitting at all, which feels not rewarding. I don't want to fight taktical the whole time, I don't wanna play Dark Souls. \nBecause of that, combat get annoying over time. This and the aggro radius. Enemies will chase you way too long and way too fast. \nThe system of different weapon types is fine to me, although I don't like to play with a hammer. To have a shield for the second hand would be awesome or the possibility to hold two different one-handed-weapons.\n\n[u]Multiplayer[/u]\nAnother big downside is the multiplayer, because it doesn't feel like playing together at all. I guess they will work on this, at least it's on their roadmap. \nI'd appreciate more multiplayer options like more loot (or everyone has their own loot), groups/tribes to play PvP and quest sharing. It's really annoying to beat every boss for many times, because it only drops the reward for one person. \nAdditionally, if the owner of the tree base logs out, the whole base is gone which makes is hard for shared bases. But I generally like the idea of having the base connected to the character, so I can transfer my base (including chests, crafting benches) to other player safes.\n\n[u]Base building[/u]\nAs mentioned before, you can transfer your tree base to other safes, which I like. Besides that, base building is good at the current state. We have 3 tiers that harmonize with each other very well. The amount of different parts is good for early access but has potentional for more decoration parts like carpets and lamps. \nThe grind for the stone parts is heavy, but okay. \n\n[u]Questionable decisions[/u]\n1. As a keyboard player I'm lowkey mad that I only have 8 tool slots. I don't know any other game where I have less than 10? In the beginning and midgame you need at least 3 different weapons and 3 different tools. Only 2 left. If you decide to go for ranged weapon, only one left. At least give me an option to create sets so I can easily swap between a fighting set and building/gathering set. \n2. The inventory and stack sizes are way too small. Only 30 or 20 per stack? We had 50 in pre-alpha, what happened? \n3. What exactly is the point of the tannery? You can craft only one piece. \n4. Durability. Everything above 75%(?) can be repaired for free, but we never really know when we hit the minimum durability before we need materials. Additionally, it's ridiculous how often how have to repair your tools. Chop 5 trees, then repair, repeat. Really annoying.\n\n[u]False advertising[/u]\n1. Taming: taming is useless. Your pets are way too weak, they can be easily beaten by the night ants or grey flies. Also ,you can only tame ONE animal at the same time. In the trailers, the taming system looked way better, but it's just bad. \n2. Armor: In the trailers they showed, specific armor prevents you from getting aggro. Just wear the black hornet set and hornets will let you in peace, but that's clearly false. Everything will attack you, doesn't matter what you wear. \n(3. owl: Where is the owl?)\n\n[u]Bugs[/u]\n1. The most game breaking bugs I faced were dead spaces. Sometimes you end up stuck anywhere without any way out. Yes, you can 'unstuck' yourself but you just die at this location. Just set the character 30s back (or to last safe point). If you decide to jump off a cliff after getting stuck there, your tombstone will be at the point where you jumped, not where you died. Good luck getting your stuff back without getting stuck again.\n2. Translations are off for German. 'Unstuck' doesn't mean 'gelockert', it means 'befreien'. 'Webstuhl &amp; Spindel' and 'Sprache &amp; Bedienungshilfen' have some questionable additions.  \n\n[u]TL:DR[/u]\nAs an early access title, Smalland delivers. You have enoughto do for ~30hrs, a beautiful world to explore and base building is fun. Even for early access we don't have many game breaking bugs and the tree base system is refreshing imo. Downsides for me are the unfair combat (enemies are way faster than you), bad story and undeveloped multiplayer. Some game decisions are also questionable (you cannot craft armor by yourself, you need to go to the NPCs) or unbalanced (repair system). 20€ (in sale) is totally fine for the currewnt game state imo. \n\n7/10", "timestamp_created": 1681287423, "timestamp_updated": 1681288547, "voted_up": true, "votes_up": 25, "votes_funny": 0, "weighted_vote_score": "0.696403205394744873", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "135691301": {"recommendationid": "135691301", "author": {"steamid": "76561198143587384", "num_games_owned": 139, "num_reviews": 44, "playtime_forever": 186, "playtime_last_two_weeks": 0, "playtime_at_review": 186, "last_played": 1680108962}, "language": "english", "review": "Been waiting for the game since it was announced so this feels bad to write but it is what it is.\nThe good: Visually it looks great | There are decent amount of creatures | Building is simple and quick\nThe bad: Combat is ridiculous - there's no ''perfect block'' and the pattern for basically every creature is light attack (x1) and roll. Rinse and repeat. | Jumping is weird and feels ''stiff''. It's easy to ''slide'' of an obstacle when jumping. | Most of the foliage is just visual. You can be up high jumping from a branch to a closest leaf just to jump through it and fall to your death. | No swimming. Not having diving is understandable but not being able to tread water makes no sense. | Basic resource gathering is dumb. You'll be spending most of your time running around spamming ''F'' on clovers and wood piles regardless of how strong or advanced you are. | Can't save or pause whenever you want. I suppose your local game runs like a server anyway. You should be able to (at least)pause and save a local game at any time. | It's not optimised that good. The stuttering happens a lot regardless of video settings.| Repetitive design e.g. the trees that are specifically designed to be used for building base (from the 4 that I visited) were exactly the same. \n///Let's say you ignore all that. The worst thing in my opinion is not having leveling/skill system. If you die at a boss all your stuff drops there. Wouldn't be a big deal but the only thing that makes your character strong is gear. So if you lose all your gear after 20 hours you're instantly as weak as you were when you started. \n\nObviously everyone loves the idea of the game but in my opinion it's not worth it without core mechanic rework. The road map shows so many upcoming things that are cool but are they worth it if the core's clunky?", "timestamp_created": 1680112320, "timestamp_updated": 1680298056, "voted_up": false, "votes_up": 167, "votes_funny": 12, "weighted_vote_score": "0.696012616157531738", "comment_count": 21, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "136944543": {"recommendationid": "136944543", "author": {"steamid": "76561198154010381", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 506, "playtime_last_two_weeks": 0, "playtime_at_review": 370, "last_played": 1702626677}, "language": "english", "review": "There are games you play, and you try to force yourself to play. There are games you play, and you try to force yourself to stop.\n\nSmalland is the latter.\n\nI rarely grab a game in alpha stage, but something about this one caught my attention. I managed to get it at a sale price and am enjoying my savings so far. The world is well thought out and the environment is intuitive. Building is a bit of a pain, but I've played with worse. The mechanics remind me a lot of Valheim, which I couldn't get into. Maybe it's the push of the world that keeps me going in this one. It feels like there is always something specific making you hunt down that beetle over and over again, or making you look for nector, etc... There is a need to move on and keep looking while going at your own pace.\n\nThere are plenty of challenges, big and small, and plenty of views that keep your curiosity going. Some things like collecting and eating seem imbalanced at first, but after a while, you get the hang of it. Night time pushes you to seek shelter or get lost; storms have the same affect. It's a bit of a pain, but it teaches you to get creative. I use the night to reap my rewards before getting ready for the next day, and turn it into a new adventure. \n\nI hope this isn't another alpha that gets abandoned. It really is a gem.", "timestamp_created": 1681886726, "timestamp_updated": 1681886726, "voted_up": true, "votes_up": 32, "votes_funny": 1, "weighted_vote_score": "0.692648828029632568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "139106570": {"recommendationid": "139106570", "author": {"steamid": "76561198018473819", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 1581, "playtime_last_two_weeks": 0, "playtime_at_review": 63, "last_played": 1703206267}, "language": "english", "review": "Hardcore FernGully.", "timestamp_created": 1685217243, "timestamp_updated": 1685217243, "voted_up": true, "votes_up": 34, "votes_funny": 10, "weighted_vote_score": "0.690495431423187256", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "142509793": {"recommendationid": "142509793", "author": {"steamid": "76561198027860975", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 1653, "playtime_last_two_weeks": 0, "playtime_at_review": 762, "last_played": 1705479659}, "language": "english", "review": "My sister and I have been talking for years about how we wish there was a game where you were a small fairy or borrower person exploring the larger world, lamenting that we didn't know how to make the game ourselves. Luckily these brilliant people came along and made this delightful game! This game is so pretty and well made, and it's exciting to see how active the developers are with feedback and updates. All the little lighting, magic, and building/item details are great. The combat is fun and the ramp up in difficulty is easy to get used to. I am so excited to continue exploring this world and can't wait to see what they add next!", "timestamp_created": 1689920832, "timestamp_updated": 1689920832, "voted_up": true, "votes_up": 29, "votes_funny": 3, "weighted_vote_score": "0.690213203430175781", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141410621": {"recommendationid": "141410621", "author": {"steamid": "76561198083245433", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1199, "playtime_last_two_weeks": 0, "playtime_at_review": 929, "last_played": 1701129249}, "language": "english", "review": "me and my boyfriend both got this game and so far we LOVE this game, as a big fan of survival games (not so good at surviving though haha) this offers some amazing visuals and mechanics having to think about the dodging adds to the combat feel, early access so yes things are going to be a bit messing at times but the devs are doing a brilliant job with bug fixes and pumping content out cant wait to see what else scurrys in to the game", "timestamp_created": 1688602831, "timestamp_updated": 1688603037, "voted_up": true, "votes_up": 26, "votes_funny": 2, "weighted_vote_score": "0.689194023609161377", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "152950152": {"recommendationid": "152950152", "author": {"steamid": "76561197976992949", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 2080, "playtime_last_two_weeks": 0, "playtime_at_review": 2080, "last_played": 1691890018}, "language": "english", "review": "**Updated Review 12-21-23**\n\nI have reversed my review for this game as the developers have proved that they listen to reason and have not bowed to corporate greed like another dinosaur game.\n\nSmalland is a fun co-op game with some interesting progression and a housing mechanic that is unique.  Your home base can move from giant tree to giant tree throughout the map, which is a very interesting take on base building in a survival game.\n\nThe game is long from finished but is very playable in it's current state.  If you are looking for a game with the similar feel of Grounded, then give this a go.  Don't be fooled however, combat can be difficult and this game is much better when played together...on a private, home-hosted dedicated server.\n\nThanks again Devs!\n\n[strike]Currently have 30+ hours in the game and while it is fun, we were waiting for the Dedicated server support to arrive.  Instead the devs have decided to lock server support to hosted server only through GPortal which is not what the community asked for.  I cannot recommend this game if this is what they do.\n\nPerhaps if they reverse this decision, I will rethink this review.  Terrible decision and anti-community.[/strike]", "timestamp_created": 1701811839, "timestamp_updated": 1703206012, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.688534736633300781", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1701862307, "developer_response": "Hey! We didn't make an exclusive deal with G-Portal, . It has always been our goal to release server files for players who wish to host their own servers, and this will happen as soon as possible, but will also require specific attention from the development team who are still hard at work finishing the game for its 1.0 release."}, "136047713": {"recommendationid": "136047713", "author": {"steamid": "76561198001807624", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 3061, "playtime_last_two_weeks": 0, "playtime_at_review": 2399, "last_played": 1702867802}, "language": "english", "review": "I saw one of my steam friends played it, so I just downloaded and tried it with no expectations since I knew nothing about the game. 21 hours later I went to bed, so ye, I enjoyed it.\n\nShould take 30-50 hours to finish it, so I hope they add some more content. \n\nVery similar to Valheim with biomes etc. If you like Valheim, Ark or any other survival game then you should give the game a chance. Only 25 bucks for 40 hours of fun? Yes please.", "timestamp_created": 1680558238, "timestamp_updated": 1680558238, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.685174763202667236", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "135938324": {"recommendationid": "135938324", "author": {"steamid": "76561197991404503", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 1020, "playtime_last_two_weeks": 0, "playtime_at_review": 664, "last_played": 1680666793}, "language": "english", "review": "I've been playing this game with two of my friends and we are really liking it. For an early access game it does really well and leaves me even more excited for the future. It honestly does feel like Grounded x Valheim.\n\nPros:\nGraphics look great!\nCreatures can be challenging at times but not impossible.\nDying - I love that you WILL die in this game whether it be by a creature, fall damage, drowning, storm, starving (9hp), etc. Mistakes happen and you should learn and adapt to not die again the same way until the next thing kills you.\n\nCons:\nArmor should be able to made at your base and the NPCs that you make it at now should just give you the recipe or quest to unlock the recipe. Make this happen and give us an armor station that we can craft.\nWe should be able to have more than one pet/mount\n\nSuggestions (I know some of this may already be on the roadmap):\nI'd like to see the weather worked on some.. Would be neat for it to play even more of a factor in the game.\nDeeper \"cave\" type systems (there's the mob spawn caves everywhere but can't be entered - Maybe create something out of them?)\nAdditional building/crafting.. Let me make my house feel more unique with more decorations and building shapes/sizes.\n\nI'll add to this list as I progress throughout the game.\n\nTLDR: If you liked Grounded or Valheim you honestly should have no issues with this game.", "timestamp_created": 1680421146, "timestamp_updated": 1680666870, "voted_up": true, "votes_up": 25, "votes_funny": 0, "weighted_vote_score": "0.682879328727722168", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "152193484": {"recommendationid": "152193484", "author": {"steamid": "76561198116727507", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 530, "playtime_last_two_weeks": 0, "playtime_at_review": 530, "last_played": 1684398451}, "language": "english", "review": "Valheim with bugs", "timestamp_created": 1701071953, "timestamp_updated": 1701071953, "voted_up": true, "votes_up": 44, "votes_funny": 26, "weighted_vote_score": "0.68083953857421875", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "143071506": {"recommendationid": "143071506", "author": {"steamid": "76561198162486791", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 2604, "playtime_last_two_weeks": 0, "playtime_at_review": 2283, "last_played": 1690820213}, "language": "english", "review": "At first i was thinking this was a rip off of grounded. but turn out it different on it play though feel. i enjoy play it with my daughter.", "timestamp_created": 1690708857, "timestamp_updated": 1690708857, "voted_up": true, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.679804384708404541", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "147422872": {"recommendationid": "147422872", "author": {"steamid": "76561197984413156", "num_games_owned": 1195, "num_reviews": 145, "playtime_forever": 1062, "playtime_last_two_weeks": 0, "playtime_at_review": 1062, "last_played": 1696102668}, "language": "english", "review": "Expected generic Grounded clone - happy to be wrong.", "timestamp_created": 1696155085, "timestamp_updated": 1696155085, "voted_up": true, "votes_up": 14, "votes_funny": 1, "weighted_vote_score": "0.677796840667724609", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "135972001": {"recommendationid": "135972001", "author": {"steamid": "76561199005489253", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1594, "playtime_last_two_weeks": 0, "playtime_at_review": 1254, "last_played": 1680576247}, "language": "english", "review": "I have been playing this with my boyfriend and friend - as we play a lot of survival games together. \n\nOverall this game has a lot of potential and it's pretty fun to play. There are however some big QOL changes that need to happen. \n\n- Map needs color coded markers or just different icons. \nEvery marker is a blue exclamation mark and you can not differentiate them. This also goes for tracking Big Trees, they are color coded on the map, but when tracked they are all blue.\n\n- Storage chests have a very frustrating bug.\nI saw in real time my items disappearing from my inventory, moving between different chests, and just disappearing and reappearing from inventory and chests. This is probably my biggest frustration.\n\n- bugs are AGGRESSIVE. on lowest difficulty they are still hard to kill. You can't run away as they will chase you until you die. Only until we switched to peaceful was I allowed to actually explore and like the game without worrying about a gang of ants or bees coming to murder me. Peaceful is a must as of now.\n\n- mounting bugs are kind of awkward to control. my grasshopper twice has glitched inside of a rock.\n\n- Fall damage is way too high. You think you could make that jump? probably not. \n\n- we need an option to enable keeping inventory upon death. not everyone wants to HAVE to travel across the whole map just to collect their shit.\n\nI know I listed a lot of negatives, but these things can be easily fixed, and I actually do enjoy the game aside from these inconveniences. They have a great game here.", "timestamp_created": 1680454367, "timestamp_updated": 1680454367, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.6773415207862854", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "135728206": {"recommendationid": "135728206", "author": {"steamid": "76561197996710462", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 2805, "playtime_last_two_weeks": 0, "playtime_at_review": 395, "last_played": 1693599979}, "language": "english", "review": "If Valheim & Grounded combined this would be it. For first day of release I have encountered 0 bugs. game play is fun, rewarding and all the systems are very intuitive. Building is fantastic. Parrying enemies is sluggish and a bit to be desired atm.. I wish I could evade a bit faster. Aside from that I have 0 complaints.  110% recommend.", "timestamp_created": 1680167422, "timestamp_updated": 1680167650, "voted_up": true, "votes_up": 33, "votes_funny": 4, "weighted_vote_score": "0.67638707160949707", "comment_count": 11, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "135681467": {"recommendationid": "135681467", "author": {"steamid": "76561198200329078", "num_games_owned": 398, "num_reviews": 2, "playtime_forever": 552, "playtime_last_two_weeks": 0, "playtime_at_review": 97, "last_played": 1680704032}, "language": "english", "review": "I saw this game and was hyped on the spot. sadly i needed to wait until release and today was the day!\n\ni played it for about 1h so far, i already fell in love just seeing the first view glipses of the game after you chreate your character, i already can say that you guys put your hearts work into this! \nthe sounds you hear when youre walking around the noises... and dont forget that there are suprises after EVERY corner. \n\nhere is 1 issue that i found:\ni wanted to try out multiplayer with my friend, i was online and even restarted my game but i just didnt show up as online.\nmy friend restarted his game aswell and we where both shown online on steam somehow it just didnt wanna work\n\nso i recomed making an invite feature\n\ni usually dont write reviews... but for this i just needed too\n\n GREAT GAME! cant wait for future updates!", "timestamp_created": 1680102517, "timestamp_updated": 1680102747, "voted_up": true, "votes_up": 32, "votes_funny": 1, "weighted_vote_score": "0.675976276397705078", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140120185": {"recommendationid": "140120185", "author": {"steamid": "76561198308389323", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 23640, "playtime_last_two_weeks": 0, "playtime_at_review": 6175, "last_played": 1705987245}, "language": "english", "review": "I love the fact that when i dedicate to building on my great tree, that the tree and it's location, everything i built on it, my inventory and my pets follow me into any server. Very cool feature.", "timestamp_created": 1686858720, "timestamp_updated": 1686858720, "voted_up": true, "votes_up": 19, "votes_funny": 1, "weighted_vote_score": "0.673132419586181641", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "153702040": {"recommendationid": "153702040", "author": {"steamid": "76561198126765047", "num_games_owned": 111, "num_reviews": 4, "playtime_forever": 803, "playtime_last_two_weeks": 0, "playtime_at_review": 803, "last_played": 1702719347}, "language": "english", "review": "As a survival game lover, Smallands in its current state end of 2023 seems empty. Yes, it is flagged as early access, but the current content is rather a snapshot instead of a well rounded, enjoyable experience. While my friend and I grinded some components at the start, around mid to late game it became completely obsolete to farm for anything else. We also skipped many sets of gear because they were not necessary to obtain. \n\nWe also increased the difficulty to \"difficult\" with increased mob damage and HP. The game still was rather easy to play with no rewards for increased difficulty. We can also agree on the mounts being incredibly unbalanced with no adapted stats to their, in reality, unique traits. The damselfly was not a single bit faster than the Hornet while being much squishier and no abilities to attack. The grasshopper was literally the fastest and earliest mount to obtain in the game, maybe apart from the incredibly expensive blue tit mount at the very end of the game. Where's the reward in grinding for that if the game is basically over once you are able to obtain the blue tit?\n\nLeveling the pets was also rather useless. In the area in the north, we immediately encountered a hornet lvl 98. So why make the effort and level the low level hornets from the southern area? Mobs usually ranged from level 4-16 there.\n\nAt its current state, the northern area is unfinished and doesn't connect well with the southern area. we also didn't find the missions to be in any way engaging. So in conclusion, the game is mediocre at best and compared to other \"small world\" games on steam, this one feels unpolished and repetitive quickly.", "timestamp_created": 1702720141, "timestamp_updated": 1702720141, "voted_up": false, "votes_up": 91, "votes_funny": 8, "weighted_vote_score": "0.672828257083892822", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "143487020": {"recommendationid": "143487020", "author": {"steamid": "76561197996720623", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 3071, "playtime_last_two_weeks": 0, "playtime_at_review": 2997, "last_played": 1691354635}, "language": "english", "review": "What a blast! Wife and I played this entirely using controllers (separate computers). I had looked at Grounded but this one looked more interesting for us. We unlocked everything (that I know of). We played Valheim for a while but got bored and the difficulty spike was a bit much in some areas. This one scared the bejesus out of us a few times with creepy crawlers sidling up to you or from behind. Very much enjoyed all the base building options and the fact that there are no timers anywhere so we can take our time with building, collecting, exploring, fighting, strategizing, etc.\n\nYou can tame different beasts and while it was fun working to unlock them, we found the travel to still need work. Much preferred to just hop and glide on our own especially once we unlocked the Icarus wings towards the end of the current game. The 500 hoot price for the bird isn't quite worth it, but oh well; since there were two of us, we had to scrounge up 1,000 hoots for two birds.\n\nWhen we'd see spiders for the first time from afar, we'd say, \"What's that? Was it fuzzy?!\" It took a bit for us to feel like we were powered up enough to just go in and clear them all out. Very fun! Some late nights we'd be playing and getting into the spider areas and couldn't help but keep brushing the hair back from our necks out of habit. Good atmospheres in this game. We appreciated the catapult system for getting around and being able to attach signs to help us remember where certain ones pointed towards.\n\nInterested in seeing where else this game might go. If you're looking for another game to play online co-op with a spouse or friend, this one worked well for us. Others mention the KB + mouse but we stuck to controllers all the way through even for the building and it was a great experience. We enjoyed the freedom to explore and sometimes stumble on quest lines or boss-level creatures.", "timestamp_created": 1691278856, "timestamp_updated": 1691278856, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.672340929508209229", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "155814883": {"recommendationid": "155814883", "author": {"steamid": "76561198059619499", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 1607, "playtime_last_two_weeks": 0, "playtime_at_review": 1607, "last_played": 1704007237}, "language": "english", "review": "Increasing the cost of an unfinished game before launch....shady. I immediately lost faith in this company after seeing this happen. Whats next...suspiciously absent content that magically appears as purchasable DLC right after full release? I see where this is going.\n\nEdit: 3/7/2024\n\n - Upon further introspection, I think my only gripe pertained to the price increase. In fairness to the devs, the game itself I found completely worthy of the original price tag. Something just felt odd about increasing the price of a game while not actually adding anything, sense then they have added enough to justify this increase. I have decided to change my review to positive to reflect this.", "timestamp_created": 1705068190, "timestamp_updated": 1709865673, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.668137550354003906", "comment_count": 9, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "146099331": {"recommendationid": "146099331", "author": {"steamid": "76561198079422184", "num_games_owned": 0, "num_reviews": 75, "playtime_forever": 941, "playtime_last_two_weeks": 0, "playtime_at_review": 908, "last_played": 1704504773}, "language": "english", "review": "It isn't like \"Grounded\" in the way you would expect it to be (which is good). The only similarity is that you're as small as a bug.\n\nIf you like Valheim, you'll like this game even more because the developers [u] actually seem to care.[/u] The setting is great, the NPC's you meet offer new bosses to fight, you can tame various creatures, etc. \n\nI've enjoyed playing it solo, and I imagine it's even better with one or multiple pals.", "timestamp_created": 1694408951, "timestamp_updated": 1694408951, "voted_up": true, "votes_up": 13, "votes_funny": 1, "weighted_vote_score": "0.656614065170288086", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "155216482": {"recommendationid": "155216482", "author": {"steamid": "76561197961163803", "num_games_owned": 0, "num_reviews": 55, "playtime_forever": 2747, "playtime_last_two_weeks": 0, "playtime_at_review": 1513, "last_played": 1708113462}, "language": "english", "review": "Its grounded with a bit of ark in it. Plenty to do. My recommendation is to just not build near enemy spawns and make forward outposts to repair. You can set it so you don't drop your loot if you get killed or fall off a cliff or fall into deep water. Id say yes get it.", "timestamp_created": 1704364698, "timestamp_updated": 1704364698, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.652156472206115723", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "144536937": {"recommendationid": "144536937", "author": {"steamid": "76561198183888878", "num_games_owned": 0, "num_reviews": 36, "playtime_forever": 389, "playtime_last_two_weeks": 0, "playtime_at_review": 389, "last_played": 1692135132}, "language": "english", "review": "very adorable survival game. love playing it with my husband. :)", "timestamp_created": 1692418732, "timestamp_updated": 1692418732, "voted_up": true, "votes_up": 30, "votes_funny": 1, "weighted_vote_score": "0.648289382457733154", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "138309571": {"recommendationid": "138309571", "author": {"steamid": "76561199215135553", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 688, "playtime_last_two_weeks": 0, "playtime_at_review": 124, "last_played": 1704565160}, "language": "english", "review": "This game reminds me of the movie Arthur and the Invisibles / Arthur and the Minimoys\n", "timestamp_created": 1684095540, "timestamp_updated": 1684095540, "voted_up": true, "votes_up": 16, "votes_funny": 3, "weighted_vote_score": "0.647119522094726563", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "136539048": {"recommendationid": "136539048", "author": {"steamid": "76561198234585680", "num_games_owned": 34, "num_reviews": 4, "playtime_forever": 3946, "playtime_last_two_weeks": 0, "playtime_at_review": 1868, "last_played": 1689998652}, "language": "english", "review": "Fun little game. Picture if Ark and Valheim had a baby. Graphically it's very pretty too. I've recommended it to a few friends, no regrets here.", "timestamp_created": 1681240404, "timestamp_updated": 1681240404, "voted_up": true, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.645339906215667725", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "142646586": {"recommendationid": "142646586", "author": {"steamid": "76561198037326817", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 1420, "playtime_last_two_weeks": 0, "playtime_at_review": 1219, "last_played": 1690751989}, "language": "english", "review": "One of my favorite games. I truly can't wait for future updates.\nAlthough I really enjoy the experience, there are still some drawbacks. For me they don't overshadow the fun, but I know some people might get upset. Let me point out some subjective pros and cons:\n\nPros:\n+ map\n+ gameplay\n+ taming\n+ quests\n+ different types of weapons\n+ resistances & vulnerability system\n+ overall design (armor, characters, world, etc.)\n+ seasons & weather\n+ crafting\n+ all the creatures\n\nCons:\n- spiders (as someone with fairly advanced arachnophobia I find them utterly scary even with the filter on. The eyes, sounds, and other details are still too much for me.)\n- bugs (mostly minor ones, it's still early access)\n- pets dying stupidly (like bugging out and getting drowned in water), which forces you to find a new one (which is a shame if you exp them a lot). I think it should be possible to revive a pet somehow, but it's just my idea.\n- you can't have more than one pet in your party.\n- building can get really annoying sometimes", "timestamp_created": 1690122667, "timestamp_updated": 1690122667, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.644779443740844727", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "136275370": {"recommendationid": "136275370", "author": {"steamid": "76561197993656518", "num_games_owned": 1454, "num_reviews": 12, "playtime_forever": 2043, "playtime_last_two_weeks": 0, "playtime_at_review": 1457, "last_played": 1711113008}, "language": "english", "review": "Highly recommend this game if your a fan of Grounded, hate to mention other games in reviews but thats the audience this game is perfect for!\n\nThis game has land and air mounts, building, crafting, good AI pathing, beautiful environment and a large map.\n\nWhen starting off you might find it pretty difficult to take on fights with most of the creatures, but just keep at it unlocking more tools and armor and keep upgrading to the gear each npc offers when you get the resources and if you feel you need it at the time. YOU CANNOT SWIM so don't go near water! Talk to all the owls to learn how to play and have the notes added to your compendium. This is also where you will find your quest tasks as their isnt a Quest Tab.\n\nHave fun out there adventurer!", "timestamp_created": 1680878423, "timestamp_updated": 1680878506, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.644043982028961182", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148357029": {"recommendationid": "148357029", "author": {"steamid": "76561198170223591", "num_games_owned": 0, "num_reviews": 40, "playtime_forever": 8757, "playtime_last_two_weeks": 0, "playtime_at_review": 8164, "last_played": 1710095032}, "language": "english", "review": "As far as survival crafters go, id rate it high on the charts. Lots of enemies, resources, quests, NPCs, the works. Why it stands out: YOU ARE SMOL! grasshoppers are the size of ponies and beetles are as big as cars! you can fly on the back of a dragonfly, or ride atop a wolfspider, among other creatures. you can build many things and move your base to different trees, depending on what's convinient. using wings on your back, you can glide huge distances, and launch aerial attacks on enemies. Stats allow you to become faster, stronger, tougher, and more enduring.\n\non the visuals: it is quite beautiful, and the world comes to life at night. the game is quite stunning the whole way through to current content.\n\non the music: fun and whimsical! the perfect soundtrack to a day in smalland national park\n\non the lore: surprisingly deep. still figuring things out, myself.\n\non the mechanics: slightly clunky, but its getting better with each update, but is acceptable with current state of the game in mind.\n\n\"should i buy this?\"\n\nThis is the kind of game that should be on anybody's playlist. yes, absolutely. 10/10", "timestamp_created": 1697492102, "timestamp_updated": 1697492102, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.643485426902770996", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "135681753": {"recommendationid": "135681753", "author": {"steamid": "76561199245689915", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 2331, "playtime_last_two_weeks": 0, "playtime_at_review": 99, "last_played": 1680991636}, "language": "english", "review": "played for right under 2 hours so far \n\nPros-1. world looks great feels like a big place to explore.\n        2.  combat and movement are pretty decent could be tweaked a bit .\n        3. eat/drinking to stay alive seem fair for a survival game big + for me\n\ncons-1. character models are a little stagnant in the face making them\n          feel a bit soulless  .\n         2. the day and night cycles felt fast and with bugs being aggressive at night\n              made me feel rushed and that will probably solve itself with better armor\\weapons\n\noverall i like the game and im ready to see more of this world GG Merge Games \n", "timestamp_created": 1680102787, "timestamp_updated": 1680102787, "voted_up": true, "votes_up": 19, "votes_funny": 1, "weighted_vote_score": "0.643076896667480469", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "135725513": {"recommendationid": "135725513", "author": {"steamid": "76561198830549652", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 3239, "playtime_last_two_weeks": 0, "playtime_at_review": 180, "last_played": 1690946851}, "language": "english", "review": "So from personally expirence, if you're about to die and you don't want to lose your crap, quickly exit to the game menu and you'll end up at your base with everything in tact", "timestamp_created": 1680162249, "timestamp_updated": 1680162249, "voted_up": true, "votes_up": 22, "votes_funny": 9, "weighted_vote_score": "0.640103936195373535", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "154365083": {"recommendationid": "154365083", "author": {"steamid": "76561199112209105", "num_games_owned": 102, "num_reviews": 1, "playtime_forever": 2897, "playtime_last_two_weeks": 0, "playtime_at_review": 2105, "last_played": 1703807214}, "language": "english", "review": "Grounded still the best but this game has a lot to do as well", "timestamp_created": 1703506999, "timestamp_updated": 1703506999, "voted_up": true, "votes_up": 39, "votes_funny": 2, "weighted_vote_score": "0.637102663516998291", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "137678875": {"recommendationid": "137678875", "author": {"steamid": "76561198400938352", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 3546, "playtime_last_two_weeks": 0, "playtime_at_review": 1028, "last_played": 1710498839}, "language": "english", "review": "stumbled across this while looking for something entirely new to play and honestly hooked. I struggle to stay engaged in games but literally been sat for the past 3 days binge playing lol. My honest advice if you're reading this before playing or knowing about it, dont watch a bunch of reviews and videos, the game is so much better experienced when you go in blind. its easily accessible for new gamers too and the multiplayer functionality is easy peasy. 1000% recommend already and its only early access :)", "timestamp_created": 1683036189, "timestamp_updated": 1683036189, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.636357903480529785", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "136084070": {"recommendationid": "136084070", "author": {"steamid": "76561198068142397", "num_games_owned": 111, "num_reviews": 1, "playtime_forever": 3146, "playtime_last_two_weeks": 0, "playtime_at_review": 3146, "last_played": 1680578039}, "language": "english", "review": "Played 52 Hours, 13/13 Achievements. Killed All Bosses and Explored the whole map.\n\nIf you liked \"A Bug's Life\" as a child and you Enjoy Survival Games, Give it a try. \n\nCrafting is enjoyable, not too demanding. Building is fun, but not unique. \nChoice of light and heavy attacks, Iron Scythe animation is on point. \nCan Mount different insects throughout the game. Not all can jump, not all can attack.\nSet armor is unlocked in an enjoyable way. Hope they add more.\nBosses look cool, Moves are the same, no unique specials.\nCan claim and build bases in the top of trees. Can Teleport said base to a different tree. Quality of life. \nMovement Really Picks up Late Game, Didn't even use mounts late game. Can Just Glide Tree Branch to Tree Branch. \nMounts die really easy.\n\nCons: Spent at least 5 hours (Being Generous) running to my body for my gear. Bug's charge attack glitches and they teleport and smack you. Can't Swim, so if you land, slip, or a bug smacks you into water, that's it. Gliding doesn't always \"Glide forwards\" You just Fall slowly at a small angle. Harvesting Items aren't in every next set upgrade. Building Assets are lacking. Bugs spawn inside the map, lots of annoying buzzing you can't find and slay. Spots that look like you can explore, then you get stuck inside or behind a invisible wall. \n\nThings I hope They add:\nMore Armor and Weapon Sets\nHigher tier Harvesting items.\nMore unique building assets to craft. \nTier 1 & 2 Mobs has Unique or More Skill Attacks.\nBosses with better loot tables (Not just the Unique Quest Item)\nBosses with Unique Attack Tables\nAbility to Fly, not just hover downwards. \nAbility to craft low tier bandages from Bag.\nA shield or Dual Wielding.\nAbility to combo into attacks\nMounts can be Upgraded or Level.\nMounts can be dismissed.\n\n\nSucks Early Game, Playable Late Game. \n\n\n\n", "timestamp_created": 1680607949, "timestamp_updated": 1680607949, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.635900795459747314", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "136874736": {"recommendationid": "136874736", "author": {"steamid": "76561198154135961", "num_games_owned": 93, "num_reviews": 7, "playtime_forever": 21115, "playtime_last_two_weeks": 94, "playtime_at_review": 1065, "last_played": 1713798106}, "language": "english", "review": "Love the game to much but I don't want to type out a book. If you liked Grounded you will probably love this.", "timestamp_created": 1681762337, "timestamp_updated": 1681762337, "voted_up": true, "votes_up": 14, "votes_funny": 1, "weighted_vote_score": "0.633541643619537354", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "136027623": {"recommendationid": "136027623", "author": {"steamid": "76561198016871624", "num_games_owned": 0, "num_reviews": 29, "playtime_forever": 1646, "playtime_last_two_weeks": 0, "playtime_at_review": 1278, "last_played": 1697085404}, "language": "english", "review": "I don't know. I want to like it but it's exhausting and very frustrating at times. The fall damage needs to be fixed. There's no more reason for that than when you're using the grapple gun to get around which I thought by way of it being a swing grapple and not a climbing grapple that it was supposed to be used to get around quicker but it just gets you killed over and over again with the fall damage. \n\nThe combat is not good at all. It seems almost impossible to prevent yourself taking damage from enemies as you don't have any proper blocks. You DO have a block but it only blocks some of the damage and there is this two second delay after attacking when you can't block at all so timing it properly is very annoying. There is also a massive problem with enemy hit boxes. Not being able to hit them but for them to be able to hit you. Or not hit you, rather. I've seen enemies faced in the opposite direction of me, I dodged out of the way of their attack because I saw it coming, and their attack still hit me.\n\nLike I said, I want to like it but it's VERY grindy and needs a lot more polish before I put any more time into it.", "timestamp_created": 1680533978, "timestamp_updated": 1680557222, "voted_up": false, "votes_up": 31, "votes_funny": 4, "weighted_vote_score": "0.631356179714202881", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "136633169": {"recommendationid": "136633169", "author": {"steamid": "76561198272291519", "num_games_owned": 0, "num_reviews": 23, "playtime_forever": 3566, "playtime_last_two_weeks": 0, "playtime_at_review": 1721, "last_played": 1700679137}, "language": "english", "review": "Wonderful game, already worth the price in its current early access state. You get at least 20 hrs of gameplay to finish the story and a lot more if you´re into building.\n\nThe map is extraordinarily beautiful und quite large. I´ve been playing alone so far and it can be pretty challenging, but the option to adjust the health and strenght of hostile insects, that was added lately, can help with that. There is also a peaceful mode which can be really useful to retrieve your death loot...\nI recommend playing the game without looking up any guides or videos. Everything is explained well ingame, and ressources are pretty much where you´d expect them irl too. One thing to note is, you currently can only have one companion, so that´s why taming another one isn´t working.\n\nThe building system is very interesting too, since you can overlap and rotate parts vertically and horizontally and create a lot of different shapes and the building parts and decorations are beautiful. Currently there are 3 tiers of building sets, the 1st one very cheap, so it´s quick and easy to setup a starter base. There is already a large variety of armor sets and weapons to craft, the best ones of them pretty pricy and a bit of a grind to get though. The character creation at this point doesn´t offer too many options, but the characters look nice and cute and the animations are pretty good.\n\nA really handy mechanic to point out is, you can move your base (once it´s a tree encampment) to any other Great Tree on the map, even to a different game hosted by a friend i.e., or lateron, once they added server support, to a different server. So I have been moving around my base all the time to where ever I´m currently harvesting or doing a quest etc...\n\nOne thing missing, which I hope will be added in the future is steam workshop support.\nEDIT: Developers stated they do want to add mod-ability on steam, but not before release.\n", "timestamp_created": 1681400222, "timestamp_updated": 1700679356, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.630769193172454834", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "149323124": {"recommendationid": "149323124", "author": {"steamid": "76561198056436116", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 6343, "playtime_last_two_weeks": 30, "playtime_at_review": 1850, "last_played": 1713121621}, "language": "english", "review": "Really surprising that this game is not more popular. I started this after getting bored of Valheim, and I have to say, I'm really impressed with the amount of content, the advanced building options and the vertical gameplay. I especially like the design decision of letting players glide/catapult from those giant trees as a more immersive way of fast travelling. Looking forward to the release of dedicated servers, would be cool to have a server for my group of friends that is always available.", "timestamp_created": 1698860139, "timestamp_updated": 1698860139, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.629400849342346191", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "136035077": {"recommendationid": "136035077", "author": {"steamid": "76561197978409306", "num_games_owned": 0, "num_reviews": 21, "playtime_forever": 342, "playtime_last_two_weeks": 0, "playtime_at_review": 119, "last_played": 1680598703}, "language": "english", "review": "There are some pretty big bugs in this game, but thankfully you can tame some and slay the others.\nI think its released at a decent stage of development with plenty to do/craft/build/fight/explore & gather.\nBuilding is pretty clean and very similar to that in Valhiem.\nA clear road-map of things to come is a good thing to see.\nThere is still some balancing, Ai pathing and clipping issues that could be resolved. But nothing major. \nSome of the items, especially the T1 bow just break way too fast & you also need to eat a liiiittle too often.\nThe graphics are decent and the environment is well made. \nWorth the price considering what the game will turn out to be once completed. \nOh and you really don't want to try and swim in this game, Your pockets are quite literally filled with stone. .", "timestamp_created": 1680542765, "timestamp_updated": 1680542765, "voted_up": true, "votes_up": 13, "votes_funny": 7, "weighted_vote_score": "0.625389814376831055", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "139861823": {"recommendationid": "139861823", "author": {"steamid": "76561198054896270", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 5625, "playtime_last_two_weeks": 0, "playtime_at_review": 3489, "last_played": 1708141633}, "language": "english", "review": "Smalland is a fun and inviting world with some engaging mechanics that have you building, gliding and swinging as you interact with the environment. The combat is NOT a strong point with sluggish movements and poor hit registration.", "timestamp_created": 1686439925, "timestamp_updated": 1686439925, "voted_up": true, "votes_up": 13, "votes_funny": 1, "weighted_vote_score": "0.621911287307739258", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "153389558": {"recommendationid": "153389558", "author": {"steamid": "76561199119540069", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 17947, "playtime_last_two_weeks": 0, "playtime_at_review": 573, "last_played": 1707603844}, "language": "english", "review": "Clean graphics, the movement feels nice, the combat is solid, gathering is plentiful, weather and season changes and effects are done well, base construction is satisfying, lots of options to make it as cozy or survivor as you want it to be, the ability to move your base into other worlds, feels good solo or co-op, overall pretty well polished. If this sounds like fun to you I 10/10 would recommend.", "timestamp_created": 1702317954, "timestamp_updated": 1702317954, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.621311485767364502", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "151668132": {"recommendationid": "151668132", "author": {"steamid": "76561198058445413", "num_games_owned": 1821, "num_reviews": 11, "playtime_forever": 660, "playtime_last_two_weeks": 0, "playtime_at_review": 658, "last_played": 1700855059}, "language": "english", "review": "I have enjoyed this game. It is very much like grounded in the fact you are dealing with little people. I loved building on the great Oak tree there.  I'm glad they have placed their building homes up in the sky and you can build in most places down on the floor. It's also quite different and gives a small pixie-like feel.  They have a good bit of work if they are creating a story as well as some of the mechanics can be better and less repetitive with access. \n\nIt would also help if they did some work on the quests and the mechanics there.", "timestamp_created": 1700854886, "timestamp_updated": 1700854886, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.618923425674438477", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "153752409": {"recommendationid": "153752409", "author": {"steamid": "76561198277130371", "num_games_owned": 0, "num_reviews": 38, "playtime_forever": 59, "playtime_last_two_weeks": 0, "playtime_at_review": 59, "last_played": 1702594253}, "language": "english", "review": "A majority of people always think of this as a contender for Grounded but In my opinion it's like a third person less glitchy version of ARK. Sure there's no dinosaurs or crazy cavement beating your skull in with a club but instead killer insects that while to a normal human wouldn't be an issue but you aren't a normal human. You're a fae/elf like creature in a very interesting fantasy setting where the \"giants\" Aka humans are gone leaving only remnants that they existed behind in the forms of bottlecaps screws and landmarks like the playground but that doesn't matter because you're goal as a vanguard appointed by your king is to find the one fae that knows the cure for the queens illness. that and just survive the harsh land riddled with insects and other dangers. A very good game and with a promising roadmap. The community is small but very friendly so If you like survival fantasy give this a shot", "timestamp_created": 1702772121, "timestamp_updated": 1702772121, "voted_up": true, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.618519067764282227", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "138714768": {"recommendationid": "138714768", "author": {"steamid": "76561198056013664", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 1101, "playtime_last_two_weeks": 0, "playtime_at_review": 716, "last_played": 1690821971}, "language": "english", "review": "ABSOLUTLEY LOVE this game. It's like the perfect mix between Ark & Grounded IMO. Anyone who's looking for a fun survival game should give this a try. Extra fun if you bring a friend!", "timestamp_created": 1684700482, "timestamp_updated": 1684700482, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.616502046585083008", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "152161201": {"recommendationid": "152161201", "author": {"steamid": "76561198052399449", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 2390, "playtime_last_two_weeks": 0, "playtime_at_review": 1156, "last_played": 1701740020}, "language": "english", "review": "I do enjoy the game, but it is not ready. Been playing with a friend, and all of our structure got completely wiped, game stability is not great, get kicked frequently and game AI struggles. Pets just run and die regularly, all the important things are fun, but those few stability things kill it", "timestamp_created": 1701048877, "timestamp_updated": 1701048877, "voted_up": false, "votes_up": 40, "votes_funny": 6, "weighted_vote_score": "0.613388478755950928", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "151968087": {"recommendationid": "151968087", "author": {"steamid": "76561199375757900", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 12646, "playtime_last_two_weeks": 0, "playtime_at_review": 11285, "last_played": 1704090646}, "language": "english", "review": "Smalland is an absolutely delightful and enchanting game that transports players into a whimsical and captivating world like no other. From the moment I entered this pint-sized paradise, I was immediately captivated by the rich, immersive environment that teems with vibrant life and unexpected adventures.\n\nOne of the standout features of Smalland is its stunning graphics. Every blade of grass, fluttering butterfly, and towering tree is beautifully rendered, creating an atmosphere that feels alive and brimming with possibilities. The attention to detail is truly remarkable, making it easy to lose oneself in this enchanting miniature universe.\n\nBut it isn't just the visuals that make Smalland an exceptional game. The gameplay mechanics are incredibly unique and innovative, allowing players to experience the world from a new and refreshing perspective. As a tiny being, I found myself constantly amazed at the challenges and obstacles I had to overcome—whether it was crafting tools to build a shelter or finding creative ways to outwit the critters that roamed this tiny realm.\n\nWhat further sets Smalland apart is its seamless integration of survival and exploration elements. With limited resources and constant danger lurking around every corner, the game never fails to keep players on their toes while embarking on thrilling quests and uncovering the hidden secrets of this whimsical world. The sense of accomplishment one feels when successfully completing a daring mission is truly exhilarating.\n\nMoreover, Smalland offers a remarkable multiplayer experience. Coordinating and working together with friends to overcome obstacles and achieve shared goals adds an extra layer of excitement and camaraderie to the gameplay. There is nothing quite like collaborating with fellow tiny adventurers to build a thriving community in this wondrous realm.\n\nFinally, the sound design and soundtrack of Smalland deserve special mention. The melodic tunes perfectly match the game's atmosphere, evoking a sense of childlike wonder and exploration. The subtle ambient sounds, whether it's the chirping of birds or the rustling of leaves, further enhance the immersive experience and make it feel like you are truly part of this miniature world.\n\nIn conclusion, Smalland is an exceptional game that combines stunning visuals, innovative gameplay mechanics, and a captivating world to create an unforgettable gaming experience. Whether you are a seasoned gamer or new to the gaming world, this masterpiece offers something for everyone. Immerse yourself in the whimsy and adventure of Smalland, and prepare to be enchanted", "timestamp_created": 1700973876, "timestamp_updated": 1700973876, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.611618578433990479", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140127185": {"recommendationid": "140127185", "author": {"steamid": "76561198012994261", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 923, "playtime_last_two_weeks": 0, "playtime_at_review": 630, "last_played": 1687216285}, "language": "english", "review": "I was worried I would be turned off by this game.  Seeing some early game footage and thinking they had a bunch of room to improve.  That being said I have about 10 hours with my son and we are having a blast.  They have released about 2 huge updates and just added parrying (witch we said it needed bad)  So they are doing a good job so far adding what needs to be added.  I recommend it. Esp at this price.", "timestamp_created": 1686867859, "timestamp_updated": 1686867859, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.610570609569549561", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "135678968": {"recommendationid": "135678968", "author": {"steamid": "76561197993292768", "num_games_owned": 0, "num_reviews": 49, "playtime_forever": 90, "playtime_last_two_weeks": 0, "playtime_at_review": 9, "last_played": 1682566510}, "language": "english", "review": "I'll go ahead and do what everyone else is doing after only playing for 30 mins (some even less). \nYou're seeing a lot of comments on how the game is not running that great for them. \nMy game is running with no issues other than the typical frame drop when you enter an open world because of the loading that has to be done. I feel like a lot of people jump into games like these with a potato and cry when they can't run the game on the highest settings.\nHere are my specs with the game at Max settings with 3440x1440p- 60hz capped.\nMSI 3080 OC\nAMD 5900x\nG.Skill 16gb- 4000mhz\n1TB Samsung SSD\n\nDo some work and actually play with the settings. I will say it doesn't help the game auto sets the graphics to Maximum. So make sure you change it accordingly.\nGame feels great, graphics are very nice, art style is awesome. I love the optional first person view. If you liked Grounded you will most likely enjoy Smallland.\n", "timestamp_created": 1680100062, "timestamp_updated": 1680100062, "voted_up": true, "votes_up": 32, "votes_funny": 6, "weighted_vote_score": "0.608734786510467529", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}}, "query_summary": {"num_reviews": 85, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 3233, "total_negative": 584, "total_reviews": 3817}, "cursors": {"AoIIPwAAAHCy7twE": "Mon Apr 22 23:41:45 2024"}}
