{"reviews": {"157954355": {"recommendationid": "157954355", "author": {"steamid": "76561197971508249", "num_games_owned": 642, "num_reviews": 95, "playtime_forever": 2238, "playtime_last_two_weeks": 0, "playtime_at_review": 2238, "last_played": 1707510884}, "language": "english", "review": "Do you know those times when you've just finished with a game and you really don't know what to play, nothing really stands out, there's a few games you'd like to try but they're way too expensive, there's a few you have halfway but don't feel like going back to, and you just start browsing your vast, VAST library of Steam trash for something that you might have left relatively untouched for one reason or the other in a desperate attempt to avoid throwing more money into the always hungry maw of procrastination? Even if you somehow never have despite stumbling into the steam page of a VERY cheap 2016 game, I'm pretty sure you could probably relate to it.\n\nI bought this game while it was still in Early Access, probably on the suggestion of a group of people I had played the first HTS game with. Our playthrough obviously didn't make it very far, and so this game sat, untouched and undisturbed on my game collection, until at the start of this very unproductive weekend, and what can I say, I guess it's just what I was in the mood for, even though looking back on it, I don't think it's a very good game.\n\nHTS2 is a very straightforward third person action-survival game split between a big hub map where the player can collect resources, build a base and craft gear and items, and where they will speak with quest-givers who will send them on self-contained, predefined missions. Complete these missions, and you will earn materials to upgrade your base and craft new items with, and experience points that can be put towards an (extremely convoluted) level-up system, as well as advancing their respective questlines. Missions can be repeated as many times as desired, and the only penalty for dying, as far as I'm aware, is loss of experience points and some minutes of player time. I'm assuming there's some kind of failure state at some point, but I have personally not experienced it, because overall, the game is pretty easy.\n\nTo be honest, HTS2's difficulty and progression are weird. First off, the way mission difficulty is handled is beautifully simple to the point of I'm conflicted on whether to call it genius or lazy. Missions have a minimum required level, but when accepting them, they will scale to the player's for purposes of enemy type and level. The player can choose to further modify the mission's level, by simply having the choice to raise or lower it by 5, meaning that if a mission is level 10 but I'm 20, I will be able to change it to be between level 15 and 25. Rewards are the same, loot is the same (not sure about enemy drops), but the total exp points received for that mission will have a multiplier based off the difference between the minimum and the level at which it is played. In my previous example, that would mean a multiplier of between 5x and 15x from the base exp reward.\n\nExperience points are spent through a baroque triple-layered system: First, you need to spend points on your camp level. This basically governs your progress through the game, which buildings you get access to, the cap of your [i]individual[/i] building levels, as well as your character's. Then, you will spend exp points into your character level, which in turn controls the enemy's, and the skill levels you get access you, *AND THEN* you'll spend exp points into upgrading skills like more damage, more sprint speed, etc. Buildings are upgraded by materials, which gives access to new gear and items. There are a few melee weapons which I have barely used, and 6 main categories of ranged weapons: pistols, revolvers, rifles, smgs, bows and crossbows for which you'll get access to direct upgrades to craft, as well as accessories that can be installed through a customization menu. Armors seem more like sidegrades, less like options and more \"this is what you'll wear for the next 10 levels\". Effectiveness is hard to gauge from the tons of stats provided, and some upgrades sometimes aren't obvious looking at the numbers, while others carry enormous tradeoffs that are not worth it. Overall the game feels like it was built with a much bigger idea in mind and that it eventually had to be cut down, but from what there is, I would say it tries very commendably to make all gear viable and give each tool its purpose, although there is little to no reason to just stick with bows through the entirety of the game.\n\nDespite the absolute showers of exp you can receive, progression through the game is mainly dragged down by resources. I imagine this game was built with multiplayer in the forefront, with several players contributing to its construction, and the materials that your base will require to stay up to date will vastly outstrip what you will receive through missions. This means that at some point you will invariably need to repeat some, and while this is pretty painless, it's not great. The game will include a glossary of items that you can access you see the three missions you've received the most of in as a quick guide to what to run if you want this, which is a very nice touch, though.\n\nThe game, while not looking amazing, holds up in a very xbox 360 arcade kind of way. The textures look mostly drab and ugly, but the animations are lovely, the models are crisp, the camera doesn't get in the way, and when it's not at night and/or raining (which is a depressingly large chunk of the time I spent playing), the game looks very decent. It also controls great, too, and in gamepad the scheme is very well though out and implemented. Menu navigation is a pain in the ass, but in general menus in this game are the counterpoint to the bright spots in other areas of the game. They are boring, straighfrorward, cluttery and clunky. Functional, but barely a passing grade.\n\nAll of this out of the way through, the game provides a steady stream of missions that just basically serve as an excuse to go from A to B, kill all zombies in between and loot all the lootables you can find. Come back to camp, drop everything off, craft a little, go see what's the next mission, and what can I say, it works mesmerizingly well and will put you in that sort of trance like state only a steady stream of fast food-like sludge pumped directly into your brain can do. It's not great, it's not amazing, but it works and it's just the right amount of interesting and satisfying to keep you pushing for the next mission, and the next level. The enemy variety, although not crazy, keeps throwing you new enemies, and while the random spawning will sometimes upset the flow of a level as they were originally designed (sometimes leaving entire swathes of level basically empty and useless), missions are varied in terms of objectives and overall design, although some of them will become repetitive pretty soon due to the similar layouts, but they are quick and brisk and much like the rest of the product it's [i]just competent enough[/i] to keep your attention.\n\nThere is a surprisingly large amount of stuff I'd like to talk about regarding this game when considering how mediocre it is considered as a whole. It's got a lot of quirks and design decisions that hint a lot of care went into its design, and it's a game that has very very solid fundamentals and that went for far higher than it should have cared for. You'll see a lot of reviews listing negatives and I'll probably agree with every single one of them. But at the end of the day I'd be lying if I didn't say I haven't enjoyed the time I've spent with it and that, if you get it at a good price, this is a heaping greasy awful delicious ladleful of gaming comfort food.\n\n7/10.", "timestamp_created": 1707517869, "timestamp_updated": 1712375946, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.632308065891265869", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158860488": {"recommendationid": "158860488", "author": {"steamid": "76561198061740176", "num_games_owned": 0, "num_reviews": 275, "playtime_forever": 1853, "playtime_last_two_weeks": 0, "playtime_at_review": 696, "last_played": 1708911916}, "language": "english", "review": "A fun game that I acquired long long ago. Though it's plagued by P2W DLC and I could never recommend spending money to support blatantly consumer unfriendly business practices.\n\nAfter playing more of the game, I can also say that it's INSANELY grindy. The zombies get more powerful every time you level up, so you constantly get weaker by leveling up until you grind materials to get better gear (at specific thresholds). There's like 6 different buildings you keep looting over and over and over again. There's 3 different locations that are just slightly different that you visit over and over and over again. Enemies respawn almost as much as they did in Sacred 2. Every piece of loot needs to be individually looted. KB&M was an afterthought this time around (not the case in the first game) and targeting with a mouse is like playing with a handicap compared to a controller; despite this being on PC where everyone has a KB&M, and most do not own controllers. At around level 15 you go from a rather solid story progression to every mission doubling to level 30, forcing you to repeat missions incessantly for materials and XP. It's insanely worse designed than the first game.\n\nIf How to Survive 1 was Quality > Quantity, then this is Quantity > Quality.  You can beat that game in 8 hours. This one will take you 60+ hours, and yet you'll see everything the game has to offer in the first 8.", "timestamp_created": 1708486413, "timestamp_updated": 1709066982, "voted_up": false, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.606950461864471436", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158785892": {"recommendationid": "158785892", "author": {"steamid": "76561198124123652", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 11371, "playtime_last_two_weeks": 0, "playtime_at_review": 4389, "last_played": 1712516551}, "language": "english", "review": "Good afternoon, having played more than 70 hours, I decided to share my opinion and impressions of the game, the game with its mechanics and atmosphere is somewhat similar to “Project Zomboid”, but here it is not a completely open world, but divided into locations. In general, the game is interesting, a lot NPCs, well-written dialogues and plot, but this is only a single-player game, and if we talk about multiplayer, then there are problems, the first is that the online is very small, you meet the same people, plus the players themselves, for some reason you are afraid when you you go to their server just to play together and they either try to kill you or ban you from the server, it’s sad, I recommend getting acquainted and spending time playing the game for a couple of evenings.", "timestamp_created": 1708412460, "timestamp_updated": 1708412460, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.524849355220794678", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160485851": {"recommendationid": "160485851", "author": {"steamid": "76561198057479199", "num_games_owned": 449, "num_reviews": 131, "playtime_forever": 298, "playtime_last_two_weeks": 0, "playtime_at_review": 298, "last_played": 1498512621}, "language": "english", "review": "Fine game but not worth its full price", "timestamp_created": 1710383083, "timestamp_updated": 1710383083, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "157374488": {"recommendationid": "157374488", "author": {"steamid": "76561198116594582", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 24578, "playtime_last_two_weeks": 0, "playtime_at_review": 23030, "last_played": 1708510332}, "language": "english", "review": "Great as a local stand alone game as well as team play online. Provides for challenges that are achievable and player/weapon upgrade options as part of the challenge goals. Also has local camp area 'surface play' which allows gathering of resources and zombie hunting at a casual pace as an option to the challenge missions set through other non player characters.", "timestamp_created": 1706837199, "timestamp_updated": 1706837199, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160063540": {"recommendationid": "160063540", "author": {"steamid": "76561198066929985", "num_games_owned": 773, "num_reviews": 100, "playtime_forever": 440, "playtime_last_two_weeks": 0, "playtime_at_review": 440, "last_played": 1512851149}, "language": "english", "review": "When I played it the game was good not sure whay is going on now", "timestamp_created": 1709847586, "timestamp_updated": 1709847586, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.522293031215667725", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159795355": {"recommendationid": "159795355", "author": {"steamid": "76561198273264814", "num_games_owned": 227, "num_reviews": 13, "playtime_forever": 5797, "playtime_last_two_weeks": 0, "playtime_at_review": 5797, "last_played": 1495844831}, "language": "english", "review": "this is seriously one of my favourite games ever. i am well aware of it's shortcomings but even after completing it over 4 years ago, i still have very fond memories.", "timestamp_created": 1709494235, "timestamp_updated": 1709494235, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.517241418361663818", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "149171216": {"recommendationid": "149171216", "author": {"steamid": "76561198239038870", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 13, "playtime_last_two_weeks": 0, "playtime_at_review": 13, "last_played": 1698634430}, "language": "english", "review": "Got the game as a gift we planned to play as multiplayer not local play. Online support apparently ended in 2020 it still shows up in the ad for the game and as a feature. Do not buy this game if you are looking to play with your friends who are not local.", "timestamp_created": 1698634716, "timestamp_updated": 1698634716, "voted_up": false, "votes_up": 109, "votes_funny": 4, "weighted_vote_score": "0.904182136058807373", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "21982594": {"recommendationid": "21982594", "author": {"steamid": "76561198023445294", "num_games_owned": 238, "num_reviews": 6, "playtime_forever": 27037, "playtime_last_two_weeks": 0, "playtime_at_review": 14067, "last_played": 1475244710}, "language": "english", "review": "I’m playing the game since the beginning of the early access and it has come a long way since so it’s time to do a check-up. \n\nPros :\n- Play local solo or coop. Play online or even local coop online!\n- Build your own place to survive. You will spend some time before getting a good camp. With the most recent update, you can set a camp attack and defend it from zombies waves!\n- Kovac. This character is hilarious!\n- Various recipes for crafting. Literally everything is used for crafting, even junk you can melt in a foundry. No leftover.\n- Missions : you will go on several missions to gain xp and loot. You can increase the level of the mission for a “high risk, high reward” gameplay but you can also decrease it if you want to go on an easy way.\n- Battle gameplay. Use melee weapons or guns but don’t get outrun nor outnumbered otherwise you will have a bad time. You need to aim your enemy and keep it in sight for a critical shot. The faster you can get it, the better.\n- Post-apo weapons : you see that they are really made of what you used to craft them!\n- Finishing moves. It feels so good !\n- Flying pets!\n- Season events: we got thanksgiving or christmas missions and specific loots!\n- You can customize your character from the inventory at any time. (Topless character against zombies ftw!)\n\nCons :\n- It’s still early access. Some things are unfinished but as the time goes, we have less and less missing features.\n- Environnement is repetitive. It’s either swamps or city with the same look.\n- Some resources are hard to find, even quest related ones.\n- In order to craft/upgrade specific weapons or buildings, you will need to grind levels or farm resources.\n- The hunger and thirst does not penalize you enough. Having 0% hunger/thirst penalize you in combat (You will hit like a fly and your aim will be awfully slow) but your health will remain unchanged so it cuts the “survival” a half.\n- If you play in public, be prepared : you obviously have player killers, robbers and griefers. So I recommend playing with friends only for the best coop experience. (On the contrary, if you search for a “pvp” like gameplay style, go for it!)\n\nThe game is on the right path and has improved a lot since its launch so if you like zombies, crafting and survival in hostile and desolate territory, buy it, you’ll enjoy the journey. And of course, with friends. The more, the merrier! (With the notable exception of your resources.)", "timestamp_created": 1458653056, "timestamp_updated": 1461052343, "voted_up": true, "votes_up": 297, "votes_funny": 25, "weighted_vote_score": "0.890885472297668457", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "35369814": {"recommendationid": "35369814", "author": {"steamid": "76561198053856901", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 1216, "playtime_last_two_weeks": 0, "playtime_at_review": 1189, "last_played": 1506843534}, "language": "english", "review": "I bought this game because I enjoyed playing the first one. Sadly, it does not live up to its predecessor in every aspects IMO. I think my biggest complaint is the insane grindy gameplay. If you want to upgrade a building, do X quest N number of times. If you want to improve your skills, repeat X mission 10+ times so on and so forth.\n\nThe sense of progression is completely gone as well. All missions are instances. I think they wanted to give the game a more immense multi-player experience. They have also done a very poor job on mission design in which some missions are just frustrating to do.", "timestamp_created": 1506844771, "timestamp_updated": 1506844771, "voted_up": false, "votes_up": 65, "votes_funny": 2, "weighted_vote_score": "0.826716184616088867", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "30266677": {"recommendationid": "30266677", "author": {"steamid": "76561197972297683", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 2255, "playtime_last_two_weeks": 0, "playtime_at_review": 2255, "last_played": 1488392940}, "language": "english", "review": "Honestly, I wish I could recommend this game, now that the full DLC pack is on sale.  It has so much potential, but by level 16, I can honestly say that HtS2 is frustrating in some curious ways that I cannot really get around.\n\nFirst, off, my first 10 levels were a total blast.  Unfortunately, this is due to the fact that I was shamelessly spoiled with DLC content that actually made the game faster and funner than it actually is in reality.\n\nI have never seen a game that essentially punishes you by leveling ever before.  The zombies, the same ones you see at level 1, become more and more terrifying as you level and they essentially out pace your skills and gear (choice of ... can we say play style?) until you can get past the hump levels where new unlocks let you get the next upgrade of your weapon choices.  \n\nSure, you can keep swapping between weapon types, favoring the weapon that just simply does the most damage at that level, but that defeats the point of having different types of weapons.  I wanted to use fast melee weapons and assault rifles.  Well, mostly, I got hooked on the play style of those weapons because I got the DLC packs in the bundle and was rewarded with some lovely swords and a great assault rifle.  Soon enough, I had to switch the melee out to slow, clunky enormous hammer like objects just to get the job done.  \n\nThen ... I am not sure when ... my assault rifle went from 1 unaimed shot kills to 2 to 3 ... and aimed shots have now reached two head shots to kill the same stupid zombies I was shooting from day 1.  I had totally enjoyed the hell out of the first 10 levels due to the DLC content, but it turns out, I was playing a drastically skewed version of those levels due to this gear.  Now, I wouldn't normally complain, but at level 16, with all of the skills upgraded and the best assault rifle I can have (same one since level 1) it takes more bullets and more running around in circles than ever before to do ... THE EXACT SAME THING.  \n\nReally uncertain why they couldn't smooth out the progression a little better on gear upgrades and/or make the zombies level at a little more in line with your own progression of skill/gear.  I am terrified of levels 17-20, then, supposedly, at that point I can make a new assualt rifle ... but good grief, just gathering supplies for those three levels will seriously suck ... mostly (see below).\n\nPro tip ... keep a local game with a lower level camp so you can farm the basics on the main map, which will stay at your camp level, not your character level.  This is of course ridiculous ... you shouldn't have to feel like swapping to another game to gather some freaking wood and the even more elusive braided rope (my own personal hell grind).  To overcome the obvious problem of being a mule, you can at least store crap in your bunker chest and have that crap follow you between your camps ... this probably being one of the obvious reasons why that is true.\n\nTo facilitate your grind, you can lower the difficulty level of quests (unless they started at your level), and well, you would be insane not to ... otherwise gathering some sheet metal will take serious fighting every time.\n\nAnd honestly, this is the only time I really enjoy the game, when the quest is a few levels below me, because it makes killing the hordes of zombies actually FUN, rather than a repeating struggle.\n\nWhich leads to the next complaint.  Can we say grind grind grind grind grind grind grind grind grind.  You will run all over the main map to gather wood, plants, and rope (... wtf) a billion times.  It is not a big map.  It gets old ... real fast.  You will also play 1/4 - 1/3 of the missions over and over until you want to cry ... just to get enough junk to upgrade your armory in hopes of getting a weapon upgrade to stem the ever growing pain of the zombies that level better than you do (and then to find that there is nothing useful in the next 3 building upgrades that you grinded your brains out for).\n\nI guess it is worth mentioning here that you will spend countless hours running through buildings and unlocking doors (which takes time) finding absolutely nothing ... which really starts to get on your nerves when you have run through a thousand empty rooms.\n\nAdd to this the senseless deaths that can suddenly happen from a couple, semi-glitchy zombie deer that will decide to charge and gore you the moment you are running in circles to shoot the ever more intense \"basic\" zombies.\n\nAnd the UI just feels ... clunky.  I am already simply exhausted with there being no keymap to transfer ALL of an item to your trunk (which you do constantly).  You drag, drop, and then move back to modal window and click OK ... that last part makes this a tremendous chore when you have heaps of stuff.  Let's not even go wild here and suggest that there be a transfer ALL \"other\" inventory into trunk ... or the awkwardness of the space bar being your sprint ...\n\nAnd speaking of sprinting ... walking in the game is utterly slow and painful, but sprint costs you stamina (which is a minor problem as you progress), but sprinting will cause you to also jump onto and over things ... making sprinting around the game, especially inside cities, somewhat obnoxious as you are constantly running over beds and furniture (and waiting for the associated graphics to complete) and often accidentally going over a balcony when sprinting along the decks of buildings.\n\nIt would be amazing to have an actual JUMP action that did those things (console nerf?) ... I know, crazy, right?  Games have been doing jumping for a long time ... it is awesome stuff and keeps your ACTION game action feeling.  Who the heck wants to watch your character slowly lumber up onto a bed (that you hit by accident while sprinting through another empty room) ... and then not even be able to jump on it!\n\nThe graphics are very good, but there simply aren't enough of them ... all around.  More character customization would be nice, along with just more gear in general (for both progression smoothing and vanity slots).  Less re-use of the same basic map designs and elements across the types of maps would be awesome, (city, cementary, woodlands, farm ... that is it by level 16).\n\nThis game is really close to being more fun than not ... really really close, but it is just a repeating time sink that makes you cringe every damn time you level!?!?!?  I understand that some people are OK with the grinds and the challenge that the game presents, but I honestly think most people perfer to play a game where they don't get punished by leveling for 75% of the levels and want \"trash\" mobs to be \"trash\" mobs ... not suddenly twice as many bullets to kill and run faster than a rabbit on crack!\n\nEssentially, you play the same game, over and over and over and over in a way that puts Diablo franchise to absolute shame in content re-use.\n\nSuggestions:\n* Better gear/skill progressions.  Weapon upgrade mods to add more damage every 2-3 levels and the damage based skills should be beefed up a little.  With the ammo upgrades every 5 levels (or whatever) and weapon upgrades (per type) every 7 (it seems), this should smooth out the curve.\n* Zombies should level slightly less than you and add more types of special zombies to keep it interesting.  Blasting away hordes of zombies should remain satisfying, not become frustrating between upgrades.\n* Let player remap the sprint key.\n* Add JUMP!!!  Get rid of that silly sprint auto-climb\n* Add a key map for \"OK\" on transfer quantity window.\n* Add a button to transfer all \"OTHER\" to trunk.\n* MORE maps and variety\n* MORE character vanity stuff\n* MORE gear ... 16 levels and excluding the DLC hats, not much armor, for example, and not a lot of upgrade choices\n* Some documentation on what stats actually mean (I haven't found it ... ).  What is \"Damage Reduction\" versus \"Damage Blocking\" ... ??? That sounds the same.\n\nP.S.  The zombie turkeys are freaking awesome.", "timestamp_created": 1488399914, "timestamp_updated": 1488478304, "voted_up": false, "votes_up": 68, "votes_funny": 1, "weighted_vote_score": "0.818342864513397217", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "48739801": {"recommendationid": "48739801", "author": {"steamid": "76561198027852936", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 13958, "playtime_last_two_weeks": 0, "playtime_at_review": 8187, "last_played": 1559162574}, "language": "english", "review": "As a fan of How To Survive 1, I am enjoying this sequel.  There are quite a few changes from the first game.  Less linear play, more of an open world feel that you can explore with tons of quest-dungeons you can do with several NPCs along the way, and repeat if you feel the need to.  The food and water system can make it incredibly difficult when you first start, until you realize there is an abundance of food on the map when you figure out where to look (it's not nearly as bad as some make it out as far as food availability, exploring the camp map after the first 2 quests can prove very fruitful early on).  I wouldn't say HTS2 is harder than HTS1, not by a long shot, but you can adjust some of the difficulty by choosing to do quest dungeons 5 levels above you and there is far more to do.  Some weapons can be a bit OP with the right combination of ammunition.  And lots of crafting/camp building to occupy your time.  \n\nSo what are the cons?  There are a couple for me that stand out like a sore thumb.\n\nFirst and foremost, no camera rotation, for the life of me I don't understand anyone making a top-down perspective game doesn't think camera rotation is mandatory.  This creates many scenarios where you have a very short angle on your field of vision, unless you happen to be moving in a direction where the camera is following your back.  These guys aught to be flogged for this.  I have never played a top-down sandbox without the ability to do so.  \n\nInability to pause single player game.  This is pretty silly, you cannot step away from the game without either quitting to the main menu or suspending the process in your resource monitor.  If you do, you continue to consume food and water and risk the chance of being attacked.  Now if you are just hanging around in camp, that's fine, you can just quit to the menu then restart, nothing is lost.  However if you are in the middle of a quest/dungeon mission, you will lose your progress and need to start over.   Really guys, no pause?  \n\nResources are really plentiful, dare I say too plentiful.  That and quest replayability makes it fairly easy to get whatever you need with a very little bit of elbow grease.  Ammunition is pretty easy to manufacture once you have a few levels on your armory.  Arrows are reuseable if you collect them.  You should never struggle for resources in this game.  This lends itself to making the game easier than it should be.  \n\nBut overall, I think it has some decent replayability.  And Kovac, as always, makes for great apocalyptian company.  It's still a fun zombie RPG hack and slash, albeit not as challenging as it could be.  And if you've ever wanted a bow that shoots like a semi-automatic, this is it.  Pick up the dynamite DLC too.  Also important to note: To play in fullscreen (as you will not see the option) open the launch configuration and select it there before starting the game.\n\n\n\nNow, what is up with all the pink toilet paper? And why lock all the bathroom doors?!", "timestamp_created": 1549217437, "timestamp_updated": 1549843582, "voted_up": true, "votes_up": 46, "votes_funny": 1, "weighted_vote_score": "0.815733253955841064", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23406482": {"recommendationid": "23406482", "author": {"steamid": "76561198015781416", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 5430, "playtime_last_two_weeks": 0, "playtime_at_review": 5160, "last_played": 1469233297}, "language": "english", "review": "I honestly really like this game, even as Early Access.\n\nUpdates are coming out regularly, and the game is getting better and better as it's fleshed out more.\n\n[h1]I'd recommend this game if you like:[/h1]\n[list]\n    [*]Zombie games\n    [*]Top down shooters\n    [*]Diablo-style games\n    [*]Crafting!\n    [*]Base building\n    [*]Base defense\n    [*]The fun of actually having to work to get better gear!\n    [*]Running away from massive zombie hordes you accidentally aggro'd because you forgot to attach a silencer to your gun\n    [*]ZOMBIE DEER OH GOD WHY\n[/list]\n\n", "timestamp_created": 1465155390, "timestamp_updated": 1465155390, "voted_up": true, "votes_up": 132, "votes_funny": 60, "weighted_vote_score": "0.79720008373260498", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "88784888": {"recommendationid": "88784888", "author": {"steamid": "76561198016046767", "num_games_owned": 0, "num_reviews": 1614, "playtime_forever": 1756, "playtime_last_two_weeks": 0, "playtime_at_review": 1756, "last_played": 1616266635}, "language": "english", "review": "I'm not gonna lie the first one was more interesting and more of a story driven adventure, this one goes for a sort of psuedo sandbox setup that at times seems neat. \n\nThere are plenty of things to do and if you are ok with mostly guiding your own adventure or if you have a group that helps to keep things interesting. \n\nIf that sounds good to you then this game can actually be a good bit of fun, otherwise I would recommend trying the first game.", "timestamp_created": 1616268158, "timestamp_updated": 1616299419, "voted_up": true, "votes_up": 43, "votes_funny": 0, "weighted_vote_score": "0.785748660564422607", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "22801286": {"recommendationid": "22801286", "author": {"steamid": "76561198039394097", "num_games_owned": 0, "num_reviews": 146, "playtime_forever": 1120, "playtime_last_two_weeks": 0, "playtime_at_review": 757, "last_played": 1576050673}, "language": "english", "review": "So after playing a few hours alone, I can say I like it! And so begins the list of why\n\nPROS AND CONS\n\n-Much better graphics than the first game, and much bigger areas to explore. No more claustrophobia or \"Why cant i mount this ledge or move past this thing\" Anything that sensibly could be traversed in reality can now be mounted or jumped off. While inside buildings, you see through a \"Hole cut\" system where the forground disappears, which is great because now the game can have interiors and other sequences the first didnt have, these all lead to super pleasing environments.\n-Every mission has its own environments and you can replay them all for loot or fun\n-Much more \"Walking dead\" and much less \"Dead island' feel to this game, the forests and cities are much more friendly to my idea of what a zombie game should be like. Night no longer brings creepy lunatics who are afraid of light (At least not constantly, they however can occasionally appear), clearing cities at night is spooky and can make you jump, the amount of zombies is reduced from 1 but they are more lethal and you have to play smarter, which I prefer. In the first game it was always a \"How many times can you empty the clip on your nerf gun\" feeling, wheras in this one its like \"Pick and choose your targets and sneak, and be ready for a zombie behind every door\" \n-Kovac.... Just... Kovac\n-After playing till i got a gun, i can confirm they are no longer air powered, long story short, they are handmade guns that sound like guns and take bullets and hurt things, not a supersoaker that magically shoots bolts and nails. and yes, they are loud and will attract walkers, very Walking dead feel to using your gun in this game. The guns are all homemade and as such have \"Interesting\" appearances, but not \"Silly\" anymore. The other weapons, bows and such, also got a sexy new look and upgrade that I love. \n\nNow, on to what I DO NOT like so far. \n\n-The menus are an utterly horrendous mess, hopefully this will be fixed later, you have a seperate menu on seperate keys for every single menu you can access, this needs to be replaced with hotkeys to parts of a central menu with subsections. \n-The camp system is cheesy and feels really pointless considering you are camping about 4 feet from Kovac's massive safe bunker, This could really use some expansion and more \"Reason\" to do it rather than because kovac told you to do it and wont share his bunker, Id prefer having environments to choose from rather than just putting it up in the generic woods you start in, give us options to use that dont make it so its a 20-mile jog to kovacs bunker and by proxy literally 90% of the quests. \n-Farming for materials is what will be the death of this game, the monotomy is toxic, enter mission, look for random drops, find 1 or 2 of your item, redo mission, repeat. This needs to be made more fun.\n\nAnd Last, what I want to see develop as the game moves out of early access.\n\n-The customization menu needs to be much more comprehensive and have many more options. Instead of having \"male body A\" and \"Male body B\" have the same look but different pants (I assume this is planned anyway) \n-While I love the fact every mission environment is now its own Cell and you dont have to walk to each of them, having more places to explore when not in missions would be nice, the forest is beautiful but it has like, 4 landmarks to explore. \n-A menu to select already done quests so you dont have to remember/run to the guy who gave it every time you want to redo it for materials. \n-If more areas are added in the future, instead of making us build near the bunker entrances, just let us place one in the environment?\n-Current finishing moves have three choices, 1 and 2 are generic and dont care about the weapon, and 3 is weapon specific (Some weapons have more, such as the bat) but expanding on these and making it so the weapon finishers happen more would be nice! Also, I cant get my arrows back when i use my bow in a finisher, i assume this is a bug. \n-In a game like this, modding support seems like it could be both possible and potentially amazing, Id love to see this happen with custom missions and gear. (I assume this would be possible because the Cells you do missions in Feel like they were created by a mapmaker type software, instead of each being \"hand made\")\n-I really REALLY like the creepiness some of the night missions give, adding a thicker more terrifying horror element to these missions would be amazing. Im not talking H2S style \"Creepers in the dark\" Im talking somethat that legitimately will make you sit in a building and not want to open a door, or go back outside or things of that nature. (All the pictures of slenderman on the walls help with the mood!) \n\nAll in all this game is an improvement on the first in almost every regard, and is supposed to just get much better, I look forward to seeing where it goes! Im gonna hop into the beta branch and Put what I find below and try to update it\n\nBETA INFO\n-TO BE LOGGED-\n\nARGUEMENT ADDRESSING SECTION THAT WILL MAKE WHINERS MAD\n\nOpposing Arguement\n-The first one actually had a plot! This one doesnt! BLAH, this one also looks worse! \n\nMy arguement\n-What H2S did you play exactly? I remember running around on islands that all look the same doing quests that had no points with the general goal of leaving at some point. All the quests were \"Go get A, bring it to B\" in the first and most in the second are similar, except all the quests in 1 were confined to each island wheras in 2 they each have a custom made Cell to pursue them in. This game also has fricken gorgeous environments by comparison to the endless sand of 1. \n\nOpposing Arguement\n-This game is so buggy, ive got stuck on X,Y, and Z objects a thousand times!\n\nMy arguement \n-I have not gotten stuck on a single thing once in all my playtime, cant really help ya there, this game is surprisingly bug free. \n\n\nIf I see other opposing arguements in reviews, I will gladly address them here, also feel free to ask about anything in the comments if you need more data before you buy!", "timestamp_created": 1462398204, "timestamp_updated": 1464920644, "voted_up": true, "votes_up": 47, "votes_funny": 2, "weighted_vote_score": "0.778394341468811035", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "80055764": {"recommendationid": "80055764", "author": {"steamid": "76561198122878553", "num_games_owned": 0, "num_reviews": 134, "playtime_forever": 125, "playtime_last_two_weeks": 0, "playtime_at_review": 125, "last_played": 1606352498}, "language": "english", "review": "If you liked the first one, replay the first one.", "timestamp_created": 1606352579, "timestamp_updated": 1606352579, "voted_up": false, "votes_up": 49, "votes_funny": 21, "weighted_vote_score": "0.770904779434204102", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "19594856": {"recommendationid": "19594856", "author": {"steamid": "76561198038687296", "num_games_owned": 0, "num_reviews": 21, "playtime_forever": 1922, "playtime_last_two_weeks": 0, "playtime_at_review": 1065, "last_played": 1472850736}, "language": "english", "review": "[h1]10/DEC/2015[/h1]\nDevs didn't change the button marks yet. So if you're using keyboard & mouse, it could be a little ambiguous when you first start the game. Just remind these keys below, then you won't have any significant problem during the play.\n\nX - Open Crafting & Inventory Menu\nC - Open Construction Menu\nSPACE - 'Next' in Dialogue\nESC - 'Skip' in Dialogue\n\n[h1]First Glance[/h1]\nI saw some negative reviews here, so I was a bit unsure whether I should purchase this game or not. However, most of the reviews are about miscellaneous minor bugs. I don't mind much about them because I believe Devs will try their best to fix those bugs as they did in HTS1.\n\nI had to purchase the game only based on HTS1, and my concern was mainly about the quality of the content itself. As of the moment, I think this game is fairly worth to invest.\n\nNow in HTS2, you can explore 2nd, 3rd story buildings in the field. You can make various weapons, armors, modules, portions, foods, and many more. And these items can be obtained only in Foundry, Chemistry Lab, Workshop, and etc, which all comprise the whole level system. There are some new types of animals using different moves which forces you to use different tactics. Also the way of proceeding quest lines has completely changed.\n\nHTS2 has some unique essentials, and they didn't just duplicate the former version of the game. They know what they are doing, and I feel somewhat obligated to support them. I just want to see how the next 3rd, 4th HTS goes. Most people who enjoyed HTS1 will understand what I mean.", "timestamp_created": 1449721533, "timestamp_updated": 1450149774, "voted_up": true, "votes_up": 51, "votes_funny": 3, "weighted_vote_score": "0.764590799808502197", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "29522486": {"recommendationid": "29522486", "author": {"steamid": "76561198047460864", "num_games_owned": 3167, "num_reviews": 100, "playtime_forever": 7407, "playtime_last_two_weeks": 0, "playtime_at_review": 7403, "last_played": 1533404964}, "language": "english", "review": "Do you like : Zombies ? Survival games ? Camp construction and defense ? Crafting weapons or armors ? Having fun with your friends ? Kovac ? Evolving with a character in an apocalyptic world ? If you answered \"yes\" to the previous questions, you should definitely play How to Survive 2.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=816482052\n\nUnlike the first game, there isn't a storyline or an open world : it's a limited area of modest size full of zombies, wild animals and resources, where you can build and enhance your camp. Then you'll run accross several NPC who'll give you various kind of quests in instances : find resources and items, rescue people, kill infected, investigate, etc. As in any self-respecting RPG, you'll get experience to improve your character, the camp and your skills. There are melee and ranged weapons and you have the possibility to craft food, potions or gear. You'll have to be cautious though, pay attention to your health, hunger, thirst and ammunition. As in the first game, you'll have to manage to craft everything you need by yourself, assisted by Kovac himself of course !\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=775274215\n\nHow to Survive 2 is a very fun apocalyptic game to play alone or preferably with friends and has hours of gameplay to offer. I regret the lack of chain saw or flame thrower and want to point out that sometimes the game can be repetitive or almost boring if you have to farm resources or experience. There are various DLCs offering special weapons, skins or additional quests.", "timestamp_created": 1485531148, "timestamp_updated": 1526673753, "voted_up": true, "votes_up": 40, "votes_funny": 2, "weighted_vote_score": "0.760837972164154053", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "74508277": {"recommendationid": "74508277", "author": {"steamid": "76561198046056362", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 32, "playtime_last_two_weeks": 0, "playtime_at_review": 32, "last_played": 1597759864}, "language": "english", "review": "Nothing like the first game. Rather than story with islands to explore, Its just missions that dump you in another map.\nCombat feels weak the map is annoying to use and the menus are ugly as hell.\nOverall unfinished feeling to it.", "timestamp_created": 1597760248, "timestamp_updated": 1597760248, "voted_up": false, "votes_up": 29, "votes_funny": 1, "weighted_vote_score": "0.757616162300109863", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "32619102": {"recommendationid": "32619102", "author": {"steamid": "76561197966983580", "num_games_owned": 0, "num_reviews": 51, "playtime_forever": 1358, "playtime_last_two_weeks": 0, "playtime_at_review": 1254, "last_played": 1498586933}, "language": "english", "review": "I have not tried the multiplayer but this game begs for being played as singleplayer\n\nThis game looks fun and plays alright but in fact there are much to be desired\n\nThe basebuilding is just a joke, slapped on without much consideration.\n\n- No NPC's to defend with or anything (it is you, alone, without any AI at all)\n\n- Radio tower to \"bring in\" other survivors, which only function is to trigger a base attack... and without NPC's, your base will be wrecked.\n\n- Misleading quests notices (you will waste alot of time on that account).\n\n\nwhich leads me to the crafting\n\n- it is a freaking chore...\n\n- it is solely dictated by the levels on your buildings (armory ect. ect.) \n\n- all these buildings could be slapped down to 1, if not because of the none-filter menu which gets very long at some point. (prepare to scroll alot)\n\nThe leveling system is bulky and wierd.. be sure to constantly to level up the pointless \"camp level\" and \"player level\" equally...\n\n\n\nThen about the trailer videos:\n\nAre for multiplayers only, the extended base defending is not what it is laid out to be..\n\nThey should make it clear that there is a huge elements missing from the singleplayer to multiplayer, it is misleading af.\n\nall in all, i feel tricked by the trailers. All the cool things you see, is not actually going to happend in singleplayer at all...", "timestamp_created": 1498055463, "timestamp_updated": 1498055463, "voted_up": false, "votes_up": 157, "votes_funny": 8, "weighted_vote_score": "0.752325296401977539", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "40223543": {"recommendationid": "40223543", "author": {"steamid": "76561198182729635", "num_games_owned": 247, "num_reviews": 87, "playtime_forever": 752, "playtime_last_two_weeks": 0, "playtime_at_review": 752, "last_played": 1509313089}, "language": "english", "review": "===[ ❤ Audience: ]=== \n☐ Kids\n☑ Everyone\n☐ Casual players\n☐ Pro players\n\n===[ ☼ Graphics: ]=== \n☐ Potato\n☐ Really bad\n☐ Bad\n☑ OK\n☐ Good \n☐ Beautiful \n☐ Masterpiece\n\n===[ $ Price/quality: ]=== \n☐ Full price\n☐ Wait for sale\n☑ Average\n☐ Refund it if you can\n☐ Don't do it\n\n===[ ☣ Requirments: ]=== \n☐ 90' PC\n☑ Minimum\n☐ Medium \n☐ Fast\n☐ High end \n☐ NASA computer\n\n===[ ☼ Difficulty: ]=== \n☐ You just need 2 arms \n☐  Ez\n☑ Easy to learn / Hard to master \n☐ Hard (first few hours)\n☐ Reksio\n\n=== [ Ⓚ Category? ] === \n☐ Chill and relaxing game\n☐ Serious game with roleplay\n☑ Hard stressing game\n\n===[ ۞ Game time/length ]=== \n☐ Really short ( 0 - 2 hours)\n☐ Short ( 2 - 8 hours)\n☑ Few hours ( 8 - 12 hours)\n☐ Long ( 12+ hours)\n☐ Endless\n\n=== [ ツ Character Customization ] ===\n☐ It doesn't have\n☐ Can costumize hair and clothes...\n☑ Okay amount of choices\n☐ Big amount of choices\n☐ Can costumize almost everything\n\n===[ ♬ Story] === \n☐ It doesn't have\n☐ Still better than Twilight\n☑ Average\n☐ Good\n☐ Fantastic\n\n===[ § Bugs ]=== \n☐ Game itself is one big BUG\n☐ Bugs destroying the game\n☐ Lot of bugs\n☑ Few Bugs\n☐ You can use them for speedrun\n☐ Nothing\n\n===[ ✦ Others: ]=== \nMultiplayer: Yes\nSingleplayer: Yes", "timestamp_created": 1519047179, "timestamp_updated": 1519047179, "voted_up": true, "votes_up": 142, "votes_funny": 9, "weighted_vote_score": "0.75203239917755127", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "26173511": {"recommendationid": "26173511", "author": {"steamid": "76561198059783270", "num_games_owned": 187, "num_reviews": 35, "playtime_forever": 4618, "playtime_last_two_weeks": 0, "playtime_at_review": 2313, "last_played": 1680835235}, "language": "english", "review": "Here's my pros and cons;\n\nPros:\n[list]\n[*]Online coop multiplayer expanded to 4 players (16 if there's 4 local players each client)\n[*]Online multiplayer, players does not need to be on the \"same place/screen\" like on the first game.\n[*]Lots of places to explore\n[*]Lots of quests\n[*]New enemies\n[*]Lots of items to craft\n[*]Camp system (very nice)\n[*][spoiler]The aliens![/spoiler]\n[*]References to the first game\n[/list]\n\nCons:\n[list]\n[*]Quests on \"raid\" system it's a crap\n[*]DOES NOT HAVE A CHAT SYSTEM (a simple texting, come on...), if you want to communicate with your friend you will have to open up the steam chat box. If you are not friends with the other players, you're ****.\n[*]Craft system aren't so nice as the first game was\n[*]Too boring to level up things and craft items, as you have to play quests over and over again, and then the quests start to bore you. This way collecting items aren't so natural as it was in the first game.\n[/list]\n\nIt's a very nice game to play [b]with your friends[/b]. I recommend it (not in the full price tho)", "timestamp_created": 1477183331, "timestamp_updated": 1498831566, "voted_up": true, "votes_up": 36, "votes_funny": 4, "weighted_vote_score": "0.746601998805999756", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "44175524": {"recommendationid": "44175524", "author": {"steamid": "76561198154419374", "num_games_owned": 167, "num_reviews": 14, "playtime_forever": 9177, "playtime_last_two_weeks": 0, "playtime_at_review": 3959, "last_played": 1612389856}, "language": "english", "review": "So, I definitely do reccomend this game. but not to everyone.\nAnd. this review will have informaton, but expect it to be all over the place. GOOD LUCK!!\n\nSo, this game is fairly expensive, for what it is. You will NOT get what you paid for in the combat department of this game. yes there are a fair amount of ways to fight. and a small collection of weapon families to all keep it a little fresh. but other than those, combat should stay the same the whole game. with you deciding how to play it out against the kind of enemies you are currently up against.\n\nIn the line of weapons. it is the kind of game where, you have your few kinds. example being, you have your sword, your mace, you shield. and you take those along the line of their family tree of weapons. each level will get the job done, and as you progress. you need the next one in line to keep that reliability.\n\nSo yeah. Don't come into this game expecting the combat to make you fall in love. you will mostly just strive to be able to one hit headshot all the zombies. which isn't a bad idea.\n\nThe content side of it. not bad. really, you have alot to do. It may be repetitive. but honestly almost every game is like that. \n\nBut the game has alot in it. mission after mission will fall onto your lap to keep you busy. and this happens all game. with some different events in between.\n\nin this game, you level your world. because your character levels cap is whatever your  worlds level is. but, the zombies will scale with you. actually, before you! they go up with the world level. but you need to do this levelling. missions also start to get restricted off of level. so you have advance. just about eveything in this game is locked by level. \n\nyou reached a new level! go craft that new item!- but wait.\nyou cant craft that. your building isn't a high enough level.\nyou cant level your building. your camp isn't high enough level.\nyou cant level up your camp, because that Russian man decided he wants to test how strong you are every ten levels!\nat least you get your own personal horde spawning device. right? just activate a large wave of zombies on your friends. they should be fine.\n\nSo, really, the game constantly hands you your next objective. keeping you going. and by god it will keep you going. unnlleessss you are playing with a friend. once they aren't online. Don't progress. or they will come online and get slapped by that zombie he swore he could one hit the night before.\n\ninstead, spend that time to try and prepare for progress. collect exp, items. and learn mission maps and different farming styles. \n\nlike running around the map for a whole hour to collect wood, while you miss every single shot on the rabbits that will bolt the second their spidy senses notice you came in their proximity, even though you are behind them- evolution treated those little things well.\n\nbut hey. multiplayer is also where alot of this games fun comes in. when you get downed, that just sucks. but when your friend goes down, it is suddenly one of the most entertaining things in the world. and your head begins flooding with jokes you can taunt them with.\n\nor, you will just have your little dlc bird, running to the downed friend, saying 'I need healing' from the popular first person shooter TF2's character Genji. then instanty revive them. because you will quickly learn that the DLC in this game is OP AF. ranging from giving you a pack themed helmet, to the pet and the weapon that will be all the more useful. \n\nthat giant hammer? it sure does hit hard. go run into a horde with your confidence, then give a polite thank you to your friend that revived you. or a fuck you, depending if their head was as full of jokes as yours!\n\nit's fine though. just after they call you bad, you accidentally shot that exploding zombie that they were standing near. hey, they forgot to heal.\n\nbut. try to keep your toxicity to a minimum. and your world to private! friends and randoms alike will gladly gank all the loot from your public chest. if you can have a trust system in order. and keep a secure world from randoms. feel free to drop everything into that public chest and enjoy the ever so convenient crafting it brings.\n\nMaybe I should more things that matter. controls! find out yourself-\nthey are your basic wasd for movement, unless you decide to use controller. then that's on you man. \nmovements can sometimes be a problem. sometimes you can glide across the ground gracefully by spamming your aim key in the direction of where you are moving. \n\nother times you just wated to turn around. but you're so damn eager you hit sprint and send yourself into the enemies so fast you cant escape. or you start vaulting all the counters in the world, because hey, your feet can pick up items too. I think. not that is matters.\n\nmelee hitreg can sometimes be a problem. the way the camera is makes you think you will smack something, but you may smack two. OR you will miss. and be the one to get slapped. but once you get the hang of it, you can enjoy the very under rated, and entertaining style of melee combat.\n\nguns will lock onto an enemy, if you keep your mouse close enough to them. and after a few moments it will charge a headshot. and you can watch your friend stagger the same enemy they was so damn sure they could headshot last night. and then they will panic. because you can only shoot your gun when you are actually aiming down the sights. and when a zombie is so fast that it catches your hand off guard and runs out of the cursor. making your shot hit NOT ITS HEAD. you will have that same enemy on your hands. just alot closer\n\nNPC's are cool. they all have their personalities. I think. if I was ever to read what they said. The only one you will really come to respect is that Stereotypical Russian in his not so shining armor. \nor most of the time. until he yoinks your controls away to tell you that you should really eat. while you continue to be smacked by that zombie because you cant exit the menu despite your panicked clicking. AT LEAST YOU TRIED! hope fully that mission wasn't Elite. because if so. back to the start! or. you will hear something about needing healing as the mystical blue bird approached you. but wait. someone is carrying it? psshh- nah. that peasent is just its caretaker. we all know the one with the revival bird doesn't have feelings.\n\nWell. I don't know what else to ramble about! I hope this gave you a little insight to not only some of what the game has to offer. but what to expect player wise. if you are interested, buy it and enjoy!. if not, I hope this was somewhat entertaining to read! \n", "timestamp_created": 1534371805, "timestamp_updated": 1534371805, "voted_up": true, "votes_up": 34, "votes_funny": 7, "weighted_vote_score": "0.746136486530303955", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "97097913": {"recommendationid": "97097913", "author": {"steamid": "76561198846079591", "num_games_owned": 0, "num_reviews": 39, "playtime_forever": 291, "playtime_last_two_weeks": 0, "playtime_at_review": 291, "last_played": 1602121226}, "language": "english", "review": "I don't know what to really say about it. It's not a bad game, nor is it a really good game. It functions well enough; I haven't seen a bug. It's just not really that fun. It's the kind of game you might play again, but you aren't sure if you really want to.", "timestamp_created": 1628328832, "timestamp_updated": 1628328832, "voted_up": false, "votes_up": 40, "votes_funny": 4, "weighted_vote_score": "0.744042396545410156", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "19154095": {"recommendationid": "19154095", "author": {"steamid": "76561198084253815", "num_games_owned": 791, "num_reviews": 64, "playtime_forever": 583, "playtime_last_two_weeks": 0, "playtime_at_review": 241, "last_played": 1493937766}, "language": "english", "review": "[h1] Intro - About [/h1]\n\tYou start out as a surviver, a surviver that has been given an opportunity to be helped by another, that has a good bit of knowledge of surviving in this horrible apocalyptic wasteland that once was a beautiful world we call Earth. This strange man gives you tasks to help him help you and along the way you will find loot such as weapons, gear, armor, food and items to craft with. Set up a camp to help you store your unused items that are only weighing you down to continue forth and gather more materials to help you survive against terrifying zombies that are hoarding areas and building all for themselves. Build the best weapon to create the most devastating hits, and clear out your path to get to you objective safely. \n\n[h1] Get to know the game [/h1]\n> Great wasteland/broken down villages and buildings\n> Crafting your own items from looting killed zombies or just things laying around\n> Play the story with a friend\n> Free roaming is just as fun as the story\n> Different weapons and armor stats increase or decrease\n> Brutal devastating hits\n> Break doors down to get inside houses\n> Gives a cool old school retro aspect of the year your in\n> Intense sistuations\n\n[h1] Pros & Cons [/h1]\n++ [b] Pros [/b]\n+ Great graphics\n+ Co-op\n+ Free roam\n+ Customization\n+ Detailed story\n+ Gore\n+ Easy controls\n+ Realistic\n+ Suspenseful\n+ Controller compatible\n\n--[b] Cons [/b]\n- User interface is uneasy to control (learn)\n- Slow at times\n\n[h1] Summary - Non Spoiler [/h1]\nYou are a surviver that gets help from another surviver that knows a lot about how to survive and guides you through missions and quests. He teaches you how to get things done. Along the way while doing these tasks or even just free roaming, you may find loot. You can find loot just about everywhere. Find items to help you craft better weapons and armor and increase your stats to help you survive longer. You can also craft a camp to help you store away items that you don’t need right away. Items have weight and can weigh you down and make you slower. Being over encumbered and becoming slower will greatly increase your percentage of death. Zombies may seem slow but do not take them for advantage, they will come from all directions, around corners and in hordes. You must make common decisions whether or not you should just stay and fight them off so you can reach your objective or quickly run and hide it out or find a safer way. This is not, just your usual zombie game where you can just plow your way though 100‘s of pounds of rotting meat. This game is realistic when it come to violence and you must proceed with caution. Be very strategic about you go about killing these monsters if you do not have the right medical equipment on hand.\n\n[h1] Personal Opinion [/h1]\nThis is a great game and will be getting more to play with friends! The great graphics and story line are amazing and cant wait to live the zombie struggle in co-op mode! It makes it a hundred times better that I can craft my own camp that I can share with my friends and store away items that I don’t need that moment. The fact that its a free roam add to that great feeling of abandonment and the only way to survive is craft eat and drink! This is one of those good wasteland survival games but with a whole different view and great compatibility with the users.\n\n[h1] Final recommendation: [/h1]\nI deffenetly recommend this game to others! This game is great to play with friends so you may destroy countless zombies together and achieve survival with your buddy! I rate this game 8.5 mainly because the menus are a little hard to control and not many options to optimize your game. Not a big fan of the birds eye view, which they did a fantastic job of doing by the way, but makes it a little...distracting at first. I did not find a lot of cons about this game. Overall it just mainly needs a user friendly interface to let the user get in and out of the menus easier and quicker.\n\n\n[i] If you found this review helpful and want to see more recommended games, be sure to follow our curator group:[url=http://steamcommunity.com/groups/Original_Curators_Group#curation] Follow here![/url]", "timestamp_created": 1447905302, "timestamp_updated": 1447978220, "voted_up": true, "votes_up": 50, "votes_funny": 1, "weighted_vote_score": "0.742940843105316162", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "30603945": {"recommendationid": "30603945", "author": {"steamid": "76561198082584426", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 7859, "playtime_last_two_weeks": 0, "playtime_at_review": 7752, "last_played": 1508475829}, "language": "english", "review": "Completely different from the first How to Survive game so don't play this thinking it'll be similar. How to Survive 2 focuses on building a base and that's all... Fuck this I'll just do pros and cons:\n\nPROS:\nBuilding a Base\nKiller Rabbits\nCheap game even with all the DLC ($25ish)\n\nCONS:\nNo in-game chat\nRe-used resources\nNot many different structures to build a base with (Like only 25 different structures)\nPoor Inventory management system\nLimited weapon types (4 types of melee, 4 types of range, and grenades)\n\nThis game would be great if there wasn't such a high focus on multiplayer yet lacking an effective way of communication. There is an in-game chat wheel but it barely covers the barebones, much like MH4U's chat system during a hunt or worse. Also, very limited post game content, quite literally once you have completed every quest in the game there is no point in continuing unless you're grinding for resouces to build the perfect base of some sort. AI behavior is very predictable, including spawn locations and time (so as long as you have half a brain). Many of the complaints found in the forums are because people lack the ability to process information logically, at the same time being able to think will kill the enjoyment of the game quite easily. Lastly even when playing with other people, both irl and online, there is a lack in feeling of accomplishment and cooperation, zombie hoard attacks are player initiated and lack of customization to camp names and player avatar makes everything feel very... bland. Even with all that said I can not deny that I was able to get 100+ hours of game play out of it, if I truly hated this game I wouldn't have bothered though disappointed now that I'm finished with it, still a good game and definitely worth the money.", "timestamp_created": 1489883238, "timestamp_updated": 1489883238, "voted_up": true, "votes_up": 34, "votes_funny": 1, "weighted_vote_score": "0.73885500431060791", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "50439322": {"recommendationid": "50439322", "author": {"steamid": "76561197969749884", "num_games_owned": 2459, "num_reviews": 1422, "playtime_forever": 41883, "playtime_last_two_weeks": 0, "playtime_at_review": 41883, "last_played": 1556820282}, "language": "english", "review": "How to Survive 2, while trying to be better than the first game, only manages to do so in some regard, most importantly in the multiplayer department. While  a lot of the game feels a lot more compartmentalized due to quest hubs and \"away missions\", coop is where this really shines. It's just so much fun to run rampant with a few friends. Graphically the game makes a huge step forwards compared to the first game, combat mechanics are precise and mostly fair, crafting is fun.\n\nThe main downside being quite a boggy grind as well as the RPG element being too strong in there, meaning that some weapons simply won't do any damage whatsoever after a certain point due to being entirely outscaled. This wouldn't be that bad if it wasn't for the fact that quest-enemies scale linearly with your character level and you might actually be better of not to invest your XP into new levels if you haven't gotten better gear yet. Not particularly the best design choice, but manageable if you know what you need to play around with.\n\nThese minor flaws aside, I had a helluva time with How to Survive 2.", "timestamp_created": 1556820794, "timestamp_updated": 1556820936, "voted_up": true, "votes_up": 26, "votes_funny": 3, "weighted_vote_score": "0.732214808464050293", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23627308": {"recommendationid": "23627308", "author": {"steamid": "76561198002973360", "num_games_owned": 1137, "num_reviews": 11, "playtime_forever": 2398, "playtime_last_two_weeks": 0, "playtime_at_review": 922, "last_played": 1645765120}, "language": "english", "review": "Well, in comparison to the first How to Survive, this one shows a huge development, it's still in early access and new contents are being made but the game so far is incredible fun to play with. \n\nYou can build things like a trunk to act as a settlement, to store things there to be used on upgrades or even to craft others items such as bandages or even pistols. Players can contribute with their spare EXP to level it up, a player can't level themselves any higher than their settlement, meaning that the game will request a cooperation, a maximum of 4 players can help each other on missions that can be changed to be harder or easier, the higher the difficulty, the more EXP they will give.\n\nPlayers will need to eat and drink to survive, a kitchen allows them to cook better food, allowing for a better recovery of those needs, if a player is thirsty they will face longer times to aim at the enemy and if they are hungry they will have a hard time to hit an enemy strong enough to give a good damage.\n\nThe enemies are no different, zombies that wants to kill you, but the nice thing is, a normal zombie is only normal until you provoke them, a zombie can be either slow or fast, very fast, and you can find yourself in deep trouble if a fast one starts to run at you and you are still reloading your rifle or you crossbow. Oh, and don't forget that your weapons produces loud sounds when you shoot, so use your rifle/pistol wisely, in a time you won't bother too much with that, firepower is needed to kill those zombies, just make sure to know your enemy first.\n\nWant bullets? Craft them with gunpowder and lead pellets. Want some good food? Cook them at the kitchen using foods you find on your quest, mixing those poor quality foods to make a high quality one!\n\nHow to Survive 2 is, so far, nice and comfortable to play, so far the game proved to be interesting as you can defend your base with barricades and even traps, because killing zombies with bullets and arrows isn't enough when you can put some zombies heads at some good spike traps. Remember, this review is being made at the early access so things can change, but so far so good as they say, or Kovac says...\n", "timestamp_created": 1466232268, "timestamp_updated": 1466232268, "voted_up": true, "votes_up": 37, "votes_funny": 2, "weighted_vote_score": "0.732117593288421631", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "38378209": {"recommendationid": "38378209", "author": {"steamid": "76561198003495525", "num_games_owned": 0, "num_reviews": 82, "playtime_forever": 684, "playtime_last_two_weeks": 0, "playtime_at_review": 684, "last_played": 1513520973}, "language": "english", "review": "Original H2S was a very nice choice for a split-screen cooperative walkthrough. You rarely got bored while moving from one location to another through a crazy storyline.\nH2S2 with its camp building is too focused around grind and collecting a lot of stuff. Spending time on replaying missions to gain food or rare materials is not what me and my friends were expected from the sequel.", "timestamp_created": 1513521699, "timestamp_updated": 1559520957, "voted_up": false, "votes_up": 36, "votes_funny": 2, "weighted_vote_score": "0.729990005493164063", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "22315194": {"recommendationid": "22315194", "author": {"steamid": "76561198172797379", "num_games_owned": 603, "num_reviews": 47, "playtime_forever": 1937, "playtime_last_two_weeks": 0, "playtime_at_review": 814, "last_played": 1489309873}, "language": "english", "review": "I've played How To Survive with my friend and both of us were getting addicted to the first game, by finishing the game in two days.\n\nSo, I've decided to get How To Survive 2 game and play with my friend. We've played this game together for at least 5 hours and we're still find this game as interesting and challenging as the first game.\n\nPros:\n-Character customisation\n-Build your character by using XP to level up abilities according to your own play style-no preset player abilities like the   first game.\n-Nice graphics.\n-No game breaking bugs are found so far.\n-It's getting more interesting when a city or town can be explored and looted.\n-Base building, which can allow players to craft items.\n-The visual of the characters' equipments can be turned off if it's too ugly or it hurts to look at.\n\nCons:\n-When playing local co-op, the camera view of one of the player on the first floor of the building and the second on the ground floor is a mess-I can't see a thing.\n-food is very hard to be found-both my friend and I are currently 0% hunger but with a lot of water.\n-No base capturing like the first one so far.\n-It seems like the players no longer needed to sleep anymore.\n-Lack of proper tutorials to follow-I've to look at the button configuration to figure out what can be done in this game.\n\nNeutral:\n-Monster Hunter style game play - Select a quest and teleport to a place to complete the mission.\n-Leveling up system-each skills need to be upgraded four time in order to aqquire the skill or to increase the level by one.\n\nBugs found:\n-I've found the bug that is - when a player is using finishing move on a zombie, an attack from second player toward the zombie will interrupt the finish. The player still performing finishing move but the zombie is free to attack the player while the player cannot move and being attacked.\n\nEDIT:\n\nHint:\n-Store your can food for crafting after building a Kitchen. A can food can fill your hunger for 10% but if you craft it using 3 can food, you can fill the hunger up to 100%.", "timestamp_created": 1460193864, "timestamp_updated": 1460261076, "voted_up": true, "votes_up": 34, "votes_funny": 3, "weighted_vote_score": "0.723612070083618164", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "36258527": {"recommendationid": "36258527", "author": {"steamid": "76561198024651070", "num_games_owned": 222, "num_reviews": 16, "playtime_forever": 1256, "playtime_last_two_weeks": 0, "playtime_at_review": 1256, "last_played": 1509904680}, "language": "english", "review": "HUGELY DISAPPOINTING\n\nFirst of all I abosolutely loved the first How to Survive. This is a step backward and a massive disappointment. The charm, fun and adventure of the orginal game is completely lost in this one.\n\nCompletely riddle with poor design choices:-\nAtrocious user interface\nTerrible mission progression\nUseless controls, poorly designed even though it's based round the controller its just not fun\nBoring character progression\nCoupled together with too much grinding for a boring experience\nController not configurable in game\nAtrocious user interface (so bad it has to be said twice)\n\nThere is loads more to hate about this game but I wouldn't advise buying it to find them.\nIf this game looks appealing to you I advise buying How to Survive Storm Warning Edition instead.", "timestamp_created": 1509764392, "timestamp_updated": 1509764392, "voted_up": false, "votes_up": 33, "votes_funny": 1, "weighted_vote_score": "0.72233736515045166", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "40511502": {"recommendationid": "40511502", "author": {"steamid": "76561197976665763", "num_games_owned": 119, "num_reviews": 19, "playtime_forever": 8816, "playtime_last_two_weeks": 0, "playtime_at_review": 6439, "last_played": 1701316453}, "language": "english", "review": "Dead Game. No dev support. Very buggy achievements. No in game chat, just simple phrases you select from a wheel. Terrible multiplayer experience. Very grindy, and not a rewarding or fun grind.  There is no food found on the world map, you have to go in mission instances to get food/water. You can find bottles of water in your bunker on occasion, but that's it. Once you get rolling and get a good food supply and level up your survival skills, it gets easier. Until you have that food cache and some skills into lowering hunger/thirst rates, you as a new player will say WTF. You will most likely run around the main map looking for food when all you find are sticks and white flowers, slowly dying of thirst and hunger. If you liked the first game, don't disappoint yourself with this mess.", "timestamp_created": 1520003484, "timestamp_updated": 1523028333, "voted_up": false, "votes_up": 38, "votes_funny": 1, "weighted_vote_score": "0.722248256206512451", "comment_count": 9, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "116197082": {"recommendationid": "116197082", "author": {"steamid": "76561198163764832", "num_games_owned": 111, "num_reviews": 12, "playtime_forever": 2677, "playtime_last_two_weeks": 0, "playtime_at_review": 2421, "last_played": 1655684708}, "language": "english", "review": "Not recommended at all, first game was better, it was a Sandbox open world while this one is about missions in closed areas, also you need to grind a lot.", "timestamp_created": 1653836246, "timestamp_updated": 1653836246, "voted_up": false, "votes_up": 21, "votes_funny": 4, "weighted_vote_score": "0.717497766017913818", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "147986582": {"recommendationid": "147986582", "author": {"steamid": "76561198073729180", "num_games_owned": 172, "num_reviews": 5, "playtime_forever": 95, "playtime_last_two_weeks": 0, "playtime_at_review": 91, "last_played": 1698800060}, "language": "english", "review": "I got to play this online for a day, and then the servers died. I joined the discord to find out what the scoop was, figuring it was just out for a day or something to zero response.\n\nI don't understand why we cant host games online without the servers, but here we are. It's a shame because this game seemed to have some potential.", "timestamp_created": 1696959136, "timestamp_updated": 1696959136, "voted_up": false, "votes_up": 24, "votes_funny": 1, "weighted_vote_score": "0.713495254516601563", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "24649066": {"recommendationid": "24649066", "author": {"steamid": "76561198284346879", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 6765, "playtime_last_two_weeks": 0, "playtime_at_review": 3322, "last_played": 1497111250}, "language": "english", "review": "Hm, this is probably my first review, so bear with me...\n\nSo far i like this game, it is both very similar and different to How to Survive 1\n\nIt lacks most of the \"survival\" element that was more present in the first game, but what it has instead is a much deeper system of crafting and base building etc\n\nThis change is both good and bad, but overall i like the newer system.\n\nSome of the bad sides though are that a lot of the earlier missions are very repetative, and reuse a lot of house and enviroment designs, but that changes a lot as you progress towards the current level cap(50), the missions towards the end feels a lot more varied and less grindy...some of them can take a lot of time though.\n\nWell, this is fairly messy for a review i guess, but overall i would give this game an 8/10 in its current state...hoping they can go that extra mile as the end of the early access looms closer :)", "timestamp_created": 1470043136, "timestamp_updated": 1470043136, "voted_up": true, "votes_up": 47, "votes_funny": 3, "weighted_vote_score": "0.712081432342529297", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "36566011": {"recommendationid": "36566011", "author": {"steamid": "76561198120877155", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 416, "playtime_last_two_weeks": 0, "playtime_at_review": 278, "last_played": 1607163626}, "language": "english", "review": "This game almost hit the right spot in terms of a zombie RPG.  It started really well, then after progressing towards the camp building aspect, the game quickly fell apart from there from bad game mechanics.\n- Inventory management is one of the worst I've seen.\n- Monotone item sprites can be difficult to distinguish at a glance so it forces you to read every item in your inventory.\n- Zoomed out camera tend to zoom back in when entering a building.  You'll have to force it to zoom back out again.\n- Hand weapon timing is somewhat annoying.  Should able to hold mouse button to set up your hit, then release to strike.\n- Camp and craft is more complicated than it should be.\n- And the worse game mechanic award goes to.... no pause in solo single player.  Nothing like not being able to pause the game when you really really needed to.  Either go find a safe spot and continue to become hungry/thirsty, or quit the game and lose all your loot.", "timestamp_created": 1510903095, "timestamp_updated": 1510903095, "voted_up": false, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.704061925411224365", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "33927882": {"recommendationid": "33927882", "author": {"steamid": "76561198095731757", "num_games_owned": 674, "num_reviews": 40, "playtime_forever": 441, "playtime_last_two_weeks": 0, "playtime_at_review": 441, "last_played": 1475248355}, "language": "english", "review": "to me, this is a \"mixed\" game.i mean, \n\nin one hand, for the survival part, fights and crafting are fun, \n\nbut, the other hand, some designs in game are pretty \"NOT reasonable\".\n\nyou have to repeatedly go into a stage-alike areas, to farm/scavenge for things/zombies.\n\nfor the construction, around the newbie starter places, there are no safe zones for you to build a large fort, sometimes my built crafting stations would be right onto the invisible zombie spawn spots, and zombies would suddenly spawn, and made destruction around... \n\nand the 3d view for the places behind walls where player's camera cannot directly shoot, it uses a sort of weird transparent circle, i think this is a good try, but i think this feature can be greatly enhanced, i dislike the way that this game makes.\n\nsuch discomforting details in game, ruin a lot of nice advantages of the game.\n\nso after a while of second thoughts, i vote \"thumb down\" to this game.", "timestamp_created": 1501509117, "timestamp_updated": 1501773318, "voted_up": false, "votes_up": 36, "votes_funny": 0, "weighted_vote_score": "0.703635215759277344", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "31029587": {"recommendationid": "31029587", "author": {"steamid": "76561198268634921", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 4672, "playtime_last_two_weeks": 0, "playtime_at_review": 4069, "last_played": 1493613419}, "language": "english", "review": "Too many structural flaws for me to recommend this.\nI was a big fan of HtS1, but this doesn't really feel like a sequal, so much as a related game. But that's beside the point, really.\n\nThe most basic issue is how it plays. You can't zoom out very far, which means you constantly have enemies running up out of nowhere. You can build things like watchtowers, but you can't see far enough for them to be useful (and on top of that, you have a very limited area you can shoot off of them). The targeting system is also weak. You have lots of enemies run up at you at a glance, and are constantly having to turn to attack them - but the aiming system means you frequently miss, and end up spinning in circles. \n\nThe other main problem is that it quickly feels like a grind, in two ways. First, hunting for items on missions becomes rather repetitive. You may have 50 rooms you have to rapidly run though, watching for a 'pick up' option to appear so you can get a random item. Instead of hunting for specific things, you just run around picking up random stuff. On the other hand, missions themselves become a grind. If you want to build up defenses, there are a limited number of missions you just have to do over and over and over. It's the same mission, but you have to constantly repeat it to grind for items. Instead of playing all the missions over and over, you have to repeat only a few of them many many many times. \n\nI've put in a lot of hours, but I do it more out of boredom (and the need to 'fnisih' a game) than out of love for it. If they took a fresh look at the basics, it does have a lot of potential. Limited visibility/combat and grinding make it much less enjoyable.", "timestamp_created": 1491699120, "timestamp_updated": 1491699120, "voted_up": false, "votes_up": 60, "votes_funny": 1, "weighted_vote_score": "0.702057361602783203", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "25453373": {"recommendationid": "25453373", "author": {"steamid": "76561197971724802", "num_games_owned": 1253, "num_reviews": 248, "playtime_forever": 1628, "playtime_last_two_weeks": 0, "playtime_at_review": 1166, "last_played": 1518393308}, "language": "english", "review": "[b][i]How To Survive 2[/i][/b] is a third-person, action/adventure with a new and improved crafting system, randomized environments and more quests than ever before. It is set in the aftermath of a zombie apocalypse and several years after the events of the first game.\n\nThe crafting system, in particular, is extremely deep and focused as well as being relatively easy to use. Within the base, workstations can be created such as an Armoury to create weapons and bullets or a Foundry which allows the creation of different armour sets, that are then used to protect and customize the main protagonist.\n\nThere is a lot of possibilities when it comes to crafting and players will spend hours gathering resources needed to make whatever they want. It doesn't feel like a grind, it feels like a necessary step to further along the survival of the character. More importantly, is that it is fun and doesn't get boring. \n\nAs players taken on quests and kill enemies, they are rewarded with experience points which can be used to upgrade the character, obtain new skills or craft new items. Experience points are used for everything,  and will need to be acquired in huge numbers to be able to upgrade everything. \n\nDuring any mission, a tactical mindset needs to be employed. This title, is packed full of zombies, and they are sensitive to sound, that means firing a weapon should be a last resort. This really ramps up the tension and overall playstyles will need to be changed on the fly to suit the situation. One minute the protagonist is slowly picking off zombies one by one, then all of a sudden too much noise was made and a horde comes running towards the character. Suddenly, players are fighting for their lives, running away and desperately trying not to be overrun by the different types of infected that are on offer. \n\n[b][i]How To Survive 2[/i][/b] is fun. When you complete a level there’s a sense of pride, a celebration well earned. While the game isn’t perfect, its worthy of checking out and just might win you over.\n\n[b]THE GOOD[/b]\n- Gorgeous graphics\n- Deep crafting and customization options\n- Fun multiplayer\n- Atmospheric gameplay\n\n[b]THE BAD[/b]\n- Annoying camera system\n- Lack of in depth storyline\n\n[h1]8/10[/h1]\n\nDISASTER | BAD | MEDIOCRE | OKAY | GOOD | [b][u]GREAT[/u][/b] | AMAZING | MASTERPIECE", "timestamp_created": 1473553475, "timestamp_updated": 1500673071, "voted_up": true, "votes_up": 36, "votes_funny": 3, "weighted_vote_score": "0.699626743793487549", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "54358203": {"recommendationid": "54358203", "author": {"steamid": "76561198023556685", "num_games_owned": 0, "num_reviews": 36, "playtime_forever": 432, "playtime_last_two_weeks": 0, "playtime_at_review": 432, "last_played": 1537483511}, "language": "english", "review": "I loved the first one and really wanted to love the second one, I really did.\n\nTLDR: Most of the humour is gone, the gameplay is restrictive, no more wacky crafting!\n\nPROS:\n- The controls are good?\n- Npcs, yeah?\n\nCONS:\n- Very restrictive leveling\n- Almost no humour\n- No crazy hordes\n- No crazy weapons\n- It's slooooooowwwww. The first one was fun and fast\n- Music is meh\n- Maps are meh\n- No more crazy crafting (Why fix something not broken, why?)\n\nI do not recommend it, go play the first one, get the first one dlcs when on sales and be happy instead of playing this boring thing.", "timestamp_created": 1564414807, "timestamp_updated": 1564414807, "voted_up": false, "votes_up": 24, "votes_funny": 1, "weighted_vote_score": "0.695740222930908203", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "18787831": {"recommendationid": "18787831", "author": {"steamid": "76561197970693531", "num_games_owned": 12869, "num_reviews": 64, "playtime_forever": 1516, "playtime_last_two_weeks": 0, "playtime_at_review": 1181, "last_played": 1477965602}, "language": "english", "review": "Avoid for now.\n\nThis will no doubt be a game worth playing at a later date, but for now it far too broken in the wrong places to be properly enjoyed - even as an Early Access title.\n\nControls are poorly thought out.   Keyboard controls have largely been ignored with game prompts only showing as xbox controller prompts with no keybindings available.\nWhen interacting/talking your character is locked from movement while enemies can still attack.  Nothing quite like having a zombie beat down on you while you try to skip through dialogue with incorrect buttons being shown on screen.\n\nQuests are nothing more than disjointed fetch quests in maps that you get teleported to via dialogue.  Once fetch quest is complete you need to hold a button and choose \"Quit\" to complete the quest.  Very confusing, but then, most of the game is.\nOn one quest you get sent to a swamp to find 2 different types of flowers, but the flowers were not actual flowers, but loot boxes generic to the games loot system.  Really?   Flowers in a swamp are in loot boxes?\nEven the fetch quests seem lazy.   Sometimes it will ask you find items you already have in your inventory, but it will force you to find them manually on the map to count.   I encountered a quest map where the required items had not been spawned (I tried twice, 40 minutes the first time, then 30 minutes the second time).   They just were not there.\n\nGraphics are sub par but do the job.   The camera view is at a fixed angle, so although you can zoom in  or out, the game uses this strange effect to clip objects blocking view and it can be quite distracting.  I played on \"Ultra settings\" and textures were terrible and no anti-aliasing at all.   A lot of the textures were just plain ugly, with a stone texture being used for a desktop computer of all things.   Sometimes you'll notice areas where the walls, the shelves, the cabinets and mousepads/computers all use the same rough texture.\n\nCurrently game progression is broken, and there is a point where you can not continue.   A pretty major issue.   What's worse is that progression is broken at two difference quest branches.\n\nOver all this is a pretty rough release at the moment.   Only for die hard players that aren't put off by bug ridden frustrating gameplay with confusing design.   \n\nVersion:  Release Build: Oct 29 2015\n-----------------------------------\ni7-4790K @ 4.00Ghz\nMSI GeForce GTX 980 Ti Gaming 6GB\n16GB ram\nASRock Z97 Extreme6\nSamsung 850 EVO Series 1TB SSD \n", "timestamp_created": 1446285069, "timestamp_updated": 1446285069, "voted_up": false, "votes_up": 184, "votes_funny": 9, "weighted_vote_score": "0.694190442562103271", "comment_count": 11, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "35204530": {"recommendationid": "35204530", "author": {"steamid": "76561198045468592", "num_games_owned": 1005, "num_reviews": 231, "playtime_forever": 5127, "playtime_last_two_weeks": 0, "playtime_at_review": 3473, "last_played": 1708723959}, "language": "english", "review": "Very fun coop game to play with friends. I ran through it with a group and it was an excellent time. Highly recommended for group play. However, game isn’t much fun playing alone. Game last a good amount of time and has a bit of reply-ability but nothing too much for end game content.", "timestamp_created": 1506351847, "timestamp_updated": 1506351847, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.692997992038726807", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "98064942": {"recommendationid": "98064942", "author": {"steamid": "76561199009037364", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 1873, "playtime_last_two_weeks": 0, "playtime_at_review": 1873, "last_played": 1629673075}, "language": "english", "review": "Reviewing the second game first as it's the only one out of the two games I own as of 8/22/2021.\n\n----\n\nHave you ever wanted every single negative aspect of the modern hack-n-slash \"RPG\" (a very, very loose term here) wrapped up into one single under-baked package? Look no further than How to Survive 2, a game that prides itself on being so bland and forgettable yet tries to hide it up with Borderlands-esque \"humor\" (also a very loose term.)\n\nWithin its first few hours, it can be an enjoyable game. However this rapidly degrades when you realize you're doing the same, cookie-cutter shopping list of boring, monotonous chores with very little pay off what so ever.\n\nThe gameplay is a simple Diablo-esque Hack-n-Slash without any of the charm of said game. While the combo system almost pulls through, it simply just falls flat due to it being underwhelming as most weapons use the same combos, and are just reskins of already existing weapons except with just higher or lower stats based on their levels. As a matter of fact, several weapons are differently named with different stats, but use the SAME EXACT MODEL WITH NO VISUAL DIFFERENCES. No, seriously, not even a color swap. You'll see the same sledgehammer model 3 or 4 times, maybe even more if you can get to the \"end-game\", which I will very much talk about later. You'll be going to the same exact city, forest, and swamp areas over and over, almost always having the same exact layout each time with completely uninteresting quests and a downright awful story. The grind of the game is so unsatisfying and tedious that you're better off trying to survive in the real world wilderness; heck, at least you get to take in the environment.\n\nI've never seen a game with such poor balancing and information-withholding from the player, despite the handholding at the beginning. One moment, you'll be clubbing heads left and right, next, you'll be struggling with the world's worst and overly sensitive auto-aim I've ever had the displeasure of experience. You're suppose to keep aiming at a zombie to score a critical hit when the circle shrinks and turns to a crosshair, however if another zombie is near-by, you may end up canceling it with no fault of your own, that or if the zombie walks over terrain that causes a lock-off. This mechanic is also broken in the Dead Dynamite DLC, which you may as well burnt the cash if you bought. Oh, yeah, next is the bugs.\n\nIf you're playing this in 2021, for some unknown reason, prepare to see bugs galore. I'm talking floating zombies, zombies getting stuck in terrain, YOU getting stuck in the terrain, the lock-on canceling randomly, your save data being deleted randomly (read all the other reviews or check the community tab, I've not personally had it happen but it seems like it's always been an issue), or even complete progress-halting bugs, such as in the Dead Dynamite DLC where fuel tanks you must blow up cannot be targeted or hit with melee. This game hasn't been updated since 2017 so it's pretty much abandoned, so never expect any bug fixes.\n\nThe visual style, sounds and animations of the game just screams asset-store, even if the models and animations are original. The zombie animals are a somewhat interesting idea, even if unoriginal. The game is so visually boring and generic that you could honestly mistake it for a student-project Unity game that uses place-holder assets. Oh, and don't bother trying to play online, there's maybe like 10 people on at any given time.\n\nThe \"end-game\" is just laughably bad. Personally, I've never made it, ended up getting so bored that I looked up the ending and story on YouTube. As it turns out, there's no even an ending... or ending cutscene, or even a congratulations or wall of text to say you did a good job. After the final quest, you just do whatever. There's no real end goal, which is something that has became alarmingly common in many games.\n\nIf you're going to play this and are not going to be stopped, just buy the base-game when it's on sale and not the Ultimate Edition or ANY of the DLCs. \n\nIf you are looking for similar games, however, just play Diablo, 7 Days to Die, Dead Nation or literally any other survival RPG or isometric hack-n-slash. Better yet, you'll probably have a significantly more enjoyable time learning to code and develop your own game, or learning to survive in the wilderness as previously stated. Heck, you'll probably find more enjoyment out of just beating rocks together.", "timestamp_created": 1629676323, "timestamp_updated": 1629676679, "voted_up": false, "votes_up": 36, "votes_funny": 2, "weighted_vote_score": "0.690101683139801025", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "99870491": {"recommendationid": "99870491", "author": {"steamid": "76561197980653142", "num_games_owned": 0, "num_reviews": 169, "playtime_forever": 1063, "playtime_last_two_weeks": 0, "playtime_at_review": 1006, "last_played": 1632490210}, "language": "english", "review": "I got both 1 and 2 in a bundle while back. I have a tendency to buy games i am interested in on sale at hard to beat prices. Knowing Ill play it later when done with current games.\nThe game is nothing special but its enjoyable. It does not really score low in any area, but not High either. Just a fun time killer. I put in hour here few hours there. Bought the military dlc love running around popping heads lol.\nIts like Cold Pizza or something similar when your hungry it sounds good.....But not something you want to eat a lot.", "timestamp_created": 1632464099, "timestamp_updated": 1632464099, "voted_up": true, "votes_up": 18, "votes_funny": 1, "weighted_vote_score": "0.687094271183013916", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23026622": {"recommendationid": "23026622", "author": {"steamid": "76561198048419446", "num_games_owned": 187, "num_reviews": 20, "playtime_forever": 3162, "playtime_last_two_weeks": 0, "playtime_at_review": 2059, "last_played": 1596516297}, "language": "english", "review": "[h1]----The Good----[/h1]\n-How to Survive 2 is a sequal to How to survive\n-Kovack is also here :D\n-A great game that's being continually updated even today\n-Great graphics\n-Costimizable charecters\n-Zooming in options\n-Controls can be remapped\n-Online and local co-op (up to 4 people on the same screen)\n-Private online as well\n-You can level up all the way to 35\n-Huge amount of skills that can help you in every way\n-Multiple missions with multiple difficulties (including hardcore missions--death=mission fail--)\n-You can build your own camp from nothing all the way to fortress\n-Custimizable weapons such as silencers, weapon stocks, scopes, etc.\n-New Enemies\n\n[h1]---The Bad---[/h1]\n-Local, online, and online private characters are seprete\n-If you play alone on local, online, or online private you wont be able to play certain mission\n-Building barriers to close to each other will have a damaged animation confusing the builder\n-Not much else (which is good)", "timestamp_created": 1463429609, "timestamp_updated": 1463706604, "voted_up": true, "votes_up": 27, "votes_funny": 3, "weighted_vote_score": "0.686535835266113281", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "32820891": {"recommendationid": "32820891", "author": {"steamid": "76561197969333702", "num_games_owned": 637, "num_reviews": 25, "playtime_forever": 6521, "playtime_last_two_weeks": 0, "playtime_at_review": 6063, "last_played": 1709047759}, "language": "english", "review": "Ranting part:\n\nFirst off, I've played this game over 100 hours now, all of them with my GF with local co-op. Extremely well spent money to make her more interested in gaming. \n\nHowever, as a game, this one is lacking... badly. I'ts almost as if they designed half the game and got sick of it, and just started shooting from the hip. For me it seems as if they spend majority of the time in designing the character Kovac from the first game, and then \"meh\". \nWeapon animations were the same for ALL weapons of the same type, dual wield knives and chinese hook swords, saaaaame animation, even the ones where a move would be practivcally imnpossible with anything but knives, like stabbing.... stabbing with hook swords.. And the Katana felt like a club... single hit target mostly, and slow, extremely so as wel... \n\nLoved the first game as it was challenging and we died alot before we learned how to tackle the enemy. But for HTS2, it was just an endless grindfest, no fantasy in enemy design (less zombie types than HTS1) and just a load of animal type zombies. \n\n[spoiler]But the most dissapointing part was the damn ending. Not gonna spoil it, but be prepared for the biggest let-down of the century.[/spoiler] That and no damn shotgun.... how the hell can you have a zombie shooter without shotguns??? \n\nEnd of rant -\n\nSummary of the games downsides:\n\n- No shotgun (seriously?)\n- Half assed design (levels look the same everywhere)\n- Lacking story\n- Repetetive everything\n- Boring grindfest (this coming from someone that have 2000+ hours logged in Diablo 3)\n- Level system is horrible\n- Controller mapping? What is that? Why have that? Sure default works but seriously... \n- Settings is limited to gamma... Yepp... Console settings... on a PC... true story. \n- Not nearly enough quests. Leading to more grinding... of the same repetetive levels... \n- 100% achievements would take aprox 2 decades, no life and patience of a saint since the leveling system is so horrible. \n- The camera makes me want to kill someone. I'm just glad the zoom level is constant when playing local co-op. If it would behave as it does in singleplayer, I would have requested my money back without a seconds thought. \n\n\nSo is it all bad? \nNot really actually. The camp mechanic is an awesome idea, and with more time and effort it would have been an awesome reality as well. Since you can build it wherever you want, it opens up for an interesting concept. If only the map was bigger, and zombie spawns wouldn't have been so damn random, it would have been another awesome reality. So I hope this game sparks ideas with other devs regarding this. \n\nThen we have Kovac. The only thing they put some effort into, and he's brilliant! I absolutely love to hate him, and the way he piss me off actually makes me happy inside. If only they put as much time into the rest of the game, this could have been a game of the year candidate without any problems. \n\nI want to recommend this game, but I just can't. It's not complete, and it feels like they just gave up halfway through and decided to put effort into How to survive 1's 3rd person view instead. It's got a solid core, good concept, but I've played early access games with more content than this.", "timestamp_created": 1498493784, "timestamp_updated": 1498493784, "voted_up": false, "votes_up": 29, "votes_funny": 3, "weighted_vote_score": "0.685179233551025391", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "63538199": {"recommendationid": "63538199", "author": {"steamid": "76561197978433339", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 387, "playtime_last_two_weeks": 0, "playtime_at_review": 387, "last_played": 1581762779}, "language": "english", "review": "I was going to write a comprehensive review of this game, but honestly I just cannot be bothered.\nMuch in the same way as the QA department at Eko Software could not be bothered.\nAfter bumping up against progression halting bugs in the \"main quest\" line that a quick Google search shows has been present since day one, I just can't work up the motivation to retry the same quest repeatedly to see if this is the time that it doesn't glitch out leaving me stranded in limbo. \nSome buggy games are fun despite the bugs, or even to some degree because of them.\nHTS2 just comes off as a chore, and I have other games in my backlog that promises to be more rewarding experiences by far.\n\nMay be more fun if you play this as co-op with a couple of friends, but anything more than 5€ for this broken mess is highway robbery.", "timestamp_created": 1581763525, "timestamp_updated": 1581763525, "voted_up": false, "votes_up": 25, "votes_funny": 1, "weighted_vote_score": "0.685139954090118408", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "98502595": {"recommendationid": "98502595", "author": {"steamid": "76561198216843591", "num_games_owned": 0, "num_reviews": 41, "playtime_forever": 1023, "playtime_last_two_weeks": 0, "playtime_at_review": 891, "last_played": 1691312925}, "language": "english", "review": "I wanted to write a long review saying how bad it is, instead im just gonna say its so boring and long I just couldnt get myself to finish it, so if you havent already, buy How to survive 1 and never consider buying this shit ever again, they took everything that was good about HtS1 and removed it :/\n\nsidenote : if you want to play with a playstation controller youll have to download an emulator even though the game is available on the playstation store, ye, its that bad", "timestamp_created": 1630323626, "timestamp_updated": 1691312797, "voted_up": false, "votes_up": 31, "votes_funny": 3, "weighted_vote_score": "0.682038784027099609", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "26652045": {"recommendationid": "26652045", "author": {"steamid": "76561197984052645", "num_games_owned": 0, "num_reviews": 38, "playtime_forever": 19252, "playtime_last_two_weeks": 0, "playtime_at_review": 17191, "last_played": 1703596229}, "language": "english", "review": "I used to love this game!! Really!\n\nI was in early access and one of the biggest supports of the game! I gave tons of ideas to improved the game, many that the devs used to improve it, I made fan trailers, I conviced ppl on the fence to buy it...\n\nThen, the game was lauched... rushed and incomplete. With no coherent storyline, no endgame, no voice over and hidden areas that we couldnt access! \nI thougth... that´s fine, maybe the investors want to see the game out and the devs will finish it with updates! I saw this happen before in one or two EA games.\nThen, they released some costumes DLCs, which I bought all, even the ones that I didn´t want because, wtf, let´s support the guys so the game can be finished!!!\n\nToday, they released the rest of the games.... with TONS of things that we asked in early access like new areas, throwing weapons, explosive weapons... every thing that we, the testers, told the devs to implement in the game, as a PAID DLC!\nThey simply expanded the game, with many of our ideas, finishing most of the game, and ask more money for it!\n\nYou see, that´s what´s wrong with the industry, devs releasing incomplete games, even after asking for our money upfront, and then, release a Paid DLC with the rest of the content. \nI can´t recomend this game, even after 315 hours of gameplay!\n\nThis is so wrong, so wrong, that I can´t recomend to anyone!\n\nToo bad, because the game was very fun and I had a blast, but I can´t support this kind of mentality in this industry!\n\n2/10 - Unfinished and rushed game.", "timestamp_created": 1479420541, "timestamp_updated": 1479420541, "voted_up": false, "votes_up": 14, "votes_funny": 1, "weighted_vote_score": "0.680294811725616455", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "28192197": {"recommendationid": "28192197", "author": {"steamid": "76561198060234916", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 1028, "playtime_last_two_weeks": 0, "playtime_at_review": 1028, "last_played": 1482347748}, "language": "english", "review": "This game really won my heart. The graphics are so much better than HTS1. And I think you start more easily than HTS1.  I can play this more peacefully. And the more you level up how harder it gets. But it's fun to start off slowly so you exactly know how everything works so you are prepared. And this crafting system is 10/10! To play this with a friend online is also much fun. I really can't get enough of it. I never played zombie/survival games before but I got introduced to this game and I love it! 10/10", "timestamp_created": 1480883275, "timestamp_updated": 1483053338, "voted_up": true, "votes_up": 34, "votes_funny": 6, "weighted_vote_score": "0.679951071739196777", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "86920302": {"recommendationid": "86920302", "author": {"steamid": "76561198075110565", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 1278, "playtime_last_two_weeks": 0, "playtime_at_review": 1278, "last_played": 1468978399}, "language": "english", "review": "It's definitely not as good as the first one. Nothing but an insane grindfest.\nThe thing that made me shut the game off and never play it again: When zombies starting spawning INSIDE my base which completely defeats the purpose of base building and trap placement.", "timestamp_created": 1613612471, "timestamp_updated": 1613612471, "voted_up": false, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.678147614002227783", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "44782809": {"recommendationid": "44782809", "author": {"steamid": "76561197998568769", "num_games_owned": 671, "num_reviews": 833, "playtime_forever": 493, "playtime_last_two_weeks": 0, "playtime_at_review": 493, "last_played": 1537063560}, "language": "english", "review": "4/10\n\nA friend and I decided to give this one a shot after finding it in the lowest tier of a Humble Bundle. We played the first How to Survive, but called it quits when we ran into a quest that required us to run all over the map, revisiting everywhere that we'd already been and cleared out once before (Quest 27). We hoped that perhaps this one would iron out some of the rough edges present in the first title and perhaps improve the quest design.\n\nThe game still has an amusing sense of humor, and Kovac is still quite a character. Additionally, the gameplay didn't feel particularly bad to me, especially once I got my hands on a bow. However, progressing through the game was just a rough ride. First of all, although I created the initial camp for us to play in online (my name was on the camp), I couldn't access it after our first play session. I had to wait for my co-op partner to get online and join the camp with my name on it before it appeared for me.\n\nMany of the quests asked us to search for one specific item in a fairly sizable zone - this often devolved into tedium, and was not what we'd call enjoyable. At this point, the game wasn't doing anything to actively turn us off, but it wasn't particularly engaging either. You have four different trees that you're trying to upgrade with the experience you acquire, and the amount of experience required goes up exponentially. Your \"camp\" has a level, as does each building you put in it. Your character has a separate level, and each skill that you have must be leveled up individually. Oddly enough, you have to put points into each skill four separate times before it actually gains a level.\n\nOnce you get to level 10, Kovac asks you to build a pylon: a big radio tower to send messages out to survivors. Unfortunately, activating the tower draws in zombies. We built the pylon in a different area of the map, because the initial area outside of Kovac's bunker was getting pretty crowded. We activated the tower and defended it from zombies, and then we gained the ability to upgrade our camp and character to level 20. Once we got to 20, we had to defend the pylon again. However, during this defense, enemies also began to attack our central camp. Since the pylon that attracts zombies was nowhere near our camp, this was a little baffling. We split off, but neither of us were strong enough to defend alone.\n\nThe next time my co-op partner hopped online, I was delayed for a few minutes. In the meantime, another random player hopped in our game and stole everything we had collected thus far from our stash. This seemed like as good a time as any to stop playing this thoroughly mediocre game.", "timestamp_created": 1537195776, "timestamp_updated": 1537195796, "voted_up": false, "votes_up": 15, "votes_funny": 3, "weighted_vote_score": "0.677984476089477539", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "25663753": {"recommendationid": "25663753", "author": {"steamid": "76561197987731882", "num_games_owned": 596, "num_reviews": 517, "playtime_forever": 13176, "playtime_last_two_weeks": 0, "playtime_at_review": 12871, "last_played": 1476452212}, "language": "english", "review": "Gameplay very Smooth,\nAudio is better,\nin comparison to H2S 1.\n\nKovac is still as entertaining as ever,\nwhile the other characters and questers doesn't have their own voices.\n\n\n\nGame has evolved more into camp building to progress, rather than the usual progress the Hero to play.\nBoth H2S and H2S 2 have its own merits.\n\n\nThe new save system is great, although sometimes, \nafter the mission, items are awarded, and storing them, \nthere is always an uncertainty on are the items and short progress saved if you exit upon.\n\nGood to see better improvements to the crafting and addition of storage system.\n\n\nBUT\n\n\nShifting items between heros and storage is alittle hassle if quantity is more than one, \nrequires to keep shifting the figure and clicking ok, pity Enter key couldn't be used.\n\nTedious, as your level progress, so does the extensions to the enemies health, \ntakes so much more shootings to bring them down,\neven more tedious work in loot and arrow/bolt pickings, \nendless clickings of the interact button over a pile of corpses.\n\nToo much emphasis on missions does making it into grind job, unlike H2S 1.\nRepeat process of grinding xp off missions, \nconstantly repairing \nand gather resources just to keep the structures and defences intact,\ncan be rather weary to the mind.\n\n\nOne thing that never changes, \nyou can escape a horde of zombies but never from getting wet.\n\n\n\n\n\n\nOverall \nit can be a game to login a few times daily, \ngo on missions for some resources,\ndo some decor to Kovac City,\nand killing some Zombies.\n\n\nCan get boring to reach the end for this Episode.", "timestamp_created": 1474695722, "timestamp_updated": 1475896827, "voted_up": true, "votes_up": 14, "votes_funny": 1, "weighted_vote_score": "0.676701605319976807", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "22342505": {"recommendationid": "22342505", "author": {"steamid": "76561197972328185", "num_games_owned": 0, "num_reviews": 76, "playtime_forever": 1498, "playtime_last_two_weeks": 0, "playtime_at_review": 1498, "last_played": 1460410306}, "language": "english", "review": "[h1]I like it![/h1]\n\nI liked the first one, even though it was linear and a bit arcadey, the humor and story struck me to keep playing and the mechanics were fun. Since this sequel was on sale for 70% off, I figured [i]what the hell[/i] and dove in to EA.\n\nI think everything is markedly improved over the original. Progression in the game seems more balanced and well paced. It might be in EA, but it already feels very complete to me. Just needs some love and polish in some places. UI/Menus could be a little better, but they are functional. \nSome people are having some problems getting the game to work properly for various reasons, but I myself have not run into anything that validating/verifying the game files didn't fix.\n\n[b]For anyone having played the first, the mechanics will be very familiar.[/b] \nEat or your melee damage will suffer when you begin to starve.\nDrink or your vital critical hits will charge slower.\nBasically, if you are starving or dehydrated you'll [i]probably[/i] die from zombies before you actually starve to death, just because you won't be as effective in killing hordes.\nI've never tested what happens when you get to 0%, though.\n\n[b]Crafting is key.[/b]\nThis game takes the crafting to the next level. Your camp level affects everything you do, as you can only level your character to your camp level. Item recipes are locked behind levels of buildings, which you will need to gather many supplies to upgrade, to finally build yourself some decent gear.\nMakes everything you do feel like it pays off once you've made some decent kit for yourself. \nAlso visually rewarding having a little camp to go home to after quests to dump your loot at.\nI've also noticed as I've built up buildings and walls, that zombies don't seem to spawn within my camp, which is good. It's a safe space.\n\n[b]You can replay any quest any time you feel like at varying difficulties.[/b]\nWant to feel like a super bad-ass zombie slayer? Knock the level of the quest down -2 and go zombie wrecking. Also good for quick supply runs.\nNeed a challenge? Ramp up the quest level +5 over your level. Serious XP gains if you manage to survive. (Each death is a -10% xp penalty)\nI usually play at +3 for a nice 10% xp bonus with not too much added difficulty.\n\n[b]The game is funny.[/b]\nI enjoy the little humour the game has and some of the quests are just the right amount of silly. It's one of the things that really charmed me in the first game and I'm glad they kept to it. There are enough \"try hard serious\" zombie games out there, this one is just good fun.\n\n[b]TL;DR[/b]\nBasically if you enjoy ARPGs, you'll probably enjoy How to Survive 2.", "timestamp_created": 1460305401, "timestamp_updated": 1460307783, "voted_up": true, "votes_up": 25, "votes_funny": 2, "weighted_vote_score": "0.674524545669555664", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "23685843": {"recommendationid": "23685843", "author": {"steamid": "76561197973038031", "num_games_owned": 0, "num_reviews": 123, "playtime_forever": 209, "playtime_last_two_weeks": 0, "playtime_at_review": 209, "last_played": 1466479255}, "language": "english", "review": "Bought it on sale and it's the only time I would dare recommend it to anyone.\n\n-repetitive mission maps\n\n-gameplay is basically grinding with the upgrades and unlocks hidden beind all the tedious missions\n\n-combat is stale. Whack em or shoot em. What weapon variety?\n\n-crafting is limited and comes off more as an obligation instead of fun. It's just a time sink to prolong \"gameplay\". Also requires you to go through tedious missions.\n\n-what survival? You'll have enough food and beverage for a small town after every mission.\n\n+Firearms are loud and will attract a Horde. This adds a little bit of decision making in the game. Only thing I can find good in this game.\n\nSo overall the gameplay revolves around doing tedious misisons, gathering items/resources at that mission and coming back to camp and upgrading your camp and character. \n\nThere's not much exploration in the traditional sense. The game forces the player to loot maps during the missions otherwise you can't get the upgrades. Upgrade feels like a chore rather than a reward or accomplishment.\n\nIt's a nice distraction for a few hours but after that it's gets stale way too fast.\n\nSOMETHING FISHY: Notice the negative reviews? Even the recent ones. The Negative ones get thumbs down to hell and back while the positive ones regardless of playtime are given thumbs up immediately. Almost as if someone's patrolling that page.\n\nold tactics some developers do on Steam.", "timestamp_created": 1466516903, "timestamp_updated": 1466516903, "voted_up": false, "votes_up": 261, "votes_funny": 12, "weighted_vote_score": "0.672539651393890381", "comment_count": 20, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "45772792": {"recommendationid": "45772792", "author": {"steamid": "76561197997085071", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 2636, "playtime_last_two_weeks": 0, "playtime_at_review": 2636, "last_played": 1541991088}, "language": "english", "review": "After few hours i've played this game, i just could not make myself to finish it. It was great to begin with, but ended up being a grind fest. Droped it few times and came back to it, but still, reapeating missions over and over again to get materials and try to progress with camp lvl and own lvl was just too much of the grind. Finally deleted the game and i know im not going to come back to it. Feels kinda sad not to finish it, but just got fed up with it.\n\nIf you want to have fun, just get How To Survive (first one) and enjoy it.", "timestamp_created": 1541991773, "timestamp_updated": 1541991773, "voted_up": false, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.672187507152557373", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23459130": {"recommendationid": "23459130", "author": {"steamid": "76561198048805063", "num_games_owned": 0, "num_reviews": 152, "playtime_forever": 1188, "playtime_last_two_weeks": 0, "playtime_at_review": 102, "last_played": 1664275111}, "language": "english", "review": "Don't judge this game based on the 1st series. How to Survive 2 is way more polished and control doesn't feel clunky as in the previous series. It has been improved a lot.\nAlso now you can build your own community of survivor in online multiplayer mode. More crafting variety, build camp or even stronghold, improved graphic, and Kovac to teach you how to survive.\n\nWhen this game leave it's early access state. Don't hesitate to buy it.", "timestamp_created": 1465423920, "timestamp_updated": 1465423920, "voted_up": true, "votes_up": 56, "votes_funny": 4, "weighted_vote_score": "0.670669496059417725", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114023375": {"recommendationid": "114023375", "author": {"steamid": "76561199079327196", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 99, "playtime_last_two_weeks": 0, "playtime_at_review": 99, "last_played": 1643478502}, "language": "english", "review": "The first game was a lot better. The second one is not that interesting. It does not have any good story to it and it is just confusing. The first game was so good, it is a shame because this could have been done a lot better. What happened?", "timestamp_created": 1650221858, "timestamp_updated": 1650221858, "voted_up": false, "votes_up": 19, "votes_funny": 1, "weighted_vote_score": "0.670570135116577148", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "55175947": {"recommendationid": "55175947", "author": {"steamid": "76561198393825451", "num_games_owned": 0, "num_reviews": 170, "playtime_forever": 4769, "playtime_last_two_weeks": 0, "playtime_at_review": 4769, "last_played": 1568824654}, "language": "english", "review": "It should be a \"neutral\" review, but there is no such option. \n\nWhat tipped the scale to a \"not recommended\" is that the game doesn`t end (!). \nI`m not exagerating or anything. It simply gets to a point where there is nothing to do anymore, so you just can`t know it`s over, then when you google it you`ll see it`s weirdly over. Looks as if the game is incomplete. It`s the first time I face that and let me tell you, it`s really depressing.\n\nPROS:\n+ Same things you liked in HTS1: destroy zombies, create weapons, etc.\n+ Camp construction (huge improvement from the first game, best feature in this game)\n+ You`re allowed to do more movements compared to the first game such as climb\n\nCONS:\n+ Buggy\n+ No story, just random NPC conversations during [mostly side] quests (first game was much better at that)\n+ No pause button. That is particularly problematic when you are trying to read a dialogue with an NPC\n+ NO ENDING", "timestamp_created": 1568844885, "timestamp_updated": 1568844885, "voted_up": false, "votes_up": 15, "votes_funny": 1, "weighted_vote_score": "0.667887210845947266", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "32116032": {"recommendationid": "32116032", "author": {"steamid": "76561198055751665", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 209, "playtime_last_two_weeks": 0, "playtime_at_review": 209, "last_played": 1496354992}, "language": "english", "review": "Personally, this game is an iffy. The things wrong with it are minor and could be easily patched. The combat and crafting is simple enough, and the zombie types and appearances aren't bad as well. The thing that really fucks this game up, is the camera angle, and how the transparency of buildings can sometimes be confusing. It seems to just jumble together at times when it comes to smaller buildings and landscapes. Beyond that, I wouldn't say it's that bad of a game, definitely a step up from the first.", "timestamp_created": 1496353345, "timestamp_updated": 1496353345, "voted_up": true, "votes_up": 22, "votes_funny": 1, "weighted_vote_score": "0.66580808162689209", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "28283108": {"recommendationid": "28283108", "author": {"steamid": "76561198015892694", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 7268, "playtime_last_two_weeks": 0, "playtime_at_review": 3582, "last_played": 1494345190}, "language": "english", "review": "While I find myself enjoying the game, the game itself seems hindered in the requirements of there being more and more players.  After awhile playing solo I've come to realize that it's not intended to be any kind of solo experience at all.  After the reset the players I had that were on the server have moved on and don't feel thrilled about starting the game over again.  Even with three of us playing we found the game getting challenging later on.  Which is a good thing, imho. \n\nHaving to make our way back up again on faith that there won't be another reset leaves me unable to convince the others to come back to the game though.\n\n", "timestamp_created": 1481350754, "timestamp_updated": 1481350754, "voted_up": true, "votes_up": 25, "votes_funny": 2, "weighted_vote_score": "0.663871109485626221", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "37946005": {"recommendationid": "37946005", "author": {"steamid": "76561198084403502", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 2365, "playtime_last_two_weeks": 0, "playtime_at_review": 2365, "last_played": 1529321025}, "language": "english", "review": "It's a bit boring but should be ok if you're already bored. Few things could be done better; but it's a simple and low stress game. And currently I think it's definitely worth the money, specially while on sale (I got it on steam halloween sale 75% off)\n\n[h1]PROS:[/h1]\n[list]\n    [*]It's a simple game that lets you do things at your own pace.\n\n    [*]It's got high playability. Few weapons, simple controls... Anything hardly ever goes wrong.\n\n    [*]So far I've seen no crashes, no stuttering, no slowing down, nothing out of the ordinary in straight 6 hour runs. = It's a stable application.\n\n    [*]If you die, you only lose some xp and respawn. It's a low stress, run around - shoot stuff, build some buildings to craft weapons and stuff kind of game.\n\n    [*]There are characters you can get quests from and starting a quest makes you load into that quest's map. Quests are replayable and reloading any map respawns the items in them. You can replay a quest as many times as you like, to loot the place again, and to get the quest rewards, as usual. Giving up half way doesn't make you lose the items you found in there, that's a definite plus for me.\n\n    [*]I doubt anyone would be like cmon let's play \"How to survive 2\" together, because it's kind of boring; but it's got multiplayer capability so... that's something.\n-edit: Interestingly playing coop is more fun. You can get revived by ppl, you don't just die when you fall. And you can go spend some stuff you got on their world, give em weapons you no longer need etc, or they can come to yours. It's more fun than solo. \n\n    [*]Your character doesn't run out of stamina too fast. Seems well balanced to me.\n[/list]\n\n[h1]CONS:[/h1]\n[list]\n    [*]It's got a rather bleak and boring atmosphere. You might get bored quickly.\n\n    [*]The characters you meet don't inspire emotional attachment (~they're not very likable). And only the main quest giver npc \"Kovac\" has voice acting, which doesn't much feel like voice acting but rather like a generic Russian guy speaking English, bit like computer generated speech. Other characters just spew out text.\n\n    [*]There's one \"use\" button, which you *might* end up breaking while looting everything.\n\n    [*]There's only one button for running AND climbing, scooting over obstacles, jumping over balcony parapets down into the streets... which you usually keep holding just to move faster but sometimes it makes you jump down unintentionally. Would be better if running and jumping could be assigned to different keys.\n\n    [*]Items spawn mostly on the ground without any context. You'd be right to expect finding food in a kitchen; but in this game you're just as likely to find an engine compartment, or gunpowder just lying on the ground. Makes the game seem cheap, like it's designed without much consideration. It works, though it can be boring for most ppl.\n\n    [*]Items listed in your inventory and in storage are not quickly accessable. They're not listed alphabetically. They get stacked in a fifo fashion. And you cannot, for instance, right click to quickly move item stacks to storage and back. You have to hold left click, move it from inventory to storage, hit ok in the slidebar popup window (where you set the amount) with your mouse everytime to move a stack of anything in your inventory. There's no keyboard input mapped into that business. It's really ret'@rded. There's a \"move everything in this tab\" button though, providing limited practicality.\n\n    [*]This is a game played in bird's-eye view, from above with a fixed angle, bit like diablo2. In a game where projectile range is unclear for some weapons, you probably would like to shoot farther than 20-25 meters. But in this game there's only 3 zoom options: close (15m radius bird's eye) , closer (8m radius 3rd person), and really ffin close (3rd person where you can see only 2 meters from you). Inside buildings, it always switches to the closest option, which makes it harder to spot and shoot zombies. Doesn't make the game too hard or anything, it's just not ideal.\n\n    [*]Also about visibility... You can't rotate the camera, the viewing direction is fixed. Your character has a rather tiny circle (with ~3m radius) of visibility around it, where the game lets you see what's around you. Outside that, buildings, trees, leaves, everything blocks your vision when they're in the way. You end up having to aim to be able to find out if there's something there. If your character starts locking onto something, you find there is. Doesn't make the game unplayable but it's an inconvenience. I'd prefer being able to adjust that tiny circle of visibility.\n\n    [*]Character skins are very limited.\n[/list]", "timestamp_created": 1512022287, "timestamp_updated": 1537388097, "voted_up": true, "votes_up": 15, "votes_funny": 2, "weighted_vote_score": "0.662452936172485352", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "51563906": {"recommendationid": "51563906", "author": {"steamid": "76561197976580958", "num_games_owned": 387, "num_reviews": 4, "playtime_forever": 16484, "playtime_last_two_weeks": 0, "playtime_at_review": 5343, "last_played": 1638225497}, "language": "english", "review": "Fun game, but at times it is a grind. For example, with each camp level upgrade (and subsequent player level upgrade), each building must be upgraded individually in order to unlock different things you can craft. Totally makes sense, except that at each level, the resources required to upgrade each building are all the same. And there's usually one or two resources that are harder to find. So you are forced to replay whichever side mission is best to get that resource multiple times over. For example, there are ~five levels in a row where each building requires 2 or 3 sheet metal, so you keep grinding out the same one or two quests that reward you with sheet metal. Then level 25-30 or so all require sheet of steel, because that's TOTALLY DIFFERENT than sheet metal. But it's just interesting and addicting enough that you grind it out a bit at a time. Just a bit repetitive.", "timestamp_created": 1561773405, "timestamp_updated": 1561773405, "voted_up": true, "votes_up": 15, "votes_funny": 3, "weighted_vote_score": "0.662353157997131348", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "22271689": {"recommendationid": "22271689", "author": {"steamid": "76561198007503248", "num_games_owned": 349, "num_reviews": 74, "playtime_forever": 769, "playtime_last_two_weeks": 0, "playtime_at_review": 736, "last_played": 1471913778}, "language": "english", "review": "Glorious game!\n\nOriginal HTS1 was ok.... now HTS2 is great!\n\n+ Graphics are good\n+ Sounds are good\n+ Weapons feel different from each other\n+ Deep skill progression system\n+ Base building!\n+ Superb crafting system\n+ 4 Player co-op :)\n+ Character Customisation (+ hide armour pieces)\n\n- Beta branch crashes alot (when loading a new map/mission) ... but its beta for stability reasons soooo...\n- Camera doesn't zoom out enough...  you can shoot further than you can see... wtf\n- Limited character customisation options... and the ones that are in are uninspired/dull", "timestamp_created": 1459961127, "timestamp_updated": 1459961127, "voted_up": true, "votes_up": 39, "votes_funny": 6, "weighted_vote_score": "0.661492347717285156", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "107824732": {"recommendationid": "107824732", "author": {"steamid": "76561198160606535", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 1372, "playtime_last_two_weeks": 0, "playtime_at_review": 856, "last_played": 1658095586}, "language": "english", "review": "How is it even possible to have a game with this much nothing? There's a huge forest to explore and there's just nothing in it. There are some plants, a lot of zombies for some reason, some rabbits, like one or two deer, a few huts with nothing in them, some train cars, and maybe some other stuff. I spent quite a while filling out the map and I didn't even finish it after an hour or two, I stopped because there was just absolutely nothing. The actual game part with an objective is quite boring too, and it doesn't even use the massive worldspace they already have. I feel bad for the level desingers because they clearly spent a long time making all of these assets and locations for there to just be, nothing.", "timestamp_created": 1641947464, "timestamp_updated": 1641947464, "voted_up": false, "votes_up": 18, "votes_funny": 1, "weighted_vote_score": "0.660457968711853027", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "36507552": {"recommendationid": "36507552", "author": {"steamid": "76561197978437344", "num_games_owned": 0, "num_reviews": 91, "playtime_forever": 781, "playtime_last_two_weeks": 0, "playtime_at_review": 739, "last_played": 1588132190}, "language": "english", "review": "[h1] Great game, but would I pay full price? Ehhh... No [/h1]\n\n[i] Here's why...[/i]\n\nDon't get me wrong, I am still enjoying this game, however there are certain things about it that bother me. -so far-\n\n    [*] [b] CAMERA HORROR [/b] \n\n                 It's an overview game with a fully 3D enviorment, [u]but you cannot rotate the camera[/u], which leaves you vunerable to being attacked from the lower part of the screen much easier than the upper, this limited camera function also almost halves the range you can shoot enemies if you are moving down than up. There are three views Zoomx1 which you will spend most of your time playing in if you want to see more than 5 feet around you. and Zoomx2 and x3 which are almost never useful unless indoors. If you are indoors there is a circle around you that spans five feet in all directions so that you can see the roof of the house you are in but not the other side of the room where a zombie might be sprinting at you from. This whole mess really started bothering me later on when zombies started sprinting at you when they become stronger, it becomes annoying that you are unable to react until they are directly upon you.\n\n [*] [b] ANNOYING QUEST OBJECTIVES [/b]\n\n                    There is a quest where you need to [spoiler] Clear out a farm of materials and lead pigs into a barn, sounds easy right? Well it's not, it can be, if you get lucky, but these pigs are undead and if you have the quest set to your level they will kill you in one hit, and they move [b] fast [/b] not only do they move fast but the way they have the barn set up you need to lead them over a ramp and into a fenced in area, the problem with this is once you get 3/6 in the pen they create an almost unpassable wall at the edge of the ramp when you are trying to lead more into the pen. So when you go to bring pigs 4-6 into the pen you will almost always die and need to use ressurection potions to get back up and run around them. It's one of those missions in a game where you are like \"what were they thinking when they made this\"\t[/spoiler]\n\n [*]  [b] USE THE BOW/PISTOL/MELEE OR DIE PLAYING YOUR WAY [/b]\n               \n                  Rifles and Assualt rifles are loud and don't ever do enough damage to justify using them since you can't shoot very far anyway because of the camera function covered before. Also crossbows are pointless since they are slower than bows and weaker than the pistol.\n\n [*]  [b] LACKING KEY SURVIVAL ASPECTS [/b]\n\n                 You can't grow plants but they play a key aspect in potion making and cooking food/drank. (maybe this is more of a personal problem I have with the game but it just doesn't make sense to me.)\n\nI still have a bit to go in the game and if I continue to push through it I will add more to this review, I got it in the humble bundle and it think it's worth the purchase if on sale..", "timestamp_created": 1510648431, "timestamp_updated": 1510648517, "voted_up": true, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.66019129753112793", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "77055678": {"recommendationid": "77055678", "author": {"steamid": "76561198077904750", "num_games_owned": 456, "num_reviews": 2, "playtime_forever": 1065, "playtime_last_two_weeks": 0, "playtime_at_review": 1065, "last_played": 1601759323}, "language": "english", "review": "Man what to say about this game. \n\nPros:\n- A major pro for me is it is about zombies yay!\n- It has multiplayer capabilities\n- Has pretty decent graphics\n- aiming with guns and bows is simple\n- gameplay is not hard\n\nCons\n- extremely repetitive backgrounds. Every area is auto generated with the same exact backgrounds. It becomes extremely bland very quickly.\n- The camp system (which is your main base building experience) is extremely lacking. Plus, you are not given much of a tutorial on how to use it.\n- There are numerous bugs and glitches in the game.\n- the variety of enemies you can fight is extremely bland. It get stale quickly as you kill hundreds of the same enemy over and over. \n- the weapons are bland as well. Plus in the time I was playing I never found a single weapon I could use in the world looting besides the crowbar. \n- The loot variety is bland as well. Plus it is somewhat hard to see the loot in the environment when walking around.\n- the camera is locked in place, not allowing you to move it. Which leaves you in awkward positions as you explore.\n\nOverall, the game becomes boring very quickly. The gameplay is extremely repetitive and in my 18 hours of playing I was bored most of it and only going through the motions hoping that the game would get more varied and better.", "timestamp_created": 1601862055, "timestamp_updated": 1601862055, "voted_up": false, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.656016886234283447", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "25477705": {"recommendationid": "25477705", "author": {"steamid": "76561198006920510", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 4546, "playtime_last_two_weeks": 0, "playtime_at_review": 4204, "last_played": 1494266161}, "language": "english", "review": "[h1] 3 / 5 [/h1]\n\nGreat Coop Game if you have friends to play with. The game has no real chat so joining other ppls games is always a bit frustrating.\nI liked the first game and I think it´s still better than part two.\n\n[h1]Pro[/h1][list]\n[*]Graphics\n[*]Kill Animations\n[*]Crafting\n[*]Some pretty cool Settings\n[*]Some pretty cool Quest givers\n[*][u]PRICE[/u]\n[/list]\n\n[h1]Contra[/h1][list]\n[*]No sleeping (and search for shelters / safe spots)\n[*]Zombies just standing around (in the first game they were sometimes clustering around dead bodies)\n[*]No female Zombies and [u]no bosses[/u]\n[*]Armour parts look crappy especially the helmets\n[*]Unbalanced weapons\n[*]No bosses\n[*]No filling stations for water or fuel\n[*]No flame or explosion weapons\n[*]Some settings feel empty and “lifeless”\n[*]No survival\n[*]Generic missions of collect xy or talk to yz\n[*][u]Some bugs prevent you from finishing missions![/u]\n[/list]", "timestamp_created": 1473680409, "timestamp_updated": 1473680756, "voted_up": true, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.653534591197967529", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "113649757": {"recommendationid": "113649757", "author": {"steamid": "76561198211371321", "num_games_owned": 397, "num_reviews": 31, "playtime_forever": 13908, "playtime_last_two_weeks": 0, "playtime_at_review": 13908, "last_played": 1593409623}, "language": "english", "review": "This game was released on 8 Sep, 2016. So it works fine in Win 7. Also in Win 10. Even co-op. However, I can't say about latter version of windows. This game is some challenging but possible to gain all the achievements (no matter who ever says about broken achievements) if you follow this guide: https://steamcommunity.com/sharedfiles/filedetails/?id=2146510938 you will be able to make it a perfect game.\n\nInteresting and fun game whether solo or co-op, although have no story but prompting about survival during your journey. I recommend it for both casual players so also specially for achievement hunters.", "timestamp_created": 1649613768, "timestamp_updated": 1649613768, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.652958214282989502", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "32296351": {"recommendationid": "32296351", "author": {"steamid": "76561197978191492", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 3333, "playtime_last_two_weeks": 0, "playtime_at_review": 1843, "last_played": 1545877320}, "language": "english", "review": "How to Survive 2, a nice fresh twist in to the survival horror crafting and basebuilding ganre. If you are in to top down shooters but olso love to feel progression, then this is the game for you. I have played a couple of survival horror open world games with crafting and basebuilding elements but this game is a nice refreshing snack im currently enjoying. \n\nDont get me wrong, tha game is good ! but needs to be fixed an example is the gameplay it would need some tweaking. Im talking SERIOUSE, a couple examples are the following: there is NO twisting of the camera perspective, this makes raiding houses at night at a higher level VERRY TENSE. The lack of visual controll (the camera) can be frustrating at times but the feel of reward you get once completing a quest if verry satisfying. Next are the character models, the weapons and pets. From my experiance the weapons (Bow, Crossbow, Pistol, Assault Rifle & Normal Rifle) ALL HAVE THE SAME SKINS just a different name a higher damage output once u go up some levels, i have to note that it feels lazy. Add some new variants of the original weapon, and put them on the higher tiers of the same weapon (this will make the build worth it !) Next to that is the placement of the weapons on the character, they are not possitioned correctly, the crossbow for example is placed in a way wich blocks off the right arm.. It feels illogical sometimes and can be painfull to whitness. Plus the fact that your able to carry 250 arrows WITHOUT a quiver amazes me, mind u its a \"survival game\" and this game lacks depth in the sense that the character lacks the items or the weapons to represent the \"survival feel\" next to that are the regurtitation of assets.. Most levels are the same, and could use some seriouse varriation.\n\nThe game \"feels\" like a grindfest from time to time, once you gain the gear you want there are NO other VISUAL differances in the weapons u have (same for the armours).. From level 1 till 30 it is all the same (what i have experiance so far). In a nutshell you go out in a open world to find quest givers, they unlock missions with loot that you need to build a base in the open world and weapons or armour for your char. The quests are instance based, so you CAN do coop missions, or both do the same mission in a different instance. We end up in seperate instances most of the time tho !, simply couse we get more loot that way?. These simple things are counter intuitive to the \"coop survival basebuilding\" ganre and could easely be fixed with some time, effort and ofcourse thinking with the correct mindset.... \n\nThe DLC and pets are pretty much a waste of money, they make you look different exept for the dlc with the missions. that one actually adds something of value. The pets however dont do annything exept scare the cr*p out of you when its night time and u can barely see. It would be nice to see a function to the pets, like the crow making a distinct sound when a enemy is near (just an idea). \n\nTo summerise,\n\ni love the game, but i hate it at the same time. It has SERIOUSE potential, sinse i bought this game about 3 times now to make my friends interested in it im hoping my feedback / comments *mild rants* will be heard by the devs. The game is in ALPHA, i am aware of this fact. Tho the progess in developing this game feels like its beeing done by 2 maby 3 persons, im saying this couse i have seen more developed games come out on the market within a shorter time period. As a supporter of this game i would say \"try it\" before you buy it. Its good, but it lacks some mechanics that make the game complete. Im voting it up, but not with full convincement.", "timestamp_created": 1497027280, "timestamp_updated": 1579267751, "voted_up": true, "votes_up": 18, "votes_funny": 1, "weighted_vote_score": "0.64701998233795166", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "39989614": {"recommendationid": "39989614", "author": {"steamid": "76561197973064116", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 4441, "playtime_last_two_weeks": 0, "playtime_at_review": 4205, "last_played": 1519193253}, "language": "english", "review": "Overall an ok game, it has a lot of fun elements but also a lot of missed opportunities.  Overall a 6.5/10, definitely worth it when it's on sale.  I wouldn't recomend buying it at full price and would skip it if you are bord of \"survival lite\" zombie games.\n\nTL:DR: basic graphics, repetative environments and quests, offset but decently fun progression and gameplay.  Not a GOTY contender by any stretch of the imagination but worth a few bucks if you like survival lite, and/or isometric games.\n\nGraphics: 4/10: isometric games generally are lower end graphics wise but this game is rather basic in this area. Maps are repetetive, animations are limited.  Areas start to feel extremely similar to one another pretty quickly.  Some effort is made to proved various \"biomes\" like forest, swamp, city etc but ultimately it's not enough and they HEAVILY reuse building interiors.  \n\nSound: 5.5/10: decent sounds convey the bleak apocalyptic setting well enough.  Different enemies have different sound effects that allow you to identify them.  The music gets repetetive.\n\nGameplay: 6/10: the isometric view and combat take a bit to get used to but function well enough once you figure it out.  \n\nSurvival/crafting: 6/10: it's survival and crafting \"lite\" which is fine by me.  People in search of a \"hardcore\" survival game will probably be dissapointed as it just uses a basic thirst/hunger system and once you get a few levels you will always have plenty of food and drink with no concerns over starvation.  It's also a casual approach as death is just a minor xp penalty and respawn.  I haven't played the harder difficulties so there may be some value there for people  in search of a more \"hardcore\" game.\n\nOverall though the missed opportunities are what make this game more of a \"buy it on sale\" affair.  A few things that would have made the game better:\n\n- Melee is too limited and over simplified: later in the game you run into more dangerous enemies that charge at you and can knock you down/deal large damage at close range.  There's also a huge amount of exploding enemies that must be killed from range.  Some sort of \"double tab space bar to dive to one side + left mouse click to quickly attack\" combo move would have made melee a lot more viable in the later game.  \n\nalso some sort of blocking for those high dps close range enemies would have helped.  Right click aims ranged, if it blocked in melee (with a specific timing needed to work that takes skill) would have been awesome. Due to these shortcomings of the overly simplified melee, you need to rely on ranged for a lot of situations.  maybe melee alone is viable but I don't see it especially due to the exploding enemies and lack of good block/dodge.\n\n- crazy powerful enemies that don't make sense: one of the most devastating mid game enemies is an infected bunny.  They really could have done better, like use infected bears, lions, something.  but an infected bunny?  C'mon devs, your better than that :P\n\n- complete lack of stealth: this might be controversial from those who think it would trivialize the difficulty and perhaps thats true but if there was some sort of risk/reward stealth gameplay option that would have been interesting.  Perhaps you need to use special armor that makes you more vulnerable as a trade off but having stealth in the game would at least open up more gameplay variety\n\n- more variety: the \"holiday\" zones like mardi gras, christmax, etc are a nice fund disctraction with different music and visuals but these are too few and too far in between to break up the monotony of otherwise similar quests in areas that look/feel the same to one another.\n\n- confusing mats: you need materials to upgrade your camp and gear but the game only sometimes makes it easy to actually find what you need.  A quest log that you can access whenever you want that breaks down both the mats you've found in the actual quest in the past as well as the quest rewards would make it a lot easier to remember where to get that metal grate or whatever when you need it.\n\n- a way to place exactly 1 entrance to the bunker on the map: you make your camp in a fortified spot but depending on where you set up you then need to run to a bunker entrance to then fast travel elsewhere in the world.  Having to make that run over and over and over doesn't really add any value to the game.  Sure you can build your camp next to an entrance but really letting the player build their own entrace would have been a great QOL upgrade.\n\n- confusing progression: I'm actually a bit conflicted on this because I do feel modern games hold players hands too much but in any event, the game progresssion isn't always very linear or sensical.  One example, you run into an \"infected turtle\" that is literally invincible unless you have the right ammunition to kill it.  The game does nothing to warn you about this or prepare you for it, you just start trunning into turtles at some point depending on your level and if you don't have the right ammo you can't kill it and can only run away.  Perhaps at least some sort of hint earlier in the game that \"certain types of ammo can pierce armor really well\" would have at least given the player fair warning that a) there are armored enemies in the game and that b) you need to upgrade your ammo to deal with them would have at least given fair warning.\n\n- story: so far the game is basically: there are zombies, you need to survive.  very basic, next to 0 character development or story arc.  Maybe it changes later on but a story or character driven game this is not.  an interesting plot would only help make this a better game.\n\n- weapon diversity: there's very clear \"best\" weapons as you progress that make all other weapons in that category useless.  A good game will design weapons that fill different niches. so maybe there's a fast attack weapon that can be \"top tier\" if you max out your desterity but that sucks if you are all strength.  This game doesn't allow for that level of customization, only rewarding using specific top end weapons for any given category.  creating a good light, medium, and heavy version of melee weapons with surporting skills for each would have allowed players more agency in how they build and play their survivor.\n\n- Ultra linear progression: what I mean is, there's always 1 bow, rifle, melee weapon etc. that will 1 shot most basic zombies as you progress.  If you don't upgrade your weapons and ammo, the game seems to get harder because that weapon will start to take more and more shots to kill off basic enemies even if you level up your survivors skills. \n\nBut it's not really getting harder because the very instant you craft the new \"best\" weapon and new \"best\" ammo and level up the appropriate skill you are suddenly back to the same power level as before.  This stagnant power level makes the game feel the same from beginning to end: sure I'm levelling up my skills but it's only so that I can keep pace with the enemies, I can never gain any ground.  Your character feels exactly as powerful at level 25 as it did at level 1.  Just keep your character skilled up in 1 primary weapon and maybe (but not necessarily) 1 secondary weapon and always make the new version as your advance and your set.\n\nOverall I'm closing in on 30 hours as I type this and will probably play until I hit max level and see if there's more of a story later on.", "timestamp_created": 1518307323, "timestamp_updated": 1518307900, "voted_up": true, "votes_up": 10, "votes_funny": 2, "weighted_vote_score": "0.639686048030853271", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "41872089": {"recommendationid": "41872089", "author": {"steamid": "76561198028044672", "num_games_owned": 1437, "num_reviews": 279, "playtime_forever": 468, "playtime_last_two_weeks": 0, "playtime_at_review": 468, "last_played": 1525295932}, "language": "english", "review": "I loved the first HTS game, not the 3rd person camera version (that one sucked), but the original first game was pretty cool! And even if the sequel looks great, I simply don't get it why they chose to go this route... it's definitely a fail for me. \n\nThey ruined it by scaling enemy difficulty according to your character level. That means if you are level 10 you go against level 15 enemies they will look exactly like all the other same type of enemies but are much harder to kill. Instead of 2 swings, you will need about 30. Yeah meh, it's just not very fun, to be honest. \n\nI don't remember the 1st one having this same gameplay mechanics, instead it was much more straightforward... Well at least this one has an online mode, but I would not recommend it, for the aforementioned reasons.\n\n I never finished the single player of HTS2, it was too hard and also boring and I'm now uninstalling it for probably the third time. But this time I won't look back. I just don't understand why they thought it was a great idea to make it so frustrating.", "timestamp_created": 1525543597, "timestamp_updated": 1530702963, "voted_up": false, "votes_up": 32, "votes_funny": 0, "weighted_vote_score": "0.638905525207519531", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "124678556": {"recommendationid": "124678556", "author": {"steamid": "76561197988448796", "num_games_owned": 1789, "num_reviews": 107, "playtime_forever": 4736, "playtime_last_two_weeks": 0, "playtime_at_review": 4492, "last_played": 1667200748}, "language": "english", "review": "[h1]Good sequel, satisfying 'one of those', solid 7/10 fun still worth checking out.[/h1]\n[b]While the presentation is certainly showing six years that have passed since the release, the gameplay of 'How to Survive 2' still remains far from being superannuated, delivering lighthearted, arcade fun in (kinda)open-world zombie survival formula.[/b]\n\n     [b]A[/b]nd said presentation is probably the easiest thing to get out of the way - nothing extraordinary considering the circumstances, i.e. a mild improvement and expansion on what its 2013 predecessor had to offer. Functional and pleasant visuals on par with mid-2010s AA indie game standards, aging accordingly and expectedly. Functionally and technically both as a game and a product [i]How to Survive 2[/i] is still rather solid, remaining as playable on the modern PC rig as it ever was.\nWhen it comes to proper gameplay and the formula- it performs maybe slightly worse, but not because of faults of its own, but by default and a result of changes in the market and all games of its silk that have been published afterwards. These days tags 'survival',  'crafting' or 'zombies' are (rightfully so) eye-roll-inducing for most, but the reality of the market in 2016 was considerably different and it would be unjust to even try attempt to scold HtS2 for relying on a played out melody. And possibly slightly unnecessary and foolish, considering all these core elements remain very much popular and successful across the industry, from the smallest indie games to AAA juggernauts, PC-core and multiplatform titles, attractiveness of this mix seems to be high, which plays to HtS2's favor, making it a game worth recommendation few years after its release. \n\n     [b]G[/b]ame is designed quite well, but after familiarizing yourself with its rhythm for a longer time it's apparent that the new design and transition from what HtS1 was, aren't fully realized and up to par with the ambitions of the developers. Even with 2016 standards HtS2 does slightly falls short when it comes to the variety and depth of various component systems. It might be not apparent after 10 or 20 hours of game time (even for veterans of the first installment) but the ambitions of the designer were clearly focused on something bigger and lasting for potentially much longer.\nThe pacing of progression and content on the offer (especially in the complete edition) is constructed and balanced well, but stretched too thin, even during the first playthrough. \n\n     [b]HtS2[/b] in its entirety relies on a 'Bethesda' format with the difference that two of three gameplay loops, exploration are looting, are serviceable but noticeably weaker compared to combat which is the star of the show. It's nothing to write home about in terms of difficulty, complexity, or spectacle, but still satisfying and carries the whole experience, tied with a nice selection of armaments and variety of enemy types.\nRepetitiveness is the name of the game,  but the trick is to coat core gameplay structure with enough distractions, randomness, and reactiveness to sufficiently overshadow turning gears. Here HtS2 almost does it in the long run, and in the shorter one (especially with a friend) I think it manages to do that. Especially in a situation without experience from the first installment and things that would carry to the sequel, like overfamiliarity with combat system that is improved and expanded but doesn't go beyond, at best, v1.5 of what has been provided previously.\n\n     [b]A[/b]s fun as it is, the game is accompanied by a recurring feeling of not fully utilized potential. It hits all the right notes but not as gracefully and hard as it should for the whole thing the be elevated into a great experience that can be recommended blind. \n'How to Survive' most likely won't become a trilogy, but the good news is that Eko Software is working on a spiritual successor: 'Paradize Project'. \nIt does look both very familiar and promising, but sadly atm looks like won't come out before the end of 2023:\nhttps://store.steampowered.com/app/1519090/Paradize_Project/\nHopefully, it will learn a lot from all successes and mistakes of both HtS games, and what the competition is doing and has done in the past few years in the booming Steam ecosystem, and will deliver something even more engaging and long-lived.\n\n[b]If you like this type of gameplay, then HtS2 package is a safe pick, especially on sale. Solo or with a friend, it is very enjoyable despite occasional jankines around the corners.[/b]\n", "timestamp_created": 1667158296, "timestamp_updated": 1667158296, "voted_up": true, "votes_up": 9, "votes_funny": 2, "weighted_vote_score": "0.637237310409545898", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "26172002": {"recommendationid": "26172002", "author": {"steamid": "76561197975569523", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 1141, "playtime_last_two_weeks": 0, "playtime_at_review": 978, "last_played": 1477174764}, "language": "english", "review": "I really enjoyed the first How to Survive, but this one is so repetitive and tedious.  I kept playing just to see if it would get better, but I'm 20 hours in and nothing has improved.  All the levels look the same.  They use the same building models in every town.  The music is the same as the first one, the enemies are the same, the sound effects are the same.  There is nothing about How to Survive 2 that improves on the first one.  Nearly everything about it is a step backwards.  Such a disappointment.", "timestamp_created": 1477175086, "timestamp_updated": 1477175086, "voted_up": false, "votes_up": 21, "votes_funny": 2, "weighted_vote_score": "0.636528372764587402", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "154213971": {"recommendationid": "154213971", "author": {"steamid": "76561198092034210", "num_games_owned": 0, "num_reviews": 139, "playtime_forever": 2718, "playtime_last_two_weeks": 0, "playtime_at_review": 2718, "last_played": 1703307280}, "language": "english", "review": "TLDR: Everything that made the first entry interesting and light hearted fun is now caked in layers of dookie.  Be kind to yourself and go get Taco Bell, you'll have a better experience than with this game. And yes, I'm including the -bathroom- time you're going to get.\n\nStory: Just like the previous entry, no real meat here. There are different questgivers to talk to, just like in the first, but only Kovac has voice over now, rendering all other NPCs less interesting and boring. Some of the H2S playable characters make an appearance, that was a nice touch. And the ending is garbage.\n\nGameplay: This was the saving grace of the of the previous H2S, it was simple, cut and dried. The fun came from exploring, unlocking resting areas by clearing a horde, crafting new weapons, the little funny ''Kovac's rules'' skits... Now all that has been replaced, in this entry, with the implementation of overly trying to add content that in the end doesn't work well. Before, a headshot meant aiming at a head long enough so the reticle would ''lock on'', guaranteeing the head shot for triple dmg. Now, you've got to aim at the mid section of the enemy to get the head shot. While it doesn't sound so bad, when you face off against hordes, itjust doesn't work since you can't really see where their bodies are amongst the crowd. Your reticle will end up hoping from one target to the next and you'll have a difficult time shooting the one guy you meant to. It's frustrating.\nThe inventory was replaced by a system of max weight, which could be good, but isn't alphabetically organised... sure, there are tabs that separate weapons, armors, healing items, etc, but it is still a giant mess. Weird to think I preferred the limited slot inventory of the first How to Survive. \nThere is still the thirst and hunger need, but resting is gone. So no skipping nights. \nOne of the main reasons for my disappointment in this title game was the way quests work; once you accept a quest, it will teleport you to an area (swamp, city, sewers, etc) and you're there for the duration of that quest. Meaning once you've completed it, all that's left to do is warp back to camp. There is no real exploration, no new places to go to, no new path to discover. It's just, talk to this quest giver, get warped here, grab this and do that, head back, rince and repeat. Certain quests have certain rare mats spawns so, expect to replay it a lot.\nCompleting quests earns you xp, which you can use to level your camp, your character and learn skills; more rifle dmg, melee dmg, more health per heal, etc.\nThe camp, where you can build and upgrade very few buildings, requires some rather rare mats later on and you'll be replaying missions to find the mats you need to upgrade the buildings. Generally speaking grinding can be satisfying, as it gives you an edge in most games, but not here since everything levels with you. \nBuildings upgrades are locked behind the camp's level, which also caps (the camp's lv) behind a ''Kovac's challenge'' every few levels, which is a giant horde attacking your base and attempting to destroy everything you own. So if your defences and placement are inadequate, prepare to rebuild everything you've already done. Establishing your base in a smart location is primordial, because having to redo your base elsewhere is a huge pain. It's important to lv intelligently as every time you level up your camp, the enemies all get tougher... Meaning you'll need to spend your xp on your character, camp and skill evenly, and make sure you've upgraded your buildings enough to craft the latest weapons and armors. It sounds good, but it's tedious and annoying.\n\nGraphics: Some areas are acceptable, but the majority of the buildings' insides look worse than Silent Hill's textures on PS1. That's hard to do, but they managed to accomplish that.\n\nAudio: I was in a hurry to finish this game, so everything bothered me. \n\nI read some of the reviews before purchasing the title and I thought, come on, it can only have gotten better, yeah? Well, no. I wanted to like this game as much as I liked the previous, but in the end I just wanted it to be over. And considering how long it took me, I REALLY wanted it to be over.", "timestamp_created": 1703340716, "timestamp_updated": 1703341337, "voted_up": false, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.63451617956161499", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "18745210": {"recommendationid": "18745210", "author": {"steamid": "76561198005397874", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 887, "playtime_last_two_weeks": 0, "playtime_at_review": 241, "last_played": 1468367866}, "language": "english", "review": "I played and loved the first game in this series.  This one is early access and already as fun as the first.  Runs smoothly and the multiplayer looks promising. And you cant beat the 15 dollar price!! +1 from me so far.\n\nLooking forward to see what else they add/upgrade over time.", "timestamp_created": 1446138006, "timestamp_updated": 1446138006, "voted_up": true, "votes_up": 51, "votes_funny": 5, "weighted_vote_score": "0.63449549674987793", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "26491118": {"recommendationid": "26491118", "author": {"steamid": "76561198186102453", "num_games_owned": 0, "num_reviews": 81, "playtime_forever": 459, "playtime_last_two_weeks": 0, "playtime_at_review": 421, "last_played": 1593947362}, "language": "english", "review": "The game itself is very enjoyable with base things, but it gets very repetitive and we don't have much features to enjoy the game. I think what we need is:\n\n-More zombie execution animations\n-Different, more maps and areas\n-More character customizations\n\nand it goes on... For now, I'll leave a thumbs-down, let's see then if the game progresses.", "timestamp_created": 1478622382, "timestamp_updated": 1478622382, "voted_up": false, "votes_up": 24, "votes_funny": 1, "weighted_vote_score": "0.632304072380065918", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "54150364": {"recommendationid": "54150364", "author": {"steamid": "76561198138000280", "num_games_owned": 410, "num_reviews": 19, "playtime_forever": 6904, "playtime_last_two_weeks": 0, "playtime_at_review": 6904, "last_played": 1563386415}, "language": "english", "review": "i wanted to finish it before i gave it a review but.. i can't.. i just.. i can't okay.. i don't want to talk about it..\n\n[b]actually i do!! and here's my 2 cents!![/b]\n\ntoday my friends, monotony has a new name. it's name is how to survive 2.\n[list]\n[*]it's not an adventure/rpg like h2s1, it's a survival/crafting game with \"rpg elements\" and zombies in it.. it's isometric though so i suppose there's a change of pace for you hey??\n[*]it might be fun for the first half hour until you see the same house model, because there are about as many as i can count on one hand, for the 200th time\n[*]i know it's a zomboid survival game, but the reason you don't hear these same zombie groaning sounds over and over again, non stop, in decent games is because they either don't last as long, there are fewer zombies(re), or they're shortish mission based games(l4d)\n[*]in h2s1 you could craft a nail gun.. in h2s2 you can craft an [spoiler]assault rifle[/spoiler]. if it's supposed to have a hint of realism(yes, yes, i know, zombies and all), then this doesn't make any sense.. but then why do i have to manage hunger/thirst/inv weight?? oh right, and there's no such thing as sleeping, let me just finish crafting my new [spoiler]assault rifle[/spoiler] and drink some water or my vision is apparently going to get \"blurry\" and i won't be able to aim as quickly.\n[*]environments.. well there are only a few smallish ones littered with the exact same houses/buildings/textures you saw in the last environment of the same type. there are only a few of those too. less than i can count on one hand and more than i care to remember.\n[*]the grind, oh for the love of puppies, the griiiiind. having to repeat missions over and over and over and over to get exp or items that you need in order to craft something is expected of you.. but i don't wan well, you have to\n[*]the scroll bars on the sides of lists of things for example your inventory or crafting lists don't work. why is this a bad thing you ask?? because later game, you might have to take the day off from work or leave it until a weekend to scroll to the bottom with the mouse wheel. don't forget your mouse with a wireless internet connection so you can scroll when you go on a business trip or take your date to the movies. \"hey man. hey, what's that in your pocket??\". it's a mouse. i'm just scrolling.\n[*]what went though the dev's/devs' mind/minds when they decided to make some of the utterly stupid enemies. [spoiler]infected turkeys?? infected rabbits?? certain infected rabbits are tougher than bears. i bet you don't get infected moles though?? 'course not, that would be stupid.\n[*][spoiler]compared to h2s1, the nocturnal infected are a laugh.. well not really, everything about them is boring[/spoiler]\n[*]i don't know if the devs designed all the assets themselves, they probably did, but it [b]looks[/b] like someone just bought a few, ran out of money fairly quickly, and thew them in all over the place.\n[/list]\nh2s2 should have either stuck with the adventure/rpg formula for 1 which worked or went with dinosaurs instead, not precisely the same few buildings, same few sounds, same quest types, same environments, and made it shorter. in my opinion it outstays it's welcome and co-op means exactly the same with 2 people seeing as it's not a 10th as complete as a survival game should be.. just my 2 cents.", "timestamp_created": 1563387847, "timestamp_updated": 1563826523, "voted_up": false, "votes_up": 32, "votes_funny": 15, "weighted_vote_score": "0.63211214542388916", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "77455744": {"recommendationid": "77455744", "author": {"steamid": "76561198090208789", "num_games_owned": 151, "num_reviews": 60, "playtime_forever": 7391, "playtime_last_two_weeks": 0, "playtime_at_review": 7387, "last_played": 1602937590}, "language": "english", "review": "Despite mixed reviews I still think this game is good. If you looking for a coop game to have fun with your friends this game could be a good option, specially if its on discount.\nYour goal as a player would be building and defending your base. So overall gameplay could repetitive, therefore I do not recommend it for solo play.\n\nBut I really would like to see How to Survive 3. With improved base building options, more weapon, chat and better item management UI.", "timestamp_created": 1602519625, "timestamp_updated": 1602519625, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.631290614604949951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "54320232": {"recommendationid": "54320232", "author": {"steamid": "76561198023974103", "num_games_owned": 859, "num_reviews": 84, "playtime_forever": 410, "playtime_last_two_weeks": 0, "playtime_at_review": 410, "last_played": 1564224878}, "language": "english", "review": "How would you classify this game? Personally, I'd call it an open world sandbox survival RPG, but I'm not completely sure if that'd be entirely accurate. Truth is, it has a combination of survival, sandbox RPG, and Diablo-esque action RPG all in one. That is to say that you can pretty much do whatever you like in your camp and during quests, you create and build up a character through a light RPG skill system and as fun as the quests can be, they can also be a bit grindy as aRPGs are. Throughout it all, you have to be careful to watch your food and water rates. Moreover, it doesn't take much to get killed but all weapons and gear have strategy to them which help you even the odds a bit. This is all tied together by an impeccable sense of atmosphere, yet it's measured by an equal sense of humor as well.\n\nIn general, How to Survive 2 is a very, very fun game when you play it more like a simulator. If you go in expecting massive, epic missions every time, or the ability to customize a character's looks or skills down to the finest detail, you'll be disappointed. Instead, when you play it more like a simulator, it feels a lot more enjoyable. This enjoyment is multiplied by the multiplayer feature. Joining up with other players is very fun, especially during the missions. I've played the game with a friend before and we took on a nighttime mission into a town. The whole way, it was downright creepy because we'd hear the groans and growls of zombies that we couldn't see, so we knew we needed to keep an eye out but not lose sight of the goal in the mission. Eventually, we ran into a huge horde of zombies and got split up. I ran toward a chokepoint within a decaying building where I was able to split off the horde between a doorway on one end and a fallen wall on the other. I was able to eliminate the ones coming through the door with my pistol so that by the time the others came through the wall, I could focus on them alone. Eventually, this enabled me to reunite with my friend. We succeeded at completing the mission but not after several massive close calls. This is just one example of some of the tactics and natural scenarios that play out in this game, especially with multiplayer.\n\nThe story itself is really rudimentary but that's because this isn't a narrative RPG. It serves more to help you learn the game and build yourself up. As I mentioned prior, it has a fantastic sense of atmosphere but it's balanced by a Borderlands-esque humor during some of the story missions. It's passable but again, don't come in expecting Fallout.\n\nThe world is open, but not seamless. You have your basic overworld where you can find random enemies and resources and that's the area that you build your base. There are a lot of options in that regard, as the world consists of forest areas, swampy areas, cabins, trains, clay pits and so forth. As far as environmental design goes, however, the missions are where the game really shines. The atmosphere goes from good to great during most missions and because of the randomized nature of them, each one of them feels mysterious and you get a sense of apocalyptic adventure when exploring these maps. From standard forest hunting trips to supply runs in ruined cities to a mission at an overrun farm, it all gives me the same vibes I got the first time I played Telltale's The Walking Dead: Season 1 and even some of the same vibes I got from watching the show. This is the game to play if you want to live out your Walking Dead action fantasies and you can roleplay if you have friends that want to play that way, but if you want something where you can create a character with a story and proper choice-and-consequence, this isn't the game for that. I'd recommend the Telltale Walking Dead games or the Fallout series for that sort of gameplay (you can even get a mod for Fallout 4 that enables a zombie apocalypse).\n\nOverall, I do recommend this game. It can be extremely fun but you need to go in with realistic and informed expectations. Again, don't expect a groundbreaking story with choice and consequence, a seamless open world and loads of detail. It's a pretty good newbie-friendly and semi-lightweight alternative to other survival games like DayZ or Fallout 76.", "timestamp_created": 1564226652, "timestamp_updated": 1564226652, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.631182432174682617", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "18806724": {"recommendationid": "18806724", "author": {"steamid": "76561197988113155", "num_games_owned": 0, "num_reviews": 155, "playtime_forever": 548, "playtime_last_two_weeks": 0, "playtime_at_review": 36, "last_played": 1479273063}, "language": "english", "review": "How to Survive 2 is an iso arpg/survival zombie game thats a very playable, fun, early access game, which is a rare find! Already I like the setting and atmosphere (Louisiana) a lot better than the boring islands in the first game. H2S2's gameplay is nearly identical to the first game, which is a good thing, although I hope they improve combat just a bit, it still feels a little stiff with melee. \n\nI like the added \"camp\" (a home base) and its cool to be able to build stuff and defend it. Also, I have noticed my avatar is able to run longer distances before depleting stamina compared to the 1st game. I recommend H2S2 even in its current state. \n\nBut be warned...it doesn't have female avatars yet!!!!...which seems to be the number 1 complaint in the forums...for some reason this game has attracted extremely picky people with entitlement syndrome. If you liked H2S, and god forbid you can look past the exclusion of being able to be a female avatar, you'll like H2S2. Its only going to get better.\n\nUpdate: Female avatars are now an option in this game, satisfying liberal feminists around the globe including the 2 that play this game.", "timestamp_created": 1446347027, "timestamp_updated": 1457220454, "voted_up": true, "votes_up": 21, "votes_funny": 3, "weighted_vote_score": "0.629207849502563477", "comment_count": 56, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "97883293": {"recommendationid": "97883293", "author": {"steamid": "76561198155526252", "num_games_owned": 0, "num_reviews": 44, "playtime_forever": 1856, "playtime_last_two_weeks": 0, "playtime_at_review": 1511, "last_played": 1672430791}, "language": "english", "review": "I think the first one was kinda better", "timestamp_created": 1629409014, "timestamp_updated": 1629409014, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.628976225852966309", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "45323816": {"recommendationid": "45323816", "author": {"steamid": "76561197998817967", "num_games_owned": 668, "num_reviews": 234, "playtime_forever": 899, "playtime_last_two_weeks": 0, "playtime_at_review": 899, "last_played": 1537638202}, "language": "english", "review": "This is a sequel to How to Survive, a pretty fun fast paced but short survival game, and unfortunately, while it offers way more content, it delivers it in a very grindy manner and is way more slow paced than original, making it a slog, even more so slogged up by mandatory grinding.\n\nSee, the original was fun. It was intense, desperately hunting for bedding or food while taking on zombie hordes. It was short with unenticing bonus modes like challenges, but the core game was fun with different weapon variations and requirement of mixing different approaches for different enemies while running from hordes. Well, you still got hordes here, but most of time you'll be taking on like several zombies at a time. And, well, it's way more slow, without the frenetic chases as you can often dispatch even hordes before they reach you, provided you have level-appropriate gear. And combat is just using your weapons and running, you don't have zombies that have resistance to bodyshots or headshots anymore. It feels more close to some diablo-like arpg with crafting and no special abilities than a more eclectic survival action that was the original. Even the survival aspect is reduced to a chore, where original had inventory limitations and severe hunger/thirst penalties, forcing you to go off course to forage some goodies or find a safehouse, here you'll soon enough reach a point where you have food and water aplenty.\n\nOh, and, one big addition. You get to build a settlment here. See, each \"mission\" takes you to some premade area, and after each you return to hub area, that's a sort of wilderness area with random zombies, scattered NPC quest givers, and you get to build stuff. Which is, well, grindy. Very much so. I had to replay same mission multiple times to earn supplies just to upgrade several structures multiple times. And quests themselves are odd, the variation of environments makes them feel all samey, even though it seems devs did put effort into adding some variation of mission - and yet, fetch quests remain prevalent. Quest givers are an odd bunch too, there's Kovac who's back from original game, and he's the only voice one - the rest, be it a couple of redneck bothers, Kovac fanboys, Kenji from original game (whose inclusion is somewhat goofy if you ask me), or a guy who is convinced his love's soul if trapped in a shovel. Yup, sounds like a fun bunch, but not like you gonna bother reading the dialogues, will ya? They're fine to sometimes cringy, but don't exactly have any depth to them, especailly when regardless of what's said there's 50% chance you'll just have to collect specified items. Settlement building, by the way, involves building defenses to defend a spire, which allows you to tier up, but it's a rare event so you'll be easting most resources upgrading crafting stations, which will offer like two-three new items per level. Oh, and, there's this whole perk and level system stuck to it all, that requires you to collect XP from quests and zombie kills and invest it into perks (tangible effect but restricted by level), own level (improves zombies more than it improves you, restricted by camp level) and camp level. Which is indeed convoluted, and was probably implemented just to balance out co-op somehow.\n\nAlso, it looks pretty generic. The only remarkable thing is probably those Kovac's Guide animations which are only like three or four in this game, including intro one. Otherwise it's very generic and derivative. Soundtrack is recycled from first game. Oh, and, interface, another pet peeve - it was definitely not designed with PCs in mine, being quite cumbersome for mouse users - and it's not like entire game can be played with keyboard you know, you need that damn button for all the hacking and slashing you gonna do, clocking on samey zombies while they'll die. Hell, not just zombies are samey here, you're bound to revisit exact same looking stores and homes dozens of times while in the city.\n\nSo, yeah, may wanna pass on this one. I sure hope that if developers intend to continue the series, they'll make it more frenetic and less grindy in the next installment, because 1st game was pretty neat, even if short.", "timestamp_created": 1539867751, "timestamp_updated": 1539867751, "voted_up": false, "votes_up": 9, "votes_funny": 2, "weighted_vote_score": "0.62858051061630249", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "134794294": {"recommendationid": "134794294", "author": {"steamid": "76561198044916804", "num_games_owned": 1836, "num_reviews": 508, "playtime_forever": 595, "playtime_last_two_weeks": 0, "playtime_at_review": 393, "last_played": 1679184914}, "language": "english", "review": "the first one was better insane grind in this game", "timestamp_created": 1679030986, "timestamp_updated": 1679030986, "voted_up": false, "votes_up": 11, "votes_funny": 2, "weighted_vote_score": "0.628563761711120605", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "44359314": {"recommendationid": "44359314", "author": {"steamid": "76561198125750182", "num_games_owned": 108, "num_reviews": 10, "playtime_forever": 311, "playtime_last_two_weeks": 0, "playtime_at_review": 311, "last_played": 1535152364}, "language": "english", "review": "Pros:\n- You can play with your friends\n- Twitch connection\n- SemiAuto-aim\nCons:\n- Here we go\n- You can't change settings ingame\n- Waste of lots of time while loading screen\n- Didn't patch over 1 and half year\n- Suck lobby system\n- Suck multiplayer\n- Suck fight mechanics\n- People will probably join randomly your game and steal your staff because you cant password your game\n- Suck skill system\n- You have to upgrade your skills in for steps but you can't get anything before 4th step\n- Bows overpower, guns underpower\n- NPC's same shit, different colour\n- You have no choice, all upgrades must be done\n- If you using bow probably only 10 arrows will be enough because you can get back every single arrow from corpses\n- USE BOW, NOT ANYTHING ELSE\n- There is not a thing as hunger, you are fed or starving\n- Random spawn of random items (Early game's rare stuff spawns next to NPC in late game)\n- Doesn't even have an ingame chat\n- Trying to make look like real, making real shit\n\nI think that's enough.\nNot even worth for 1$", "timestamp_created": 1535153420, "timestamp_updated": 1535153498, "voted_up": false, "votes_up": 23, "votes_funny": 9, "weighted_vote_score": "0.626575291156768799", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "29497982": {"recommendationid": "29497982", "author": {"steamid": "76561198114226859", "num_games_owned": 0, "num_reviews": 40, "playtime_forever": 2456, "playtime_last_two_weeks": 0, "playtime_at_review": 2456, "last_played": 1484330554}, "language": "english", "review": "May sound repetitive, but I loved the first one. Not this.\nThis is no longer an open world game as it used to be, the mission and stages are so boring and repetitive and there's no hint on how to put the loots in use.\nTotal failure.", "timestamp_created": 1485420736, "timestamp_updated": 1485420736, "voted_up": false, "votes_up": 32, "votes_funny": 1, "weighted_vote_score": "0.626556336879730225", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23644577": {"recommendationid": "23644577", "author": {"steamid": "76561198015089838", "num_games_owned": 857, "num_reviews": 36, "playtime_forever": 662, "playtime_last_two_weeks": 0, "playtime_at_review": 429, "last_played": 1501161930}, "language": "english", "review": "This is a great game and it's very addictive. If you like survival, open worlds, 3rd person shooters, upgrades, base building and customisation then you'll love this!\n\nThere's 4 player local co-op, which I've been using to play 2 players. There's also 4 player online co-op in case you're foreveralone.jpg. The character levelling/skills system has both useful and meaningful stats to improve. This makes grinding experience a lot more enjoyable as the incentive of both loot and the ability to improve yourself are subsequently rewarded. The base building system is easy to use/ very intuitive. There's a tonne of buildings e.g. kitchen, armory, stash. Each building will help provide your character support in one way or another. There's also defences which are necessary as your base grows. Zombie horde attacks increase in size and difficulty the more prosperous your base becomes.\n\nTo have a game as good as this in early access speaks volumes about the games future potential and I can't wait to see what the developer brings us next.\n\n", "timestamp_created": 1466309662, "timestamp_updated": 1466309662, "voted_up": true, "votes_up": 14, "votes_funny": 1, "weighted_vote_score": "0.626520752906799316", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "97337262": {"recommendationid": "97337262", "author": {"steamid": "76561198110823165", "num_games_owned": 28, "num_reviews": 15, "playtime_forever": 380, "playtime_last_two_weeks": 0, "playtime_at_review": 367, "last_played": 1633344672}, "language": "english", "review": "great with friends but i have no friends", "timestamp_created": 1628660832, "timestamp_updated": 1628660832, "voted_up": true, "votes_up": 18, "votes_funny": 36, "weighted_vote_score": "0.626407086849212646", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "138723347": {"recommendationid": "138723347", "author": {"steamid": "76561198103473901", "num_games_owned": 124, "num_reviews": 2, "playtime_forever": 3905, "playtime_last_two_weeks": 0, "playtime_at_review": 606, "last_played": 1686524349}, "language": "english", "review": "Big downgrade from the first title. The combat is worse than HtS1 because charged attacks can't be released when you want to but have a fixed duration, also there is a weird lock-on on enemies that makes it hard to hit multiple enemies at once. The game is way less focused on exploration than HtS1, it is mission-based with uninteresting, underdeveloped and not even dubbed characters. The base building aspect is interesting, but even here there are problems: you have a \"trunk\" (a chest) where you can store a lot of items. If you decide to destroy it to relocate your base you lose EVERYTHING you had stored, with no warning or anything - no, items don't even fall on the ground, they are just instantly deleted. The game is full of stupidities like these. Very disappointing, HtS1 was an original, fun game that wasn't trying to be a masterpiece but did its job well. HtS2 feels rushed, low-effort and honestly a downgrade from HtS1. I cannot recommend this game.", "timestamp_created": 1684709825, "timestamp_updated": 1684710434, "voted_up": false, "votes_up": 13, "votes_funny": 1, "weighted_vote_score": "0.625592470169067383", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "133194867": {"recommendationid": "133194867", "author": {"steamid": "76561197995947354", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 24972, "playtime_last_two_weeks": 0, "playtime_at_review": 24972, "last_played": 1676736740}, "language": "english", "review": "What an unexpected little gem of a game!  I discovered this game quite by accident in January 2023, and by mid-February I'd put in over 400 hours and I'm still enjoying it. Only single player for me, so no comments on the multiplayer.", "timestamp_created": 1676837247, "timestamp_updated": 1676837247, "voted_up": true, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.62456977367401123", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "38687864": {"recommendationid": "38687864", "author": {"steamid": "76561198061469259", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 92, "playtime_last_two_weeks": 0, "playtime_at_review": 92, "last_played": 1514274161}, "language": "english", "review": "DO NOT BUY THIS! GET HTS1 INSTEAD!\n\nBought this because after the 20 hour campaign gameplay from 1 was satisfying, a balance of survival and action.\nYet 2 local campaign has no story support, unclear instructions yet it feels like a bunch of scattered ideas combined to be a game, hardly a sequel to the great HTS1.\n\nNeedless to mention that it has no pause function, even in local game.", "timestamp_created": 1514274376, "timestamp_updated": 1514274376, "voted_up": false, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.624363839626312256", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "143386594": {"recommendationid": "143386594", "author": {"steamid": "76561198875322282", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 99, "playtime_last_two_weeks": 0, "playtime_at_review": 99, "last_played": 1691153188}, "language": "english", "review": "its absolutely downgrade from hts1, the campaign mode is not realy adventure that you can explore the island, its just feel you spawn in a some level with square little maps, its just not feeling the story of the campaign mode, the combat is feel so hard, everytime you die you just spawn in start postition in the map. Just play the hts1", "timestamp_created": 1691153543, "timestamp_updated": 1691153543, "voted_up": false, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.624279797077178955", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "146972402": {"recommendationid": "146972402", "author": {"steamid": "76561198112819846", "num_games_owned": 0, "num_reviews": 440, "playtime_forever": 370, "playtime_last_two_weeks": 0, "playtime_at_review": 370, "last_played": 1695599235}, "language": "english", "review": "This is one of those games that starts off pretty well and then becomes boring and grindy. You can't build anything cool like a base or house. You just run around killing zombies to get XP in order to upgrade your camp. It also quickly reaches the point where in order to build anything you must build/craft something else that requires a ton of resources that can only be obtained by repeating previous missions and completing other missions that you often have no idea how to even start. There is no real single player campaign. Gameplay instead feels more like a mobile game ported to pc. There are also no graphic options, the camera cannot be rotated, you cannot pause the game or manually save, inventory is text-based and very plain, the environment always looks the same, you never pick up any cool gear or weapons, and your character always looks the same and never seems to improve in any noticeable way. After a while, I simply lost interest because in my opinion there's no rewarding gameplay or a reason to continue playing. Overall, I ended up not enjoying my time spent with this game and I therefore cannot recommend it.", "timestamp_created": 1695600487, "timestamp_updated": 1695600528, "voted_up": false, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.621908426284790039", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "89619680": {"recommendationid": "89619680", "author": {"steamid": "76561197997739320", "num_games_owned": 588, "num_reviews": 56, "playtime_forever": 1401, "playtime_last_two_weeks": 0, "playtime_at_review": 929, "last_played": 1622928697}, "language": "english", "review": "Fun with co-op through online. I would recommend to set friendly fire off.", "timestamp_created": 1617438365, "timestamp_updated": 1617438365, "voted_up": true, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.620367169380187988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "32409571": {"recommendationid": "32409571", "author": {"steamid": "76561198072276670", "num_games_owned": 305, "num_reviews": 8, "playtime_forever": 302, "playtime_last_two_weeks": 0, "playtime_at_review": 302, "last_played": 1473024797}, "language": "english", "review": "If anyone here has played dead frontier, they know why I bought this game. \n\nFirst off, the game isn't actually open world. The 'open world' map is actually just a hub. NPCs give you various quests that teleport you to different locations should you accept them. When you complete the quests you get teleported back to the hub. \n\nThe story isn't very compelling at all. The first NPC Kovac just keeps giving you quests that feel more like tutorials than anything else. The quests were boring enough and the 'open world' concept was disappointing enough to make me quit after a few hours of forcing myself to play it. \n\nThe combat system on the other hand, is actually nice. It's almost how i wanted the combat to be. The crafting system is simple enough. I didn't think anything of it. Same with the hunger system. \nLast of all, the survival part of the game isn't that deep (even though I would have wanted it to be). You don't need rest, which makes no sense. I think a mechanism for resting is an integral part of a survival game. And I've already stated what I needed to about the hunger (and thirst) system. \nAs for the art style, it's nice, nothing special, but just nice. \n\nAll in all, the only part i actually liked about the game was its combat. I was indifferent toward the survival aspect because I'd have cared about it if the story and the quests themselves had been compelling enough to keep me playing the game in the first place. \n\n", "timestamp_created": 1497444433, "timestamp_updated": 1497444433, "voted_up": false, "votes_up": 25, "votes_funny": 1, "weighted_vote_score": "0.619839608669281006", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "20129994": {"recommendationid": "20129994", "author": {"steamid": "76561197973084037", "num_games_owned": 887, "num_reviews": 5, "playtime_forever": 7624, "playtime_last_two_weeks": 0, "playtime_at_review": 515, "last_played": 1613242238}, "language": "english", "review": "It's awesome. At the beginning you need little adjusting but you get used to it :D I just miss the PAUSE BUTTON :/ In HTS1 it paused when you went to INVENTORY, MAP and MENU, here it doesn't. But for EARLY ACCESS it's really good.", "timestamp_created": 1451514521, "timestamp_updated": 1451514521, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.617402732372283936", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "20653352": {"recommendationid": "20653352", "author": {"steamid": "76561197985621679", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 10061, "playtime_last_two_weeks": 0, "playtime_at_review": 3480, "last_played": 1483076571}, "language": "english", "review": "How to Survive 2!  I was really looking forward to this game.  I'm a big fan of the first one mainly because it was so much fun playing coop.   So I was excited to hear HtS2 supported four players!  I have not been dissapointed.   How to Survive 2 offers up a solid coop experience where you get to explore, craft, and kill zombies... again.   Keep in mind the game is in early release so I expect there to be a lot of positive changes.\n\nThe positives:\n-An open world to explore\n- A camp building feature that allows you to build multiple camps any where on the map\n- Lots of new weapons and upgrades: melee, bows, crossbows, pistols, rifles, SMGs etc.\n- Multiple attack types with melee weapons\n- Quests with a good variety of map types\n- Peircing damage!  I love lining up zombies and taking them out with one shot\n- Scaling difficulty based on the level of your camp and player\n\n\nNegatives\n- Invisible zombies.  Yes, it's a bug and I would bet it's on the top of their bug list.  Luckly others in your party can warn you of the impending attack so you can melee or run\n- No melee finishing moves.   I hope they put these back in from H2S.  It was very satisfying\n- The game is a bit unbalanced right now.  You get way more food then you need and a chem lab where you can make buffs you don't need.  I'd like to see them become usefull.\n- A couple of bugged quests.  Again, it's early release.  There are work arounds.\n\nOverall it's totatly worth playing, especially for the cost.", "timestamp_created": 1453343228, "timestamp_updated": 1453343328, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.616737782955169678", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "23604898": {"recommendationid": "23604898", "author": {"steamid": "76561198014163140", "num_games_owned": 407, "num_reviews": 6, "playtime_forever": 238, "playtime_last_two_weeks": 0, "playtime_at_review": 118, "last_played": 1466362934}, "language": "english", "review": "While I just played the game for half an hour, I still want to leave a review to discuss some points in other negative reviews that made me reconsider even giving the game a shot.\nThe game runs without problems, looks nice, got nice sound and overall visual effects, too. You are able to change the resolution and the shadow quality, where in my opinion \"low\" still looks really nice.\nI am playing with a gamepad and this game works flawlessly, and the controls were easy to learn and adapt.\nI never played the prequel, but I already like what I've seen from the story.\n\nThis game may or may not be like the first, that is not for me to judge. But everyone who is looking for a casual zombie/survival/roleplay/hack&slay game that can be played easily while using a controller and relaxing on the couch, you should take a look at How to Survive 2.\n\nI will continue playing the story and discover what I will be able to do in my camp, once it is set up!", "timestamp_created": 1466118973, "timestamp_updated": 1466118973, "voted_up": true, "votes_up": 14, "votes_funny": 2, "weighted_vote_score": "0.61649024486541748", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "97825730": {"recommendationid": "97825730", "author": {"steamid": "76561198146518300", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 4070, "playtime_last_two_weeks": 0, "playtime_at_review": 3568, "last_played": 1683645278}, "language": "english", "review": "It's good we can host own server or camp, but we can't give password or make it friends-only.\nWhen others people join your camp / server, it's always make lag to me and my friends.\n\nHope developer can fix this simple feature. Just give password or make friends-only on camp.\nThen I'll recommend this game.", "timestamp_created": 1629325823, "timestamp_updated": 1629325823, "voted_up": false, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.616423308849334717", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "42149292": {"recommendationid": "42149292", "author": {"steamid": "76561198025263977", "num_games_owned": 567, "num_reviews": 42, "playtime_forever": 3462, "playtime_last_two_weeks": 0, "playtime_at_review": 3460, "last_played": 1526850449}, "language": "english", "review": "4 / 10, Mediocre!\n\nHow to Survive 2 is a far cry from first game in the franchise. I'm not saying the first one was great, but at least it was fun.\n\nThis version just feels rushed, unfinished, poorly balanced and rightfully annoying. It's ok for the first hours, but repetition and constant grinding soon become the main scenery. It definitely had some potential, but sadly, in it's current state, it's nowhere near a good, mainstream game.\n\nPersonally I wouldn't recommend buying this game unless a big overhaul of the game's mechanics and quests would be in the works.", "timestamp_created": 1526852536, "timestamp_updated": 1526852536, "voted_up": false, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.61625140905380249", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23778156": {"recommendationid": "23778156", "author": {"steamid": "76561197983409337", "num_games_owned": 494, "num_reviews": 20, "playtime_forever": 113, "playtime_last_two_weeks": 0, "playtime_at_review": 113, "last_played": 1466824972}, "language": "english", "review": "I realize that the game is still in early access and will probably change before its final release.\nThat being said, the base of the game is just not that much fun. 2 hours in the game and it's boring and repetitive already.\n\nThe majority of the quests I've gotten so far are:\n- Kill this many zombies\n- Collect a certain amount of X\n\nAnd every time you take a mission, it magically transports you to a different (small) map and back. There is little coherence between your base and the rest of the world. State of Decay is an example of a zombie game that did this really well.\n\nApart from this, the game doesn't really stand out in the other areas. \n- Loot is spread out over the maps and doesn't require much imagination to find.\n- You can expect your typical zombies (slow, fast, animals, ..)\n- Base building is kind of annoying without snapping and you have to upgrade your level a lot before you can do anything at all.\n- For some reason you gain experience that you have to distribute yourself to either your camp level, your character level (why?!) or skills (which depend on character level..)\n- The combat is very hack-and-slash-ish. Probably great for people who like this style, but I'm not a fan.\n\nI'm still looking around, trying to find an excellent zombie-survival game that can entertain me. State of Decay was a lot of fun and I'm hoping to find something with a similar continuous world and more advanced base management.", "timestamp_created": 1466826051, "timestamp_updated": 1466826051, "voted_up": false, "votes_up": 50, "votes_funny": 2, "weighted_vote_score": "0.616246998310089111", "comment_count": 8, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "48738732": {"recommendationid": "48738732", "author": {"steamid": "76561198077190584", "num_games_owned": 1385, "num_reviews": 38, "playtime_forever": 482, "playtime_last_two_weeks": 0, "playtime_at_review": 391, "last_played": 1507160103}, "language": "english", "review": "Sadly - the first How to survive game was better.", "timestamp_created": 1549214049, "timestamp_updated": 1549214049, "voted_up": false, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.615331649780273438", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "33709052": {"recommendationid": "33709052", "author": {"steamid": "76561198105390979", "num_games_owned": 0, "num_reviews": 35, "playtime_forever": 6870, "playtime_last_two_weeks": 0, "playtime_at_review": 6698, "last_played": 1596317752}, "language": "english", "review": "Lots of different ingredients; lots of crafting options. Recipes are unlocked as you upgrade your camp (i.e. as you invest experience points in your camp and improve your camp structures). The explosive bullet DLC that is available for this game (extra money for that DLC) is fun to use but very overpowered. Some variety in the monsters. Great multiplayer (used to be glitchy, but that was fixed a while back). Fun caps out around level 40 or so. Can feel grindy at times. Dying gives an experience penalty, but it isn't too much. There is a reasonable window of time during which team mates can revive you and thereby avoid you sustaining the experience penalty. Lots of ways you can upgrade your character, improving their skills in particular areas. Kovac is a very entertaining character and the storyline in general is funny. I recommend taking the time to read the dialogue, as the writer(s) had a good sense of humor. Missions (especially town missions) can get kind of repetitive since the maps don't change at all and all of the town missions have pretty similar contents. I realize it sounds like I have a lot of criticisms for this game, but I actually really enjoyed it. I am played-out on it now, but it really hooked me for a good long while. Overall, a fun, funny game :)", "timestamp_created": 1500683092, "timestamp_updated": 1500683092, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.615041792392730713", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "44962576": {"recommendationid": "44962576", "author": {"steamid": "76561198003132759", "num_games_owned": 1576, "num_reviews": 187, "playtime_forever": 476, "playtime_last_two_weeks": 0, "playtime_at_review": 443, "last_played": 1538040115}, "language": "english", "review": "How to Survive was a mediocre survival/action game with a pretty bad story. That story served a purpose, however – it provided momentum, progression and a conclusion before the game outstayed its welcome. How to Survive 2 eschews the story and winds up as a dull mess.\n \nIt feels like a freemium mobile game. A hub with a few bland NPCs, exclamation points above their head, directing you to bland repeatable quests for set rewards. Get XP to level up, and the enemies level up too. Farm quests for XP and items. Die and come back with a small XP penalty. All it needs is a daily reward.\n \nIt’s grindy, with none of the things which mitigate or at least obscure a grind – engrossing gameplay, a good story, interesting random loot, imaginative setting, being a licenced product. \n \nIt even loses most of its survival aspects – sleep is no longer a factor, and thirst and hunger are never really issues. Just playing through the game normally should give you ample supplies, and if there is any difficulty, you can farm a quest as much as you need.\n \nIt does a poor job of explaining many of its concepts; too often I had to scramble to the forums, to find that others had been equally baffled.\n \nIt’s just not a good game in any respect – not in writing, gameplay, graphics (particularly the dark areas, for which the game may as well be renamed Eyestrain Simulator), sound or concept. Even the controls are poor - sluggish in gameplay, utterly useless with a controller in menus.\n\nThe final straw for me was a poorly explained mission involving herding pigs into a barn. Once I figured out what I actually had to do (another trip to the forum) I set about the task - only to find two of them got stuck on the entrance, not only failing to count towards the task, but quickly killing me whenever I tried to bring more to the barn. I could have restarted, but enough was enough.\n \nThe original game was okay; not awful, not great, but something to spent a few hours on and come away with a degree of satisfaction. \n \nThe sequel is a frustrating, annoying, dull experience in every way.\n \nOne positive aspect, though – at least it doesn’t crash constantly like the original.", "timestamp_created": 1538040357, "timestamp_updated": 1538040357, "voted_up": false, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.614174008369445801", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "59932321": {"recommendationid": "59932321", "author": {"steamid": "76561198119600365", "num_games_owned": 0, "num_reviews": 60, "playtime_forever": 8993, "playtime_last_two_weeks": 0, "playtime_at_review": 7311, "last_played": 1701524260}, "language": "english", "review": "\nThe most in-depth top down shoot I've played in recent memory\n\nCombine the best aspects of Diablo Dead space 1 & 2 and don't starve together and you get How 2 survive 2. This game is incredible but it has one Major flaw: repetition (Which it shares with Diablo). While the customization and weapon crafting are insanely deep, EVERY MISSION IS A FETCH AND KILL QUEST! Every. Single. One. It does make the game boring after a while which detracts from the gameplay so play this game in short bursts. Otherwise this game is great", "timestamp_created": 1576451168, "timestamp_updated": 1576451168, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.614020049571990967", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "36186935": {"recommendationid": "36186935", "author": {"steamid": "76561198023058046", "num_games_owned": 1663, "num_reviews": 15, "playtime_forever": 310, "playtime_last_two_weeks": 0, "playtime_at_review": 310, "last_played": 1509669893}, "language": "english", "review": "Got this in a humble bundle because it had some other games I liked so I got it pretty god damn cheap. Going to try keep this review as short as possible. Only played 2 hours so things might change as the game progresses.\n\nPros:\nOne or two of the DLC packs add new story conent.\nThe start of the game is relatively easy to understand what you need to do. \nThe base building aspect is different.\nThe game teaches you what you need to do in order to set up a somewhat decent base.\nThe \"help\" guide is pretty unique. Takes the form of little TV shows that the guy you first meet does.\nThe characters are somewhat interesting.\nYou can change what level missions are in comparrison to your character.\nCharacter skills include things to make it easier to survive both in and out of combat.\n\nNeutral:\nThe rest of the DLC adds gear that provides some bonuses to defence or scavening but no story.\nSkill and level system is pretty basic but is easy to work your way through and not get lost.\nThe missions in the game take place in seperate instances with afaik, no way to get there outside of selecting the mission again.\nDespite being easy to do, basebuilding can be a bit of a pain since you can only place things within a smal range of where your character is standing.\n\nCons:\nNo ability to pick up and move already placed base items. Once you place it, there's no going back.\nThe inventory management needs work. Transferring stuff into storage and back is a chore. \nNot very much in the way of graphic settings to change. Only Low, Medium, High.\nGame is a little bit too easy at the start.\n\nDo I recommend this game? Yes. It's quite enjoyable, even if I'm just playing it as a timewaster.\nI do recommend setting missions to 2 levels higher than what you are just for that sweet XP bonus without a massive challenge spike too.", "timestamp_created": 1509528918, "timestamp_updated": 1509528918, "voted_up": true, "votes_up": 13, "votes_funny": 1, "weighted_vote_score": "0.613419115543365479", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}}, "query_summary": {"num_reviews": 7, "review_score": 5, "review_score_desc": "Mixed", "total_positive": 1626, "total_negative": 845, "total_reviews": 2471}, "cursors": {"AoIIPwRp6HuJyeEE": "Mon Apr 22 23:48:48 2024"}}
