{"reviews": {"160733209": {"recommendationid": "160733209", "author": {"steamid": "76561198006684815", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 2614, "playtime_last_two_weeks": 0, "playtime_at_review": 2358, "last_played": 1711048869}, "language": "english", "review": "You know what?\n\nI want to love this game. It does many things amazingly well and it's a lot of fun.\n\nRight up until you start to grind something. The targeting for grinding is enough to drive me insane. If I'm targeting a canister with my grinder out and I start grinding, I'm very obviously trying to grind the canister right? Nope. The game thinks I'm trying to grind the canister next to it, or the desk, or pretty much anything else around it but what I'm actually targeting.\n\nThis is a simple raycast people. Camera to object raycast to check both distance and target. There is absolutely no reason why this should be an issue this far into Early Access and because of that, I'm giving it a negative review. Why?\n\nWell if you're playing on Madman mode (which I do for the challenge) every bit of scrap matters early game. It's stupidly frustrating to try and target something - be it a monitor on a desk or a canister on the floor or even a box without breaking something you didn't intend on breaking. Later in the game this can mean destroying the building itself when you were trying to break a desk, which wastes pretty much every other possible resource in the building itself since it all just disappears. It's a massive waste.\n\nIf and when they fix this, I'll be happy to turn my frown upside down, but until then the game is frustratingly annoying to me.", "timestamp_created": 1710654478, "timestamp_updated": 1710654478, "voted_up": false, "votes_up": 15, "votes_funny": 1, "weighted_vote_score": "0.698424458503723145", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1710720785, "developer_response": "Hello,\n\nFirst of all - thank you for playing the game and for being so passionate about it. I'm sorry that you're having technical issues with targeting, we're aware that this may be especially annoying in TPP and we're working on it, it should be fixed in the next Major Update. I hope that you'll give the game a second shot once it's patched and meanwhile we'd advise playing in FPP. Also, could you please share what monitor are you using and what's your mouse DPI?\n\nKind regards,\nOM Team"}, "158729294": {"recommendationid": "158729294", "author": {"steamid": "76561198093370752", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 598, "playtime_last_two_weeks": 0, "playtime_at_review": 598, "last_played": 1693411920}, "language": "english", "review": "The groundwork is all there and it is a solid game and there is a lot of potential with this game. My only issue is the world feels rather dead and there isn't much worth to actually upgrading your base and then focusing on the food/water aspect because there is no one that needs it nor any other real uses than yourself just eating/drinking and upgrading one or two things that lead you to the same feeling of \"why?\" did I just make all this? Once those certain voids get filled I'd love to come back and play this again.", "timestamp_created": 1708360994, "timestamp_updated": 1708360994, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.68228679895401001", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159167886": {"recommendationid": "159167886", "author": {"steamid": "76561197993500303", "num_games_owned": 0, "num_reviews": 229, "playtime_forever": 570, "playtime_last_two_weeks": 0, "playtime_at_review": 283, "last_played": 1708857960}, "language": "english", "review": "No where near ready. Everything is a massive pain. My character seems to need 25 hours of sleep a day for some reason, then whenever he goes outside he's so cold he starts to die.\n\nI built 4 solar panels and an ECU to feed them into the workshop, but the workshop has no means of storing power, so that night all my potatoes died. Then the next day there were tornadoes so I had to just stand there like a lemon for 10 minutes waiting for them to end as I had nothing else to do.\n\nThen I built a battery rack for the workshop, but it does nothing. I guess later on I can research batteries to put in it? Then I built a battery pack, but it's an exterior building??? Ok. So I wired that in to the workshop so my potato plants wouldn't wither overnight, but the battery doesn't last the night, so all my potatoes died.\n\nI figured ok, maybe for some sadistic reason the developers thought new players would have to find out the hard way that they need to build 8 solar panels, 2 ECUs and 2 battery packs before they can grow potatoes with the most basic level of botany.\n\nSo I started mining for more resources, and all the rocks are \"unknown\" even after I've mined them and know they're iron, silicon, or aluminium. Then the rock I was mining started floating 20 feet above the ground.\n\nI decided at that point I'd just take my helmet off and die until this game gets some serious quality of life improvements and bug fixes.", "timestamp_created": 1708795362, "timestamp_updated": 1708795795, "voted_up": false, "votes_up": 22, "votes_funny": 4, "weighted_vote_score": "0.667859554290771484", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1708901008, "developer_response": "Hello,\n\nThank you for sharing honest feedback and for playing the game. Please, bear in mind, that the game isn't ready yet - we're in Early Access and we're adding stuff and polishing stuff that's already here as we're getting closer to the full release. \n\nSurvival on Mars can be tough, but if figuring things out and learning on your own mistakes is something you don't necessarily have time/ mood for, there are resources that will help you navigate through the dangers and challenges on the Red Planet, for example, this guide may be helpful:\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=2976445864\n\nLet us know if there's anything else we can help you with.\n\nKind regards,\nOM Team"}, "158475947": {"recommendationid": "158475947", "author": {"steamid": "76561198327076583", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 8001, "playtime_last_two_weeks": 0, "playtime_at_review": 8001, "last_played": 1708022588}, "language": "english", "review": "The game is oddly enough, as Advertised, not bad for an Early Access. Has its moments where it can be boring but it strongly depends on the weather settings and difficulty. The game can also be a bit of a reference machine with the easter-eggs too if you're familiar with pop-culture. I walked into cave and saw a suspicious looking rock, realizing what it was I was like \"Nope\" and GTFO of there(those that have found it or know of it know what I'm talking about)\n\nSandbox starts that give you the Rover are really helpful, especially if you're trying to do this on hard(namely because the vehicle is heavy, enclosed with it's own atmo, doesn't ragdoll, and can tank a meteor strike IF you are lucky and it just hits the trailer end of it.)\n\nThe base construction system is simple yet has its own challenges, because of how the tech is researched, how the materials are gathered, and of course module placement, environmental consideration, and resource management.\n\nThe Game is a bit of a grind and time sink, and it has the tendency to get boring when you've done everything in it's current Dev-State, but those are about the only downsides to it that I've been able to find.\n\nI've always enjoyed survival games where the Environment is ACTIVELY trying to kill you in the most natural way possible, or by your own carelessness, hubris, shortsightedness, mismanagement, or lethal missteps. I've been blown up by the damaged ATV as I tried to break it down for parts, blew me back and actually put me THOUGH one of my solar panels... so yea be thankful the game has no gore or blood, because some of the ways you can die are pretty gnarly.", "timestamp_created": 1708118630, "timestamp_updated": 1708118630, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.600326001644134521", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159350571": {"recommendationid": "159350571", "author": {"steamid": "76561198016716979", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 507, "playtime_last_two_weeks": 0, "playtime_at_review": 499, "last_played": 1709150519}, "language": "english", "review": "The game didn't quite align with my preferences as it leans heavily towards scavenging rather than focusing on building, which is more in line with my interests. The inability to fabricate circuit boards was a downside, as it forces reliance on finding them. Additionally, the experience-based tech tree didn't resonate with me; I'd prefer a research-based one. Implementing a research entity where players could invest resources like electricity or materials would provide a more engaging progression system.\n\nIt would also be beneficial to introduce automated mining earlier in the game, with manual mining serving as a quicker resource acquisition method. The disproportionate amount of time spent on manual mining detracted from the overall enjoyment, leaving me with limited resources to invest in building.\n\nOverall, the game left me feeling unexcited during moments of travel and mining. The extensive travel requirements felt time-consuming and unengaging, making me feel bored. I simply do not enjoy the mindlessness of scavenging, especially when it dominates the gameplay experience at the expense of building and crafting.", "timestamp_created": 1708982961, "timestamp_updated": 1708982961, "voted_up": false, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.592996716499328613", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1709274524, "developer_response": "Hello,\n\nThank you for checking out the game. I'm sorry that you didn't like it, but constructive feedback is always very valuable to us, even when it's negative. Would you say that it's a matter of tweaking some numbers and with much less grind you'd enjoy the game much more or the building options aren't satisfying for you either in their current state?\n\nKind regards,\nOM Team"}, "160928890": {"recommendationid": "160928890", "author": {"steamid": "76561198161314198", "num_games_owned": 58, "num_reviews": 1, "playtime_forever": 554, "playtime_last_two_weeks": 0, "playtime_at_review": 554, "last_played": 1710862888}, "language": "english", "review": "Fantastic game only thing holding me back right now tho is constant crashing atleast every 10 too 15mins during random times wether im mining or grinding driving it happens no matter what im doing, I'm playing on laptop but I still meet the recommended specs, my specs are\nRyzen 9 5900HX 16core\nRadeon RX6800M 12GIG\n16Gig ddr4 ram\nWindows 11\n\n", "timestamp_created": 1710867140, "timestamp_updated": 1710867140, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.576271176338195801", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159172270": {"recommendationid": "159172270", "author": {"steamid": "76561199170632369", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 99, "playtime_last_two_weeks": 0, "playtime_at_review": 99, "last_played": 1708798488}, "language": "english", "review": "Glitchy AF!!!  Tutorial would not allow me to do multiple simple things, like moving a plant from spot A to B, opening the crane camera, or throwing a rock in the crusher. Was using an Xbox controller and mouse. I spent over an hour just trying to figure out the game controls and many of them seemed not to work like they were supposed to. I finally gave up after spending more time watching Youtube tutorials than playing the game.", "timestamp_created": 1708798780, "timestamp_updated": 1708798780, "voted_up": false, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.566907286643981934", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1708900323, "developer_response": "Hello,\n\nThank you for playing the game and the feedback. I'm sorry that your experience was unpleasant, for now, the optimal way to play the game is M&KB. Full controller support was funded as one of the Kickstarter goals and will be coming further down the line.\n\nKind regards,\nOM Team"}, "162372417": {"recommendationid": "162372417", "author": {"steamid": "76561198846843368", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 93, "playtime_last_two_weeks": 0, "playtime_at_review": 93, "last_played": 1712445226}, "language": "english", "review": "I will have to try sandbox mode but early impressions is there are some real collision bugs.  Story mode tells you to go to x and when you get there nothing happens.  Doors are closed you can't go over the railings, just nothing until you die.  Not so sure about this for already being out for a year.", "timestamp_created": 1712445412, "timestamp_updated": 1712445412, "voted_up": false, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.558638095855712891", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1712494944, "developer_response": "Hey there, \n\nThank you for the review. I imagine that you're referring to the escape sequence - we got a lot of feedback regarding that part of the game and we're aware of problems some players experience. But that is just a very minor portion of the game. I hope that sandbox/ free mode will allow you to properly discover what OM is all about and that your stay on the Red Planet will be fun..\n\nCheers,\nOM Team"}, "162199482": {"recommendationid": "162199482", "author": {"steamid": "76561198004816145", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 2530, "playtime_last_two_weeks": 0, "playtime_at_review": 2530, "last_played": 1712244608}, "language": "english", "review": "Well.\n\nSometimes I wish Steam would allow you to rate a game as \"Meh\". There is something interesting here, and for 40 hours or so (with a lot of fails and deaths), it was a decent enough survival experience. But in the end so many small things have piled up that made just go: okay, enough Occupy Mars.\n\nYou might ask yourself then why is this review positive? Because I did stick to it for 40 hours to get to the \"end game\", and overall the journey there was tough but rewarding. But now a brief overview:\n\n1. Graphics: serviceable\n2. Sound: serviceable\n3. Controls: Janky\n4. Survival: Rough, very rough, but fair.\n\nBut now here is a list of complaints (in no particular order):\n\nThe pickup to hand mechanic for most items (except cables) is just weird. It needs to go, and I much prefer to just always pick up to inventory and move things to the hotbar.\n\nThe mining part of the game has a serious progression issue. Hand mining larger rocks, and then grinding them down to small usable junks in the early game is a painfully slow process of getting mats. So much so that I only did it if absolutely necessary. It picks up once you get the truck and the small dump station, and once that comes along its easy to get 1000+ of each ore easily completely trivializing mining and building. There needs to be a step in between those two extremes. It gets even more OP once the rover comes along. Maybe add a tiny grinder were you can place one ore rock at a time in there that you have to hand carry there? Or perhaps the drone can carry one stone at a time to that tiny grinder for you? Or strap one ore rock onto the ATV instead of those pathetically small ATV storage things?\n\nSo many rooms feel utterly pointless. I built a cafeteria and never used it since you cannot really use it for its purpose as a central \"food, drink and social\" room. The same with the lobby. Its only real purpose is to allow you put on the heavy suit. Why can't we just put CO2 scrubber, battery rack (to charge batteries) into the lobby and use it as a sort of \"prep room\" before heading out of an airlock? Same with the cafeteria, you cannot place a water sink in there to fill up your water. Why devs? Why? The HQ is similarly confusing, but at least it allows you place most essentials (water, battery recharge, storage and science benches), even though where you can place what is not always clear. This needs a complete overhaul. IMHO there should be no reason to restrict where we can place what.\n\nI hate the tablet system. Basically you have to find tablets while exploring that randomly gives you the opportunity to unlock a tech once you have enough points in said tech tree. Tablets don't unlock tech, they *allow you* to unlock tech with points you have to earn through other means first. Sorry but that RNG factor is just horrid. Easy solution: much like the pen drives which are coded to a certain tech tree, just give us coded tablets that gives us one 1 unlock option the tech tree. We can then choose were to spend that point, depending on what makes sense for us. Or remove tablets entirely and re-purpose the pen drives for that. Or even better, just steal Subnautica's mechanic of allowing us to scan those things in the wild at those random POIs to get the blueprint.\n\nProgression in the tech tree seems horribly imbalanced as well. Once I had the medium solar panels I gained electricity points rapidly, so much so, that I was lagging behind with the tablets. Lots of points no place to put them. Botany advanced really quickly with every grown plant, while mechanics and materials were very very hard to level.\n\nThe power usage of rooms seems horribly unbalanced. Why does a long corridor need like 4kw of energy? Why does the workshop the most useful of the buildings need so much power? Why can't I manage the batteries outside remotely from inside with a terminal?\n\nThere also needs to be some touch ups in terms of QoL features. For example the hangar has power slots to charge vehicles, but you cannot fill the rover's oxygen tanks in there. Why not? \n\nWhy aren't there just generic sockets everywhere in my base where I can charge my CO2, O2 and power? Why do I have to fiddle with batteries and tanks right up to the end game? Just give us a charging station, and perhaps a better suit between the light one and the heavy one, that just makes all of that charging easier and more convenient?\n\nWind power seems really useless to me. Solar panels are the way to go and the new nuclear devices (kilo power) will never ever leave you wanting for power. Maybe give us steam engines that use water? Or allow us to ferment some plants to create bio fuel for burning?\n\nGrinding down things for mats is way better to get mats but also arbitrarily locked behind tablet tech. I'd argue that needs a balance pass as well. Perhaps allow us to grind everything from the start, but how much we get is locked by tier? Maybe add some things that can only be gained by grinding POIs, while other things have to be crafted? Or even better, give us the option to grind with the rover, dump scrap, trash and wrecked buildings into the rover to deliver to a recycling station?\n\nStorage cabinets need power. Why? Devs, why? But why? Its not a freezer, its not some magical preservation storage box, its just a cabinet with a display on it. Perhaps overthink the entire storage concept a bit. The small storage boxes are neat, but it they'd be a hundred times better if we could just place them on the walls. So many spaces above placed work benches are just free for a little shelf with a storage box on there.", "timestamp_created": 1712250593, "timestamp_updated": 1712250802, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.547325074672698975", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159355898": {"recommendationid": "159355898", "author": {"steamid": "76561197974059746", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 4980, "playtime_last_two_weeks": 0, "playtime_at_review": 1378, "last_played": 1710561068}, "language": "english", "review": "The devs are onto a winner here. Definitely an addictive and fun game. There are a few issues that need working on, but by and far, I think this is a wonderful survival simulator.  \n\nPros-\n-Lots to do\n-Scientific concepts\n-Great graphics\n\nCons-\n-Feels like a mining sim at times\n-Awfully populated with other settlements for a barren wasteland like Mars\n-BMX bike needs some tweaking as it's too easy to die on it. \n-Kind of weird how the rocks on Mars have no gravity/weight? There may need to be some calculations on mass and the Martian gravity 3.71 m/s^2.", "timestamp_created": 1708989554, "timestamp_updated": 1708989554, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545454561710357666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161678017": {"recommendationid": "161678017", "author": {"steamid": "76561199068366318", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 29, "playtime_last_two_weeks": 0, "playtime_at_review": 29, "last_played": 1710465865}, "language": "english", "review": "I loved the prologue I was looking forward to this game however I couldn't play it at all, it got stuck either in the menu or at the initial moments and even the simple introduction video didn't run correctly, I had to ask for a refund.", "timestamp_created": 1711659757, "timestamp_updated": 1711659757, "voted_up": false, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.541751563549041748", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1711681305, "developer_response": "Hello,\n\nThank you for your interest in the game and I'm terribly sorry that your first contact with Mars was so disappointing. We'll do our best to help you if you still have logs and could send them to us for diagnostics.\n\nThey should be located in:\nC:\\Users\\%username%\\AppData\\LocalLow\\PyramidGames\\OccupyMars\n\nPlease, copy the whole folder to a zip/rar file and send it to eracolonisthelp@gmail.com\n\nKind regards,\nOM Team"}, "161368406": {"recommendationid": "161368406", "author": {"steamid": "76561197999346390", "num_games_owned": 35, "num_reviews": 1, "playtime_forever": 3298, "playtime_last_two_weeks": 855, "playtime_at_review": 2067, "last_played": 1713778484}, "language": "english", "review": "its a very addictive game but lots of fun very difficult at first", "timestamp_created": 1711299651, "timestamp_updated": 1711299651, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525862038135528564", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157951515": {"recommendationid": "157951515", "author": {"steamid": "76561198009916106", "num_games_owned": 273, "num_reviews": 126, "playtime_forever": 60, "playtime_last_two_weeks": 0, "playtime_at_review": 60, "last_played": 1683382603}, "language": "english", "review": "It's quite fun, but extremely badly optimized. it runs quite poorly and sometimes it just lags for no reason at all, there's almost nothing on the screen and it just lags down to like 20-30fps.\n\nI was invited to test the demo and pre-release versions and here are my videos on them:\n\ndemo gameplay:\nhttps://www.youtube.com/watch?v=qq0APY_SupI\n\npre-release gameplay:\nhttps://www.youtube.com/watch?v=sDAuxRM7pUI\n\nif you want to read few things about it, here are PROS and CONS:\n\nPROS:\n+ open world\n+ good game concept\n+ most things are quite realistic\n+ realistic cable and hose dragging\n+ lot of different things to do\n+ devs seem to be adding new stuff every now and then\n\nCONS:\n- very poor performance\n- it's more of an eating/drinking simulator, you have no time to do anything other than just eat and drink, this is biggest problem for me. i dont want to be pressured with food and drink 24/7. i had to write a trainer for food and drink in order to enjoy the game a bit.", "timestamp_created": 1707514681, "timestamp_updated": 1707514681, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157720227": {"recommendationid": "157720227", "author": {"steamid": "76561197997190381", "num_games_owned": 68, "num_reviews": 1, "playtime_forever": 9439, "playtime_last_two_weeks": 13, "playtime_at_review": 8686, "last_played": 1713648815}, "language": "english", "review": "very well made game lots of things to do and learn for me best space game so far as for sandbox game a lot of fun i hope it goes long and has a good future looking to see what future has to offer i think there is still lots of room to grow great tech good design as long as it stays on steady track and does not rush to end so far very good even if people not sure about it give it some time play it a wile it mite grow on you", "timestamp_created": 1707233301, "timestamp_updated": 1707233301, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159570325": {"recommendationid": "159570325", "author": {"steamid": "76561198207194545", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 11146, "playtime_last_two_weeks": 0, "playtime_at_review": 10854, "last_played": 1710017047}, "language": "english", "review": "There's nothing like the feeling of cresting a hill on your Electric ATV, catch 'air' and smack face first into an enormous boulder!    \nAnd if you're not that reckless you may build a large base, grow all kinds of plants, prospect for Uranium, or just loot old, abandoned bases. It's actually quite fun until the meteorites starts falling.   \nCan you manage your time and resources and succeed?    \nOn Madman level?    \nThen Mars needs YOU!", "timestamp_created": 1709247424, "timestamp_updated": 1709247424, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.519999980926513672", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161570275": {"recommendationid": "161570275", "author": {"steamid": "76561198077730102", "num_games_owned": 374, "num_reviews": 18, "playtime_forever": 2019, "playtime_last_two_weeks": 0, "playtime_at_review": 2019, "last_played": 1711532316}, "language": "english", "review": "Has always been such a great concept, but everything still feels terrible about this game. The movement feels cheap and is an awful experience trying to do anything at all. The tech tree still feels like nothing more than an absolute chore and a painful one at that (not enjoyable progression). Overall, I'd rate this game in its current state as a 3/10.", "timestamp_created": 1711532457, "timestamp_updated": 1711532457, "voted_up": false, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.519459903240203857", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1711566617, "developer_response": "Hey Wily,\n\nThank you for playing the game thoroughly before forming an opinion, we appreciate all feedback as long as it's constructive. We're sorry to hear that you still feel that we're far from the finish line, but I hope you can give the game another shot after some updates. If you want to add/ ask anything else, please do - we're here to help and to listen.\n\nKind regards,\nOM Team"}, "159597757": {"recommendationid": "159597757", "author": {"steamid": "76561198039510426", "num_games_owned": 97, "num_reviews": 53, "playtime_forever": 35, "playtime_last_two_weeks": 0, "playtime_at_review": 35, "last_played": 1709287077}, "language": "english", "review": "30 mins of tutorial that ended in being unable to progress. Very poorly made game if i can break it on my first play through accidentally in less then an hour!\r\n\r\nHad the mission \"Fill O2 Canister\" which sounds pretty simple, right? Except all my oxygen bottles were already full and the tutorial gives you no empty bottles, nor can you empty full bottles.\r\nSo how do you fill a non-existent bottle of O2? I have no idea.\r\n\r\n Looks like it could be an interesting game if the dev cut 95% of the pointless tutorial out and actually made the game playable but as it stands it's a complete waste of money.", "timestamp_created": 1709287264, "timestamp_updated": 1709287264, "voted_up": false, "votes_up": 5, "votes_funny": 3, "weighted_vote_score": "0.514670908451080322", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1709805006, "developer_response": "Hello,\n\nThank you for playing the game. At this point, you should have an empty bottle, but you can also just equip one yourself and use it a bit. It doesn't need to be empty for the tutorial to go through. And if tutorials ain't your thing and you prefer to discover things at your own pace, please try Free Mode / Sandbox with customisable difficulty.\n\nIf there's anything else we can help you with, please let us know.\n\nKind regards,\nOM Team"}, "160693109": {"recommendationid": "160693109", "author": {"steamid": "76561198255541972", "num_games_owned": 68, "num_reviews": 6, "playtime_forever": 1456, "playtime_last_two_weeks": 2, "playtime_at_review": 851, "last_played": 1712757422}, "language": "english", "review": "This game is living up to my expectations of what survival might feel like, at least with current scientific understanding. There is an urgency to get things done and progress as food is limited and the starter shuttle has a supply that only goes so far. \r\n\r\nThere's been some reviews and videos saying its got a lot of POI's and maybe that's not everyone's flavour, for me i quite like it. I mean the start suggests that you are one of many to try and establish, so it makes sense that there is failed and abandoned infrastructure around. \r\n\r\n * A note to the devs. I would love to see poi that may have puzzle like elements. some perhaps still in the frays of semi working condition, and access to them hidden behind a need to resupply/fix power. or perhaps pressure failures for not checking if its safe or not. just an idea for a more cautious and exciting experience.\r\n\r\nThe game itself been set on mars (clearly lol) and is very barren and hostile. The ultimate things you are watching for are your typical survival game needs. With martian twists and flares added to spice it up. my last outing i was a nibblet from from death with health, as temperature plummets in the night time. leaving me half icicle upon entry to my sanctum ha ha ha.\r\n\r\nI would recommend it's quite addictive. Music is lovely and zen, which is about as much rest as you'll get.\r\n\r\n*last side note for devs. please keep updating and enriching. our data and imagery on the real life martian surface is ever expanding. \r\n Cave exploration would be good. Unique martian natural poi's would be amazing. \r\n\r\nbeyond that im fairly new still and am curious to see what else this title offers\r\n\r\ni give it 4.5/5 as that final bit comes from more updates ha ha ha   :-)  \r\n\r\n", "timestamp_created": 1710615176, "timestamp_updated": 1710615176, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.514285683631896973", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159007433": {"recommendationid": "159007433", "author": {"steamid": "76561198068770920", "num_games_owned": 0, "num_reviews": 46, "playtime_forever": 3328, "playtime_last_two_weeks": 0, "playtime_at_review": 2387, "last_played": 1708916900}, "language": "english", "review": "Great shape for an EA title.  Although is been out in EA for years, it's currently very playable and fun. It's addictive and challenging. If you like base building survival sims, this one puts you on Mars and does a great job of trying to kill you.  Looking forward to every update and full release.", "timestamp_created": 1708639544, "timestamp_updated": 1708639544, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.511557161808013916", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160627205": {"recommendationid": "160627205", "author": {"steamid": "76561198142609310", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 5767, "playtime_last_two_weeks": 0, "playtime_at_review": 5322, "last_played": 1710696881}, "language": "english", "review": "So far I'm really enjoying this game. Looking forward to future technologies and content. Was a steep learning curve at first until I realized I had skipped over some important tutorials. 88 hours in and still have lots to do.", "timestamp_created": 1710551070, "timestamp_updated": 1710551070, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.507722020149230957", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160542981": {"recommendationid": "160542981", "author": {"steamid": "76561199552571858", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 5446, "playtime_last_two_weeks": 0, "playtime_at_review": 5337, "last_played": 1711126756}, "language": "english", "review": "i love this game its the best i think yall should try it out and the new cool update came out the nunlear update\r\nand it has some new cool stuff like miners.urainum centrefuses. more", "timestamp_created": 1710454524, "timestamp_updated": 1710454524, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.507042229175567627", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "138165584": {"recommendationid": "138165584", "author": {"steamid": "76561198079981014", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 3508, "playtime_last_two_weeks": 0, "playtime_at_review": 822, "last_played": 1702941690}, "language": "english", "review": "Yes, the game is in early access. I am having a lot of fun with it so far. I guess I'm just lucky when it comes to game crashes and bugs, as I haven't experienced a single crash in over 14 hours of gameplay, and I haven't encountered very many bugs. Although, I do think the ATV could be a bit faster.\n\nIt's a fun base-building survival game, and I would recommend it to people who understand that it's in early access. All the comments tearing the game apart for bugs, low fps, and missing features don't really make sense, since the game is still in development.\n\nI almost didn't purchase this game because of all the negative reviews, but I'm very happy I decided to give it a chance.", "timestamp_created": 1683858139, "timestamp_updated": 1683858139, "voted_up": true, "votes_up": 112, "votes_funny": 1, "weighted_vote_score": "0.901025772094726563", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "143753402": {"recommendationid": "143753402", "author": {"steamid": "76561198055511804", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 993, "playtime_last_two_weeks": 0, "playtime_at_review": 677, "last_played": 1704146445}, "language": "english", "review": "This game is so close to being on of my favorite games.  A few things they would make better.  You are stuck on mars with a suit that wont protect you from the cold??? really!!  So you have to always be inside at night for 10 hours.  Time goes by so fast you only have like 20 mins to do anything before you have to hide inside all night.  So  you don't get hardly anything done. Then you have to stop and wait.  Its annoying.  I would love this so much more if the suit was protection from the cold.  And then sleep dictates when you stop.", "timestamp_created": 1691633275, "timestamp_updated": 1691633275, "voted_up": true, "votes_up": 123, "votes_funny": 6, "weighted_vote_score": "0.895996749401092529", "comment_count": 13, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140827826": {"recommendationid": "140827826", "author": {"steamid": "76561198045072134", "num_games_owned": 309, "num_reviews": 11, "playtime_forever": 2056, "playtime_last_two_weeks": 0, "playtime_at_review": 2056, "last_played": 1687729363}, "language": "english", "review": "TLDR: This game is fun, for a while. Eventually you hit a brick wall in the form of \"Time Crime\" where the game just wastes your time. There are some bugs, game breaking ones are generally fixable with a reload. The game is being actively developed and there are a couple patches a month so I expect to give this game another shot in a year. Thumbs up because this game shows a lot of potential and I got more hours out of it then it cost in dollars.\n\n\nLong form answer: Time Crime.\n- The turning point for me was after establishing a decent size base and a single weather event can destroy your entire power plant causing critical failure. At the moment there is no wind or nuclear power in the game so solar is your only option and they are heavily diminished by dust devils and sand storms. When the game starts spamming you with dust storms once a week and then it takes two days to recoup from the sand all over the place it takes its toll. \n- On top of that half the research tree is gated behind the exploration feature. Where you have to travel several thousand kilometres away from your base, Mark Watney style in your rover, setting up a solar panel, sleeping during the day, driving in the night(that part was cool), only to find a ruin that has junk or no technology for you. Effectively wasting your time. I later found out after 30 hours that there is a bug where every ruin has a technology tablet you just have to reload your game.\n- The entire food growing mechanic is very tedious. In there are 4 stages of plants, you start them off in an incubator, move them to a shelf, plant them in the ground, then put them in a dome. I love that part of the mechanic. The tedious part is moving the plants around is very clunky, the ratios for each stage are a little wonky. Example: Incubators hold 20 plants, stage 2 hold 18 plants but the large item you use to move the plants around only holds 17 plants, so there is a lot of back and forth and some waste. Setting up the power/water/fertilizer/soil ratios has to be done each time you plant a new crop so it eventually gets tedious. Once you have food, you have to combine multiple types of food to get a decent amount of hunger bar from each meal or you'll be chowing down on a dozen potatoes like in Minecraft. The entire thing just needs a pass, but it is a cool concept.\n\nThe game overall is really fun. The tutorial is a little tedious with some buggy movement and controls you will have to just get used to. This game has a lot of potential once its polished up a bit. I love the challenge and technical nature of the game. One thing that stood out was having to drag around cables and hoses to connect machines to power and liquids, just like in real life. Deconstructing solar panels during the day results in sparks flying out that can shock you. There are other examples but I digress. \n\nLooking forward to doing another run in 6-12 months after this game gets some more cook time.", "timestamp_created": 1687923555, "timestamp_updated": 1687923555, "voted_up": true, "votes_up": 84, "votes_funny": 2, "weighted_vote_score": "0.879686415195465088", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "149562545": {"recommendationid": "149562545", "author": {"steamid": "76561199223051104", "num_games_owned": 115, "num_reviews": 19, "playtime_forever": 7285, "playtime_last_two_weeks": 0, "playtime_at_review": 373, "last_played": 1702511166}, "language": "english", "review": "Campaign mode is tough, and almost made me quit playing for good, so unless you're super dedicated or just love punishment, I'd recommend starting with a few hours in sandbox mode. (It goes without saying that you should complete all of the in-game tutorials either way before jumping in, but I'm going to say it anyway.)\n\nEssentially, it does take time to learn the mechanics of the game, and resources simply deplete too quickly during the first few days of the campaign. You end up in a death spiral, short of having individual game save files perhaps once a day, so you can essentially \"go back in time\" and not make the same mistakes. It takes time to reach a sustainable point, and time, food, water, and oxygen are precious resources.\n\nI'm glad I went to sandbox mode and was able to make a bunch of mistakes, learn the game, and discover how the game loop can be enjoyable. If you choose to start in Campaign mode that's fine, just don't give up. You can start a new game in sandbox mode and learn the game, then come back to the campaign easily, but that's my suggestion.\n\nI think the real problem is that the day/night cycle is simply too fast, and it's one of the more frequent complaints I've seen in other reviews.\n\nWhile there aren't any Steam Workshop mods for this game, you can head on over to nexusmods and get the \"TIME SCALE MOD\". It's the only mod I run for Occupy Mars, but it's a MUST HAVE IMO! \n\nSince there are no in-game speed options, and the default speed is ridiculous, I most likely would have stopped playing the game had I not found this mod to slow time down to a reasonable speed. (Time scale is customizable by user to select # of minutes/day/night.)\n\nhttps://www.nexusmods.com/occupymars/mods/14\n\nYou're welcome! \n", "timestamp_created": 1699157426, "timestamp_updated": 1699670463, "voted_up": true, "votes_up": 61, "votes_funny": 0, "weighted_vote_score": "0.866397440433502197", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "139469456": {"recommendationid": "139469456", "author": {"steamid": "76561198338423123", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 372, "playtime_last_two_weeks": 0, "playtime_at_review": 345, "last_played": 1691075725}, "language": "english", "review": "Great idea, horrible implementation. A frustrating mix of questionable design choices, bugs, poor optimization, teasing with genuinely good ideas, and slightly laughable attempts at being a visual spectacle. At this point, the game is practically unplayable to me, and if you just watch the broadcasted gameplay, you'll likely see all of the content anyway.\n[hr][/hr]\nI love what this game is trying to be. I played the demo a few years ago I think, and I thought it was a relatively original idea for a sci-fi sandbox. I was really looking forward to the actual game. But now, after a few hours of playing, even taking the \"early access\" into account, I'm very much disappointed.\n\nFor starters, half of my experience with this game was just waiting. I played on a hardware that more than satisfies the recommended requirements, and with settings set to medium, the game lagged most of the time. Loading screens took minutes. Interacting with anything locked me into 3 seconds of unskippable animation, so merely opening the shelves in the landing pod to get the starting resources takes me a minute when it should have been 5 seconds. Except for the initial part, all the messages in the campaign were also unskippable and had a weird delay. When walking around the base, you end up waiting a second for a slow door or airlock every few seconds. It's somehow unbelivably frustrating and tragically boring at the same time.\n\nThen, there are the bugs. The first time I played the campaign, I got locked in an interface of some machine that tried to take a milion cables from my inventory, even though I didn't even have that many, and wouldn't let me leave no matter how many times I tried escape or RMB. Then a machine exploded in my face and glitched me inside the stairs, so I had to restart the game. I even managed to stick my head through the wall a few times. I replayed the first part of the campaign avoiding exploring the base in fear of breaking the game again (making it mostly pointless), and the second part had me run out of an exploding ruined base with a character that gets stuck on every piece of rubble on the ground. After giving up on the campaign and trying the free play, I found out that the replicator in the starting pod consumes the resources, but doesn't seem to produce anything. At that point, I gave up on the game entirely. They might as well just give me a welder that only blows soap bubbles and ask me to build my base with it.\n\nAnd to those that say \"it's just an early access\", I have two counterarguments:\nFor one, this \"game\" already costs more than a fully-working released game with all of the idea promised here would, and to me, it delivers practically no entertainment worth enduring the constant frustration. If I'm expected to test or co-develop it, I should be paid by the developers, not the other way around.\nAnd for two, I doubt I'm investing in the finished product, because the current game has even worse quality than the demo. It's like their only prioirty was whatever was necessary for the showcase in the trailers and broadcasted gameplay, and they completely forgot that this is supposed  to be a game as well. It has significantly more content, but that just means more technical debt, more opportunities for bugs, and more things that can break whenever they need to change anything. At this rate, they'll just end up in development hell until they run out of budget and will have to give up on the game.\n\nI want to be wrong, and I hope that this can work out, so I won't refund this game. But I consider it more of a charity than investment, so if you are looking for an actual playable game, look somewhere else.", "timestamp_created": 1685784972, "timestamp_updated": 1685788007, "voted_up": false, "votes_up": 49, "votes_funny": 1, "weighted_vote_score": "0.786643624305725098", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1685880038, "developer_response": "Hello, \n\nThank you for giving our game a shot and for the review. \n\nWe released a big patch on the test branch yesterday that tackles some of the issues that you mentioned. If everything goes smoothly, it should be available soon on the main branch as well. You can learn more here:\nhttps://steamcommunity.com/games/758690/announcements/detail/3687931332330630924\nAs you know, the game is in Early Access, and lots of things are bound to change, as our goal is to polish it and develop it accordingly to our community's suggestions. We'd appreciate the benefit of the doubt. I hope that your stay on Mars will be all fun, with no frustration in no time.\n\nKind regards,\nOM Team"}, "145255496": {"recommendationid": "145255496", "author": {"steamid": "76561197997022377", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 3663, "playtime_last_two_weeks": 0, "playtime_at_review": 3659, "last_played": 1693312266}, "language": "english", "review": "When the send feedback feature in the game doesn't even work you know the game has some serious problems. This game is a big buggy mess. I get that it is early access but the developers seem to focus more on adding content than fixing things. The latest update broke my save so i had to start again and even though you can now skip the tutorials it still makes you have to do the awful mini missions at the start of the game. This game isn't all bad but there is so much bad that it needs so much work to make it good. Character models and character animations are terrible. Distinct lack of gameplay diversity or storyline. For such a large landscape the ability to set markers on the map is limited. Just the whole thing is janky. Just feels like the developers are too inexperienced to make the game as good as other similar games. Hopefully it will get better but i'm not particularly hopeful.", "timestamp_created": 1693312133, "timestamp_updated": 1693312133, "voted_up": false, "votes_up": 62, "votes_funny": 4, "weighted_vote_score": "0.774982333183288574", "comment_count": 10, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1693326920, "developer_response": "Hello!\n\nThank you for the feedback. I'm sorry that you feel that the new update disrupted some things. I just wanted to clarify: the new update DOESN'T break your save. It converts it to the new version of the game. It might take some time, resulting in the performance drop, but once fully converted it won't happen again. Just let it run for some time and you should be good to go. Also, if you're starting from scratch, you can always choose Free Play/ Sandbox mode to skip the campaign entirely. If the save problem still persists - please, let us know, and we'll do our best to help you out.\n\nKind regards, \nOM Team"}, "144203471": {"recommendationid": "144203471", "author": {"steamid": "76561198106156522", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 6842, "playtime_last_two_weeks": 2778, "playtime_at_review": 2073, "last_played": 1712958251}, "language": "english", "review": "the developers to this game are focusing on other games, and allowing the bugs to go on, then change the gameplay to bring back the bugs that had already been there, the game have got potential, the developers are imo not worthy to be working on this game, it is above their expertise, they are not willing to give it the effort it deserves.", "timestamp_created": 1692040312, "timestamp_updated": 1692040312, "voted_up": false, "votes_up": 115, "votes_funny": 3, "weighted_vote_score": "0.764477670192718506", "comment_count": 11, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1692110847, "developer_response": "Hello,\n\nThank you for playing the game and the review. I'm not sure where you got the info about us focusing on other games - yes, as Pyramid Games we got several titles under our belt, but they are being developed by different teams and Occupy Mars is our priority. \n\nRegarding the bugs - the game is in Early Access. I know that you might feel like you were left in the dark for a bit, but we were busy preparing a really big update. It's gonna feature BOTH fixes to bugs and completely new features, check out the dev logs to learn more!\n\nKind regards,\nOM Team"}, "152462827": {"recommendationid": "152462827", "author": {"steamid": "76561198200301621", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 1073, "playtime_last_two_weeks": 0, "playtime_at_review": 913, "last_played": 1701563649}, "language": "english", "review": "So much potential!\nI had a lot of fun playing this game until I got to one point: Meteor Showers. In career mode sure, but sandbox mode not having the ability to turn them off is bad design. Instead of building towards cool new things you find yourself regularly fixing existing structures damaged or destroyed by Meteor showers. In sandbox mode, which is supposed to be for relaxing exploration and creative stuff, You should have the ability to turn off meteor showers without modifying install files. It can be frustrating spending half your time fixing crap you already built instead of exploring and enjoying the rest of the game which is beautiful.\nEDIT: After further thought I would recommend this game. The devs really care about the quality and are receptive to feedback. Consumers should support that kind of work and passion.", "timestamp_created": 1701195699, "timestamp_updated": 1704292189, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.764082849025726318", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1702266225, "developer_response": "Hello,\n\nThank you for giving the game a shot and for leaving very precise feedback, we'll consider this. I hope you can give our game another shot in some time.\n\nCheers,\nOM Team"}, "138125839": {"recommendationid": "138125839", "author": {"steamid": "76561197990666542", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 368, "playtime_last_two_weeks": 0, "playtime_at_review": 295, "last_played": 1684207834}, "language": "english", "review": "This game has some interesting potential but it is a very, very long ways off before I'd call it a game.  If you do try it, do yourself a favor and go straight to sandbox and skip the campaign/tutorials, they're worse than worthless.\n\nPros: \n  * the power management is interesting and seems to be a challenging puzzle.  you string together solar panels and transformers with snaking cables to power your base.  power is limited enough to encourage you to go exploring\n  * cool tech tree/experience system where you unlock more points in the area you spend more time in.\n  * survival aspects, i.e. food/water/oxygen/health are in-line with most other space survival games.\n  * sandbox mode is engaging enough and it's fun to discover the mechanics\n  * repairing the circuit boards is an interesting and creative minigame, though the interface to it is too sensitive.\n\nCons:\n  * bugs, oh god the bugs.  crashes are frequent enough to be deterring, items disappear, you can get locked behind menus after exiting, and for some reason every time i reload the game i'm stuck with only Y-axis movement of the mouse.\n  * movement feels clunky and slow. i think the ATV is slower than running.\n  * interacting with objects takes away camera control/movement until the animation is done (super annoying).  taking your helmet off/on sticks you with an 8 second unskippable cutscene where you let down your horribly rendered hair.  every. time.  who thought that was a good idea?\n  * no build queue or any way of tracking which items you're missing for a construction\n  * campaign and tutorials are best left skipped.  seriously don't even open up the campaign mode.\n  * music gets repetitive really fast, and isn't very good to begin with. just turn it off and play your own in the background.\n  * boulders jiggle and dance as you mine them\n  * mining is a boring time-sink where you sit there and hold left click for about half your game time.  it could be 10x faster and still feel too slow.  honestly i almost uninstalled the game after the first mining run.\n  * somehow I got shipped off to mars with only two water bottles and no circuit boards, despite literally all of my critical infrastructure needing circuit boards.\n  * you need water stockpiled to sleep?\n  * no way to refill water/oxygen/suit power inside the workshop in the time i played.  running out into the cold, taking damage, just to get enough water to sleep til morning is ridiculous.\n  * temperatures in general seem very buggy and inconsistent.  i had a workshop full of plants freeze to death despite it being powered the whole time.\n\nMaybe there are late-game vehicles and buildings that make it worthwhile but there's no way i'm slogging through this for 50 hours to get to them.", "timestamp_created": 1683785112, "timestamp_updated": 1683785112, "voted_up": false, "votes_up": 96, "votes_funny": 7, "weighted_vote_score": "0.753839313983917236", "comment_count": 15, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1683999645, "developer_response": "Thank you for your feedback myrcutio, we appreciate it.\n\nWe know players are experiencing some issues and problems with the current version of the game. We're working on hotfixes and we will improve every aspect of the game during Early Access period.\n\nWe hope that in the future, after some updates, you will try the game out again and consider updating your review if you find the experience improved and enjoyable.\n\nBut let me answer point by point to the cons mentioned in your review:\n1- we're working very hard on improving the game, first days of early access launch are usually difficult but we are releasing patches every day\n2- the starter ATV is a broken vehicle so it's slow on purpose, but player can level up his/her tech tree and quickly build a new one which is much faster\n3- we're currently testing a special checkbox in settings which will allow to disable additional animations like opening levers, taking off helmet etc.\n4- you can pin the list of items which you need for construction by right clicking on an item in inventory and it will stay on the screen so you can track it\n5- music is a matter of personal preference, but we added a radio device which you can build in the game and then put your own musing into the game folder to listen to it\n6- Mars has lower gravity (0.38% of earths gravity) so things are lighter on mars than they appear.\n7- There's a checkbox in option where so you can toggle automatic hold on click. Of course the beginner tools are slow but that's only to allow for quick upgrades and once you level up your tech tree you will quickly feel the difference with faster tools.\n8- you would understand why you ended up alone on Mars if you played the campaign mode ;)\n9- you need to be hydrated to sleep, because it's a survival game\n10- you can build bathroom with sink to drink water from it\n11- you probably lost power for some time in the middle of the night - you need to store enough in the batteries before the night comes\n12- as for \"timed event which Possemaster mentioned below - there's only one short scene where you escape from the destroyed base - it's needed to explain the story and we've added a button to skip it in the last patch.\n"}, "145251586": {"recommendationid": "145251586", "author": {"steamid": "76561197979675662", "num_games_owned": 2319, "num_reviews": 27, "playtime_forever": 166, "playtime_last_two_weeks": 0, "playtime_at_review": 128, "last_played": 1693382101}, "language": "english", "review": "Where to even start.  I don't have any idea how this game has a Mostly Positive review score.  Did the last update break everything?\n\nThe game is almost non-functional.  I can't harvest materials from rocks without the rocks being deleted from the map before resources drop.  Sometimes walking into partially mined rocks crashes the game.\n\nA lot of the controls don't make any sense.  Why can't I just pick stuff up off of the ground while holding a tool?  Resources should automatically be added into your inventory, I shouldn't have to put a tool down to pick up the resource and then place it into my inventory.\n\nWhy can't I rotate things in building mode?  This is a standard feature of this genre, where is it?\n\nThe campaign mode is trash.  The voice acting direction is horrible and the event pacing is illogical.  Why does the tutorial section at the start end after tutorial 2, why do we have to go down to floor 0 to talk to some guy when we have space age technology; do we not have radio communication?\n\nThe writing is really bad and a lot of it feels like it was generated by Chat GPT or translated to English from some other language by Google Translate.\n\nModel collisions are broken, I almost got stuck under the debris during the crouching tutorial.\n\nThis game should not even be released yet; it isn't ready for Early Access.  They should not even be making new game systems when the core mechanics are this broken.\n\nStay away from this game for a couple of years.  It might be playable by then if the devs don't abandon it (I am betting that is what happens).", "timestamp_created": 1693306900, "timestamp_updated": 1693306900, "voted_up": false, "votes_up": 50, "votes_funny": 2, "weighted_vote_score": "0.751548945903778076", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1693314444, "developer_response": "Hello, \n\nThank you for playing the game and the feedback.\n\n- You can rotate and move buildings up and down in building mode with arrow keys\n- Other tutorials are optional, but you can continue them by going back to the tutorial screen, you can also launch them via the main menu\n- We had some known instances of rocks that held 0 resources and disappeared instantly after being touched by a drill - This is likely a \"residue\" from the previous version of the save and shouldn't have much impact on your playthrough\n- When you start drilling a rock, at first you knock off bigger chunks that you can load onto your rover or pick up manually and move to your truck/ crusher. You can also drill further, to turn it into \"pickables\" which you can add to your inventory, the process is demonstrated here:\nhttps://youtu.be/WokYtHuY6mk\n- You can hide the tool you're holding very quickly by clicking RMB \n\nAbout the crashes - honestly, we've never encountered this bug before. If you could please send us your save file as an archive, we could help you directly and learn more about the issue.\n\nSave files are located in:\nC:\\Users\\%username%\\AppData\\LocalLow\\PyramidGames\\OccupyMars\n\nPlease, copy the whole folder to a zip/rar file and send it to eracolonisthelp@gmail.com\n\nLast but not least - please keep in mind that it is Early Access and a lot of this stuff is going to change, including QoL stuff. If the campaign was a bothersome experience for you, I'd suggest exploring Mars in Free Play / Sandbox mode, so you can test the game's systems at your own pace.\n\nKind regards,\nOM Team\n\n"}, "154802134": {"recommendationid": "154802134", "author": {"steamid": "76561198016001273", "num_games_owned": 473, "num_reviews": 97, "playtime_forever": 1213, "playtime_last_two_weeks": 0, "playtime_at_review": 1213, "last_played": 1703940091}, "language": "english", "review": "Good relaxing game about Mars colonization... This is a lie... You need to survive on Mars, so it is not so relaxing... Good game though...", "timestamp_created": 1703940158, "timestamp_updated": 1703940158, "voted_up": true, "votes_up": 25, "votes_funny": 1, "weighted_vote_score": "0.747182726860046387", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "147975449": {"recommendationid": "147975449", "author": {"steamid": "76561198848857148", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 3682, "playtime_last_two_weeks": 0, "playtime_at_review": 1957, "last_played": 1706068426}, "language": "english", "review": "Lots of things about this game are great! The whole concept is brilliant. Setting up power and plugging in cables with sockets is fun. The building system is great.\n\nThe core parts of the game mining and salvaging are buggy and horrible. As soon as I started playing this was an issue and now 30 hours in its just fustrating which is a pity for what can and maybe one day will be a fantastic game.\n\nSalvaging :: Instead of mousing over something and it tells you what the mouse is over, then you hold left click and salvage that item(like every other game!) nope it doesn't do that!! it randomly flickers and grinds whatever is under the cursor and you can move and grind something different. It flickers to something different even if the mouse is completly still. So trying to grind a barrel it will start grinding the wall or a desk. Which isn't so bad but when you upgrade the grinder it will grind the whole desk and destroy the barrel you were actually trying to grind. The 3rd upgrade actually grinds down the whole structure so trying to grind a barrel or a desk and the whole structure just vanishes along with everything in it !! No xp, no materials. Grinding things down is the first bit of the game you come across and you have to do a lot of it, so it should work well??! My suggestion hovering over items lights them up, holding left click grinds the item that is highlighted only. Easy fix!\n\nMining :: Again this is a core part of the game, mine ore and build stuff. Straight from the start of the game its not great. Instead of highlighting over something and mining that, it has the same issue as salvaging. It should be fun like other games, minecraft, space engineers, etc. The other issue is the scanner for ore, you scan ore and it tells you what it is after about 1 second. scan another rock after 1 second it tells you what that is, mouse over to the first rock and it rescans it again for 1 second etc even though it knows what it is, so why rescan it? so the mining involves : get scanner out, scan, get mining drill out, mine, put mining drill away otherwise you cant pick up the ore?? get scanner out again and repeat. This game requires a lot of mining so make it fun and reduce the amount of busy work?. \n\nAlso even though you scan the rocks, you cant tell what they are, after scanning they should show up on the map or the ui? All the rocks are identical looking so trying to find specific ores, lol its just annoying. Scan oh its not that one, scan oh not that one etc with no way of marking what you have already scanned and what it is! like after you scan an ore make it change color so you can clearly see oh its silicon or iron. Or show it on the ui and the map? Have big huge rocks so you can slowly work your way through? like huge veins.\n\nAfter playing and finally unlocking the big rover vehicle which I was excited about, was disappointed after trying it. The drill bit is tiny, the same logic as the handheld manual drill, and you are meant to grind the ore down only once to smaller chunks(but not the smallest size) and load them into the back of the truck with a grabber. But you can accidentally grind it down to much to the small pieces, which you cant pick up with the grabber and worse of all you dont get the high yield that you are meant to get. I searched on youtube and people are actually using the hand drill to mine instead of the vehicle just to get it to the right size and then using the grabber. Which makes no sense whatsover. My suggestion have a massive drillhead that grinds the rock down to the proper size thats needed.\n\nAlso the grabber is questionable, there is a camera to see what its doing and guide it in place and such, but it has such a short reach it should be a lot longer and maybe more automatic? Its okay the first time but grinding loads of rocks just becomes tedious instead of fun. The gameplay loop for the rover is drive to rock, get out of rover, get the handdrill out, mine rock into the right size pieces, get back in truck grab a few bits, press tab, maneuver truck closer because grabber range is so small, tab again to switch to grabber, pick up some pieces, tab back, move truck again etc. My suggestion, big drill bit that quickly drills the rock in to the right size pieces with no way to make them to small, and then much longer range grabber to pick them up. Or ai bots that automatically picks up the pieces or something?\n\nMap system :: Map is bad. You can only track 3 things on the hud, why :( And only with colors, yellow, red, green. Why not make a map where you can add notes and change to any color you want, with as many notes as you want. And then you can tick and untick the items you want to track? You can make notes but not set the text color of the note, and the text actually goes under some elements on the map like structures so you cant read or see them anyway :( Also notes in the fog of war/shroud dont show up lol. You cant use the map while driving???? you have to stop your vehicle, get out to actually view the map?? come on guys this is the basic things to get right.\n\nUI / Hud ::\n\nthere is a choice between first person and third person camera which is nice, apart from the fact going to third person gets rid of the hud and ui :( so if you running out of oxygen or water it wont tell you if you are in third person... Hud should always be visible, and if need be toggle options to hide or show it.\nThis might just be me but vital stats should all be on the same place on the hud, not some on the left and others on the right. Also you cant use inventory while in a vehicle.\n\nI havent mentioned the random bugs that force you to reload your save, because this is early access and thats fine, you can quicksave by pressing F5 so do that regularly and its not a big deal. \n\nThe things i have mentioned I feel are important because its the core of the gameplay and the first thing new people see and interact with. Mining and salvaging should work well and be fun, the map should work well so you can make notes on every little thing you want, ie \"big hill watch out\" \"water patch here\" \"loads of solar panels here to grind down\" \"half looted\" \"go here\"\n\n", "timestamp_created": 1696945338, "timestamp_updated": 1696945338, "voted_up": false, "votes_up": 22, "votes_funny": 2, "weighted_vote_score": "0.747132837772369385", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1697099500, "developer_response": "Hello,\n\nThank you for such detailed feedback. Regarding the \"mouse jumping\" -  we are aware of the issue and we're working on a solution. We tried some fixes, but they caused other troubles. We believe that we're on the right track and we'll let you know when it's fixed. Again, apologies, but this is Early Access, we're doing our best to make it as good as possible, but some bugs are bound to happen.\n\nKind regards,\nOM Team"}, "138110041": {"recommendationid": "138110041", "author": {"steamid": "76561198032214340", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 23112, "playtime_last_two_weeks": 0, "playtime_at_review": 148, "last_played": 1698878159}, "language": "english", "review": "Has the ability to become a great game. There are things to be worked on and bugs to be squashed but that's what early access is all about. Be warned though. This isn't an arcade game and there isn't much hand holding. Your going to have to work out a lot of stuff, just like.....I don't know....maybe you were stranded on Mars or something.", "timestamp_created": 1683751625, "timestamp_updated": 1683751625, "voted_up": true, "votes_up": 51, "votes_funny": 9, "weighted_vote_score": "0.746230185031890869", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "138230224": {"recommendationid": "138230224", "author": {"steamid": "76561198005209129", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 8311, "playtime_last_two_weeks": 0, "playtime_at_review": 1370, "last_played": 1701619703}, "language": "english", "review": "Early access version .119.4\n\nShort version is I have enjoyed the 20+ hours I've played since launch. Now to the details.\n\nThis is a technical/complex game that will only get more so as it moves through EA. This is *not* a rub 5 stones and 2 sticks together to make a mud hut type of survival game. It took me about an hour to sort out how the power controls and such worked together. There is a nice system of logic behind the controls/power/water etc but it certainly took some plugging/unplugging stuff to figure it out. For being so early on in EA (or imo beta build) it seems well built and fairly fleshed out as far as buildings being ingame, models working etc.\nThe loading screen states this is an EA game with bugs...if you don't like such things, I dunno what to say.\nIn 20+ hours I've only encountered 1 or 2 game breaking bugs that were resolved by rolling back to an earlier save, I think it cost me 2-3h of gameplay total. For me that's totally fine for EA but I know that would bother some people. \nI expect to get another 10-20h of gameplay on the initial release build of EA which I'm on and then return to it as it gets updated. My hope is that they follow the No Mans Sky model of continuing to update the game over time while selling copies to pay for development, NMS turned into a gem of a game. Ocupy Mars is way less buggy and more stable imo and has large potential (not as high a ceiling as NMS) but could be a very very good game once it's out of EA and continuing on.\n", "timestamp_created": 1683975480, "timestamp_updated": 1683975480, "voted_up": true, "votes_up": 32, "votes_funny": 0, "weighted_vote_score": "0.741591393947601318", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "152916118": {"recommendationid": "152916118", "author": {"steamid": "76561197993518995", "num_games_owned": 673, "num_reviews": 8, "playtime_forever": 4910, "playtime_last_two_weeks": 0, "playtime_at_review": 4194, "last_played": 1710496857}, "language": "english", "review": "This has been a really tough decision, it's almost a \"wish there was a neutral\" style review.  But, ultimately, the question \"Would I recommend this game as is?\" would have to be answered with a \"No\".  There exist worse games for the money, but also much better ones.\n\nSo, on to the why of it.  First and foremost, the game is buggy and does not explain its own mechanics well.  There's an intro / \"tutorial\" but it's honestly THE buggiest part of the entire game, as in it locked up when, upon being informed I should take my helmet off now that I'm inside the doors of the base, I took my helmet off, which apparently the on-rails scripted tutorial just could NOT handle.\n\nAfter, or if, you manage to get through said section or just skip it to play sandbox, you're presented with an empty Red Planet that is dotted with abandoned bases.  For some reason repairing these bases and getting them functional as a shelter isn't an option, no instead they're there for you to grind down for parts and resources and loot for other parts and resources.\n\nAt this point there feels like a real thing of interest as you struggle to assemble what you need for things like having power throughout the night so your plants stay unhurt from Martian temperatures, and that can be touch and go early game, but once you've assembled enough power generation and storage (be it a solar power and battery setup or going whole-hog on wind generators)... well, functionally that's it.  There's just... nothing more to do.\n\nOh, you can grind and grind and grind for the heavy rover, sure.  But then you discover that, once again... you end up with this feeling of just... \"why?\".\n\nUpdates are still happening, and fixes are still ostensibly happening but the improvements and polish that the game desperately needs just don't seem to be forthcoming.  Certainly not at the rate needed to bring this game up to its potential any time soon.\n\nAnd the game HAS potential, there's a spark of something good here.  But I'm sure we've all seen so many Early-Access games just get abandoned or declared done despite being nothing of the sort.  So while I hope the game turns itself into a gem and makes me change this to a positive review while munching on a big pile of crow, right now, I just can't recommend this game.", "timestamp_created": 1701769429, "timestamp_updated": 1701769429, "voted_up": false, "votes_up": 26, "votes_funny": 1, "weighted_vote_score": "0.738977372646331787", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1702627898, "developer_response": "Hello,\n\nThank you for playing the game and for the review, this is very solid feedback and I hope that as we're getting closer to the full release you'll see that the potential you mentioned was realised and you'll want to visit Mars at least one more time.\n\nKind regards,\nOM Team"}, "138979946": {"recommendationid": "138979946", "author": {"steamid": "76561198298044539", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 2096, "playtime_last_two_weeks": 0, "playtime_at_review": 2096, "last_played": 1684715570}, "language": "english", "review": "Its definitely not a 'bad' game. I had fun for the first 10-15 hours of gameplay. But you run out of fun stuff to do pretty fast. I think Occupy Mars has a lot of potential. But when compared to similar space games like Icarus or even KSP, its fairly rudimentary in its current state. Once you gather blueprints and materials to build a base you're pretty much done with the game as far as I can tell. There's not really any quests, and base decorating is almost non existent. The Greenhouse is somewhat interesting and the rover has potential, but apart from that, there is very little to interact with. You can go out in a rover to mine resources to build a mega base, but there's little incentive to do so, since it's just you, and anything bigger than a small base just feels empty and redundant. You could explore the map, but its very uninteresting, apart from generic abandoned outposts and a few very scattered points of interest. I didn't bother with the jetpack, since by the time its unlocked I'd already built a base and unlocked all the tech I could, so there wasn't much point apart from flying up to get a better view of the base.\n\n I love space. I love mars. I'm a huge SpaceX and Elon fanboy. I really want to love this game. But at the moment its just too empty and progression too limited for me to genuinely recommend. I hope they keep developing it so I can come back and play it again further into development, once more content is added, and update this review. I really think this could be a great game. Just needs a bit more work.", "timestamp_created": 1685041886, "timestamp_updated": 1685041886, "voted_up": false, "votes_up": 42, "votes_funny": 2, "weighted_vote_score": "0.736105024814605713", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1685176093, "developer_response": "Hello,\n\nThank you for the review and for taking the time to give us elaborate feedback. I'm sorry that some parts of your experience were far from pleasant, but as you know, the game is in Early Access, so a lot will change and we'd appreciate the benefit of the doubt. For now, we were focused on fixing stuff, but we also have more content up our sleeves, hopefully, some of it coming as soon as sometime in June. I hope that your stay on Mars will become enjoyable very, very soon as we polish the game.\n\nKind regards,\nOM Team"}, "138120260": {"recommendationid": "138120260", "author": {"steamid": "76561198108168096", "num_games_owned": 492, "num_reviews": 1, "playtime_forever": 1253, "playtime_last_two_weeks": 0, "playtime_at_review": 535, "last_played": 1685206239}, "language": "english", "review": "Ok.. I tried. I put in a fair ~9 hours. Constructive feedback time..\n\nI'll try to keep it as concise as possible.\nWhat feels bad:\n  In a game with so many levers, you get action locked into using every single lever. If you are a couple of steps too far away and try to use a lever, you will get action locked into taking baby steps until you can reach said lever.. and then slowly pull it down all the way and stare at it until it goes back up. That feels terrible.. The best levers in the game are when you are running to the escape pod and the timer has stopped.. the lever to the hatches leading to the busted elevator. You click them and they move.. simple. This goes for anything that locks you into an action like that. Opening overhead compartments included.\n\n  Accessing your Pipboy seems pretty slow too. Maybe this is just a gripe from me, but it feels like Fallout where it takes too long. It could just be that I'm already frustrated from the time to use levers, so that might just be a me thing. \n\n  The choice to not let me use my map on the ATV is a brutal one. Maybe it's because it's tied to your Pipboy.. err.. Marsboy? How about just having the map pop up on your face shield while you're driving?\n\n  The tutorial. The tutorial is dope in the lore category. I don't mind that. But it feels long winded and like you're running through a maze doing irrelevant stuff. In 9 hours, I haven't needed to replace a fuse or any of that. Granted - some of my time was spend reloading or walking away for a little bit out of frustration. Also, when you first land in your recovery vessel, you would think that you need to get material points by scrapping. So, people generally grab the grinder and go to the nearest base to grind away only to find out that they need an upgraded grinder. Hopefully they find out that they need to use the grinder on the smaller boxes and such inside.\n\nBUGS:\n  The workbench. It basically is a bug. Your tools disappearing. Finishing a repair doesn't repair always. Sometimes you can dupe a small circuit board, etc... It's such a cool idea, but I feel like it went from idea to Prod and skipped QA.\n  The advanced tablets. Those things you read to get the advanced schematics... yea.. It really sucks to ride out to a POI on your ATV (stopping every few minutes to hop off and check the map) and see that the advanced tablet has fallen through the floor of a structure that you need a higher level grinder to make it through.\n\nThis is my first review - so sorry for the crappy formatting.\nThat's it. Cheers.", "timestamp_created": 1683771181, "timestamp_updated": 1683771181, "voted_up": false, "votes_up": 42, "votes_funny": 2, "weighted_vote_score": "0.723778069019317627", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1683790927, "developer_response": "We appreciate the feedback, thank you! We're working on first fixes as we write this, we also plan to improve every aspect of the game in the near future. We hope you will consider coming back and updating your review when the experience is more acceptable for you :)"}, "138136023": {"recommendationid": "138136023", "author": {"steamid": "76561197999665751", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 548, "playtime_last_two_weeks": 0, "playtime_at_review": 133, "last_played": 1705279253}, "language": "english", "review": "I enjoyed this when I did the pre-release play test it and I bought it and I enjoy it now. It does have issues here and there but nothing game breaking that I have encountered. And the Devs are actively slinging out patches daily and that may slow down some once they get it in a better state but at least they are trying which is more than I can say for most other EA titles. Those that are saying it is unplayable are just using it as an excuse to crap on it. Patience and understanding seem to be lacking in today's society.", "timestamp_created": 1683810608, "timestamp_updated": 1683810608, "voted_up": true, "votes_up": 27, "votes_funny": 0, "weighted_vote_score": "0.707588613033294678", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "139225403": {"recommendationid": "139225403", "author": {"steamid": "76561197970095972", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 1485, "playtime_last_two_weeks": 0, "playtime_at_review": 1276, "last_played": 1702148458}, "language": "english", "review": "It kind of pains me to say this because i like the game but i cannot recommend buying this game in its current state. So far this has been a complete exercise in frustration. I wont bring up the myriad of bugs it is early access so those are to be expected one of the major problem is the game gates your tech tree advancement behind tablets you have to locate in the world and it is completely RNG based. You may never come across the one you need it is honestly just poorly designed. Then lets talk about the disasters so your base is hit with a dust storm hey that's cool its mars but you cannot sleep through it you are just stuck in your base staring at the walls until its over lol. I finally got a halfway decent start and have a OK base up and running when i read on a post that water wells are not infinite and they run out over time? ...... Honestly whats the point then you spend hours building a base and you have to tear it down and move it WTH? ....... I am sure the devs will address the current issues with the game they do seem to be responsive to the community and since i am past the time to refund the game i will continue playing it for now but my advice is to wait this one needs to bake for awhile longer.", "timestamp_created": 1685382664, "timestamp_updated": 1685382664, "voted_up": false, "votes_up": 24, "votes_funny": 2, "weighted_vote_score": "0.700304865837097168", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1685478766, "developer_response": "Hello,\n\nThank you for the review and for playing our game. As we said before, we want to develop the game with our community - we got plenty of feedback regarding wells, tablets, and weather and we'll be looking into these mechanics to make sure they are fun to play and not frustrating. Especially regarding water wells, it shouldn't take long  - we thought it's gonna be fun if it's realistic (it's actually more complex than just \"it runs out\", but we get it that should be telegraphed better and we consider toggle option or removing the finite water at all).\n\nI hope it won't be long before your stay on Mars will be 100% fun.\n\nKind regards,\nOM Team"}, "138970045": {"recommendationid": "138970045", "author": {"steamid": "76561198072060066", "num_games_owned": 80, "num_reviews": 4, "playtime_forever": 2879, "playtime_last_two_weeks": 0, "playtime_at_review": 2225, "last_played": 1697266475}, "language": "english", "review": "While the game has huge potential and i loved playing it, in the current state i can't call the game early access. called me old fashioned but \"in my time\" we called this beta access at best! the game is filled with GAME BRAKING bugs. and it's not an overstatement or exaggeration. examples:\n-PCB's will fall trough the world in outposts, if you use your interface menu and raise the distance you can see them. go to an abandoned outpost and look into the ground you will notice almost every other one where you didn't fine a pcb it's because it's under the map. \n-the display in the green house it's bugged, i can't access it since i put the greenhouse down rendering the whole thing useless\n-the rover clips into the terrain or bugs out when you open the door or try to driving it not letting you to mount in the chair, -2nd, the helmet in the rover: if you hover over it the ai will say something to the line: sorry you can't access that\n-while this is not a bug it's the most annoying thing i have encountered in a game in a long time: THE ANIMATIONS ARE ABYSMAL! let me explain: to take your helmet off it takes a solid 2 seconds of animation where you just have to watch him taking it off. if you have a base and you want to take it off every time you go in and out it will drive you nuts. almost everything has a forced animation that is so annoying after a couple of hours of playtime that you just want to quit playing the game. same goes for opening loot crates doors and the list goes on\n- what made me quit the game was that after 35h of game-play my game completely gave up: the water well all bugged out all of them produce and store the water in the tanks but whenever you try to access that water it's saying water source is empty despite having 800gal, and 6000gal \"plus 4 5 other wells, connecting it to your base with a hose won't chance anything the water won't move out of the wells or tanks or well pumps or any combination of those. on top of that my personal(inventory) h2o tank is at 0 and the quantity instead of showing percentage or the scale bare it's saying \"NaN\" i haven't had to refill my H2O tank in 6 or 7 hours of game-play. i i can't plant anything. every time i try to refill my h2o bottle i get either water source empty or a negative number something like -253675.\n- despite all of that i kept playing but last night the food bar stopped going down and if i try to go to sleep i get stuck in the animation that's spinning around the capsule or the star sky or sun or whatever the time of the day you go to be in when you went to bed. the only way to get out of it is to alt+F4.\n-Horrible FPS spikes\n-terrible 1st-3rd person random camera auto switching\n-the list of game braking bugs could go on and on and one i just thought i should share the game braking ones(for me) and why i think this game was nowhere near the \"early release\" they called. This is a BETA release at best! So for now i would stay away from buying the game. It is very addictive to play the game and i'm sure if they put the time and effort into fixing it it might be a great success but for now the price it's not right for what you get!", "timestamp_created": 1685029980, "timestamp_updated": 1685030319, "voted_up": false, "votes_up": 47, "votes_funny": 4, "weighted_vote_score": "0.6980552077293396", "comment_count": 25, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1685175984, "developer_response": "Hello,\n\nThank you for the review and for taking the time to give us elaborate feedback. I'm sorry that some parts of your experience were far from pleasant. A huge patch with bugfixes is in the works. As you know, the game is in Early Access, so a lot will change and we'd appreciate the benefit of the doubt. I hope that your stay on Mars will become enjoyable very, very soon as we improve the game.\n\nKind regards,\nOM Team"}, "145246273": {"recommendationid": "145246273", "author": {"steamid": "76561198011641803", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 75329, "playtime_last_two_weeks": 3694, "playtime_at_review": 15594, "last_played": 1713770168}, "language": "english", "review": "Like:  The Game as a whole, good graphics and overall storyline.\nDislikes: slow loading, jerky movements, minimal instructions on how to do things i.e. botany - no indication of the need to use silicon rocks in the composter before you can use the 'fields'  properly, still trying to find how to get the 'chemisty' side of things set up due to lack of information etc.", "timestamp_created": 1693298483, "timestamp_updated": 1693298483, "voted_up": true, "votes_up": 21, "votes_funny": 0, "weighted_vote_score": "0.6978721022605896", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "138348817": {"recommendationid": "138348817", "author": {"steamid": "76561198006363351", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 4897, "playtime_last_two_weeks": 0, "playtime_at_review": 925, "last_played": 1684986128}, "language": "english", "review": "Out of date. Will re-review later.\n\nOne of the most promising survival RPG out there.\nTDLR: Try it, refund if unhappy but give it a chance. Consider trying the demo(occupy mars: prologue 2020) at least.\nEspecially if you are a space exploration nerd like me. I love the idea and I really like their dedication to realistic Sci-Fi. \nThink \"The Expanse\"(without the torch drives) instead of Star Trek magic tech. Or SpaceX in 20-30 years.\n\nExplore, grow your food, expand your base, unlock new technologies and ultimately becomes self-sufficient.  Get the full martian colonist experience including freezing to death in those cold martian nights, eating a meteor to the face, losing the war against sand and breaking your neck while attempting a front flip with your ATV in 40% earth gravity.\n\nGame is stable I haven't had a crash so far. There are a few hiccups with the game but nothing major. I should point out that 4 patch have been published in less than a week since launch so some bugs that were present on launch day are already gone(infinite loading in particular). Thus the game is not as broken as some early reviews would lead you to believe. \n\nThe game is fun but a number of issues(big&small) remain: \n\nThe soundtrack is fine but the game will occasionally cycle from one track to the next without rhyme or reason, as far as I can tell. That can be a bit jarring at times. It's also a little repetitive. I wish we had more control over that.\n\nThe performance is okay but it's somewhat lower than the play test(pre-early access) for one reason or another(it could be the different location on the map). I used to get low to mid 90's now I currently get high 70's to low 80's on average with dips to 40's or sometimes 30's when on the QUAD ATV. Given my high spec system(5900x/32gb ram/3090), it is mildly disappointing to see occasional stutters when there were none previously(or very few) but it is also early access. To be fair, I maxed out all the graphics settings so the game would run better if I were to lower a few.\n\nWhile most of the core features are in the game, they still need to add a number of things so optimisations will likely take some time, which is fine. Adding DLSS support would be nice. \n\nThe datapad fetch quests is rather boring. I am not convinced that datapads should be required for basic technologies. In the game you are purportedly an electrical engineer, yet, you need to rediscover how to extend/upgrade the ECU/batteries? Seems odd to me. Also, far too grindy. This is a delicate balancing act though. If it becomes too easy then players will blitz through the tech tree and skip some of the techs but right now given how rare datapads are, I think some techs should have that requirement waved. It also forces us to reload the game if we don't get the tech we need so overall the experience is janky. Sure it's self-inflicted to a point but trust me, you REALLY want those battery upgrades and as it stands, finding a sufficient amount of datapad in a reasonable time-frame is too hard. I found 3 datapads after being 6 hours in the campaign(which is not worth it right now, just do freeplay).\n\nThe system should be modified such that you still need datapads to progress toward mid & late game techs but for the technologies you need to build a basic self-sufficient base you should be able to get them without datapads. So essentially, a workshop that can power itself and produce food in perpetuity. One might think that you don't truly need the ecu and battery upgrade to do this but I disagree because of the circuits board requirement. You need at least 48hours of battery capacity and assuming a drain of 25 kw, that's a lot of batteries.~7 circuit boards or 1 per 180kwh of capacity provided by un-upgraded batteries, +3 or 4 for ecu, +1 for ATV. Just not realistic to expect player to obtain that many small circuit boards in the early game. Why 48 hours? Dust Storms. Solar panels produces nothing during storms and run at a lower rate for some time after unless you clean them.  Probably want 72 hours of capacity to be extra safe. Thankfully, upgrades for ecu and batteries don't need circuits board which seems reasonable to me. Just be really careful with those potato seeds and don't plant them too early.\n\n[b]Speaking of circuit boards, Please Devs, make them stackables[/b]. Also, let us store them in the containers in the capsule.\n\nThe distribution of circuit boards on the map is strange. I have found 7 large ones, about the same amount of small ones but only one medium circuit board. This might be fine depending on which devices need which circuit board(something which the knowledge base in the game doesn't cover at the moment), so time will tell. \n\nSome techs should be shifted around. Why is suit battery printing so far up the tech tree? It's weird. But again, early access and things already changed substantially from the previous version so I expect that things will keep changing according to feedback.\n\nI dislike the new procedure to remove the helmet. Too many clicks are involved( I use the keybind instead). More importantly, there should be an option to speed up or skip the animation. First person animation for helmet removal and when going to sleep would be nice... \n\nThe biggest issue in my opinion is that the campaign is not very good right now. You should just play the tutorials on the main menu and then do free play. Here's why:\nThe facial animations don't seem to always work or maybe not every character has facial animations, I'm not sure. The more important issue though it's that the whole story intro at alpha base feels rushed and it seems like it's just tacked on. You very briefly get introduced to some characters and some of the basic mechanics without it being a full blown tutorial and then complete three or four basic tasks which don't teach you anything immediately useful. Then the base gets blown up everyone either leaves or dies and you are left alone on mars. After that, you start just like you would if you had selected free play. \n\nAnother issue is that after the base gets destroyed, you need to escape it and it's an absolute maze.  This would be fine if not for the fact that if you run, jump or move too quickly in some corridors(the ones with collapsed roof or missing floors mainly) you die instantly. Escaping it was a lot of trials and errors. Even before the base gets destroyed, navigating through it was a pain since a lot of airlocks are locked for no apparent reason and you often need to take a massive detour to get where you need to go.  There are also no sign post anywhere so finding the doctors office for example is just a matter of opening every door in the general direction that the arrow points towards. I like the general idea but the intro needs a lot of polish.  I am not sure if there are currently more story related content beyond that but I will update my review If I find any. \n\nThere are a few other issues and a little jank( no crosshair or target highlight when grinding/mining/repairing, pop-in of your face while driving the ATV, no map while driving the ATV) but this review is getting quite long.  \n\nAll in all though, the Devs have good ideas and a good work ethic if the incredible patch cadence is any indication and I imagine the issues will get fixed sooner or later. \n\nIn short, a good albeit not perfect early access game but a solid 7/10. If we get everything that's been alluded to on the roadmap it will easily be be 9/10. If you are on the fence, try out the demo that was released a while back. Alternatively, buy it, try out the tutorial and freeplay for an hour or two and if you don't like it refund it but I really think you should give them a chance.\n\nSkip the campaign for now though as it will just waste your time and not give a good overview of the rest of the game. \n\nI have more to say but I'm ending it here since I am running out of characters. I will edit my review or add comments if necessary.", "timestamp_created": 1684174609, "timestamp_updated": 1708877694, "voted_up": true, "votes_up": 29, "votes_funny": 1, "weighted_vote_score": "0.693416774272918701", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "138597632": {"recommendationid": "138597632", "author": {"steamid": "76561198269614282", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 2033, "playtime_last_two_weeks": 0, "playtime_at_review": 2033, "last_played": 1684464276}, "language": "english", "review": "As far as mechanics go, this game has some interesting ideas that make it fun at first. For the price it is currently, I don't see it being worth it yet. I think the team building this game has a lot of work ahead of them. The map is massive, but exploring is repetitive and tedious. The tech tree needs a complete overhaul unless the devs genuinely dislike their playerbase. I looked through the roadmap for this game and it might go somewhere, but probably not for a few more years. It lacks content, it lacks polish for the UI, it lacks graphical optimized performance, it lacks clarity when it comes to the tech tree, it lacks balancing in terms of the loot you find in abandoned outposts, and it lacks enjoyment for longer playthru's. This game could fix many of these issues quickly, but the fact it has been in testing for so long and it hasn't, doesn't give me hope. So WAIT, spend your money on games that are finished, or at least that can be enjoyed throughout the development process. This may not be one of them.", "timestamp_created": 1684570873, "timestamp_updated": 1684570873, "voted_up": false, "votes_up": 24, "votes_funny": 0, "weighted_vote_score": "0.689400017261505127", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1684705670, "developer_response": "Hello,\n\nThank you for playing the game and the review. I'm sorry that you didn't like the experience, but please, keep in mind that we're in the Early Access and a lot is bound to change. I hope that in some time you'll return to Mars and have tons of fun with the title.\n\nKind regards,\nOM Team"}, "138323546": {"recommendationid": "138323546", "author": {"steamid": "76561197998112769", "num_games_owned": 0, "num_reviews": 40, "playtime_forever": 1039, "playtime_last_two_weeks": 0, "playtime_at_review": 937, "last_played": 1684355510}, "language": "english", "review": "Wait before you buy. I had my fun. But after building your base.. there is nothing left. No Missions no research nothing. I hope there will be something like research stones, craters or old station, a use for your base. Currently it's just building a base", "timestamp_created": 1684123390, "timestamp_updated": 1684123390, "voted_up": true, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.67910468578338623", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "138161888": {"recommendationid": "138161888", "author": {"steamid": "76561197993755512", "num_games_owned": 75, "num_reviews": 6, "playtime_forever": 6737, "playtime_last_two_weeks": 0, "playtime_at_review": 1252, "last_played": 1706189524}, "language": "english", "review": "Yes there are bugs, yes there are somethings I would change, yes I LOVE THIS GAME (So far)!!! I get to build, survive, play with power and O2, H2O, etc.. we just need multi player and i will be happy.", "timestamp_created": 1683850521, "timestamp_updated": 1683850521, "voted_up": true, "votes_up": 22, "votes_funny": 0, "weighted_vote_score": "0.678193986415863037", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "149010479": {"recommendationid": "149010479", "author": {"steamid": "76561199488516680", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 19955, "playtime_last_two_weeks": 0, "playtime_at_review": 1293, "last_played": 1710983409}, "language": "english", "review": "this is one of the most deep, detailed games ive played is some time. love it! However, would it be to much to ask for a bit more guidance in the initial setup of your first base? ive spent more time watching videos, reading long, long, so long, Q&A's . Not a big fan of having to take online classes to learn how to play a game. this would be the only reason i wouldnt recommend this to other players. otherwise you could not ask for a more well put together game.", "timestamp_created": 1698447685, "timestamp_updated": 1698447685, "voted_up": true, "votes_up": 15, "votes_funny": 1, "weighted_vote_score": "0.67112201452255249", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140771189": {"recommendationid": "140771189", "author": {"steamid": "76561198119308253", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 8865, "playtime_last_two_weeks": 0, "playtime_at_review": 7780, "last_played": 1693958411}, "language": "english", "review": "EDIT 9/5/23\n\nIm changing my rating to recommended. The game breaking bug I described below was fixed once the latest update came out. Their team communicated with me and looked at my save files, and even though they couldnt fix the issue right away, I have to give them credit. The game certainly isnt perfect, and theyll need to really expand the tech tree and other aspects of the game to maintain long term game play, but overall I still really enjoy the game.\n\n\nI actually really like this game, even with the usual early release bugs.  Im about 150 in-game days into it(130hrs) and have accomplished all the main things you can with the game in its current state.  That said, a game breaking bug keeps happening to me since the latest update where my saves do not in fact save.  I can restart and Ill be able to save a couple times successfully, but if I dont notice the saves arent working, I end up losing a ton of progress. This includes autosaves after sleeping as well as manual saves.  Ill keep an eye on updates and will likely play again, but I consider this to be game breaking and cant recommend the game until I see it addressed.", "timestamp_created": 1687838738, "timestamp_updated": 1693951083, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.6710357666015625", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1687855224, "developer_response": "\nHello,\n\nThank you for giving our game a shot and for the review. I'm sorry about the technical difficulties undermining your adventure.If you could send us your save file as an archive, we could help you directly and learn more about the issue.\n\nSave files are located in:\nC:\\Users\\%username%\\AppData\\LocalLow\\PyramidGames\\OccupyMars\n\nPlease, copy the whole folder to a zip/rar file and send it to eracolonisthelp@gmail.com\n\nKind regards,\nOM Team"}, "138100279": {"recommendationid": "138100279", "author": {"steamid": "76561198050772866", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 85, "playtime_last_two_weeks": 0, "playtime_at_review": 27, "last_played": 1709690668}, "language": "english", "review": "I would think that after having the demo out for so long that they would have been able to make the game better.. its worse. It is almost unplayable and the fact that it still has SO MANY bugs is unbelievable. Stay FAR away from this game unless you're a glutton for bad games.", "timestamp_created": 1683737294, "timestamp_updated": 1683737294, "voted_up": false, "votes_up": 152, "votes_funny": 14, "weighted_vote_score": "0.665662169456481934", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1683738456, "developer_response": "Hello, \n\nThank you for taking the time to give us some feedback. Would you mind being more specific? It's difficult for me to help you out or address stuff not knowing what's wrong. \n\nKind regards,\nOccupy Mars Team"}, "138101261": {"recommendationid": "138101261", "author": {"steamid": "76561198074381645", "num_games_owned": 0, "num_reviews": 59, "playtime_forever": 20, "playtime_last_two_weeks": 0, "playtime_at_review": 20, "last_played": 1683738251}, "language": "english", "review": "Terrible framerates, overbearing tutorial, cringeworthy voice acting, clunky UI, sluggish and janky movement. I don't know man, just not for me I guess.\n\nI hate leaving these kind of reviews but wow, this game needs some serious work. I might pick it back up in a year or so.\n\nJust go buy Planet Crafter and have fun", "timestamp_created": 1683738788, "timestamp_updated": 1683751009, "voted_up": false, "votes_up": 107, "votes_funny": 7, "weighted_vote_score": "0.664645671844482422", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1683740505, "developer_response": "Hello,\n\nThank you for the feedback. Please note that this is an Early Access release and we'll continue developing and polishing the game. I hope that after some time you can return to the game and have tons of fun with it.\n\nKind regards,\nOccupy Mars Team"}, "139328481": {"recommendationid": "139328481", "author": {"steamid": "76561198060449919", "num_games_owned": 55, "num_reviews": 2, "playtime_forever": 2945, "playtime_last_two_weeks": 0, "playtime_at_review": 1565, "last_played": 1685881173}, "language": "english", "review": "Still a bit rough around the edges right now, but that's to be expected from a game that was just released in Early Access 3 weeks ago. Even at this stage, there's plenty to do, with just as much (if not more) promised to be released later. \n\nIf you're a fan of survival games, this is a good one. If you're a fan of base building, you'll like this. If you're a fan of space exploration, there's plenty for you to enjoy. Since I'm all three, I'm probably a bit biased here. I haven't played this enough to know if there's much in terms of story, so if that's what you look for, not sure what to tell ya.\n\nSome things worth mentioning:\n - I've played a few space-based survival adventure games and so far, this is the most realistic. I don't want to spoil anything, so I'll leave it at that, but that is one thing this game does very well.\n - the soundtrack is quite good, if you care about that kind of thing \n - lots of cool stuff to build/research/discover\n - the ground is pretty boring (it's Mars, so that tracks), but you can tell they put some work into making the sky look pretty damn cool\n\nHope this review is helpful. Probably isn't. Have fun.\n\n", "timestamp_created": 1685553234, "timestamp_updated": 1685553234, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.663483142852783203", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "156344369": {"recommendationid": "156344369", "author": {"steamid": "76561198018124881", "num_games_owned": 398, "num_reviews": 106, "playtime_forever": 3273, "playtime_last_two_weeks": 0, "playtime_at_review": 3273, "last_played": 1705719562}, "language": "english", "review": "Awesome concept, some interesting mechanics, below average implementation.\n\nPros:\n- Good farming\n- Decent exploration (Good in Nuclear update)\n- Decentish mining\n\nCons:\n- Linear development. It doesn't look linear, but very much feels linear because despite non-linear tech tree there is effectively no two ways to go about the same thing.\n- General implementation/UI/Interactions. Things like oxygen, power and water are overtrivialized in some aspects yet filling your bottle sometimes takes as long as building a water well. It's better now that threre are buildable water taps (a tap the size of a bathroom) and battery chargers, but still feels overcomplicated and non realistic\n- Power, I'm not sure what's going on there... it's trivial enough to overbuild your power supply and put a bunch of batteries&extensions in parralel, but system in general feels overcomplicated and unrealistic (power can vanish into the air without any consumer, same for the water)\n- Things like temperature and pressure in facilities just passively work, like facility just instantly heating up to needed temperature once power turns on, complicated topic seems oversimplified to the extreme.\n- Facility issues and weird limitations, low variety (to be fair it's similar to other games, like subnaitica, but equipment placement is predefined to such a degree that it feels like there is no variety, ex: all doors are predefined, can't build vertically).\n- Inventory... When 3D printer and rover are the most effective storage... There are some improvements in 'nuclear' branch, but that's scratching at the surface of the issue. There seems to be a major control inconsitency: picking up rocks requires a long click, ore a doucleclick, cable goes straight to inventory when you want it in a toolbar while tool needs to be dragged into inventory if you don't want it in toolbar. Taking a tool from stationary storage into toolbar is not possible, you need to open inventory separately. Floor (if it wasn't bugy) would have been a far more effective storage than most constructable solutions. On top of that you need to research storage as if welding couple shelves is a problem.- Inventory... When 3D printer and rover are the most effective storage... There are some improvements in 'nuclear' branch, but that's scratching at the surface of the issue. There seems to be a major control inconsitency: picking up rocks requires a long click, ore a doucleclick, cable goes straight to inventory when you want it in a toolbar while tool needs to be dragged into inventory if you don't want it in toolbar. Taking a tool from stationary storage into toolbar is not possible, you need to open inventory separately. Floor (if it wasn't bugy) would have been a far more effective storage than most constructable solutions. On top of that you need to research storage as if welding couple shelves is a problem. Running time from storage to storage...\n- Bugs. Like both of facilities that are connected by an airlock losing atmosphere when aitlock is supposed to stop it. Pointing grinder onto one item removes a different one, e t c\n\nThis might end up being a decent game, but can't reccomend at the moment.", "timestamp_created": 1705720730, "timestamp_updated": 1707144795, "voted_up": false, "votes_up": 17, "votes_funny": 1, "weighted_vote_score": "0.652812302112579346", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1705779967, "developer_response": "Hello,\n\nThank you for playing the game and for such thorough feedback. If you could elaborate on the subject of storage, what would you say is the biggest problem? The overall capacity of storage units? Where they can be placed? How much resources do they cost? How storing the items is handled? Or do you have something else in mind?\n\nKind regards,\nOM Team"}, "146886635": {"recommendationid": "146886635", "author": {"steamid": "76561197993593329", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 456, "playtime_last_two_weeks": 0, "playtime_at_review": 456, "last_played": 1695500458}, "language": "english", "review": "TL:DR - It's a bit too early access. Doesn't seem like a lot here except casual survival and base building. A lot of balancing still needed to keep padded game time to a minimum. Very few bugs, none of which were game breaking from what I found.\n\n-\n\nSo here's the long version. Game is fun to a degree but it has some frustrating elements to it. Examples include random blue print unlocks which gate some important things such as vehicles. It takes literal hours to gain research points, though thankfully that's through actions you would already be taking just playing the game anyway. Random weather events like tornadoes taking quite a long time to pass as well as a night so cold you start taking damage just being outside.\n\nMore than a few times I found myself going down a slight decline only to some how start falling down instead of walking and die to fall damage. This means any progress I've made since the last save is completely lost. Added to that the travel times and tediousness of resource gathering make for a very frustrating time.\n\nI did find the base building mechanics a bit clunky but easy to understand. Most things have easy to follow indicators but a lack of manual rotation controls gives it an awkward feel.\n\nLastly there's a bit too much busy work, though some of it I did find interesting to work out, like the circuitry repair, though basic survival resource management and farming were on the tedious/clunky side. Though farming did have it's quirks I was tired of it after a few rounds of planting/harvesting/processing repeat. Yes, that's how farming works, it's just the particular mechanics here are over complicated or downright tedious.\n\nI'd say give this a little more time to cook and it'll probably be worth your time and money.", "timestamp_created": 1695501790, "timestamp_updated": 1695501790, "voted_up": false, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.652058064937591553", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1695579552, "developer_response": "Hello,\n\nThank you for playing the game and for the thorough feedback. We'll consider improvements to the tech tree system. As the game progresses, you'll unlock more ways to explore Mars, travel further and even stay outside at night. I hope that with future improvements to the game you'll be able to change your mind, have plenty of fun and give us a positive score :)\n\nKind regards,\nOM Team"}, "152353260": {"recommendationid": "152353260", "author": {"steamid": "76561198009391214", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 114, "playtime_last_two_weeks": 0, "playtime_at_review": 114, "last_played": 1701154998}, "language": "english", "review": "This game needs a lot of work.  I cannot recommend this game until the interface and explanation of tasks gets better.  Start CO2 scrubber.  Go to machine indicated. press start. go flying across the room.  Still says start CO2 scrubber.  Stupid.  This game assumes you already knew what you are to do.  You are always getting thermal warnings even in the base.  Select a task to track - how?  Oh - its in messages - ok....  How to track - press the unlabeled symbol in upper left of message.  Except you have to do it several times for it to light up and stay lit.  I had played the demo a while back and thought they had improved the game quite a bit since the reviews were positive - unfortunately that doesn't seem to be the case.  The concept might be good - but not worth it right now.", "timestamp_created": 1701156213, "timestamp_updated": 1701156213, "voted_up": false, "votes_up": 35, "votes_funny": 5, "weighted_vote_score": "0.649704813957214355", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1702266160, "developer_response": "Hey Madjim,\n\nThank you for giving our game a shot and for the review. I'm sorry about the technical difficulties. Can you please send us the video and logs/ save files so we can take a look at what's wrong?\n\nSave files are located in:\nC:\\Users\\%username%\\AppData\\LocalLow\\PyramidGames\\OccupyMars\n\nPlease, copy the whole folder to a zip/rar file and send it to eracolonisthelp@gmail.com\n\nKind regards,\nOM Team"}, "138263836": {"recommendationid": "138263836", "author": {"steamid": "76561197970596369", "num_games_owned": 211, "num_reviews": 2, "playtime_forever": 1912, "playtime_last_two_weeks": 0, "playtime_at_review": 562, "last_played": 1706298824}, "language": "english", "review": "In the past i was playing take on mars, i really like the whole concept of being on mars alone and build a base. Occupy Mars gives me this satisfaction. I personally play the freeplay because i like it and the ability to choose that all tech is already unlocked and i don’t need to do all the grinding and searching for all blueprints is for me the most positive part. I just want to build my base and go through all mechanics. I really like the giant rover. I see it as my mobile home in the beginning and search for my ultimate location to build my base. With the early access release a lot of tech is already delivered and this will give me a lot of happy play time.\n\nI am a father of two kids and i don’t have the time to grind and search for all tech blueprints. In this way i am able to play and build my base.\n\nTo all developers off this game, you delivered me an awesome game and a lot of fun to build my base. Keep up this awesome work.", "timestamp_created": 1684023117, "timestamp_updated": 1684023117, "voted_up": true, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.6449776291847229", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "138463952": {"recommendationid": "138463952", "author": {"steamid": "76561197977325659", "num_games_owned": 0, "num_reviews": 29, "playtime_forever": 165, "playtime_last_two_weeks": 0, "playtime_at_review": 148, "last_played": 1697731098}, "language": "english", "review": "Ugh. I want a survival game on Mars to work. I really do. I had this on my wishlist AND Kickstarted it. Just not good, at all. It's functional, but... barely.\n\nHint to the devs: trying to plug things in isn't a fun game mechanic. Gating stuff behind RNG lootcrates (essentially) is not fun. And launching - even in EA - in this state is not a sensible move. I hope things improve. I'll be following. But can't recommend in this state.", "timestamp_created": 1684374810, "timestamp_updated": 1684374810, "voted_up": false, "votes_up": 31, "votes_funny": 1, "weighted_vote_score": "0.640507400035858154", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1684417448, "developer_response": "Hello,\n\nThank you for giving our game a shot and for the review. I'm sorry that you didn't like the experience. If by RNG and loot crates you mean the circuit board mechanic, we're looking into that and we'll be changing the system.\n\nWe're patching the game almost daily, a lot of things are bound to change and we hope that you'll be able to enjoy your stay on Mars very soon.\n\nKind regards,\nOM Team"}, "138102766": {"recommendationid": "138102766", "author": {"steamid": "76561198080418297", "num_games_owned": 244, "num_reviews": 10, "playtime_forever": 37, "playtime_last_two_weeks": 0, "playtime_at_review": 37, "last_played": 1683740152}, "language": "english", "review": "Besides the idea, there isn't a single good thing about this game, not the graphics, soundtrack, playability, visuals, nothing is enjoyable.\nThe game has a very slow pace compared to my espectations, since it is a survival game maybe it should take inspiration in great games from the same genre.\nInteractions are way too slow and movement gives you little fine control, \nThe interface color scheme is bland and tedious, it's basically blue everywhere, \nThe tutorial is BEYOND boring and does an awful job explaining the basics and couldn't keep me engaged . overall a terrible experience.\nEven if there was multiplayer/coop I don't think I could overlook such screaming problems", "timestamp_created": 1683740937, "timestamp_updated": 1683740937, "voted_up": false, "votes_up": 62, "votes_funny": 10, "weighted_vote_score": "0.638044118881225586", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1683743352, "developer_response": "Hello,\n\nThank you for your review. I'm sorry that your experience with the game was so negative. While regarding the technical aspects of the game all I can say is that we'll continue working on that stuff, keep in mind that the game is still in the Early Access.\nRegarding the tutorial problems - could you elaborate please on which parts were they unclear? We'd love to help you out or at least to know what to focus on when fixing them.\n\nKind regards,\nOM Team"}, "138132083": {"recommendationid": "138132083", "author": {"steamid": "76561198136844941", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 5019, "playtime_last_two_weeks": 0, "playtime_at_review": 303, "last_played": 1702589552}, "language": "english", "review": "This game has been called unplayable and a mess, and I am still trying to find out what justifies that. I have been following this work of art from the beginning along with many others. I will start off by saying I am a proud backer of the Kickstarter that brought us this game. There are some things that need worked on with the game, but I just played it for 5 hours and thoroughly enjoyed it. As long as you're not trying to play the game on a potato of a computer, everything ran fine for me and looked great on Medium graphics settings with the resolution set for 1900x1080. Everything still looked great, GPU was never used up over 70%. I run a Nvidia 3060 12gb VRAM. CPU never went over 10%. I run a Intel i7 12700k 3.6GHz 12-Core Processor. A majority of these people claiming to have all these issues most likely don't have the settings configured properly. Anyone who is a fan of the survival genre, LOOK NO FURTHER! This game has it all, and instead of having to worry about annoying A.I. Wolves, Bears, or other creatures. You simply have to survive the harsh elements of Mars. I absolutely love that the devs of this game worked hand in hand with the folks developing tools/structures for colonies on the Moon/Mars in the here and now. The structures you see in game are the prototypes of what they may be using in future colonization missions in space. What a time to be alive! You can expect the normal grind you would have to put in when playing a solid survival game. You have the same frustrations as well, however, this game is Early Access and I would have to say it is probably one of the better Early Access titles I have played that hasn't been a complete flop. Including AAA titles. So well done to the devs. Get it now while the price is good. Once the cat is out of the bag about this gem, it will surely be marked up to a price that reflects the quality and you will have missed out at getting in on the ground level and helping make an already outstanding game, even better.", "timestamp_created": 1683802374, "timestamp_updated": 1683802374, "voted_up": true, "votes_up": 31, "votes_funny": 2, "weighted_vote_score": "0.637389123439788818", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "138651360": {"recommendationid": "138651360", "author": {"steamid": "76561198108249070", "num_games_owned": 0, "num_reviews": 48, "playtime_forever": 468, "playtime_last_two_weeks": 0, "playtime_at_review": 468, "last_played": 1684628608}, "language": "english", "review": "So im soft locked, my well has 13 liters of water and when i try to fill up my water canister is says \"source empty and deletes all the water in my well, And then im sitting there with no water while i wait for the well to generate and then it just deletes it again when i try to refill my bottle\nALSO why do i have to switch to third person just to take a nap, you have to do this 3 TIMES just to get through 1 night!", "timestamp_created": 1684629224, "timestamp_updated": 1684629224, "voted_up": false, "votes_up": 17, "votes_funny": 1, "weighted_vote_score": "0.636811792850494385", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1684705144, "developer_response": "Hello,\n\nThank you for giving our game a shot and for the review. I'm sorry about the technical difficulties undermining your adventure. It sounds like a bug. If you could send us your save file as an archive, we could help you directly and learn more about the issue.\n\nSave files are located in:\nC:\\Users\\%username%\\AppData\\LocalLow\\PyramidGames\\OccupyMars\n\nPlease, copy the whole folder to a zip/rar file and send it to eracolonisthelp@gmail.com\n\nKind regards,\nOM Team\n"}, "138103337": {"recommendationid": "138103337", "author": {"steamid": "76561198046670709", "num_games_owned": 130, "num_reviews": 3, "playtime_forever": 24, "playtime_last_two_weeks": 0, "playtime_at_review": 24, "last_played": 1683740925}, "language": "english", "review": "Horrible graphics. Awful framerates even on Very Low settings. The tutorial treats you like you've never used a computer before. The campaign starts very slow and with a lot of cringy, boring voiceacting. Dude, just let me play and build stuff. I eventually gave up after an explosion pushed me away and locked me inside of another object, unable to move. I couldn't find an \"Unstuck\" button in the options. \n\nIdk, maybe I just got unlucky and impatient. There's definitely a potential here for something decent, looking at the pictures/videos. They just need to patch up the core game to make it at least somewhat playable...I'll give it another try in couple of months maybe.", "timestamp_created": 1683741751, "timestamp_updated": 1683741916, "voted_up": false, "votes_up": 34, "votes_funny": 5, "weighted_vote_score": "0.632758080959320068", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1683744033, "developer_response": "Hello,\n\nThank you for the review and the constructive criticism. I hope that despite the first harsh impression you can return to the game after some fixes and have tons of fun with it. It's Early Access and we'll continue to develop and polish the game.\n\nKind regards,\nOM Team"}, "141311178": {"recommendationid": "141311178", "author": {"steamid": "76561198198173582", "num_games_owned": 54, "num_reviews": 1, "playtime_forever": 645, "playtime_last_two_weeks": 0, "playtime_at_review": 328, "last_played": 1694277680}, "language": "english", "review": "Too many bugs, even for an early access game.\n\nThe Major Game Breaking Ones: \n\n- Save system is broken. Saving manually from the menu doesn't work, and the auto-save feature just gets stuck in the \"Saving...\" state, rendering the mouse useless in the menus. \n\n- Game freezes 5 out of 6 times while loading, and having to force quit. \n\n- Blueprints even after unlocked are still showing as locked. No amount of restarting fixes this. This includes Freeplay mode where all the blueprints are already unlocked. I managed one time to get them to show up by random luck, but haven't had any since then. \n\nI spent more time dealing with bugs than playing the game, and have passed the refund window. Guess I'll wait and see if any of these get fixed on future updates, but for now its a no-go.\n\nUpdate: Game was updated and promised to fix the saving bug but its still present.", "timestamp_created": 1688494052, "timestamp_updated": 1694626926, "voted_up": false, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.62955319881439209", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1688657404, "developer_response": "Hello,\n\nThank you for giving our game a shot and for the feedback. I apologize for the technical difficulties - we're currently working on a major update that should tackle these problems, most importantly, save system bugs. We know that players expected it to be out in late June/ early July, but we decided it needs some extra polish and more stability. I hope that once it's out, you'll be able to focus on what's important - fun.\n\nKind regards,\nOM Team"}, "145415507": {"recommendationid": "145415507", "author": {"steamid": "76561198062440797", "num_games_owned": 0, "num_reviews": 64, "playtime_forever": 3637, "playtime_last_two_weeks": 0, "playtime_at_review": 3637, "last_played": 1692843449}, "language": "english", "review": "The early access game started out good and seemed to be going in the right direction.  Until the recent update.\n\nThe developers decided to add grind hindrances and blocked quality of life items all the while adding unrealistic vehicles in a planetary environment where simply breathing is a challenge.\n\nExamples:\n\n- You can 3D print an entire quad vehicle, but you are not able to 3D print a simple oxygen or water bottle in order to have a stock of air and water for extended exploration.  \n\n- after this update your tools such as torch and grinder erode after a couple of minutes of use, requiring repairs.\n\n- A motorcycle on mars?  now there a sure fire way to crack your helmet open and die on a rock laden landscape.\n\nMany of these obvious issues have been voiced by the community, but the developers simply reply with. \" we have made a decision to do it this way\"  \n\nSo in essence:  play the game the way we tell you to play it.. not the way you want to play it.\n\nNow a Developer may reply to this review with the company line of \" thank you for your input, however.. blah blah blah.\"  but if you want to see it for yourself.. take a peek at the forums.\n\nI have lost all desire to play the game.  Money well wasted....", "timestamp_created": 1693531314, "timestamp_updated": 1693531601, "voted_up": false, "votes_up": 11, "votes_funny": 2, "weighted_vote_score": "0.627636492252349854", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1693572372, "developer_response": "Hello,\n\nYes, unironically thank you for your input. Your and community's voices ARE important to us. In upcoming updates, we'll adjust the damage the tools are taking when used, according to players' suggestions. We're also working on the printable oxygen and water bottles.\n\nThe vehicles we added were funded as part of the Kickstarter campaign. We had a legal obligation to add them. Many players enjoy them and that's fine. Some don't and it's also fine. It's YOUR Mars exploration, nothing forces you to use them. If you feel like they're not a fun addition to the game and break your immersion - you don't have to rely on them. \n\nKind regards,\nOM Team"}, "140207408": {"recommendationid": "140207408", "author": {"steamid": "76561197972642306", "num_games_owned": 641, "num_reviews": 9, "playtime_forever": 14977, "playtime_last_two_weeks": 623, "playtime_at_review": 8737, "last_played": 1713800550}, "language": "english", "review": "Well, I've been with this game since it came out for Demo in June 2020 & Prologue in August 2020. Then I was granted a key for Beta Play Tester in 2022 after I contributed to their Kick-starter.\n\nI've patiently watched all the changes, and additions. Now it's Early Access, and I'm loving what I see, and it leaves me thirsting for more. Don't play this if you don't like grinding, technical, or brainteaser games.\n\nLike [i]Mark Watney,[/i] you're alone, and will be challenged. Adapt, or [i][b]DIE.👽 [/b][/i]\n\nAnything you want to know about the game can be found on the tablet. Experiment with [i][b]Trial & Error[/b][/i] will also do you well. So, if this seems like it's up your alley, then by all means, give it a try.\n\n[b][i]𝓐𝓼 𝓐𝓵𝔀𝓪𝔂𝓼,\n𝓚𝓮𝓮𝓹 𝓞𝓷 𝓖𝓪𝓶𝓲𝓷𝓰![/i]☕🐱👍[/b]", "timestamp_created": 1686996905, "timestamp_updated": 1686997885, "voted_up": true, "votes_up": 13, "votes_funny": 2, "weighted_vote_score": "0.624481379985809326", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "143708868": {"recommendationid": "143708868", "author": {"steamid": "76561198060208965", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 2281, "playtime_last_two_weeks": 0, "playtime_at_review": 1403, "last_played": 1708178996}, "language": "english", "review": "The cursor a small dot difficult to play the game , mouse sensitivity not helping much ,looked at options to adjust but none is there", "timestamp_created": 1691577859, "timestamp_updated": 1691577859, "voted_up": false, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.624071836471557617", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1693730103, "developer_response": "Hey there,\n\nThank you for giving our game a shot. We'd love to help you out with this, could you please send us a screenshot, your mouse model and your monitor model at eracolonisthelp@gmail.com?\n\nAlso in the recent update we've added the possibility to configure game cursor, you can set it, for example to a different, more contrasting color.\n\nKind regards,\nOM Team"}, "141752035": {"recommendationid": "141752035", "author": {"steamid": "76561198059327036", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 8799, "playtime_last_two_weeks": 0, "playtime_at_review": 4081, "last_played": 1708312721}, "language": "english", "review": "Honestly, I wish they had a neutral review for this one. \nFirst the good.  The game has some real potential.  The building system has some pretty slick features that make it a lot of fun to play around with.  Everything from power generation to building your own massive farms is there.  Even a garage for your vehicles.  Love that aspect of it and can get totally lost building my base up.\n\nHere is the bad, and what outright scares me.  The save system is totally broken, shot, gone.  More than a few times I have had to completely relocate my base because when I would load back up, there would be buildings that had been disassembled right square in the middle of my base, or even better buildings that were not visible but there from before wrecking my airlock and power systems.  That brings the second scary part, disassembling parts leads to a LOT of the RNG components just disappering completely.  Worse, these components can't be just replaced by making them again, it becomes a hunt through some more of the broken bases to try to replace them... over and over and over.  I have even had some disappear during the save/load cycle.  Items have disappeared out of storage.  All this makes me outright scared that the game will end up another of those disasters chasing this bug and never really finding the raw source, and just ending up with work around after work around to have a game that can be played :(", "timestamp_created": 1688988616, "timestamp_updated": 1688988616, "voted_up": false, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.622296929359436035", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1689181756, "developer_response": "Hello,\n\nThank you for playing the game and the review. We're aware that some players are experiencing problems with the save system and we're working on a patch that will rework it completely. I hope that after some time when the game is improved, you can give it a second shot and have a lot of fun.\n\nKind regards,\nOM Team"}, "138146296": {"recommendationid": "138146296", "author": {"steamid": "76561197984651887", "num_games_owned": 423, "num_reviews": 45, "playtime_forever": 672, "playtime_last_two_weeks": 0, "playtime_at_review": 414, "last_played": 1683981612}, "language": "english", "review": "I want to start off buy noting this is an EA review. The game is not finished, not even close. I am writing this to counter-balance the people who like to complain, and are usually the loudest. \n\nMy first 30 minutes (Ive played for 6.9 hours now) was ... not fun. I decided to go through the tutorial/campaign and it was a disaster. I got stuck on a toilet, no joke. Modern players do not need to be handheld so much as to be instructed to sit on a toilet. I dont know about other people, but i dont enjoy sitting there listening to NPC's talk about crap I dont care about. Its annoying. \n\nEventually I said screw it and did the Free Play. Once I did that I started having fun. I have restarted i think about 6 times so far. Each time ive tried a different starting area and there are VAST differences between the areas. Someone should document the differences, because they are kind of major. \n\nFirst irritation in Free Play was the way cables are handled. If you put one in your hand, you can never again pick it up and put it away. \n\nResearch was super confusing for a while. I eventually figured out that the reason nothing seemed to work was because I had changed the research option difficulty to be the medium one (it defaults to hardest). On the medium difficulty basically all the starting research is done and you cant do the more advanced research without specific tables. There is an AI at the beginning of the game that implies the research you have is temporary... but i dont believe this to be the case. \n\nI dont like the way research points are earned. You have to mine so much minerals to get a point so you can unlock the Workshop (no idea what mining has to do with a workshop)... and you HAVE to do this because either electricity or mechanics require that Workshop be unlocked for you to progress in those trees. So basically you are forced into a progression of mining, then deconstruction then building just to get the pre-req's unlocked in other trees. \n\nWalking ... omfg... thats rough. Find an ATV and everything changes. A must have. \n\nNot fond of mining. Its loud. It takes forever. Its mind numbing. \n\nOk... so what do i like. \n\nI like the mechanics of it all. I mean, thats the reason a lot of us play these types of games. Think Stationeers or Space Engineers for example. This doesnt have the complexity of Stationeers... but it might eventually. I like the way you can turn valves and flip switches on the CO2 scrubber for instance, or the way  you can controller power from the Transformer and Batteries. I like that you can upgrade your devices with more complex systems and then tie them altogether. I like running cables from one place to another, along with water and O2. \n\nI highly recommend playing on the hard setting. You miss so much of the game if you play it on tourist setting where you have tons of resources and everything is unlocked. \n\nThe game is not easy. It could use some graphics overhall for sure. Once multiplayer is in it will be much more fun.\n\nIts 20 some odd bucks. Fair price for an EA game I think... not like those other morons charging $70 now for an EA game. \n\nGive it a chance. Return it if you dont like it.", "timestamp_created": 1683825794, "timestamp_updated": 1683825794, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.615196764469146729", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "145714982": {"recommendationid": "145714982", "author": {"steamid": "76561199446447981", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 3411, "playtime_last_two_weeks": 0, "playtime_at_review": 1778, "last_played": 1709662969}, "language": "english", "review": "Generally big fan of real world simulations that combine high technical demands with exploration and creation. Aside from Minecraft which is in a category of its own, have been playing alot of Subnautica. Occupy Mars is more technical and this makes it very gratifying. I am still at the beginning of the game, so will revert with more detailed feedback at a later date.", "timestamp_created": 1693928949, "timestamp_updated": 1693928949, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.614697277545928955", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "138105641": {"recommendationid": "138105641", "author": {"steamid": "76561197991017544", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 3647, "playtime_last_two_weeks": 0, "playtime_at_review": 66, "last_played": 1706310252}, "language": "english", "review": "Great, fun survival game that already has a significant amount to do.\nHave played the alpha a lot and just getting into the early access with even more to do now. Looking forward to see it progress.", "timestamp_created": 1683744968, "timestamp_updated": 1683744968, "voted_up": true, "votes_up": 35, "votes_funny": 3, "weighted_vote_score": "0.609415888786315918", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "145221360": {"recommendationid": "145221360", "author": {"steamid": "76561198035688501", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 69, "playtime_last_two_weeks": 0, "playtime_at_review": 69, "last_played": 1693255950}, "language": "english", "review": "Screensgots and videos suggest a totally different look and feel.\nLow texture quality (in setting \"fantastic\"), obviously no tesselation support (really bad for a game in 2023).\nBad controls (rover in tutorial not steerable).\nNot acceptable at all.", "timestamp_created": 1693256557, "timestamp_updated": 1693256745, "voted_up": false, "votes_up": 22, "votes_funny": 2, "weighted_vote_score": "0.60679161548614502", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1693312168, "developer_response": "Hello,\n\nThank you for your interest in the game! I'm sorry that you didn't like it, but we're grateful for the feedback. I also wanted to address some things:\n\nThe entire terrain system in the game IS based on the tesselation\nThe tutorial simulates virtual reality, so there's no terrain in tutorials, I'd advise launching Free Play/ Sandbox mode on the Tourist difficulty to try out the Rover properly\nthere are a lot of complex systems and interactions in the game and it seems like you barely scratched the surface, perhaps with further exploration you'll see the appeal of the game?\ntexture quality, etc. - we strive to polish the game more and more, but could you either send us a screenshot or share your specs? it's hard for us to guess what might be wrong based on the information that scarce and we'd love to help\n\nHaving said that, the game is in the Early Access and a lot is about to change.\n\nAlso, if you could tell us how screenshots and videos are different than what you actually got, we'd appreciate it, as we strive to present the game as transparently and truthfully as possible.\n\nKind regards,\nOM Team"}, "138150078": {"recommendationid": "138150078", "author": {"steamid": "76561198082316306", "num_games_owned": 586, "num_reviews": 85, "playtime_forever": 92, "playtime_last_two_weeks": 0, "playtime_at_review": 45, "last_played": 1691510488}, "language": "english", "review": "I put no but I mean \"not at this time.\" The prologue, when I played, was absolutely amazing, even with the various bugs here and there. \n\nBut this EA release is all but unplayable. \"Take off helmet,\" tutorial says (w/o saying how), so I figure out how to do it (remove helmet and place in inventory (as opposed to, ya' know, a fKKin hotkey)) then the game immediately closes the inventory and now I cannot move. I can spin around in 360, fine. But can't move. I cannot open the options menu via ESC, can't open up the inventory (TAB) or do anything so I have to force-close the game. \n\nOther people are reporting the game gets in an infinite load and the dev team is like \"send us your save file or we won't be able to figure it out.\" Now, I GET that they will need a bug report but the sheer volume of people reporting this problem makes it really hard for me to believe that not one of the computers the devs are using won't reproduce this issue. Please. \n\nIf you want to pay to be an Alpha tester, then fine, the game [COULD] be awesome down the line, but as it sits, nah. Sit on this thing for 3-6 months and come check the reviews. \n\nI'll update this review once we can actually play the game. If they need alpha testers, they can pay someone to do it. EA is not for this level of (doesn't work). EA is for \"help us add additional content and tweak things\" not \"help us get the game to work.\"\n\n**Edit to Dev response**\nI was all about this game during prologue and bought it the moment it was for sale. I will NOT refund the game because given what you've done so far, I have faith that you'll be able to fix it.\n\nBut, I can't in good conscience recommend the game to anyone at this time for those very reasons.\n\nI will update this as soon as a patch fixes at least those two game-breakers.\n\nThanks!", "timestamp_created": 1683829910, "timestamp_updated": 1683834437, "voted_up": false, "votes_up": 19, "votes_funny": 1, "weighted_vote_score": "0.604210495948791504", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1683874858, "developer_response": "Thank you for your feedback. Rest assured we're working hard to fix every major issues and we will use Early Access period to improve every aspect of the game so we hope that in the future you will give it another shot and maybe update your review then.\n\nAlso, worth noting that there is a key rebind option for taking your helmet off."}, "138195241": {"recommendationid": "138195241", "author": {"steamid": "76561198158679795", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 4909, "playtime_last_two_weeks": 0, "playtime_at_review": 613, "last_played": 1710718145}, "language": "english", "review": "Ok... I like the concept of the game and the potential is defiantly there but there are so many bugs that it pushes your patients level to the limit. I know its an early access but for the current asking price, its just not there yet. I have been following this game for some time now and maybe I was too hyped up and set my expectations to high. To give an idea, just today I had two major bugs placing cable where my game was left unresponsive and had to force close the game and another bug where my vehicle must have clipped under the scenery and I was no longer able to interact with it in the middle of no where far from base.\nIn conclusion, I think this game will be great but that day is going to take a long time to arrive. The current price is to high for the amount of bugs still crawling around... I don't recommend buying the game at this time, be patient and come back in two or three months", "timestamp_created": 1683915615, "timestamp_updated": 1683921580, "voted_up": false, "votes_up": 21, "votes_funny": 1, "weighted_vote_score": "0.602772057056427002", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1683921760, "developer_response": "Hello,\n\nThank you for the feedback. I'm sorry that you didn't like what you got, especially after you were so hyped. We'll do our best to deliver the game that you expected and deserve. That being said - please, keep in mind it's Early Access. Some bugs are bond to be there. Since the release we released 3 patches and we're hard at work preparing more fixes and improvements to the gameplay. I hope that it won't take long before you'll be able to have tons of fun with the game.\n\nKind regards,\nOM Team"}, "138106285": {"recommendationid": "138106285", "author": {"steamid": "76561198186215147", "num_games_owned": 436, "num_reviews": 158, "playtime_forever": 1078, "playtime_last_two_weeks": 0, "playtime_at_review": 23, "last_played": 1708295331}, "language": "english", "review": "This game is awsome, yes its EA and has some issues but what game doesnt? Im a backer and ive been with them for the ride because i believed in it. I still do and ill play and get more people in because i can say with certanty from watching the devs streams and watching the development that this will be a good one. Call me a white knight if you want thats just ignorance. People love to bash games that are EA because of bugs and they expect them to be perfect. We all see the trolls who love to jump in and push stuff into the red to hurt the devs. We all know this exists.\nLook at the game for what it is and can be for the future. They worked hard on this and had many sleepless nights to bring us this excellent sim. Try it and judge for yourself and understand this game isnt perfect\"Yet\". \nIt has good graphics thats a lie, it has a tutorial and it can get stuck, again they told us all that on the page. Now that the meat is doen they can focus on the fluff with a few tweaks. Occupy mars is a game well worth waiting the three years or more for it that i have.\nUltimately try it for yourself, give it a shot and remember other games that came out with bugs, darktide guys? Vermintide 2? Cyberpunk? All bashed and trolled but still going strong. At least Occupy mars isnt a cash cow for the company as so many titles are these days. My vote is a 10 our of 10, yes it needs work but isnt that what an EA game is all about? If you dont like the bugs or possibility of bugs, then play something else or refund this one. But im telling you, if you like space survival then your gonna love this one. In the past the bugs we had lasted maybe a week or less before they were HARD addressed. I mean you can look at osirus new dawn, they took that one over, ruined it, then declared it done and bailed on it while its a broken mess. The guys at pyramid games arent like this at all, this is thier passion project and doesnt deserve people telling people not to buy it. Bugs happen guys, if you dont like it dont play EA games. \nAs someone whos played this since demo and then at backing, id say your in for a treat just gotta roll with it for now. They do work hard on it.\nI want to edit this and point something out to the potential customers, Notice alot of the negative reviews are from people playing for about five mins, certainly less than an hour or two. As a player let me tell you you cany really experiance much of the game at thatpoint and its easy to say\"its broken\" or \"dont buy\" when you yourself get frustrated with the complexity and are frustrated. Give it a shot people, give it a chance and try to play for more than ten mins to judge it. Im rallying around it as a fan who has played for a long time and a backer for something i believe in.", "timestamp_created": 1683745860, "timestamp_updated": 1683747516, "voted_up": true, "votes_up": 52, "votes_funny": 7, "weighted_vote_score": "0.602374613285064697", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "138234507": {"recommendationid": "138234507", "author": {"steamid": "76561198409542929", "num_games_owned": 0, "num_reviews": 63, "playtime_forever": 340, "playtime_last_two_weeks": 0, "playtime_at_review": 36, "last_played": 1684189125}, "language": "english", "review": "The performance is really bad & i wonder why, it already looks like a game from 2010, there should be no problems with decent setups.\n\nI've no idea what to do now in the campaign, there is 0 guidance besides the handbook. I have no idea what the \"tutorial\" in the base before you land is for, other than teaching things which do not help much at all afterwards and making you mad by that absolute bad timed maze escape.\n\nThe only EA excuse which would be valid is for the really bad translations, but not for performance and introduction into the game. I mean, if this simple things already turn out to give you more a pain than fun, something is wrong with how the devs think people will play/understand the game.\n\nI'll check it out again in a year or so and see if it was just another EA cash grab or not. But don't have much hope, i already don't know where the 3 years went into...\n\nAlso i am not sure if the character creation is meant to be a meme, or if they really tried to make character customization. Maybe it's a leftover from internal april fools? Idk.\n\nNever ever i have played an early access title which was that painful to play. I really wanted to give it a chance, but it's impossible if you don't deep dive into things which should have been explained in the first place.", "timestamp_created": 1683982195, "timestamp_updated": 1684067988, "voted_up": false, "votes_up": 13, "votes_funny": 4, "weighted_vote_score": "0.599569380283355713", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1683985386, "developer_response": "Hello,\n\nThank you for giving our game a shot and for the review. I'm sorry about the technical difficulties undermining your adventure. Performance issues that you're experiencing are most likely connected to memory usage and how vast is the gameplay area. We're working on optimizing the game further, please bear in mind that it's an Early Access release. \n\nAs a temporary measure I'd advise closing background apps such as internet browsers and unchecking the \"always render environment\" option in the menu. \n\nWe'd appreciate some benefit of the doubt and we hope that you'll be able to enjoy your stay on Mars very, very soon.\n\nKind regards,\nOM Team"}, "138113397": {"recommendationid": "138113397", "author": {"steamid": "76561197995821223", "num_games_owned": 2425, "num_reviews": 129, "playtime_forever": 801, "playtime_last_two_weeks": 0, "playtime_at_review": 145, "last_played": 1694989644}, "language": "english", "review": "Thankfully so far(2 hours of gameplay) i haven't had any issues with bugs or  major optimization issues(except during cutscenes when the frames drops from 60 to 20, but other than that, it runs mostly of the time with 60 fps(with some drops here or there, with graphics on \"good\" quality.)", "timestamp_created": 1683757453, "timestamp_updated": 1683758231, "voted_up": true, "votes_up": 24, "votes_funny": 0, "weighted_vote_score": "0.594760894775390625", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "138785424": {"recommendationid": "138785424", "author": {"steamid": "76561198176559694", "num_games_owned": 211, "num_reviews": 25, "playtime_forever": 935, "playtime_last_two_weeks": 0, "playtime_at_review": 902, "last_played": 1687732944}, "language": "english", "review": "This game is genuinely fun, challenging and rewarding.\n\nI was extremely excited to get this game on the build up to EA, then the release was swamped with negative reviews - seemed like buying it was the wrong decision and I was actually quite disappointed without actually playing the game.\n\nI came back to it a week later - just one week, and the reviews had flipped from mostly negative to mostly positive, I felt that excitement return but was still concerned given the initial reviews.\n\nI read a review that said ignore the campaign, go straight to free mode, watch some YouTube videos to get started.\nThat is probably the single most helpful review of any game I have ever read.\n\nSure there has been near daily updates since release showing the Devs are here to stay, but seriously if you're not sure whether to buy this game, I recommend you get it and just play the free mode for the 2 hour refund window. Before you know it, you haven't slept for two days and you've racked up 15 hours game play whilst just \"testing to see if it's any good\"", "timestamp_created": 1684783165, "timestamp_updated": 1684783165, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.594472169876098633", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "145268284": {"recommendationid": "145268284", "author": {"steamid": "76561198012042748", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 13984, "playtime_last_two_weeks": 0, "playtime_at_review": 13524, "last_played": 1710445577}, "language": "english", "review": "Bought the game after a month of it being officially released. I have to say that it is a very interesting game. Fun and stressful at the same time. It is actively being updated and improved upon by the developers. Highly recommend to those that enjoy the survival games. Beautiful imagery and physics are surprisingly pretty good.. repetition can set in after prolonged gameplay. Not sure what the end game will be for this one.", "timestamp_created": 1693325162, "timestamp_updated": 1693325162, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.588899075984954834", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "139459826": {"recommendationid": "139459826", "author": {"steamid": "76561199137973941", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 3071, "playtime_last_two_weeks": 0, "playtime_at_review": 2196, "last_played": 1685937569}, "language": "english", "review": "Game still needs a lot of work.\n\nJumping suddenly stops working, restarting a save, changing the button, going back to default after it not working, the sudden events of death when doing nothing but mining, getting stuck within the floor of bases, when reloading a save, reloading on top of your emergency pod. The sound is messed up with the different stages when the drill is upgraded. Can hardly hear the computer AI talking, there should be different settings for the different sound options. There should be an \"Unstuck\" option to get you unstuck. Death is way to sensitive and unrealistic. The storage Cabinet doesn't work, so have to use the fridge for storage?!!\n\nWill wait for further patches to see if these issues get fixed. The game shows promise, so looking forward to check it out again when more patches have been done. For now, I would not recommend. I'll change my vote, when I see significant improvements.", "timestamp_created": 1685768032, "timestamp_updated": 1685915067, "voted_up": false, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.58417820930480957", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1685879952, "developer_response": "Hello, \n\nThank you for giving our game a shot and for the review. \n\nWe released a big patch on the test branch yesterday that tackles some of the issues that you mentioned. If everything goes smoothly, it should be available soon on the main branch as well. You can learn more here:\nhttps://steamcommunity.com/games/758690/announcements/detail/3687931332330630924\nAs you know, the game is in Early Access, and lots of things are bound to change, as our goal is to polish it and develop it accordingly to our community's suggestions. We'd appreciate the benefit of the doubt. I hope that your stay on Mars will be all fun, with no frustration in no time.\n\nKind regards,\nOM Team"}, "145347602": {"recommendationid": "145347602", "author": {"steamid": "76561198036161878", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 424, "playtime_last_two_weeks": 0, "playtime_at_review": 416, "last_played": 1696168678}, "language": "english", "review": "This game is still ALPHA, basic problem like sounds not loading in cinematics, textures not loading in HD (I put a picture up to show it), collision issues, stuttering animations, the music I set it lower but it keeps going back to default, no lip sync to audio dialogue, not everyone has audio dialogue, the audio channels are not split so you can't set the audio for voice different from the sound effects (so 1980s bad), the jack hammer keeps hammering when you stop hammering on one rock with the wind down sound even when you go to another rock no matter how many times you move rocks, it's on my m.2 (7,000r and 6,500w) drive and I'm having serious pop-ins with a 4090!, you have the upgrade bench and unlocked tier 1 of the grinder but you can't upgrade your grinder WHY? because IT ONLY UPGRADES TO GRADE 2 you start with tier 1 but the naming system doesn't tell you that SO YOU'VE JUST WASTED TIME PUTTING POINTS INTO SOMETHING YOU CAN NOT USE! \n\nAfter 6 hours of gameplay and 8 months of waiting I am irate at the state of this game.\n\nI understand it's prerelease but this is BAD I've been waiting to play this since the kickstarter and I am not impressed. Asus branding is all over the place, I hope their happy with their purchase, because I am not. \n\nI've seen this happen to way too many games. They'll sit in prerelease for years and won't get fixed, besides little patches here and there. But it will never pickup the hype again as the kickstarter. \n\nI cannot recommend this game! If the developer does fix these issues and other growing issues I may revisit this and update it. But I certainly won't be checking back on this title any time soon.", "timestamp_created": 1693434525, "timestamp_updated": 1693436474, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.581749081611633301", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1693480019, "developer_response": "Hello Superman, \n\nThank you for the feedback. I'm sorry that some aspects of the game undermined your experience.\n\nRegarding the performance - after the last update we reworked the save system and conversion might take a while and result in a performance drop, but once the conversion is complete, it should be over. If that is not the case and weird stuff happens all the time, please check out the troubleshooting FAQ here:\n\nhttps://steamcommunity.com/app/758690/discussions/0/1749021365362863747/\n\nYou can also reach us by email at eracolonisthelp@gmail.com and we'll gladly help you out. \n\nUnlocking the grinder not only allows you to print it (so if you lose it you can get it back) but will also be useful later on, as it unlocks other important tools. You didn't waste anything.\n\nIn no way we're abandoning the title, We released a huge content update on August 28th and today we released some hotfixes as well. I hope that you can give the game another chance. \n\nKind regards,\nOM Team\n"}, "138105725": {"recommendationid": "138105725", "author": {"steamid": "76561198001442783", "num_games_owned": 1893, "num_reviews": 12, "playtime_forever": 7057, "playtime_last_two_weeks": 0, "playtime_at_review": 160, "last_played": 1709102346}, "language": "english", "review": "Only 2.7hrs in but I have been really enjoying the game.\n\nI have been getting over 60fps per the nvidia overlay on high settings with only a few dips below that on high graphic settings with the following setup:\n\nCPU: i9-12900K\nRAM: 64GB 4800 DDR5\nGPU: NVIDIA GeForce RTX 3080\nDisk: NVMe\nOS: Windows 11\n\nI am using a multi-monitor setup, with this on the main display, twitch on a secondary, and Netflix on the 3rd.\n\nAre there bugs, yes there are... this is an EA game and people need to remember that. The mission is good AFTER the intro mission (I really don't like it either however if you look in the discussions it becomes clear where to go and takes less than 5min to beat it after that.\n\nWill update this after more time in game or if something changes.\n", "timestamp_created": 1683745069, "timestamp_updated": 1683745069, "voted_up": true, "votes_up": 15, "votes_funny": 2, "weighted_vote_score": "0.578463733196258545", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "155470673": {"recommendationid": "155470673", "author": {"steamid": "76561198045204619", "num_games_owned": 239, "num_reviews": 9, "playtime_forever": 3149, "playtime_last_two_weeks": 0, "playtime_at_review": 2398, "last_played": 1710352253}, "language": "english", "review": "HeYo!\n\nIts a wery good game but we need CO-OP in this My Buddy and i wanna play it looks awsome!", "timestamp_created": 1704628561, "timestamp_updated": 1704628561, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.576561331748962402", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "151966535": {"recommendationid": "151966535", "author": {"steamid": "76561198026607287", "num_games_owned": 68, "num_reviews": 3, "playtime_forever": 4641, "playtime_last_two_weeks": 0, "playtime_at_review": 3320, "last_played": 1708435726}, "language": "english", "review": "The game has a really well thought out setup.. some of it can be a bit corny.  The game play is constant, and keeps you moving forward.  The storms don't seem to cause any lag or issues with frame rates and the surroundings of the location the game is played looks great.  The only down side I see is, why have a base so big for one lost soul. Two workshops, is enough for one person to survive with in the game.. so only real con I see unless they intend to bring more npc content the game does get kinda dull.", "timestamp_created": 1700972995, "timestamp_updated": 1700972995, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.57629626989364624", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "138236111": {"recommendationid": "138236111", "author": {"steamid": "76561198074218842", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 211, "playtime_last_two_weeks": 0, "playtime_at_review": 142, "last_played": 1684384087}, "language": "english", "review": "This game is brutal. Throws you right into the fire, the tutorials don't show you much. I died because I couldn't figure out how to power my suit and my first sleep in the game there was a meteor shower that destroyed my base before I could even figure out the first few missions. Not to mention the performance and optimization is abysmal. I can play plenty of other better looking games fine and this one lags so bad even on medium to low graphic settings. \n\nEDIT: Just an idea, But reducing the difficulty temporarily or chances of events happening in the first few missions might make players stay in the game longer, build confidence and increase their likelyhood of replay or trying again if something does happen. Having a meteor shower blast me when I'm trying to figure out how to power my suit and sleep can get frustrating for a lot of people. \n\nI did try the electrical socket in the hangar. But I could not find an option to charge my suit. I tried googling it to which people said \"press E\" but still no change. My suit was at 0%, I tried going outside during normal hours and got a bunch of warnings so i figured there MUST be something inside im missing. After roaming the HAB for quite some time, the meteors killed my base and subsequently me. \n\nI understand this is only an EA title, it's clear there is work to be done but I am extremely confident that these are committed and passionate developpers. If you cant handle the EA title, wait until it is released. If you are looking for a RAW mars experience then this is the game for you.", "timestamp_created": 1683984464, "timestamp_updated": 1683990992, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.57161402702331543", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1683987954, "developer_response": "Hello,\n\nThank you for playing the game and for the review. I'm sorry to hear that your experience was so negative. Would you mind telling us more about the problems with the tutorials? We're more than happy to help.\n\nTo charge your suit, approach the solar panel and use the blue socket. Alternatively, you can charge your suit inside the buildings properly supplied with electricity via an electric outlet.\n\nRegarding performance and other technical issues - we're hard at work improving that, please keep in mind that it's an Early Access title, our goal is to develop the game accordingly to our community's suggestions.\n\nKind regards,\nOM Team"}, "148197017": {"recommendationid": "148197017", "author": {"steamid": "76561198062339996", "num_games_owned": 0, "num_reviews": 31, "playtime_forever": 4704, "playtime_last_two_weeks": 0, "playtime_at_review": 4704, "last_played": 1693533481}, "language": "english", "review": "Ok, this is a crafty, arduous, long and punishing on hard but fun to play if you are into craft/survival. PVE only, suits me fine.", "timestamp_created": 1697284920, "timestamp_updated": 1697284920, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.569197773933410645", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "156164376": {"recommendationid": "156164376", "author": {"steamid": "76561198286424782", "num_games_owned": 343, "num_reviews": 50, "playtime_forever": 6699, "playtime_last_two_weeks": 0, "playtime_at_review": 6690, "last_played": 1706020850}, "language": "english", "review": "It seems the developers gonna work on this one for years if not decades to create something to be called as a 'open world survival craft' game, not just its engine, that would have missions, challenges and goals and, as they promised, to take you back from Mars, whoa! It's up to you to believe them or not but right now it's a nearly zero content with a campaign title as a pure bait which ends before it has even begun and, after placing few hydrodynamical and electric installations mainly released in a very primitive way, you get full immersion into the atmosphere of a clicker for everyday stuff consuming. Not gonna bothering you with bugs, lack of QoL, optimization issues, they definitely are. And yeah, a huge desert map with different biomes full of metal junk, vehicles for its exploration (you got familiar with best of it if played prologue) and more junk will be incoming as airdrop. In other words, whole bunch of potential! But today I'd recommend playing something more worthwhile like 'Survival: Fountain of Youth' released on the same time and still on EA. It's up to you to believe me or not.", "timestamp_created": 1705493440, "timestamp_updated": 1705493440, "voted_up": false, "votes_up": 9, "votes_funny": 1, "weighted_vote_score": "0.565351784229278564", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1705499478, "developer_response": "Hello,\n\nThank you for checking out the game and sharing your opinion. To address some of the criticism. First of all, OM is in Early Access, and a lot is going to change. A lot already did. Finishing the campaign was one of the Kickstarter goals, we're working on it. During the last months, we added a lot of QoL fixes and optimizations and we're not gonna stop there. We also kept adding content to the game and yesterday the Nuclear Update which includes missions was released on the test branch. If missions are not showing up for you, make sure you're on the proper branch, here are the details:\nhttps://steamcommunity.com/games/758690/announcements/detail/3973930206429835830?snr=2___\n\nOf course, we'll continue to work on the new stuff and improve what's already delivered. I hope you can give the game another shot.\n\nCheers,\nOM Team"}, "150059840": {"recommendationid": "150059840", "author": {"steamid": "76561198012040310", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 1109, "playtime_last_two_weeks": 0, "playtime_at_review": 1109, "last_played": 1699822710}, "language": "english", "review": "Rating: ★★★☆☆\n\nOccupying Mars kicks off with an intriguing first 10-15 hours, full of discovery and challenges. Yet, the initial excitement fades, exposing a game that lacks depth. The technology tree, touted for customization, disappoints as players are forced into a narrow progression path, making most choices inconsequential.\n\nProgression becomes a grind, demanding repetitive tasks, while the illusion of an open world gives way to a singular, predetermined route. The mandatory search for tablets feels more like a tiresome obligation than an enjoyable quest.\n\nHowever, amidst the shortcomings, Occupying Mars boasts positive aspects. The intricate handling of electricity, water, and gas adds an interesting layer of complexity, enhancing the overall gameplay. The electronic repair feature is a welcome addition, contributing to immersion by making the Martian experience feel more authentic. Additionally, the food creation mechanic adds depth to the game, further immersing players in the challenges of survival on the Red Planet.\n\nIn conclusion, setting aside issues with performance and overall polishing, Occupying Mars reveals itself as a game with untapped potential. To provide a lasting and enjoyable experience, it requires substantial work in terms of additional features and increased depth. The game should offer more varied ways to play, ensuring that each player's journey on Mars is a unique and engaging experience. As it stands, Occupying Mars falls short of delivering the rich and diverse gameplay needed for long-term enjoyment.", "timestamp_created": 1699880211, "timestamp_updated": 1699891914, "voted_up": false, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.561200618743896484", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1700029495, "developer_response": "Hello,\n\nThank you for checking out the game thoroughly and for such an elaborate review. We're happy to hear that you appreciate the basics of the game and we hope that the changes introduced to the gameplay features as OM moves further towards the full release will change your mind.\n\nKind regards,\nOM Team"}, "155071425": {"recommendationid": "155071425", "author": {"steamid": "76561198012523488", "num_games_owned": 0, "num_reviews": 47, "playtime_forever": 2429, "playtime_last_two_weeks": 0, "playtime_at_review": 2407, "last_played": 1712162415}, "language": "english", "review": "Buggy mess in desperate need of balancing. Seems the longer I play the more bugs I get. Can't build missiles because the fins keep falling through the ground. I'd wait and see if it improves", "timestamp_created": 1704213425, "timestamp_updated": 1704213425, "voted_up": false, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.560669422149658203", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1704291816, "developer_response": "Hello,\n\nThank you for playing the game and for the review. I'd love to help, but I need to know more. Please, send us your save file as an archive.\n\nSave files are located in:\nC:\\Users\\%username%\\AppData\\LocalLow\\PyramidGames\\OccupyMars\n\nPlease, copy the whole folder to a zip/rar file and send it to eracolonisthelp@gmail.com\n\nKind regards,\nOM Team"}, "138389982": {"recommendationid": "138389982", "author": {"steamid": "76561198007306685", "num_games_owned": 0, "num_reviews": 66, "playtime_forever": 2457, "playtime_last_two_weeks": 0, "playtime_at_review": 1833, "last_played": 1684576894}, "language": "english", "review": "A challenging and immersive survival simulation with lot's of potential. The development team are fantastic, I have thoroughly enjoyed my time playing the game, looking forward to see how the game develops in the future.", "timestamp_created": 1684259055, "timestamp_updated": 1684259055, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.558913230895996094", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "155986019": {"recommendationid": "155986019", "author": {"steamid": "76561198029431443", "num_games_owned": 0, "num_reviews": 23, "playtime_forever": 4656, "playtime_last_two_weeks": 0, "playtime_at_review": 4569, "last_played": 1705280094}, "language": "english", "review": "Yes BUT,\nThere is a lot of time wasting such as constant grinding and mining. Then there are dust devils, storms, and solar storms where you can't really do anything including sleep. Just stand there and wait and maybe go do the dishes IRL. Finally I am near end game, but need one more tech point to get something. I have built things, ground them down, built other things, and each time that tech tree adds 0.5 of a point and that took one hour. So to get the point I will need to spend about 10+ real life hours. So it's on hold and I only occasionally log in to keep playing. Should be better after some updates.", "timestamp_created": 1705258804, "timestamp_updated": 1705258804, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.558632612228393555", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "138233759": {"recommendationid": "138233759", "author": {"steamid": "76561198967762375", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 585, "playtime_last_two_weeks": 0, "playtime_at_review": 117, "last_played": 1693756493}, "language": "english", "review": "This game has good potential and very interesting gameplay, but the tutorials hardly work at all, the game is laggy and poorly optimized and becomes boring after a few hours. i know it's just a pre-release approach, but i've been waiting for this game for 3 years and it's a big disappointment for me.", "timestamp_created": 1683981117, "timestamp_updated": 1683981117, "voted_up": false, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.558458328247070313", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1683984972, "developer_response": "Hello,\n\nThank you for giving our game a shot and for the review. As you pointed out - it's an Early Access release, we've already released 3 patches and we're hard at work, developing further improvements to both the technical and gameplay side of the game. We'd appreciate some benefit of the doubt and we hope that you'll be able to enjoy your stay on Mars very, very soon. Also, would you mind telling us more about the problems with tutorials?\n\nKind regards,\nOM Team"}, "138102579": {"recommendationid": "138102579", "author": {"steamid": "76561198990952209", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 27, "playtime_last_two_weeks": 0, "playtime_at_review": 27, "last_played": 1683739878}, "language": "english", "review": "Sorry, but NO, not yet at least.\n\nI understand it is an EA title, but movement is kind of annoying, picking up items is uninstuitive and in some cases does not work at all. I would like to spend some more time in game, but the game is not very welcoming.\nI hope the dev team will bare in mind that, no matter the genre, the game suppose to entertaining.\n\nAre you not entertained? No I'm not.\nI am very sorry but I have to refund.", "timestamp_created": 1683740671, "timestamp_updated": 1683740671, "voted_up": false, "votes_up": 19, "votes_funny": 4, "weighted_vote_score": "0.557357072830200195", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1683741946, "developer_response": "Hello Musterion,\n\nThank you for the feedback. I'm sorry to hear that your experience was mostly negative. Is there anything besides movement and picking up mechanics that you'd like to see improved?\nI hope that after some time you can return to the game and have tons of fun with it.\n\nKind regards,\nOM Team"}, "138123867": {"recommendationid": "138123867", "author": {"steamid": "76561198002874170", "num_games_owned": 5489, "num_reviews": 161, "playtime_forever": 76, "playtime_last_two_weeks": 0, "playtime_at_review": 76, "last_played": 1683776307}, "language": "english", "review": "In it's current state, based on the first hour of game play, I can't recommend right now.\n\nMainly, everything feels kind of cumbersome from basic mechanics to UI. Things like waiting for door after door after door to open, for your view to switch to third person and an animation to play when you put your helmet on or off, for it to be difficult to tell if an airlock door is really an airlock or if it's just moving into another pressurized room, to not being able to go outside at night so you need to go back and traverse all those doors again to sleep and walk back...it just slowly grates on you.\n\nIt feels like the developers focused so much on making a simulator of a Mars base that they didn't really focus on what would make a fun game.\n\nThe entire first part of the game (I made it an hour), is basically fetch quests and running back and forth between different areas to grab a thing and hear more dialogue.\n\nThese minutes are precious to hooking a player and need to highlight the core mechanics and best parts of the game. If this is all there is to offer right now then I don't think I will be back. It's obvious a lot of work went into this, but for a game of this scale it really needs much more time and play testing and feedback.\n\nI'll come back in a few months and see whats up though and update review accordingly!", "timestamp_created": 1683779734, "timestamp_updated": 1683779883, "voted_up": false, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.556936800479888916", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1683791010, "developer_response": "Hey tagwolf, thank you for your review and feedback. We hope you will come back after some updates are published - we believe you will have much fun in Occupy Mars after we eliminate the issues you're writing about."}, "139586457": {"recommendationid": "139586457", "author": {"steamid": "76561197978534278", "num_games_owned": 0, "num_reviews": 145, "playtime_forever": 631, "playtime_last_two_weeks": 0, "playtime_at_review": 631, "last_played": 1685929236}, "language": "english", "review": "First of all, I love these kinds of games. The exploration, development and maintenance of your own base... But this just feels...lacking... True, it is still in development, but there seems to be an aweful lot of focus and effort put into the graphical side of things while games like these stand or fall on the gameplay and simulation mechanics (for me at least). Games like the Mars Colony duo and Stationeers had their own problems, but they were (and still are) miles ahead of this. If the development team wanted to implement actual atmospherics for example, that's in general such a big cycle hog that it would come out messing up the entire game or the entire game would have to be redesigned (just ask the Astroneers team). The good news is that multiplayer shouldn't be much of a problem, because there isn't all that much data that needs to be shared. There's just not that much going on...\n\nThe only thing this has going for it is active development and the graphics. To be clear, graphics in games like these should not have priority. Or at least not before the gameplay mechanics, simulations and events have been fully fleshed out. It makes this game feel like I should be able to play a more stable version in Garry's Mod or something. The game itself is a salespitch without product. And after years of advertisement, that's a real shame.\n\nStill, it does what it says on the box, and it does it reasonably well, so I can't give it a thumbs down, but it just feels so lacking... I've read reviews saying this isn't an arcade game, but in this genre, it sure as hell feels like one.\n\nI'll leave this in the oven for another year or so...", "timestamp_created": 1685964888, "timestamp_updated": 1685965308, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.556877076625823975", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "138138854": {"recommendationid": "138138854", "author": {"steamid": "76561197960894936", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1146, "playtime_last_two_weeks": 0, "playtime_at_review": 215, "last_played": 1707605974}, "language": "english", "review": "Yes it has some unorthodox control mechanics.\nYes the campaing needs a lot (a lot lot) tuning and polishing. I did abandon the campaing at the escape from the base part, because of it's frustrating elements.\nBUT! \nWhen i moved onto the free play mode, i got what i expected.\n\nYes, the pace of the game is slow. Can be meditative at some points, but the demo showed what to expect, so no dissapointments there.\nYes, the graphics are not Unreal Engine 5 level, but a big thumbs up for the creators in making all the buildings, tools, mechanical parts, connectors, cables, etc as lifelike as possible!\nYes, it has bugs, but nothing that couldn't be handled in the future!\n\nThis is an Early Access. It is meant to be available for purchase for the players who are willing to give money to the developers knowing that the game is still a work in progress. Supporting them so to speak. This is what early access is for. Not to troll and cancel them and request money back after 15 minutes of play...\n\nTheir approach on a martian survival, base building game, insfused with lifelike technologies and tools, is unique!\nSo please, give them the chance!", "timestamp_created": 1683815258, "timestamp_updated": 1683815604, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.556714475154876709", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "139162572": {"recommendationid": "139162572", "author": {"steamid": "76561199016644385", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 6454, "playtime_last_two_weeks": 102, "playtime_at_review": 2846, "last_played": 1713753598}, "language": "english", "review": "great game lots of potential, but the game wont let you save your progress, or freezes during auto save and you have to force close the game. and the devs are not saying anything about if they are trying to fix it or not. save your money for now, and hopefully they fix this issue soon!!", "timestamp_created": 1685289808, "timestamp_updated": 1685289808, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.556500792503356934", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1685383196, "developer_response": "Hello,\n\nThank you for giving our game a shot and for the review. I'm sorry about the technical difficulties undermining your adventure. If you could send us your logs save file as an archive, we could help you directly and learn more about the issue.\n\nSave files are located in:\nC:\\Users\\%username%\\AppData\\LocalLow\\PyramidGames\\OccupyMars\n\nPlease, copy the whole folder to a zip/rar file and send it to eracolonisthelp@gmail.com\n\nKind regards,\nOM Team"}, "138112475": {"recommendationid": "138112475", "author": {"steamid": "76561197977566788", "num_games_owned": 354, "num_reviews": 9, "playtime_forever": 3320, "playtime_last_two_weeks": 284, "playtime_at_review": 42, "last_played": 1712659834}, "language": "english", "review": "The game is as expected when people push for a release. \n\nCyberpunk situation all over again, people whinge about the wait time for a game and then cry about all the bugs when developers push to release the game. What people need to remember the game is \"Early Access\" which means its missing features and still needs a lot of work. \n\nI enjoy the free play of the game and am happy to give this a thumbs up. i look forward to see all the improvements that will come for this game and the eventual release of multiplayer.", "timestamp_created": 1683755768, "timestamp_updated": 1683755768, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.555354893207550049", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "138373712": {"recommendationid": "138373712", "author": {"steamid": "76561198038975516", "num_games_owned": 0, "num_reviews": 49, "playtime_forever": 2405, "playtime_last_two_weeks": 0, "playtime_at_review": 1463, "last_played": 1708544675}, "language": "english", "review": "To start if u like crafting and resource management and being stranded on big red and you loved the martian movie and the idea of colonization of mars this game is for you. This game is  really awesome a bit of a learning curve but worth it yes there is some bugs what you expect from an EA release but very much fun and addictive. i must say the more i discover what stuff does what the more interesting it gets. would love if co op was already available so that me and my friends can enjoy it together. Some features still missing but this is going to be a great game if given time. Graphics not all that bad. Some controls and so on to figure out but game has lots of potential. Thanks devs for this game its worth it and can't wait to see where this goes", "timestamp_created": 1684230524, "timestamp_updated": 1684245839, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.554861128330230713", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "138112560": {"recommendationid": "138112560", "author": {"steamid": "76561197992274409", "num_games_owned": 0, "num_reviews": 17, "playtime_forever": 81, "playtime_last_two_weeks": 0, "playtime_at_review": 81, "last_played": 1683755774}, "language": "english", "review": "It needs  A LOT of work, but I'm here for it. Genuine challenge, but they need to work on the clunkyness. \n\nDefinitely not for anyone outside of a Mars enthusiast currently.", "timestamp_created": 1683755940, "timestamp_updated": 1683755940, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.55378645658493042", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "156494375": {"recommendationid": "156494375", "author": {"steamid": "76561198115144047", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 3966, "playtime_last_two_weeks": 0, "playtime_at_review": 812, "last_played": 1706917680}, "language": "english", "review": "So overall, I think this is a great game.  I love that there's a lot of stuff to do, similar to Space Engineers, and a little bit of No Man's Sky.  My only \"complaint\" is that the game keeps crashing every 45 min to an hour of gameplay, so I have to Alt+F4 the game and re-start.  TO BE FAIR, the first couple of screens warn you that this will happen.\n\nOverall, I think it has great potential, and even though it crashes for me, I'll continue to play it.", "timestamp_created": 1705866258, "timestamp_updated": 1705866258, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.549646139144897461", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140610710": {"recommendationid": "140610710", "author": {"steamid": "76561198123315070", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 604, "playtime_last_two_weeks": 0, "playtime_at_review": 209, "last_played": 1696082778}, "language": "english", "review": "way to buggy at the min, one min it wont save and then the next min it wont load, but that aside it is a great game just hope they sort all the bugs out soon.", "timestamp_created": 1687607468, "timestamp_updated": 1687607468, "voted_up": false, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.549291431903839111", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1687712504, "developer_response": "Hello,\n\nThank you for giving our game a shot and for the review. I'm sorry about the technical difficulties undermining your adventure.If you could send us your save file as an archive, we could help you directly and learn more about the issue.\n\nSave files are located in:\nC:\\Users\\%username%\\AppData\\LocalLow\\PyramidGames\\OccupyMars\n\nPlease, copy the whole folder to a zip/rar file and send it to eracolonisthelp@gmail.com\n\nKind regards,\nOM Team"}, "142556161": {"recommendationid": "142556161", "author": {"steamid": "76561198035456149", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 121, "playtime_last_two_weeks": 0, "playtime_at_review": 121, "last_played": 1689986757}, "language": "english", "review": "The tutorials, at least, are worse than the original prologue versions:\n* The aiming reticle is almost invisible, and with the general jerkiness of the controls (even with mouse sensitivity set as low as possible) makes it really hard to correctly target objects to use.\n* The seed tray mechanic is really bad; the tray obscures the area into which you're trying to plant.\n* Crazy laggy, even with graphics set to \"medium\".\n* Really bad tutorial instructions; unclear and missing steps.\n* English text is hard to parse; really needs proofreading and editing by a native English speaker/writer.\n\nIt's not at all ready for release. If the aiming reticle and seed tray were fixed, maybe, but that's as far as I got before I gave up.", "timestamp_created": 1689987105, "timestamp_updated": 1689987105, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.547780036926269531", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1690116883, "developer_response": "Hello,\n\nThank you for playing our game and for the feedback. The game is in Early Access, so a lot is about to change, both regarding the technical side of things and the gameplay itself. Would you mind sending us a screenshot/ video of the problems with the tray at  eracolonisthelp@gmail.com? Please include the info about your gear/ setup.\n\nKind regards,\nOM Team"}, "138107782": {"recommendationid": "138107782", "author": {"steamid": "76561198347248926", "num_games_owned": 64, "num_reviews": 5, "playtime_forever": 5155, "playtime_last_two_weeks": 31, "playtime_at_review": 115, "last_played": 1713756668}, "language": "english", "review": "ooo my... even coming out of the beta, damn talk about a splash of cold water. waking up without a rover, oh my. keep up the good work, and keep patching us too. its good to see a relief patch within hours of release.", "timestamp_created": 1683748074, "timestamp_updated": 1683748074, "voted_up": true, "votes_up": 14, "votes_funny": 2, "weighted_vote_score": "0.547709107398986816", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "147654210": {"recommendationid": "147654210", "author": {"steamid": "76561199089730491", "num_games_owned": 43, "num_reviews": 1, "playtime_forever": 10591, "playtime_last_two_weeks": 0, "playtime_at_review": 8548, "last_played": 1708398004}, "language": "english", "review": "Great Game and the updates that they are putting out are great. they listen to feedback and implement when they are able to.", "timestamp_created": 1696466938, "timestamp_updated": 1696466938, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.547521114349365234", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "149020381": {"recommendationid": "149020381", "author": {"steamid": "76561198094719264", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 5091, "playtime_last_two_weeks": 0, "playtime_at_review": 5091, "last_played": 1687907492}, "language": "english", "review": "I never post game reviews, but this time I HAD TO. I bought this game and played in early 23. Left to come back to what I thought would be a better game with recent patches. To my surprise... NOPE. The tool durability added to the game recently just wrecked what was already a slow grinding tedious game. Its almost as if the devs want people to stop playing this game. What a waste. I dont even care if I could get a refund. Im just done... moving on.", "timestamp_created": 1698462732, "timestamp_updated": 1698462732, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.547115862369537354", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1698596026, "developer_response": "Hello,\n\nThank you for the feedback. I'm sorry that you feel that way - we discussed the tool damage with our community and we'll be fine-tuning it, so it's a mechanic that introduces some variety and things to consider and doesn't turn the game into a grindfest. We've also added some fun stuff - turbines, new suit and means of locomotion. I hope that perhaps you can still come back to Mars after some time, we're still working on new stuff and improving what's already in the game.\n\nCheers,\nOM Team"}, "140136579": {"recommendationid": "140136579", "author": {"steamid": "76561198126073589", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 5988, "playtime_last_two_weeks": 0, "playtime_at_review": 5924, "last_played": 1688066467}, "language": "english", "review": "This a really fun and addictive survival game. Early access means it has some issues but I'm sure the Devs are working tirelessly on them.", "timestamp_created": 1686883916, "timestamp_updated": 1686883916, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.54703831672668457", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "146238095": {"recommendationid": "146238095", "author": {"steamid": "76561198012120869", "num_games_owned": 0, "num_reviews": 37, "playtime_forever": 2078, "playtime_last_two_weeks": 0, "playtime_at_review": 1946, "last_played": 1699992747}, "language": "english", "review": "I did enjoy playing this game, while I could, but I can't recommend it because it crashed again and this time I can't load or start a new game, despite verification, reloading etc. Hopefully when it is eventually released all the bugs will have been rectified, but for now all I can do is request a refund.", "timestamp_created": 1694629739, "timestamp_updated": 1694629739, "voted_up": false, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.546913981437683105", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1694716539, "developer_response": "Hello,\n\nThank you for giving our game a shot and for the review. I'm sorry about the technical difficulties undermining your adventure. If you could send us your logs and the save file as an archive, we could help you directly and learn more about the issue.\n\nSave files are located in:\nC:\\Users\\%username%\\AppData\\LocalLow\\PyramidGames\\OccupyMars\n\nPlease, copy the whole folder to a zip/rar file and send it to eracolonisthelp@gmail.com\n\nKind regards,\nOM Team"}, "139646468": {"recommendationid": "139646468", "author": {"steamid": "76561199435023494", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 15902, "playtime_last_two_weeks": 0, "playtime_at_review": 9923, "last_played": 1686599207}, "language": "english", "review": "It's definitely worth the money even as an \"early access\" title.  At 170 hours of gameplay I've completed/built roughly 85% of the available content but explored only 40% of the planet (all by my own estimation)  .  Ahead still lies a complete skill tree (Chemistry) that's not released and several more branches of existing trees that are \"works in progress\". \n", "timestamp_created": 1686069028, "timestamp_updated": 1686069028, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.546498298645019531", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "143977874": {"recommendationid": "143977874", "author": {"steamid": "76561198043431847", "num_games_owned": 111, "num_reviews": 9, "playtime_forever": 8325, "playtime_last_two_weeks": 0, "playtime_at_review": 4875, "last_played": 1712289427}, "language": "english", "review": "\"Occupy Mars\" is a space exploration simulation game that promises to provide players with an immersive and challenging experience of colonizing the Red Planet. Developed by Pyramid Games, the game takes a daring leap into the realm of interplanetary colonization, offering players a taste of what it might be like to establish a human presence on Mars.\nVisually, the game manages to capture the stark beauty of the Martian landscape, with its rusty red terrain and towering cliffs. The attention to detail is impressive, from the intricate rovers and habitats to the dynamic weather systems that can dramatically affect your colonists' survival. It's clear that the developers have put a considerable amount of effort into creating a visually captivating representation of Mars.\nThe gameplay mechanics in \"Occupy Mars\" are where the game truly shines. Players are faced with a plethora of challenges as they strive to establish a functional colony in an inhospitable environment. From managing resources like oxygen, water, and power, to growing crops and maintaining machinery, every decision carries weight and consequences. This level of complexity adds a layer of realism and depth that keeps players engaged and constantly thinking about the long-term sustainability of their colony.\nOne of the standout features of the game is the attention to scientific accuracy. \"Occupy Mars\" does an excellent job of incorporating real-world concepts and challenges of Mars colonization into its gameplay. Whether it's dealing with radiation exposure, dust storms, or the intricacies of hydroponic farming, players are required to think critically and strategically to overcome these obstacles.\nHowever, it's worth noting that the game's learning curve can be steep, especially for those new to simulation and management games. The initial hours of gameplay can be overwhelming as players grapple with the various systems and mechanics. A more comprehensive tutorial or optional hints could potentially alleviate this initial difficulty and make the game more accessible to a broader audience.\nIn terms of replayability, \"Occupy Mars\" offers multiple playstyles and approaches to colony management. Whether you want to focus on scientific research, exploration, or industrial development, the game accommodates different strategies, allowing players to experiment and find their preferred playstyle.\nWhile \"Occupy Mars\" excels in many areas, it's not without a few minor drawbacks. The user interface, while functional, could benefit from some streamlining to improve overall user experience. Additionally, some players might find the lack of a robust narrative or character development a bit of a letdown, as the game leans heavily on the simulation aspect.\nIn conclusion, \"Occupy Mars\" delivers on its promise of providing an immersive and challenging experience of colonizing the Red Planet. With its attention to detail, scientific accuracy, and complex gameplay mechanics, it's a must-play for fans of space exploration and simulation games. While there are a few areas that could be improved, the overall package is a testament to Pyramid Games' dedication to creating a realistic and engaging Martian colonization experience.\n\n", "timestamp_created": 1691831973, "timestamp_updated": 1691831973, "voted_up": true, "votes_up": 9, "votes_funny": 4, "weighted_vote_score": "0.545880436897277832", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141538684": {"recommendationid": "141538684", "author": {"steamid": "76561198030290953", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 23511, "playtime_last_two_weeks": 0, "playtime_at_review": 10830, "last_played": 1697250501}, "language": "english", "review": "Great game its engaging and challenging. I'm not happy with the tablets they ARE NOT located at every derelict base. I have completely ground down the bases and found that maybe 40% of bases have them. There are to many circuit boards and not enough tablets. The other big problem is the frame drops. All that said the game is pretty amazing and the DEV is constantly updating.", "timestamp_created": 1688751407, "timestamp_updated": 1688751407, "voted_up": true, "votes_up": 3, "votes_funny": 2, "weighted_vote_score": "0.545454561710357666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "139802445": {"recommendationid": "139802445", "author": {"steamid": "76561198159164307", "num_games_owned": 118, "num_reviews": 5, "playtime_forever": 9868, "playtime_last_two_weeks": 0, "playtime_at_review": 8933, "last_played": 1710908630}, "language": "english", "review": "The potential for Occupy Mars is still very much there.  And I enjoy the game, though I think some key things need focus if they want a successful early release.   Having no ability to build all the things in the menu is obnoxious.   Basic objects like Oxygen Tanks or Water tanks should be among the first things we should be able to to build.  Having to build a water station every 2k km is not a fun way to explore such a vast map. \n\nThat said, a focus on customization along with the exploration elements will make this a much larger appeal despite being a niche category to begin with.   Because at the moment, once you hit a certain point, growing plants just to grow plants faster ends up being the only thing left to do in the game. \n\nI'm excited for more content and new concepts, however, if I get an update and it's a new vehicle that offers me nothing other than the same means to get from A-B without making that trip faster, then I've no reason to play. \n\nThis gets my recommendation if you like exploration and building with some task management, but I'm not expecting it to improve dramatically given how long its been in development and won't appeal to the masses. \n\nWait for a discount to be sure.", "timestamp_created": 1686345012, "timestamp_updated": 1686345012, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545454561710357666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "139708162": {"recommendationid": "139708162", "author": {"steamid": "76561198083043771", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 6205, "playtime_last_two_weeks": 0, "playtime_at_review": 6195, "last_played": 1711479336}, "language": "english", "review": "I would not recommend this game at this time, After 100 hours of play and building everything currently being able to build it leaves you wanting.. Lack of content, bugs and to be honest grindy. I understand this is early access but after the number of years this game was in production I would expect a more complete game. With more to do. the lack of truly free building is also a down mark. the inability to place item where I want is a major issue, Building a Bedroom and it come completely stocked is a what moment. or finding a tank or helmet or other gear and not being able to pick up or use. leaves a lot of questions. secondly with all the abandoned bases and habitats you should be able to fix them up and occupy them but for some reason you can not, even if you have to skill and blueprint to supposedly build your own exact same thing", "timestamp_created": 1686174830, "timestamp_updated": 1686174830, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545454561710357666", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1686242615, "developer_response": "Hello,\n\nThank you for playing the game and for the review. We're working hard to get rid of the bugs and the first content update should arrive within a month's timeframe. I hope that with time your stay on Mars will be both enjoyable and rewarding.\n\nKind regards,\nOM Team"}, "138277436": {"recommendationid": "138277436", "author": {"steamid": "76561198065839274", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 4414, "playtime_last_two_weeks": 0, "playtime_at_review": 712, "last_played": 1711302937}, "language": "english", "review": "OK for starters game is brutal. I died so many times on the base escape, before I realized I could push over the air tanks. If you want a survival game that makes you work your behind off from the getgo this one does it. Zero hand holding but from my play so far I've enjoyed every minute even when I am frustrated as to how to do something. P.S. I'm terrible with punctuation sorry", "timestamp_created": 1684049539, "timestamp_updated": 1684049539, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.545454561710357666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}}, "query_summary": {"num_reviews": 21, "review_score": 6, "review_score_desc": "Mostly Positive", "total_positive": 701, "total_negative": 268, "total_reviews": 969}, "cursors": {"AoIIPwHNgXWQtuQE": "Mon Apr 22 23:48:33 2024"}}
