{"reviews": {"32729096": {"recommendationid": "32729096", "author": {"steamid": "76561198018483984", "num_games_owned": 1971, "num_reviews": 132, "playtime_forever": 1700, "playtime_last_two_weeks": 0, "playtime_at_review": 754, "last_played": 1576181504}, "language": "english", "review": "I used to want to wait until games released to review them; but with games staying in EA longer and longer, and going on sale during, friends keep on asking me if a game is worth it. So here we are.\n\n[h1]This is an Early Access review of v0.4.3, and can only attest to what was in the game as of June 2017.[/h1]\n\nThe Wild Eight is a co-op survival game where you play one of eight characters (each having a different strength), who have survived a plane crash in a snow-filled forest. You can play in single player perfectly adequately, or play with a group to survive and explore together. It focuses on exploration and survival (food, water, temperature and monsters), with a small amount of building (just a couple of set items) and crafting. Whilst the world and the items are quite limited at the moment, it really excels in atmosphere and some of the indoor locations are fantastic. Creepy, interesting and surprising in some ways - I'm not putting any spoilers here though! There is a quest system, but the game can be played fairly openly, you're not obligated to follow the order directed at all.\n\n[h1]Pros:[/h1]\n[list]\n[*] Beautiful graphics\n[*] Eerie and fitting soundtrack\n[*] Tough survival, but has two modes and the easier difficulty is much more forgiving\n[*] Proper co-op survival where you work together.\n[*] A fair few different inside/building locales, with some surprises in store\n[*] Quite a few different items\n[/list]\n\n[h1]Cons: (Remember this is for June 2017 build - I anticipate most of these being addressed)[/h1]\n[list]\n[*] Early Access\n[*] Currently fairly limited amount of monsters\n[*] The outside world looks very similar\n[*] Whilst survival (food/water/heat/outside animals) feels balanced, there are a few special monsters that feel VERY tough right now.\n[*] Multiplayer can currently be a bit laggy.\n[/list]\n\n[h1]Is it worth it?[/h1]\n\nI was one of the 1200 folks to back this game on Kickstarter and I was pretty sad it didn't make any of the stretch goals, and barely got through at all. Nothing I've kickstarted has released on time, and this game is no exception, with a kickstarter release date of Dec 2016 (EA keys were sent in Feb 2017). I was a little disappointed back in February, but the recent bunker update was fantastic. It has made some decent progress since that date, and to me, the existing game is now worth the money - with the promise of much more to come so I'm happy to recommend it.\n\nIt's a game that needs more - more items, more locations, more monsters - but I'm pleased with the core of this game, happy I supported it on Kickstarter and happy to recommend it.\n\n[h1]Thumbs up - and massively looking forward to this progressing into a full game.[/h1]", "timestamp_created": 1498314786, "timestamp_updated": 1498314786, "voted_up": true, "votes_up": 698, "votes_funny": 21, "weighted_vote_score": "0.90348052978515625", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "138203030": {"recommendationid": "138203030", "author": {"steamid": "76561197975523595", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 563, "playtime_last_two_weeks": 0, "playtime_at_review": 563, "last_played": 1683874989}, "language": "english", "review": "WARNING: ABANDONED GAME\n\nYet another abandoned game that had great potential and would be great even today, except as usual\nthere are many game breaking bugs that were never fixed for 5+ years.\n- Items randomly disappear\n- Crafting an item fails; the end item poofs but you also lose the hard earned resources\n- Nothing in the game seems to respawn and yet you're expected to survive not to mention the game touts\nthat it is built for multiple people; this makes it unsustainable for even 1 player\n- Saves are randomly wiped\n- Corruption of files between coop players\n- Interface fails to update skills bought and forces a restart of the game\n- Many \"skills\" don't actually function and were reported 3+ years ago from the date of this review\n- No real precise or comprehensive information to find out things about the game; trial an error is the only\nway and often is extremely obtuse.\n\nAnyway, another bummer in the massive floating bummer pile.", "timestamp_created": 1683924080, "timestamp_updated": 1683924080, "voted_up": false, "votes_up": 111, "votes_funny": 0, "weighted_vote_score": "0.884828031063079834", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "87753597": {"recommendationid": "87753597", "author": {"steamid": "76561198016602204", "num_games_owned": 656, "num_reviews": 14, "playtime_forever": 1427, "playtime_last_two_weeks": 0, "playtime_at_review": 1427, "last_played": 1614721201}, "language": "english", "review": "[h1]READ THIS BEFORE YOU BUY! [/h1]\nI have bought this game as a part of humble bundle deal. The funny thing is that I actually wanted to try this game for a long time now. And now that I had chance to play it, I'm seriously disappointed. The short version, the devs abandoned this game long time ago without fixing important bugs and mechanics. This game isn't worth your money or time. If you want the long version, continue reading...\n---\n[u][b]1) Bugs, bugs everywhere...[/b][/u]\nImmediately after starting the game, you start to notice things like quest markers not disappearing after you finish the quest (this happens randomly and that's why I think it's a bug).\nSome quests are tied to a certain item and the quest won't be marked as \"done\" until you interact with that item - most of the time it's some unimportant item such as muffin or similar thing you don't need when you reach certain level. But because the quest will stay active until you pick up that one specific object, you spend your time throwing items on the ground and picking up everything in the area, one by one.\n\n[u][b]2) Organized mess...[/b][/u]\nInteraction with items and objects is pain in the a$$. Simply put, when there's multiple items or objects close together, you have to slowly and carefully move your mouse over the few pixels to try to pick whatever you actually want to interact with. Or you can just pick everything and throw everything you don't want on the ground later. However, this doesn't work with objects (chests, etc...) and won't be possible when you have full inventory and need only that one specific item before you can go because you're trying to save your bacon by picking up wood, so you can make campfire and not freeze to death. Or you're trying to pick that weapon you threw instead of firing a pistol (because the weapon switch didn't work again for some reason), so you can protect yourself against wolfs.\nYou can't even divide items into individual stacks. For example, you need to take some ammo with you but you want to leave half behind just in case you would get killed again by \"wasteland 2\" status that came out of nowhere and you froze to death in a spot that you can't reach ever again to pick up your things because now you're freezing to death 2 rectangles on map earlier then before. So, if you managed to stack items that you didn't want to stack, you're fu*ked and you will never be able to divide that stack again. \n\n[u][b]3) Freezing in Arctica? Duh...[/b][/u]\nUnfortunately, the game freezes randomly for a split second even with the strongest hardware. Mostly at times when you're under attack and you need your reaction time to be as fast as possible. Or, as mentioned above, you're suddenly out of the map borders you're supposed to stay in, but the game registered that just now. In that case, say goodbye to all of the leather, ammo, vapor 3 suits you managed to loot in the last bunker, because you'll never be able to reach the spot you just died in ever again (even with multiple personal heaters after you finally managed to find a blueprint for it).\n\n[u][b]4) range combat is pointless[/b][/u]\nThere are constant issues with terrain, moving targets and disappearing arrows. Basically, if you want to hit anything and kill it before it reaches you, you need to:\n     [u][b]A) Be on a flat area -[/b][/u] if you're fighting something while the target is standing on even the smallest rock, your shot won't hit it. To ensure that you're going to hit your target, you need to stand on the same level as the target and the target needs to stay still.\n     [u][b]B) Use a pistol -[/b] [/u]if you're using his and arrows, you'll soon find out that not every time you try to shoot the arrow actually gets shot. Sometimes it just disappears immediately after you click your mouse and if you're fighting a mutant, you just lost precious shot that could save your life.\n     [u][b]C) make sure the target is not moving -[/b] [/u]if you're trying to hit a moving target, you won't hit it. The reliable and basically the only way how to fight with long range weapons is to agro the poor thing you're trying to kill and then take as many shots as you can while it's running towards you.\n\n[u][b]5) consumables or quest items? [/b][/u]\nAfter you reach dynamite section, you'll find out that even the quest items are consumables. And if you managed to use them all before you unlocked that next section, you're pretty much fu*ked and you need to start the game from the beginning again. And if you do start the game again, you will be afraid to use anything that you can't craft just because it may be another quest related consumable you'll need later to progress further.\n\n[u][b]6) crafting in a survival game, checked... What do you mean \"it's not good\"?[/b][/u]\nUnfortunately, this is one of those games that has crafting system implemented just because it's expected to be. The crafting system is a mess. You often spend several minutes (even hours, if your looking for chemicals and other rare ingredients) trying to gather ingredients for that thing you want to make, just to find out that the loot you got during the grind is way better than whatever you'll make. \nAnother issue is that the cost isn't worth the item you're trying to craft. For example, if you want to craft basic bone arrows, you need just wood and bones. Pretty simple and easy to get. But if you want to upgrade to steel arrows, later in the game, you need wood, some leather strips and processed steel (steel is made by mining ore, forging it to iron and forging it again with no extra item. Thus, creating steel. Tadaaa). If you're a standard rpg player, you'll check what the improvent is if you're going to replace the old item with the improved version. In this case, you would find out that your damage output while using his would improve by 3. Which is basically nothing and combined with the disappearing arrows and targeting system I mentioned before, it makes one of the most useless and most expensive upgrades in the game.\nAnother issue with the crafting system is if you spent several minutes to gather the material you need for that specific item and then click on something else by mistake, you can't cancel the crafting process. You're forced to watch the loading animation showing how you're wasting valuable resources on something you don't want and probably don't have any use for. Multiple times I just stared at the screen, watching my precious recourses being wasted on something else, just because the crafting menu suddenly changed because you just used last piece of that thing you need to make the other thing and didn't notice in time (the crafting menu changes based on the materials you have in your inventory. The things you can currently make are the first in the menu).\n\n[u][b]7) legendary permanents[/b][/u]\nChests, campfire and forges are the three objects you need to build at some point in the game. Unfortunately, these objects can't be removed - ever. That means, if you managed to build a forge in a spot which, for example, prevents a gate from opening (one specific quest made me really furious), you will never get past that gate. Or, for example, if you were forced to build a campfire in hurry, to avoid freezing to death, you just created a permanent marker on your map. If this sounds like a joke to you, imagine how showing this gets after a few hours in the game, when you're looking for a specific marker on your map, because you can't create your own, temporary marker. That's right. This game won't allow you to create a custom marker so you can easily reach the spot you want but if will create a marker everytime you build a campfire.\n\n---\nTher are other issues I could write about (for example the deer sled issue and how you can't reconnect it with a new deer if you managed to lose your original deer to hunger - you simply need to create a new sled) but let's be honest... Did you even read it this far before you clicked away?", "timestamp_created": 1614727990, "timestamp_updated": 1617220070, "voted_up": false, "votes_up": 117, "votes_funny": 4, "weighted_vote_score": "0.884634494781494141", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "132550847": {"recommendationid": "132550847", "author": {"steamid": "76561198000293028", "num_games_owned": 265, "num_reviews": 10, "playtime_forever": 1175, "playtime_last_two_weeks": 0, "playtime_at_review": 1175, "last_played": 1591293151}, "language": "english", "review": "Sadly abandoned, had a lot of potential.", "timestamp_created": 1676060039, "timestamp_updated": 1676060039, "voted_up": false, "votes_up": 149, "votes_funny": 5, "weighted_vote_score": "0.879392802715301514", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "132426101": {"recommendationid": "132426101", "author": {"steamid": "76561198005886197", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 1328, "playtime_last_two_weeks": 0, "playtime_at_review": 1328, "last_played": 1675869199}, "language": "english", "review": "The Wild Eight is a roller coaster of a game. It's a survival craft, but also a major imbalance hag that likes to show you just how hard enough it is by throwing you into 3 wolves on the same tile, one of which is a King Wolf, or better yet a bear thrown in the mix. The achievements don't trigger 70% of the time, the quests break more than fine china, I had fun with the Survival and Crafting aspects but pulling teeth compared to other survival crafts.\n\nBUY AT YOUR OWN RISK AS THIS GAME HAS BEEN ABANDONED.", "timestamp_created": 1675870249, "timestamp_updated": 1675870249, "voted_up": false, "votes_up": 121, "votes_funny": 3, "weighted_vote_score": "0.868504464626312256", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "92076597": {"recommendationid": "92076597", "author": {"steamid": "76561197972317208", "num_games_owned": 0, "num_reviews": 32, "playtime_forever": 5202, "playtime_last_two_weeks": 0, "playtime_at_review": 5202, "last_played": 1581554136}, "language": "english", "review": "The Wild Eight...oh, the wild eight...the game that once was. I'm going to be firm but fair on this one - this game was really good at the time I was playing it, but that was many months-to-years ago. These days, alas, the only thing wild about this game is the codebase which now seems to have grown weeds, and there's an old rusted lawnmower out front. The lawnmower has no gas. If you ever want to know what the term \"bitrot\" means then this game is a prime example.\n\nI'll describe it as it once was: You're stuck in a plane crash on a desolate tundra with only your wits and your teammates to survive. You'll have to navigate forests and hunt wild game to find food, and keep the fires lit to stay warm. It's intense survival and it's really engaging just doing that by itself. To top it all off there's something mysterious about this landscape...something eerie and unsettling. Finding an old abandoned bunker you can't help but wonder what happened to the inhabitants of this facility, or what sinister experiments they were engaged in. Alarmingly the reactor that powered this old base has been badly damaged and the cooling systems are unreliable. It's more an annoyance but you have to constantly keep tabs on that reactor to make sure it doesn't breach. It's an annoyance you will tend to though because the alternative is frankly beyond your worst nightmares. Over time you'll come to find the dark truth behind this bizarre depraved experiment...\n\nNow I'll describe it as it is: You get stuck in walls a lot. Chopping down trees tends to throw wood up into the upper stratosphere where it floats tantalizingly in the air and out of reach. Walking into rooms sometimes leaves you in a void in the ceiling where you'll spend the rest of eternity wondering where the map went. That really cool piece of equipment that you found? Yeah, goodnight. That awesome equipment is stuck in the bottom of a pit that you can't possibly reach without turning yourself into pulpy rockface sauce. Worse yet is when it's critical to the story and you can only camp around the hole cursing yourself for going out at night. Then you reload the game only to find the save game is corrupted and you spawn in the outer reaches of the uninitialized memory with items floating around everywhere...and your legs where your head used to be. The dark truth behind this mystery is that they didn't implement software testing, and the horror that awaits is JIRA. I'll spoil the story; the mysterious missing inhabitants are \"the development staff\". The staff seem to have gone for a long lunch. They've been out to lunch for...over a year now? The lasagna must be really good or something.\n\nI can't say I've ever seen a game that's developed in reverse before, and certainly not like this. Games are supposed to become more polished and more complete over time but this one seems to have gotten worse. At some point I'll assume Frank threw his hands in the air and said, \"Ah fuck it, the code is crap. Let's have a beer.\" They never recovered from the hangover. At one point I would have recommended this game but I can only recommend it now if you're interested in seeing the result of bad software process in action. You might also enjoy it if you like gazing at logs and deer skins floating out in the upper stratosphere when you should be building a tent. Sometimes the logs you'll be staring at are actually crashdumps, and I do loves me choppin' some dem' illegal memory access exceptions.\n\n-5/10 Gravity goes downwards normally.\n-10/10 Doors should lead to the other side of the door, not oblivion.\n-inf/10 Software testing is not a \"desirable\".\n\nBuyer beware: Thar be bugs in them there snowy hills...", "timestamp_created": 1621134088, "timestamp_updated": 1621134088, "voted_up": false, "votes_up": 197, "votes_funny": 53, "weighted_vote_score": "0.866418004035949707", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "35707875": {"recommendationid": "35707875", "author": {"steamid": "76561198152623058", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 1916, "playtime_last_two_weeks": 0, "playtime_at_review": 922, "last_played": 1540753127}, "language": "english", "review": "14 hours into the game with my husband, and I'm not sure what issues people are referring to, that make the game \"unplayable\".  We have had a few minor glitches/bugs but absolutely nothing that detracted from the game.  I can only imagine those reviews were older, because for us, it has run nearly flawlessly (ie: maybe 2 minor glitches in 14 hours)\n\nAs a casual gamer, this game has been easy to pick up, interesting to play, and just challenging enough to keep it interesting, not overly frustrating.  The game also is very pretty visually, and the multiplayer is fantastic.  Very pleased, and looking forward to the numerous updates planned by the Devs.", "timestamp_created": 1507954758, "timestamp_updated": 1507954758, "voted_up": true, "votes_up": 156, "votes_funny": 10, "weighted_vote_score": "0.860036075115203857", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "69297414": {"recommendationid": "69297414", "author": {"steamid": "76561198021135962", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 2155, "playtime_last_two_weeks": 0, "playtime_at_review": 2155, "last_played": 1589710313}, "language": "english", "review": "It starts off strong.\nPositives: \n- Survival mechanics are pretty great, managing hunger, cold, health. \n- Great concept\n- Interesting storyline\n\nNegatives:\n- Bugs\n- Very bland, disappointing ending\n- Repetitive and strange pacing\n\nThis could have been a really fantastic game. The style is great, the basic mechanics are pretty good.\nBut it's clear the developers phoned it in pretty early. It's unpolished, buggy, and lacking just... Love.\n\nI was compelled to finish this as I wanted closure on the storyline and to see where this game went. Quality of the game degraded over the course of the story- less voice acting, worse performance, just falling flat on its face.\n\nI loved the premise, I enjoy the mechanics, but the pacing is strange. Harvesting resources tends to be unbalanced- getting leather and tendons vs. wood and ore, it's very skewed and can making crafting vastly unavailable.\n\nI want to recommend this but I just cannot. As great as it started, and as compelling as the concept is, it just ends up flatlining halfway through and feels like a time sink with no resolution.", "timestamp_created": 1589710623, "timestamp_updated": 1589710623, "voted_up": false, "votes_up": 57, "votes_funny": 1, "weighted_vote_score": "0.853827536106109619", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "79050742": {"recommendationid": "79050742", "author": {"steamid": "76561198095236697", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 18506, "playtime_last_two_weeks": 0, "playtime_at_review": 3884, "last_played": 1606035150}, "language": "english", "review": "This is an ABANDONED game. There has not been an update made to it in over a year. The issues it had then are still there now. It can be fun but there are tons of quests that you start and just about a minute later as you have completed it by simply turning on an item you are left with a WTF moment. Your main base is incomplete in my opinion. There are glaring X's on rooms in the building with no access to them and then are rooms you have to hunt down the keys to open. Looks like a project started and never completed to me. There are quests where you work to find a solution to free a person who talks to you then you get everything done and either nothing happens or you find them long dead. How was a dead person talking to me? The game is meant to played co op or multiplayer obviously. There are just too many things you must do just to survive in this very harsh environment. There are things that are normal and then the supernatural appears to remind you the world you are playing is anything but normal. Busy dodging wolves and bears get attacked by a ghost. Walking along and bump into a werewolf (called a mutant once you harvest it but obviously a werewolf in appearance). There are issues with save games not working properly once you make them. Nothing makes you more angry than to have 70 days played in this game and then reload to play some more and just instantly die when you load in or it just puts you in a load loop and you never get in at all. If you enjoy old incomplete games then knock yourself out playing this one.", "timestamp_created": 1605018826, "timestamp_updated": 1605018826, "voted_up": false, "votes_up": 78, "votes_funny": 2, "weighted_vote_score": "0.839117348194122314", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "31189765": {"recommendationid": "31189765", "author": {"steamid": "76561198141504784", "num_games_owned": 19, "num_reviews": 2, "playtime_forever": 7147, "playtime_last_two_weeks": 0, "playtime_at_review": 7146, "last_played": 1493918189}, "language": "english", "review": "In dired need of Moderator/Official server.\n\nCause this game is slowly dying.\n\nUpvote only because it was fun when there's people to play with.", "timestamp_created": 1492389304, "timestamp_updated": 1492389304, "voted_up": true, "votes_up": 176, "votes_funny": 5, "weighted_vote_score": "0.835754811763763428", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "36580764": {"recommendationid": "36580764", "author": {"steamid": "76561197988166946", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 5084, "playtime_last_two_weeks": 0, "playtime_at_review": 3085, "last_played": 1700976253}, "language": "english", "review": "Imagine I told you I was going to build you a house. I tell you that you can buy the house when its done, or you can pay for it now and if you pay for it now, not only will it be even better when it's done, but I'll actually give you a discount! You see the plans for the house and the discounted price and decide yeah, you're going to buy it now before it's done. \n\nCouple months later, theres just a foundation, some framing and the early stages of a plumbing system and I look at you and say, \"Hey uh, I'm bored so I'm guna have my buddy finish this, maybe. I don't really know what he's guna do with it. But I'm guna go build a different house now. Enjoy!\"\n\nThats what this is. I can't believe this is legal.", "timestamp_created": 1510952821, "timestamp_updated": 1510952821, "voted_up": false, "votes_up": 521, "votes_funny": 68, "weighted_vote_score": "0.831552505493164063", "comment_count": 37, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "42869082": {"recommendationid": "42869082", "author": {"steamid": "76561197995281359", "num_games_owned": 1505, "num_reviews": 128, "playtime_forever": 654, "playtime_last_two_weeks": 0, "playtime_at_review": 593, "last_played": 1529634206}, "language": "english", "review": "I'd just like to say that this game is [i]AWESOME[/i], it needs some work and a bit more content but it's a great title for Early Access. I've played it for over eight hours so far in one sitting, seven of them being with a friend in Multi Player that I bought a copy for [i](it's too expensive at regular price for many of my friends that aren't diehard fans of the survival genre)[/i]. Really impressed with the amount of interaction that the DEVs have with their players and the good vibes of the forums.\n\nThe following are my issues with the game itself. I spent a good while on this and will edit it as we go along with discussions. If anything is not to your liking I’ll remove it if asked [i](within reason)[/i] I haven’t played this game for long but I really do think it’s a gem in the rough.\n\n\n[h1]Quality of Life Enhancements:[/h1]\n[code]\nTorch Crafting - It took me a good five to fifteen minutes to figure out that I couldn't have the torch in my hand to light it, this is very unintuitive and just realism breaking. Please let us craft with items that are in our hands.\n[/code]\n[code]\nItem Trading - So far the only way I can see it is you need to craft a chest to trade items which wouldn't be a huge problem if it wasn't for the next issue.\n[/code]\n[code]\nLack of a structure destruction tool/option - You wanted to trade some items with a friend, maybe you mined too much and don't want your items to block you in [i](see next issue)[/i]. Well just make a chest, but be prepared to have it displayed on your map forever with no way of knowing if you actually have emptied all those items in that chest. Not to mention campfires [i](not as much of a problem as they have a purpose for traveling people, but it is an issue when too many are crafted in the same area)[/i] and Furnaces [i](who wants to travel 15 blocks just to use a furnace that you build a couple hours ago?)[/i] You don't need to get refunded many resources if any at all, just let us destroy them please.\n[/code]\n[code]\nItem Scattering - Please, don't make our items that we mine with a tool [i](with a full inventory)[/i] scatter around us effectively blocking us from moving or crafting [i](issue happened with Ore)[/i] leaving us to die a cold and unforgivable death [i](unless you have a buddie rushing to come over to pick up a section of the wall)[/i]. While this was funny, it got old really fast. Sometimes the items will land in the sky being unreachable which is also a bummer if it's Ore. Not so much for Wood [i](which is what fell in our sky)[/i]. I'm not sure if this would also fix the way trees can go flying which I'd argue is a feature and a good laugh once in awhile.\n[/code]\n[code]\nLive Map - It would be nice to be able to see where there are trees on the map, while it's not needed it would be a quality of life improvement even though there are trees litterally everywhere unless someone has been axe happy.\n[/code]\n[code]\nServer Client - I'm not sure if this is already a thing but it would be really cool to be able to host our own server via CMD client with our own variables just another wish list feature.\n[/code]\n\n[h1]Bugs:[/h1]\n[code]\nOriginal Text: You can pack up structures at any time and move then somewhere else\nFixed Text: You can pack up structures at any time and move them somewhere else.\nSource: https://steamcommunity.com/sharedfiles/filedetails/?id=1417007049\n[/code]\n[code]\nAnimals frozen / Void of loot - While this bug [i](Multi Player, IDK about Single Player)[/i] can be fixed with a simple Save and Exit, then reload your Multi Player file, it's still a big bummer that it happens every hour or two.\n[/code]\n[code]\nScotty Doesn't Know - Gifting Scotty a max quality/durability item will still give you sharpened bones? Gifting him wooden shoes/armor will get you adrenaline shots and clothing? This has got to be a bug since you guys specifically mention in the quest that higher quality items will yield better rewards... but it doesn't. I mean this is a great way to farm gear early game but it’s pretty game breaking when you gift him a couple sets of steel armor and you only have a hat and two bone knifes to show for it. [i](Also when is Scotty going to get out of there? How am I helping him get out of there anyway?)[/i]\n[/code]\n\n[h1]Content:[/h1]\n I have barely touched the map/dialog content/quests of the game but I have Steel Equipment unlocked. I'd really like to see some more equipment options after this, as well as some tougher shelter/workshop improvements [i](maybe requiring something more than leather/Iron... How about some Steel and a new element?)[/i]\n\nPS: Thanks for reading, I know your time is valuable and I hope these critiques’ find you well :)\nPPS: This review has been marked as helpful by over two users so far, but as this is a Early Access game that i'm pretty jazzed about it'll be getting a lot of review updates so the count will be reset quite often.\n\n\nEDIT: added a bug \"spelling error them\", tweaked some spelling and grammar in my post and removed Frost Guy bug (it's a feature!)\nEDIT2: RedShell Removed from the Game!\nEDIT3: Game abandoned", "timestamp_created": 1529479171, "timestamp_updated": 1611925570, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.829675495624542236", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1529498912, "developer_response": "Hello, and thanks for the feedback.\n\nWe would like to inform you that latest update 0.9.23 has no Red Shell integration. We care about your trust in us and wish you the best gaming experience."}, "30041100": {"recommendationid": "30041100", "author": {"steamid": "76561198007148574", "num_games_owned": 604, "num_reviews": 84, "playtime_forever": 985, "playtime_last_two_weeks": 0, "playtime_at_review": 985, "last_played": 1487544023}, "language": "english", "review": "The Wild Eight\n\nOn Saturday, February 18, 2017, my friend and I read the initial reviews and were skeptical of The Wild Eight. At this time it had only been released for several days. While I was more sold on the idea, my friend was hesitant because of some prior early access titles that were a huge letdown. The reviews implied that there were bugs, sketchy multiplayer servers, and some “boring” gameplay. After winning a bet with my friend, he decided to buy the game. We spawned into a server together and the game ran very well. We were almost immediately immersed, taking on our roles as airplane crashed survivors. After building a riddled tent and a shelter to make some tools, we began a small journey around the snowy woods. We spotted a rabbit. We chased it, throwing rocks at it and yelling. The rabbit got away. It was at this moment our stomachs began growling and our feet were turning purple. We died before making it back to camp. So we started over. \n\nAfter figuring out the basics, we set up a large and upgraded campsite, got a stockpile of food, and made ourselves some high tier clothes and weapons. This process took around a couple hours. Our new goal was to complete a series of quests and to discover what was on the map. I have to say, the map size and variability on The Wild Eight is very impressive. It immediately brought me back to my days on Terraria. We would get back from an hour long adventure and see that we only discovered about 5% of the total map size. \n\nPros:\nHuge map with lots of variables and procedurally generated content.\nAn actual storyline and main / side quests to be completed.\nBesides forest, areas exist such as caves, old facilities, and abandoned towns.  \nChallenging gameplay, where hunger drains rapidly and the cold always lingers.\nSmooth graphics, 60 fps, and a great top-down engine. \nA soundtrack that is relaxing during the good times, and terrifying in the bad. \nA variety of NPC animals both to hunt, and to hunt you. Boss battles as well. \n\nCons (most cons are only there because of early access bugs):\nAnimations sometimes are glitchy. Your axe will swing a foot away from your arm, ECT. \nThe animals will sometimes be out of sync with you and other players. My friend was killed by an animal that he couldn’t see and I could. He would swing at an animal when it appears 10 feet away. \nThere is also building bugs between players. I sometimes can’t see structures that my friend builds.\n\nAll in all, the gameplay is very challenging. If you die, your character’s leveling / building progress restarts and you have to loot your body for the gear you had. I would highly recommend to not play by yourself. On Saturday my friend and I got the game. We played for 13 hours straight. We still have lots more to do and discover. Bugs exist in this early state, but nothing game breaking. No crashes or failed saves or anything. If you enjoy survival games like Rust, a cooperative experience, and an adventure such as Terraria, then The Wild Eight, a 20 dollar price tag, is fully worth it and I highly recommend.\n\nUPDATE: We played in stretches for a couple more days and are now taking a break. We finished most main missions and discovered most of the map. Admittedly, we both rage quit after losing max gear / levels lol. We are awaiting further updates. In my opinion, my 16 hours of gametime were fully worth my 20 dollar purchase.", "timestamp_created": 1487527856, "timestamp_updated": 1490044267, "voted_up": true, "votes_up": 80, "votes_funny": 6, "weighted_vote_score": "0.821952700614929199", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "94629995": {"recommendationid": "94629995", "author": {"steamid": "76561198095371981", "num_games_owned": 0, "num_reviews": 23, "playtime_forever": 1077, "playtime_last_two_weeks": 0, "playtime_at_review": 1077, "last_played": 1570653989}, "language": "english", "review": "Abruptly abandoned by devs that went to work on another project. The game itself was decent with friends but don't expect anything else but a grind with eventually no payoff. I really think this game could've been something good with time and updates.", "timestamp_created": 1624939875, "timestamp_updated": 1624939875, "voted_up": false, "votes_up": 50, "votes_funny": 0, "weighted_vote_score": "0.810645222663879395", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "102968902": {"recommendationid": "102968902", "author": {"steamid": "76561198061410634", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 50, "playtime_last_two_weeks": 0, "playtime_at_review": 50, "last_played": 1637204289}, "language": "english", "review": "Wish I had some friends to play with.", "timestamp_created": 1637204469, "timestamp_updated": 1637204469, "voted_up": true, "votes_up": 73, "votes_funny": 41, "weighted_vote_score": "0.807384490966796875", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "63301072": {"recommendationid": "63301072", "author": {"steamid": "76561197966435823", "num_games_owned": 0, "num_reviews": 35, "playtime_forever": 2481, "playtime_last_two_weeks": 0, "playtime_at_review": 2481, "last_played": 1581369932}, "language": "english", "review": "TLDR: A game abandoned by the original developer and very poorly \"finished\" by another team. It's advertised as something a lot more than what it is. The actual end product is an unfinished game that lacks depth and any sense of purpose or proper progression. Avoid unless you like to be bored by a clunky unfinished prototype.\n\n\n\nThis is another one of those games that seems nice on the surface and from the trailers but is utterly unfinished and lacks any sort of proper depth, sense of progression or balancing of mechanics or side quests. \nI wouldn't even call this a finished game to be honest. \n\nThe game starts out alright at the beginning. It seems very basic from the get go but you get the impression that there could be something cool here. Unfortunately you're faced with the reality of a clearly unfinished product within the first few hours of gameplay though. I wish I noticed it a bit earlier so I could have asked for a refund but I kept hoping that it was just rough at the start and would kick in to gear eventually...but that never happened.\n\nYou've pretty much seen it all in the first couple of hours and the rest is just repetition of those poorly planned and balanced mechanics until you're bored out of your mind.\n\nMost of the mechanics seem to be implemented on a level of depth you'd expect from an early prototype where the developer is still trying to figure out what works and what doesn't. In addition to the poorly implemented mechanics there seems to be no proper balancing of them either. \n\nYou get a ridiculous amount of loot but the inventory system is utterly terrible and you have to keep juggling constantly to be able to keep the stuff you want. \nYou have combat but it's really clunky and the skills for it are the most basic things you could imagine. Add \"x\" amount of damage to your attacks. Don't get me wrong, that could be an unlock...it's just that there hardly is anything with more depth than that. Forget about any sort of tactics or alternatives to \"click on the creature until it's dead\"-tactic.\nThere's crafting but it's so simple and boring there's hardly any sense of progression at all. You pretty much unlock better gear by finding more of the same resource you find everywhere, yay. There are some resources that require a bit more effort to find but that's a very small consolation.\n\nThe side quests usually have some sort of story but they seem so pointless that half the time you don't even realize you finished the quest until you don't know what to do next. These side quests sometimes give you some item you might need in the main quest but you have no idea of knowing that until the end. Mostly you just find lots and lots of meaningless loot that you'll struggle to carry with you.\n\nThe world map is pretty huge but it's mostly empty wilderness with some random buildings here and there with loot. Loot you don't really need most of the time.\n\nI simply continued playing this after the first few hours to get it out of my backlog and I can hardly say it was enjoyable.\n\nI know this review is very harsh and there are surely some good parts in the game (such as the art) as well it's just that this game is such a poor execution as a whole. It's a real shame because I think this could have been good with a properly cohesive plan and vision but what was deemed \"finished\" seems more like an incoherent, clunky prototype that doesn't really know what it's trying to be.", "timestamp_created": 1581373280, "timestamp_updated": 1581373280, "voted_up": false, "votes_up": 61, "votes_funny": 1, "weighted_vote_score": "0.803443670272827148", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "120657280": {"recommendationid": "120657280", "author": {"steamid": "76561198405770185", "num_games_owned": 360, "num_reviews": 85, "playtime_forever": 1050, "playtime_last_two_weeks": 0, "playtime_at_review": 1037, "last_played": 1674789367}, "language": "english", "review": "i loved this game so much, but the dev's dropping it is SO upsetting. it is hard to recommend a game that is abandoned. this game had so much potential too :(", "timestamp_created": 1660542975, "timestamp_updated": 1660542975, "voted_up": false, "votes_up": 41, "votes_funny": 0, "weighted_vote_score": "0.801989257335662842", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "38388384": {"recommendationid": "38388384", "author": {"steamid": "76561198000876770", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 1595, "playtime_last_two_weeks": 0, "playtime_at_review": 1484, "last_played": 1569683883}, "language": "english", "review": "Hello, i feel like this game could be great fun, that is why i wanted to leave a feedback, might as well do it here. I only click yes because i trust this is a WIP and there is still a lot to look forward to.\n\nAs for the positive traits:\n-Fun to play with friends\n-a large enough map, random elements too\n-the quests are fun enough when you play them for the first time\n-character progression keeps you busy for a while\n\nNegative would be:\n-Not much fun to play with random people, because there are no means to interact(simple chat, and you can drop items, thats it)\n-The quests are the same every time you do them, they may spawn in a different location, but it changes nothing\n-Map is not endless, you reach the border of it and you die, this was the thing i tested straight away when i launched it for the first time.\n-There are 2 actual structures you can build - workshop and tent. Survive this.\n\nThis game really lacks depth, like: \n\n-diversified crafting(everything in 1 place, seriously? crafting is a great jewel of any survival game, you cant just ignore it)\n\n-more building options(there should be an option to live in a tent, other than that i think player should be able to build whatever he wants, put whatever he wants in the room and make a building whatever he wants it to be) \n\n-psychological aspects(buffs, debuffs, moods and stuff, or you might just replace all your characters with robots - might be more fun)\n\n-actual traumas(not just health bar, permanent injuries and deseases included, why is there medecine added to this game?)\n\n-more interaction options(this is a co-op game, after all, so basic stuff like tagging other players, radio beacons, inspecting other players, custom written biography would be a highly recommended addition, to my mind)\n\n-definately character customization options(i d expect to see people in characters i am playing: with traits, skills, personalities and not simple pawns, i mean even strategy games have much more \"realistic\" and \"alive\" characters, even though you dont play them directly. As for character development, it should be about chosing, not about grinding xp then purchasing a skill that everyone else will master too)\n\n-somewhat real animals(who give milk, wool, eggs, whatever. Tamed animals behave wierd, but it doesnt matter, they are pretty much useless anyway, just a carriage you cant even ride, or just a pet wolf that ll run around a bit and die imminently, because you cant train it. Cant feed them vegetables or meat either - only special food, and deer cant just eat his share of grass, or whatever it eats naturally, while wolves lose their ability to hunt when they become tame - not much fun)\n\n-temperature is important in a survival game(one temperature bar and a fireplace(and furnace) is not enough, it seems the temperature is always exactly the same throughout the whole game, and you can just run around in a t shirt, periodically lighting up a fire. Have you ever been anywhere beyond california? it gets colder in winter in alaska and its pretty much green for a few months in summer)\n\n-electricity(so you have 5 generators with you, and you cant use them, you keep chopping that wood and throwing it into the fire)\n\nAt least this is what i d expect from a survival game with RPG elements, and nothing less.\nI actually had no idea you cant even build a simple wall in here when i bought it, i mean there are structures on the screenshots. You cant even enter your shelter (character disappears into it, what?), cant sleep without wood either, why? I ve played for about 25 hours, i got some of the characters to max, did most of the quests, there are literally no reason i should play again ...yet.\nI hope this game will receive some new features so it doesnt feel like you do exactly the same thing over and over again if you start a new game.", "timestamp_created": 1513551187, "timestamp_updated": 1513599566, "voted_up": true, "votes_up": 47, "votes_funny": 2, "weighted_vote_score": "0.800353109836578369", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "50309125": {"recommendationid": "50309125", "author": {"steamid": "76561198107910983", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 3080, "playtime_last_two_weeks": 0, "playtime_at_review": 2591, "last_played": 1658593286}, "language": "english", "review": "My wife and I are having a lot of fun playing this game after the kids are in bed. The last update upset me because I considered the game unplayable with food spoiling so fast. A quick patch from the developers seems to have cleared up any issues I've had.", "timestamp_created": 1556152785, "timestamp_updated": 1556234280, "voted_up": true, "votes_up": 46, "votes_funny": 5, "weighted_vote_score": "0.792344629764556885", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1556182464, "developer_response": "Hello!\n\nWe appreciate your feedback! We've just released a new patch in which spoilage rate for food on the ground, in a chest and in a refrigerator has been decreased. Peanut Butter, Packed Lunch and Canned Food are not subjected to spoil anymore too.\n\nYou can check for full list of changes here: https://steamcommunity.com/games/526160/announcements/detail/1625146988531946776\n\nWe hope, you will find yourself satisfied with the new update, and it will bring your mood up!"}, "61555597": {"recommendationid": "61555597", "author": {"steamid": "76561197963516055", "num_games_owned": 612, "num_reviews": 17, "playtime_forever": 169, "playtime_last_two_weeks": 0, "playtime_at_review": 169, "last_played": 1578530682}, "language": "english", "review": "I had The Wild Eight on my wish list for a very long time. Keeping an eye on development, watching youtubers play it and just overall trying to get a feel for it. Deciding whether or not it was the game for me.\n\nWell after a few years of watching development here and there, my friend and I decided to finally give in and purchase it while it was on sale for $13.00.\n\nWe tried. We really did try to give it a chance. The game just kind of throws you into this wilderness and then tells you how to do some basic things in the game. After about 10 minutes, your mission objective is just \"Find where the power lines lead\". So we did that, we followed them for probably 30 to 40 minutes because they branch off in different directions and have dead ends.\n\nSo we finally found the end and the next objective was.... follow the second power lines.\n\nSo my friend and I said no thanks and we got into the survival and crafting aspect. \n\nThe main problem with this game is everything is very simplified. I don't like games being really complicated and I don't want them to be a mobile type game with basic features. Unfortunately, this game feels like the latter. \n\nA lot of craftable items comes from hunting animals who have a random chance to drop certain things you need to progress. So you hunt boars, wolves, deer, foxes and rabbits. After two hours in, that's all I saw, also a werewolf inside a bunker for some reason that we just avoided.\n\nI'm sure there's a few more enemies further in and lots of different items. The whole world just feels empty and pointless. I was kind of hoping for The Long Dark kind of experience but in co-op form, but that's not what I got. \n\nWhat we got was a very basic, buggy and minimum content game. At two hours in, I'm already able to craft 70% of items and can already see what else there is. It's very formulaic. Leather > Metal > Crystals is basically the tiers of progression for armor, weapons and tools. Nothing felt challenging, just tedious.\n\nWanted to like it, I really did, but for $13 and especially for the default price of $24.99, totally not worth it. Playing with friends usually makes the worse games enjoyable, but it doesn't help just plain boring games at all.", "timestamp_created": 1578543251, "timestamp_updated": 1578543251, "voted_up": false, "votes_up": 65, "votes_funny": 2, "weighted_vote_score": "0.790085732936859131", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "39516493": {"recommendationid": "39516493", "author": {"steamid": "76561198004485107", "num_games_owned": 234, "num_reviews": 20, "playtime_forever": 1097, "playtime_last_two_weeks": 0, "playtime_at_review": 848, "last_played": 1577487111}, "language": "english", "review": "*** EDITED REVIEW ***\n\nWhile the game is fun, the producer are working on two new games and seems to have let this one die. DO NOT BUY UNTIL YOU SEE DE-SYNC PATCHES.\n\n\n( 8/10 )\n\nI would suggest to buy if you are looking for a new \"Story\" game. Fun to read the messages, to figure out what's happening. Survival is rather basic and perfect the way it is.. Spoiler, this ain't a survival game. Nice little crafting attributes, exploration and quests.\n\nPros - \nRelatively stable  CO-OP (Sometimes people have to join 2 times for everything to load correctly).\nHas a story to it, a goal.\nLooks great\n\nCons - \nIf you don't lose yourself in haversting, story can be finish in a day.\nMinimalist crafting (Updates coming soon ?)", "timestamp_created": 1516556578, "timestamp_updated": 1516659242, "voted_up": false, "votes_up": 55, "votes_funny": 2, "weighted_vote_score": "0.786825954914093018", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "85837633": {"recommendationid": "85837633", "author": {"steamid": "76561198814489602", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 71, "playtime_last_two_weeks": 0, "playtime_at_review": 71, "last_played": 1560184880}, "language": "english", "review": "They left this game so they could develop The Day Before. It's left by the devs, sadly. Had big potential.", "timestamp_created": 1612291342, "timestamp_updated": 1612291342, "voted_up": false, "votes_up": 67, "votes_funny": 0, "weighted_vote_score": "0.775142848491668701", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "29792399": {"recommendationid": "29792399", "author": {"steamid": "76561197981740772", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 630, "playtime_last_two_weeks": 0, "playtime_at_review": 630, "last_played": 1486772591}, "language": "english", "review": "Its like the Movie \"the grey\" but you need to Level Up to become Liam Neeson.", "timestamp_created": 1486601611, "timestamp_updated": 1502063642, "voted_up": true, "votes_up": 78, "votes_funny": 87, "weighted_vote_score": "0.772498488426208496", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "148707551": {"recommendationid": "148707551", "author": {"steamid": "76561198812238600", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 1094, "playtime_last_two_weeks": 0, "playtime_at_review": 1094, "last_played": 1579446809}, "language": "english", "review": "Abandoned by devs", "timestamp_created": 1698023738, "timestamp_updated": 1698023738, "voted_up": false, "votes_up": 51, "votes_funny": 0, "weighted_vote_score": "0.770521163940429688", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "33223824": {"recommendationid": "33223824", "author": {"steamid": "76561198075743597", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 3188, "playtime_last_two_weeks": 0, "playtime_at_review": 1740, "last_played": 1679846425}, "language": "english", "review": "Great game! The survival part is nicely balanced without being too easy, and the exploration is thrilling! :)\n\n \n\nI particularly enjoy the fact that the survival is made easier by the unique skills of the people you play with. That's why generally play on open servers to meet nice people, but I would like to address this message to all the haters/trolls/mean people that are sometimes destroying what others built: you’re welcome to come any time in my server to steal, destroy, and break everything. Everything you steal we’ll farm again, everything you destroy we’ll build again, everything you break we’ll repair like brand new. \n\n\n\nThat being said, make no mistake, if we ever meet, I will give you … a big hug, cause you must be really lonely, sad and angry at yourself to choose to do such things to others…\n\nBelieve in yourself and others friends, and our lives will become lighter to carry and the world a better place!\n\n \n\nPeace\n\nTheos", "timestamp_created": 1499162614, "timestamp_updated": 1499162614, "voted_up": true, "votes_up": 37, "votes_funny": 8, "weighted_vote_score": "0.770380139350891113", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "121947165": {"recommendationid": "121947165", "author": {"steamid": "76561198029558376", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 19, "playtime_last_two_weeks": 0, "playtime_at_review": 19, "last_played": 1546562776}, "language": "english", "review": "not finished and abandoned devs moved on to a new game. deffo devs and publisher to avoid", "timestamp_created": 1662671583, "timestamp_updated": 1662671823, "voted_up": false, "votes_up": 46, "votes_funny": 0, "weighted_vote_score": "0.770217776298522949", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "108883904": {"recommendationid": "108883904", "author": {"steamid": "76561198348314648", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 198, "playtime_last_two_weeks": 0, "playtime_at_review": 198, "last_played": 1643216901}, "language": "english", "review": "Needs friends to play with. If you are alone willing to find someone in the game, forget about it. They removed servers and now you can only create your own. Game is pretty much dead. Wont recommend.", "timestamp_created": 1643297864, "timestamp_updated": 1643297864, "voted_up": false, "votes_up": 53, "votes_funny": 2, "weighted_vote_score": "0.769368767738342285", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43699075": {"recommendationid": "43699075", "author": {"steamid": "76561198023662250", "num_games_owned": 428, "num_reviews": 18, "playtime_forever": 1510, "playtime_last_two_weeks": 0, "playtime_at_review": 1030, "last_played": 1535128698}, "language": "english", "review": "First of all, it's an epic game for people who always say ''I wish The Long Dark was multiplayer''.\n+ Very user friendly interface. \n+ Lovely graphics, tons of craftable items.\n+ Great storyline.\n\n- Day-Night cycle is too fast. It messes things up and quickly makes you feel exhausted.", "timestamp_created": 1532354933, "timestamp_updated": 1532354933, "voted_up": true, "votes_up": 26, "votes_funny": 1, "weighted_vote_score": "0.767908096313476563", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "69639141": {"recommendationid": "69639141", "author": {"steamid": "76561198088609971", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 4140, "playtime_last_two_weeks": 0, "playtime_at_review": 4140, "last_played": 1563461468}, "language": "english", "review": "I wouldn't  have bought this game if I knew what was going to happen to it.\n\nA game with huge potential, abandoned by devs after they sold the game to HypeTrain Digital. Playable as single player, but it still lacks content and has pretty major bugs that render it unsuitable for multiplayer games.", "timestamp_created": 1590199985, "timestamp_updated": 1590199985, "voted_up": false, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.757196187973022461", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "51518765": {"recommendationid": "51518765", "author": {"steamid": "76561198024056355", "num_games_owned": 121, "num_reviews": 3, "playtime_forever": 788, "playtime_last_two_weeks": 0, "playtime_at_review": 122, "last_played": 1563412426}, "language": "english", "review": "Interesting and fun survival mechanics and environment but so impossible to play at the moment without bugs.\n\nBought and played the game with 2 other friends. The main bug that made us stop playing was getting stuck on the loading screen after trying to load in from a lobby. If we did load in we were met with desynch bugs where we couldn't see each other or we couldn't interact with the environment of the host. Really upsetting because I could easily get addicted and enjoy a game like this. Seriously looking forward to some phat updates that make it at least playable.", "timestamp_created": 1561707523, "timestamp_updated": 1561707523, "voted_up": false, "votes_up": 43, "votes_funny": 2, "weighted_vote_score": "0.755495965480804443", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "30139481": {"recommendationid": "30139481", "author": {"steamid": "76561198139057588", "num_games_owned": 2533, "num_reviews": 116, "playtime_forever": 690, "playtime_last_two_weeks": 0, "playtime_at_review": 685, "last_played": 1501402081}, "language": "english", "review": "it's like the son of the long dark and don't starve together, but it's getting repetitive too soon.", "timestamp_created": 1487937964, "timestamp_updated": 1487937964, "voted_up": true, "votes_up": 50, "votes_funny": 3, "weighted_vote_score": "0.755088865756988525", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "55447249": {"recommendationid": "55447249", "author": {"steamid": "76561198165800884", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 7300, "playtime_last_two_weeks": 0, "playtime_at_review": 4434, "last_played": 1651683219}, "language": "english", "review": "Even with 1.0.13 update this thing is bugged as hell.", "timestamp_created": 1570216609, "timestamp_updated": 1574825007, "voted_up": false, "votes_up": 106, "votes_funny": 4, "weighted_vote_score": "0.753206491470336914", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1570452010, "developer_response": "Hello! Thank you for reaching out.\n\nWe would love to hear from you more details about the problems you've encountered.\nIf you prefer e-mail, you may contact us at support@hypetraindigital.com.\n\nYour feedback will go a long way towards improving the game and fixing the issues you’ve experienced!"}, "40667234": {"recommendationid": "40667234", "author": {"steamid": "76561198012770553", "num_games_owned": 235, "num_reviews": 80, "playtime_forever": 4138, "playtime_last_two_weeks": 0, "playtime_at_review": 2507, "last_played": 1689439084}, "language": "english", "review": "Was sold off to a company that is butchering the game in direction, content, and mechanics. If I knew they would change the game this much for the worse I would not have bought it but seeing as how you can't tell the future with these things I'm stuck with a mutation of a game I really enjoyed. \n It started with the addition of the spirt and how they put a stupid pumpkin head on the thing for the holidays...that was just so tacky and took away from the feel of the story. Now the controls are all messed up with the way you have to switch to your rock as a \"held\" item, then charge a throw with a max of about 6 throws before theres some sort of \"stamina\" bar that needs to regenerate. Assuming you hit your animal target, they will be stunned for about 2-3 secs giving you enough time to switch back to your other held item (some weapon, axe, or pick) and close almost no distance as you then have to switch back as the animal comes too and runs off. \n Everything about this game yells wasted potential and it really stinks to think about that.", "timestamp_created": 1520549193, "timestamp_updated": 1520549193, "voted_up": false, "votes_up": 49, "votes_funny": 0, "weighted_vote_score": "0.751924395561218262", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1522839387, "developer_response": "First off, thank you for your constructive and detailed feedback! \n\nHypeTrain Digital was involved in the development of the Wild Eight from the very beginning. The new development team’s main aim is for the original vision of The Wild Eight to remain intact, while adding new features and content based on both numerous tests, as well as player feedback. \nSome of the recent patches have directly addressed the issues you mention in your review -  for example, Throwing Stones no longer use Stamina. \nMost of the team is now focused on re-working the Network system - this will eliminate issues with synchronization, caused by unoptimised code. Click here for more info on this subject: \nhttp://steamcommunity.com/games/526160/announcements/detail/1641996806291123080\n\nWith the work on Network system over, the team will resume creating new content for the game - resources, quests, items, new locations etc. We can’t reveal them yet, but we’ve got some big things in store! \n\nHope to see you back in the Alaskan wilds soon, having a great time with The Wild Eight! \n"}, "137160398": {"recommendationid": "137160398", "author": {"steamid": "76561198059504895", "num_games_owned": 0, "num_reviews": 24, "playtime_forever": 2136, "playtime_last_two_weeks": 0, "playtime_at_review": 2136, "last_played": 1571716802}, "language": "english", "review": "It is a great game worth a solid 20+ hrs, unfortunately their was an upheaval with the devs so it will never be finished.  Sucks cus my bro and I had a lot of fun with it and it has some solidly great game play, mechanics, and story.  Depending on the cost it'd be worth a few $$$ still but as stated before it died before it could bear fruit which is a huge downer...", "timestamp_created": 1682240099, "timestamp_updated": 1682240099, "voted_up": false, "votes_up": 21, "votes_funny": 0, "weighted_vote_score": "0.745257794857025146", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "118461749": {"recommendationid": "118461749", "author": {"steamid": "76561199007711532", "num_games_owned": 130, "num_reviews": 40, "playtime_forever": 11, "playtime_last_two_weeks": 0, "playtime_at_review": 11, "last_played": 1654361242}, "language": "english", "review": "game devlopers left just like my dad", "timestamp_created": 1657300367, "timestamp_updated": 1657300367, "voted_up": false, "votes_up": 42, "votes_funny": 35, "weighted_vote_score": "0.743234813213348389", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "85686234": {"recommendationid": "85686234", "author": {"steamid": "76561198026397941", "num_games_owned": 2262, "num_reviews": 109, "playtime_forever": 1034, "playtime_last_two_weeks": 0, "playtime_at_review": 1034, "last_played": 1612091041}, "language": "english", "review": "A good amount of potential and some decent survival gameplay with friends. Some resources are too scarce for larger numbers of players, so a low 2-4 seems best. The second half of the game is rushed, nonsensical and seems to be unfinished. You walk into a building are provided with a bunch of objectives but can ignore all of it and just press two buttons to finish the game, with no real ending, just cut to credits.", "timestamp_created": 1612091288, "timestamp_updated": 1612091288, "voted_up": false, "votes_up": 31, "votes_funny": 0, "weighted_vote_score": "0.74312746524810791", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "50154635": {"recommendationid": "50154635", "author": {"steamid": "76561198302003495", "num_games_owned": 79, "num_reviews": 10, "playtime_forever": 2263, "playtime_last_two_weeks": 0, "playtime_at_review": 1973, "last_played": 1629526544}, "language": "english", "review": "This game is the definition of a love/hate relationship.\n\nYou'll love it because of the unique environment, entertaining quests, and fun times playing multiplayer with friends. \n\nYou'll hate it because you run into a bug at least every five minuets; many times a quest breaking and rendering it unable to be completed. \n\nIf you are on the fence about this game, I would wait until a later release when the game is more stable. I'm writing this at the time of the 0.10.188 build. I was playing with my sister and we experienced a total of 4 game breaking bugs in a matter of 6 hours of total game time. Still love the game to death though.", "timestamp_created": 1555387160, "timestamp_updated": 1555387160, "voted_up": true, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.741280972957611084", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1555603160, "developer_response": "Hello!\n\nThank you for the feedback. If possible, we would like to learn more about the problems you’ve encountered. We’ve added you to the friend list on Steam and waiting for your response. \n\nIf you don’t feel comfortable carrying the conversation to the private messages, you can create a discussion topic here: https://steamcommunity.com/app/526160/discussions/0/ , or send us an email to support@hypetraindigital.com . \n\nWe would really appreciate, if you could get in touch with us and help solve these issues and bring our players better gaming experience."}, "47733340": {"recommendationid": "47733340", "author": {"steamid": "76561198068351675", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 1532, "playtime_last_two_weeks": 0, "playtime_at_review": 1208, "last_played": 1600546868}, "language": "english", "review": "I love this game so much, i thoroughly enjoy the content and story it has to offer, but all the bugs make it unplayable. I will play for hours just to lose most of my items and progress I make from dieing randomly, chests locking so you cant open them, items floating, getting stuck, falling through the map, and one time I had the Emergency Transit System just completely stop working. I really want to play this game but everytime I lose a lot of items and have to restart over and over, its draining my desire to continue playing.", "timestamp_created": 1545543768, "timestamp_updated": 1545543768, "voted_up": false, "votes_up": 36, "votes_funny": 3, "weighted_vote_score": "0.740212559700012207", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "55383143": {"recommendationid": "55383143", "author": {"steamid": "76561198062603303", "num_games_owned": 0, "num_reviews": 254, "playtime_forever": 362, "playtime_last_two_weeks": 0, "playtime_at_review": 362, "last_played": 1569948424}, "language": "english", "review": "Bought it when it first came out and had to stop playing due to bugs.\n\nThe bugs are still there.", "timestamp_created": 1569948637, "timestamp_updated": 1569948637, "voted_up": false, "votes_up": 121, "votes_funny": 8, "weighted_vote_score": "0.73986738920211792", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "40163540": {"recommendationid": "40163540", "author": {"steamid": "76561198045520610", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 4139, "playtime_last_two_weeks": 0, "playtime_at_review": 2778, "last_played": 1675043169}, "language": "english", "review": "This game is fun with friends, I never played with randoms. I got my 4 friends to play this with me and had a blast from beginning to end. Just wish this game got more content. Played it start to finish three times or so. Found all the secrets and explored the whole map. After that not much to do. First time players though will have a blast.\n\nThis game is like The Long Dark with less Single Player and more Multiplayer.", "timestamp_created": 1518886985, "timestamp_updated": 1518886985, "voted_up": true, "votes_up": 32, "votes_funny": 0, "weighted_vote_score": "0.739690005779266357", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "79038667": {"recommendationid": "79038667", "author": {"steamid": "76561198261886133", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 535, "playtime_last_two_weeks": 0, "playtime_at_review": 535, "last_played": 1584825818}, "language": "english", "review": "As mentioned in many other reviews, this game feels unfinished, is riddled with bugs, and overall leaves much to be desired. The game was personally very fun to play at first, but after some hours of playing, the frustration from bugs and lack of basic in-game functions got the better of me. The design and concept had such potential. I would not recommend getting the game in its current state.", "timestamp_created": 1604998883, "timestamp_updated": 1604998883, "voted_up": false, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.732535660266876221", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "93837309": {"recommendationid": "93837309", "author": {"steamid": "76561198164920015", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 536, "playtime_last_two_weeks": 0, "playtime_at_review": 536, "last_played": 1623821057}, "language": "english", "review": "The game was declared finished by developers, however, there are many bugs they didn't care to fix for co-op. There are teleporting hostile mobs, when you upgrade a skill, it doesn't register/apply if you are a player on someone else's server. Items will randomly disappear. It has overall fun gameplay if the bugs are not messing with it. However... The endings... make all the work not worth it.", "timestamp_created": 1623821598, "timestamp_updated": 1623821598, "voted_up": false, "votes_up": 32, "votes_funny": 0, "weighted_vote_score": "0.731404244899749756", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "48945549": {"recommendationid": "48945549", "author": {"steamid": "76561198089514832", "num_games_owned": 564, "num_reviews": 4, "playtime_forever": 13413, "playtime_last_two_weeks": 0, "playtime_at_review": 10390, "last_played": 1689615217}, "language": "english", "review": "short version - if you like survival/crafting games and understand what early access means, get it and play solo if you want the game to be challenging. pay no attention to the negative reviews from people that bought it just before a buggy update, its just bad timing for them. \n\nslightly longer version - if you know what it takes to make a game, you will understand that bugs happen every update, and can affect an entirely separate part of the game that previously worked fine. This is the nature of bugs and early access, they can only be found by actually playing the game, being a part of early access allows you to be a part of this process. Leaving a negative review for reasons that are addressed before you agree to participate in an early access project only hinders their ability to improve the game as you are putting people off becoming a part of this process. actively reporting bugs is a good thing, whereas stating that yes, indeed there are bugs in an \"Early Access review of the game\" after you've played the game for a total of thirty minutes helps no one. Yes, bugs are annoying, yet more annoying to debug. on a rare occasion, a roll back to the previous version is required and start again from scratch, this happens with Windows updates all the time, they frequently break your PC in a variety of different ways and you have to play the part of debugger yourself. Be patient with the Developers, bugs take time to solve and annoy them more than they annoy you. I remember many moons ago going through pages of code line by line for hours trying to understand why it wasn't working, in the end my co-programmer had missed a semicolon at the end of one line of code. fun times.", "timestamp_created": 1549968019, "timestamp_updated": 1549968019, "voted_up": true, "votes_up": 30, "votes_funny": 1, "weighted_vote_score": "0.727602303028106689", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "56757101": {"recommendationid": "56757101", "author": {"steamid": "76561198171033130", "num_games_owned": 457, "num_reviews": 376, "playtime_forever": 90, "playtime_last_two_weeks": 0, "playtime_at_review": 90, "last_played": 1573216150}, "language": "english", "review": "Shallow and poorly designed as a survival game, boring and repetitive as an adventure game.\n\nAs a survival game, the survival aspect basically means you have to periodically slaughter random animals and eat their flesh. That's it, there's really nothing further required to perpetually sustain your hunger. If the animal doesn't fight back you just have to chase it down and beat it to death, if it does fight back you can heal the damage by eating its flesh after it's dead. To keep warm all you have to do is periodically build a fire out of extremely basic resources you get from punching trees, stand by the fire for a brief period and now you're warm again. That's it, that's all the survival. There is a crafting system but you find so many premade items in buildings that there's little point to it. By the way, was playing on the highest difficulty which the developers claim is meant for experienced players. Yet was easily able to perpetually survive with basic beginner knowledge of the most rudimentary systems of the game that's how imbalanced it is.\n\nAs an adventure game, all you do is run around the wilderness tracking down quest locations where you then acquire a new quest marker that leads you to a random somewhere else. That's basically it, yet again. All you do is just wander around the extremely visually repetitive wilderness looting generic points of interest while you knock off vague quest objectives.\n\nThe combat is lazy, and boring. Can't really dodge enemy attacks or perform any kind of actual combat at all. You just hit the enemy until they die while they hit you until they die, it's just a damage race. Aiming attacks is awkward, the hitboxes are awkward and overly small. Can't even stealth or try to preemptively avoid enemies since they see you immediately, yet they're barely a threat since all you have to do is outrun them or juke them around an obstruction with little effort to get away.\n\nThere's little depth to the game systems at all. There's not much point to craft many things, to make traps or perform any traditional survival strategies or varied gameplay mechanics. Just wander around damage racing animals to death and looting quest locations. There is a level up system but the perks you unlock are extremely generic and uninteresting, the unlocking system is very poorly paced and in general you can unlock stuff almost as fast as it is made available.\n\nThe game is filled with lots of little glitches, even after the game has undergone an extensive early access and also has been patched aggressively since launch because it was so glitchy.\n\nWorst of all really though is how absolutely stupid this game is on a design level. You can't craft sticks without a workshop, you can't craft sticks. You can't craft throwing rocks, out of rocks, without a workshop. You can create a workshop with your bare hands but you can't turn rocks into throwing rocks without a workshop. By the way throwing rocks are just rocks but with a slightly different graphic. You can't craft any tools without a workshop yet you can only make one workshop, so if you want to take it with you you have to set it up and pack it up every single time you want to craft. The same applies to your level up station, you can only make one of it and have to unpack and repack it everytime you want to use it. Alternatively you can anchor your base to one location, that location probably being the hub bunker that you find almost immediately after crash landing into the wilderness that sure is convenient. You can't build your structures in the hub bunker where it's warm and modern though, you have to build your camp outside the hub bunker and sit out in the cold while a fully furnished research bunker with a living room that has couches and tables is directly beside you. And again, even if you choose to set up a base the cosmos won't allow you to build anymore workshops or level up stations so that becomes the only place you can perform basic character functions. This is all just so dumb conceptually.\n\nAlso rabbits are immune to being stunned by a rock being thrown at them. The description of throwing rocks is that they can be used to stun animals, yet one of the smallest most vulnerable animals in the wilderness is immune to them. And boars are immune to tasers. So what is the point of trying to stun anything or do anything even remotely interesting when it takes more effort and doesn't work, versus just running up to the animal and murdering it with a baseball bat.\n\nWalking against a solid object won't cause your character to stop walking, they'll just keep walking in place. There's no fluctuation in the characters animations for how fast they are walking, slow walking and running have the same animation. You can slip and fly off a ledge at absurd velocities, and the game calculates your fall damage based on how long you fall regardless of whether you fall down vertically or diagonally. So if you fall off a two meter drop, but get flung off diagonally for six meters because of the broken physics; the game will act as if you straight up fell six meters and damages you accordingly. When food on the fire is done cooking, it just falls onto the ground unceremoniously. All of the above are very basic quality flaws that competent developers routinely avoid. Even something so amateurish as the game visibly spawning players in the air at the start of each map, which is how developers stop players from potentially phasing through the floor on spawn but competent developers find a way to hide it. Spawning the player visibly in the air so that they fall down a foot as the game loads them into the map is something you see in shoddy free games.\n\nThe pacing of the whole thing is just bad, wake up from a plane crash with no real exposition. Immediately find bunkers and science labs in the wilderness with no exposition. Immediately set out on a quest to perpetually track down new bunkers over and over with no exposition. There's nothing interesting or engaging about any of this on a story based level. Giant green misty barrels of goofy toxic sludge with an anthropomorphic wolf guarding them, how is any of this meant to be taken seriously or be immersive at all.\n\nThere's eight characters and only two of them are female. Caucasian female or not caucasian female. What variety.\n\n\nThis is just really not good. As a survival game it's lazy, extremely imbalanced and shallow. As an adventure game it's lazy, extremely boring and shallow. Filled with glitches and completely asinine, backwards design features in general. This costs twice as much as Don't Starve Together, which offers far more content and far more interesting gameplay and is still actively being updated with new content. I'm really disappointed that I bought this ahead of release when it was on sale while I waited for it to leave early access, this was a complete and total waste of that fifteen dollars. This is just not a game that should cost money, on nearly every level it is beyond amateurish both in design and implementation.", "timestamp_created": 1573218507, "timestamp_updated": 1575468686, "voted_up": false, "votes_up": 60, "votes_funny": 4, "weighted_vote_score": "0.72716444730758667", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "61982600": {"recommendationid": "61982600", "author": {"steamid": "76561198074151686", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 123, "playtime_last_two_weeks": 0, "playtime_at_review": 123, "last_played": 1577571089}, "language": "english", "review": "I really wanted to like this game, I really did, first bought it because it reminded me a lot of a 3rd person The Long Dark, got it for a friend as well because it was coop and thought we were gonna have fun surviving in it together. Well we didn't have fun, the controls and management of the game is just horrible, almost unplayable and very frustrating. So I was waiting and waiting and waiting for an update that would fix wildlife running in the air, stun from throw stones lasting less time than it takes you to even get into the melee range to hit anything and the fact that you basically have to \"cheat\" to build up enough food to survive through constant respawning is just mindboggling. Graphics are nice, bugs and  poor playability years after release are not.", "timestamp_created": 1579275000, "timestamp_updated": 1579275000, "voted_up": false, "votes_up": 47, "votes_funny": 2, "weighted_vote_score": "0.727095842361450195", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "91660633": {"recommendationid": "91660633", "author": {"steamid": "76561198085400206", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 600, "playtime_last_two_weeks": 0, "playtime_at_review": 600, "last_played": 1620496758}, "language": "english", "review": "This could have been a great game. Even with the bugs I had a lot of fun with it. The game ends at 52% of the story (at least for me and my friend). \n\nIf the devs had cleared up the major bugs and finished the game, I would very much recommend it. Unfortunately, it is abandoned. The funniest part is them thanking their kickstarter backers in the credits. Somehow I doubt they feel happy about your results.", "timestamp_created": 1620497055, "timestamp_updated": 1620497055, "voted_up": false, "votes_up": 23, "votes_funny": 3, "weighted_vote_score": "0.726451754570007324", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "41767052": {"recommendationid": "41767052", "author": {"steamid": "76561198288803223", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 186, "playtime_last_two_weeks": 0, "playtime_at_review": 186, "last_played": 1525057176}, "language": "english", "review": "Very disappointing. concept is great but the game is low quality in movement and controls, you couldn't do certain quests for bugs and couldn't revive players. after 3 hours it was very frustraiting. Basically it is a game about eating. Even over warmth is eat. every 2-5 minutes you will eat. and it gets boring and repetitive you search for food cook food and eat, die from a pack of wolves that are way OP. because you can't see them in the trees due to the graphics so as you swing for the wolf you chop a tree instead. You Die then run from the start pick up your gear that breaks pretty fast and eat again.  animal traps don't work. boots disappear quickly and waste material and time you need for eating so I just never wore shoes. don't waste your money. Disappointed that the game makers think this is how Alaska is! it should be named the Hungry Eight instead of the the Wild Eight.", "timestamp_created": 1525058349, "timestamp_updated": 1525058349, "voted_up": false, "votes_up": 112, "votes_funny": 36, "weighted_vote_score": "0.724468588829040527", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "121106967": {"recommendationid": "121106967", "author": {"steamid": "76561198059205106", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 284, "playtime_last_two_weeks": 0, "playtime_at_review": 284, "last_played": 1630777413}, "language": "english", "review": "The game was abandoned.", "timestamp_created": 1661253885, "timestamp_updated": 1661253885, "voted_up": false, "votes_up": 33, "votes_funny": 0, "weighted_vote_score": "0.722002804279327393", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "131870239": {"recommendationid": "131870239", "author": {"steamid": "76561197991009575", "num_games_owned": 0, "num_reviews": 89, "playtime_forever": 134, "playtime_last_two_weeks": 0, "playtime_at_review": 134, "last_played": 1545159048}, "language": "english", "review": "Boring game, scammy company.", "timestamp_created": 1675086124, "timestamp_updated": 1675086124, "voted_up": false, "votes_up": 89, "votes_funny": 1, "weighted_vote_score": "0.718406081199645996", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "30613949": {"recommendationid": "30613949", "author": {"steamid": "76561198147974779", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 264, "playtime_last_two_weeks": 0, "playtime_at_review": 175, "last_played": 1489940483}, "language": "english", "review": "Friend: Hey do we still have that medkit i'm really low\nMe: Sure here you go \n*right clicks*\n*Medkit hits friend*\n*friend dies of impact*\n10/10 would kill somebody with a medkit again", "timestamp_created": 1489925595, "timestamp_updated": 1489925595, "voted_up": true, "votes_up": 25, "votes_funny": 103, "weighted_vote_score": "0.71699368953704834", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "152476282": {"recommendationid": "152476282", "author": {"steamid": "76561198073554730", "num_games_owned": 261, "num_reviews": 68, "playtime_forever": 445, "playtime_last_two_weeks": 0, "playtime_at_review": 445, "last_played": 1677429144}, "language": "english", "review": "Don't buy this. It's pretty much unfinished.", "timestamp_created": 1701209404, "timestamp_updated": 1701209404, "voted_up": false, "votes_up": 65, "votes_funny": 0, "weighted_vote_score": "0.716319680213928223", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "29848659": {"recommendationid": "29848659", "author": {"steamid": "76561198067093461", "num_games_owned": 451, "num_reviews": 10, "playtime_forever": 1184, "playtime_last_two_weeks": 0, "playtime_at_review": 688, "last_played": 1527203828}, "language": "english", "review": "This game is very promising. It was supposed to be released as finished but instead came out in early access and that's okay. Although, the game is very punishing, it can be fun with a few friends as well. I was playing with three other friends and I reached day 31 before we all got off. I do agree that vitals go down too fast, but it's not really because they go down too fast, it's that days go by too fast. The way hunger progresses is how long you've gone without eating so if you eat at 8am, you may need to eat again around 6pm, which is realistic, but if time went by slower, making days and nights longer, it would fix this problem, and I think that people fail to realize that it's time going by too fast, not the hunger and heat. Overall, this game is very fun once you get the hang of it and there's an interesting story too!", "timestamp_created": 1486822704, "timestamp_updated": 1486822704, "voted_up": true, "votes_up": 25, "votes_funny": 0, "weighted_vote_score": "0.715363860130310059", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "29827750": {"recommendationid": "29827750", "author": {"steamid": "76561198054503824", "num_games_owned": 669, "num_reviews": 35, "playtime_forever": 1253, "playtime_last_two_weeks": 0, "playtime_at_review": 1171, "last_played": 1497771359}, "language": "english", "review": "The Wild Eight is a low-poly survival/crafting game. Your plane has crashed in Alaska and it's up to you and anyone else who is alive (up to 8 players, obviously) to gather supplies and survive the harsh environment. \n\n\n[h1][b]++PROS++:[/b][/h1] \n\n\t+Graphics. This is obviously personal preference, but the graphic styling of this title is a low-poly/high-res mashup that works all too well, creating a very unique feel.\n\t\n\t+Audio! The soundtrack to this game is rather enjoyable. I sat in the title screen for a minute waiting for a buddy to setup a server and was surprised that the track playing was actually creating a sense of anxiety...perhaps foreshadowing.\n        \n        +Cannibalism! Do I really need to explain? I may or may not have eaten my brother...\n\n\t+Explore your map and push the limits of staying away from camp. Everytime you think you have enough food and inventory slots unlocked, the wind and wolves will remind you otherwise.\n\t\n\t+Collect cooperatively. Set up a battle plan and assign roles to your group instantly. A buddy and I survived 26 days (a 3 hour play session) by having him hunt/build traps while I ran around and gathered the necessary supplies to craft said traps.\n\n\t+Crafting is splendid, even in Early Access. It comes across as a little shallow at first (if you have played any other titles in the survival genre), but that's something I'm willing to accept considering the current game state. If you finally start to get ahead and have a nice little stock pile of supplies and food, start putting out storage chests at camp. Lumber and ore are the big players currently, collecting these in combination with unlocking different crafting recipes in your workshop allows the upgrading of your tools and structures: (axe and pickaxe--->Bone Axe/Bone pickaxe, etc.).\n\t \n\t+You'll have to hunt. Right now hunting is basically crafting stun rocks and hurling these stones of stun at unsuspecting wildlife and then sprinting up and beating them OR you can set up a flurry of traps and 'herd' the animals into them. It currently takes about 3 traps to knock a full health animal down into chow. \n\n\t+Skill Points/Skill Tree is realistic. You can level up your mobility(speed/sprint), your backpack's inventory capacity, the drop rate from animals/resources,etc. The way I see this is the longer you have survived, your character 'hardens' up. Can carry more, run faster for longer, etc.\n\n\t+There are actually quests! So surviving was hard enough, right? Now you have the opportunity to follow side quests and explore abandoned facilities, settlements and labs. This adds a level of depth to the game which isn't 'needed' but is definitely appreciated.\n\n\t+It's hard. That's right, I said it. You will get frustrated, you will panic, you will die. Accept this and try your best. Try not to freeze to death as you venture out.(hint: build a campfire right behind the resources you are harvesting and then you can work, relatively safe and relatively warm). If you die, that's it. You lose all that hard work you put into leveling up.\n\n[h1][b]--CONS--:[/b][/h1]\n\t-Multiplayer servers (as stated in other reviews) were maxed out and this caused connectivity issues. The devs however have actively replied on the forums and stated that they are aware of such and are putting more servers online. \n\n\n[h1][b]Last words:[/b][/h1] One of the few early access titles that I would actually encourage players to buy. Even in it's early access state, this game is worth every penny($19.99). I can't wait to watch The Wild Eight continue to grow/update and 'survive' the sh*tstorm of disappointing Early Access survival titles that plague the Steam Marketplace at the moment. Do yourself a favor (especially if you like hard games) and get this gem asap.\n\n\n[h1][i][b]**REVIEW UPDATE AS OF 2/17/2017**[/b][/i][/h1]\nThanks to 2 or 3 patches: (these are some of the updates that I've personally appreciated and noticed in game) \nYou can now load a saved game without breaking UI.\nYou can also select a region when joining or creating a server.\nAnimals and buildings have all experienced multiple upgrades (buildings now provide immunity from blizzards and additional 50% cold defense and animals that have less than 25% HP are inflicted with a -30% speed debuff.)\nWeapons have had their bleed/stun chances altered(increased).\nEASY MODE IS AVAILABLE...that's right. If you thought the game was too hard originally, this option now exists. The effects of cold and hunger are reduced and you don't lose skills and structure levels upon dying.\nCampfire's have HP (something so simple being so game changing).\n\nOf course there are more bugs that have been fixed, items updated, etc. Make sure to check out the patch notes frequently. This game is moving fast. The devs are A+ in my opinion!\n\n[h1]Check out the FAQ:[/h1] [i]http://steamcommunity.com/app/526160/discussions/0/135508489637089295/[/i]\n\n[h1]Updates (since release into EA):[/h1]\n[i]http://steamcommunity.com/games/526160/announcements/detail/240217180981959374\n   http://steamcommunity.com/games/526160/announcements/detail/240217512921348745\n   http://steamcommunity.com/games/526160/announcements/detail/240217512933006981", "timestamp_created": 1486745479, "timestamp_updated": 1487352450, "voted_up": true, "votes_up": 55, "votes_funny": 1, "weighted_vote_score": "0.714843153953552246", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "68087437": {"recommendationid": "68087437", "author": {"steamid": "76561198101929198", "num_games_owned": 139, "num_reviews": 8, "playtime_forever": 2484, "playtime_last_two_weeks": 0, "playtime_at_review": 2484, "last_played": 1573363346}, "language": "english", "review": "Game was abandoned by developers. Don't bother with it.", "timestamp_created": 1587943532, "timestamp_updated": 1587943532, "voted_up": false, "votes_up": 37, "votes_funny": 2, "weighted_vote_score": "0.713300228118896484", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "108987898": {"recommendationid": "108987898", "author": {"steamid": "76561198359634052", "num_games_owned": 188, "num_reviews": 26, "playtime_forever": 2285, "playtime_last_two_weeks": 0, "playtime_at_review": 1084, "last_played": 1706062051}, "language": "english", "review": "I don't feel bad playing a half baked game, but after pouring a few hours in after playing with a friend and on solo.... it starts to lack content. It's mysterious at the beginning, and it really captures the essence of being isolated, hungry and always on the lookout for dangers,... \nMy friend and I encountered a few glitches that are not really game breaking, like taming a wolf (...) or being stuck on a \"tilted\" cliff, not being able to reclaim items after falling into a lake close to the end, magically losing items from the inventory, ... it's fine, it's still thumbs up... Even on Solo, it was enjoyable, but there are a lot of story items that are not explained, sometimes the mystery is just my own imagination running wild, as the actual fun part of the game is to roam around collecting, surviving.... the wild 8 is a game that gives you a story compass, but it is solely up to you, how you journey through this world and what you like to explore. There is no time limit, there are of course map boundaries, and that can be a good thing...but in retrospect, this game is not what I expected or what was advertised. The main story is not enough. The side stories can be great, but it just isn't enough. I would've liked, if there were some minimal bug fixes, some DLC content to utilize the large world...perhaps a little Easter eggs for future games.... I don't feel bad playing a half baked game - it's fine....", "timestamp_created": 1643422194, "timestamp_updated": 1676221332, "voted_up": false, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.71323847770690918", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "102526559": {"recommendationid": "102526559", "author": {"steamid": "76561198006525169", "num_games_owned": 0, "num_reviews": 144, "playtime_forever": 1340, "playtime_last_two_weeks": 0, "playtime_at_review": 942, "last_played": 1636675362}, "language": "english", "review": "Will I complete it? Probably. So why do I not recommend it? Because the game basically forces you to play coop, because it isn't balanced around single player. I'm playing it single player. So what are the issues?\n\n1. Even with maxxing out melee damage, and having the best weapon in the game (thus far, Mutant Battle Claws, which deal 20-24 base damage), you still do not deal enough damage per second to go toe to toe with a standard bear, much less mutant bears or werewolves. \n\n2. Even with maxxing out protection skills, wearing the best armor in the game (thus far, vapor armor), you cannot go toe to toe with bears, mutant bears, or werewolves. \n\n3. Each health upgrade only increases max hp by +5, from a base of 100. As a bear can hit for 30 damage, this increase is pitiful.\n\n4. Even with the pistol or shotgun, you cannot one-hit a bear, mutant bear, or werewolf, even with maxxed out ranged skills.\n\n5. There is a lot of walking or in my case, running from bears and werewolves, in this game. \n\n6. You cannot craft a lot of the lategame resources, such as scrap, or chemicals. You always have to find them, and you go through a lot of these. \n\n7. The tram system only allows you to visit already found locations, that you've turned the tram on. Why? Who knows. \n\n8. Stack sizes are really small. Base of 8 for most items. Ammo is set to 12. Most stack sizes do not increase with skill investment.\n\n9. It takes forever to earn skills. \n\n10. A lot of quest completion steps are very obtuse in how you need to complete them, and I've had to look up online for help for almost all of them. \n\n11. There are hidden stats that are not explained anywhere. Or they are broken. Hard to say which. Like Endurance. \n\n12. There are a variety of items with unknown purposes to them. Even online searches turned up nothing. Like Radioactive Canned Food. \n\n13. Every found note in the game is listed as Note #12. \n\n14. Some buildings you automatically warm up in, with no clear source of heat and others you lose heat in. Why this works in some and not others, I have no idea.\n\n15. You cannot place chests inside structures and most storage containers in structures have between 3-4 slots in them. Chests have a base of 15 and can be upgrade to a max of 25. \n\n16. Some resources are used only once in a crafting recipe. ie Wolf Claws or Fox Tails. After that, they have no point to them. \n\n17. You cannot craft any of the really nice weapons you find randomly. Like Machete, Harpoon, Combat Knife, etc... You also cannot craft any of the Vapor items or Combat Boots.\n\n18. There are way too many Werewolves and Mutant Bears around the place I'm at, and according to the game, I'm only at 40% completion. Both of these can almost kill me if I'm not careful, and have a medkit on hand for emergencies. \n\n19. You can only repair armor with the advanced repair kit, which requires a special blueprint to be found and requires way too much scrap and circuits, which are decently rare resources. This really discourages you from using Vapor armor, as once its gone, its gone. \n\n20. For some strange reason, boots wear down super fast, despite getting hit in the body a lot. The skill to reduce their wear and tear, doesn't seem to work, or requires all 5 points invested in it to work.\n\nI could go on, but you probably get the idea. There are a ton of little things that mar the game, and really make you realize that the game wants you to play coop and wants to make single player torturously hard to do. Otherwise, it has great ambience, atmosphere, and a decent survival loop, but its flaws makes me want to quit the game. But as I'm at day 98 now in single player, I've invested too much time now to quit and the story is starting to make sense.", "timestamp_created": 1636531974, "timestamp_updated": 1636531974, "voted_up": false, "votes_up": 66, "votes_funny": 6, "weighted_vote_score": "0.713138818740844727", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "96030851": {"recommendationid": "96030851", "author": {"steamid": "76561198435254622", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 150, "playtime_last_two_weeks": 0, "playtime_at_review": 150, "last_played": 1626661340}, "language": "english", "review": "The game is just too buggy to be played enjoyably. A friend and I got into it trying to have a good time, but we encountered a bug within the first second of playtime that prevented my friend from starting the tutorial. We had to stop and reload the server, at which point we enjoyed about 3 minutes of bugless playtime before the game broke some more. In 2 hours we experienced constant bugs with desync, forcing us to quit and reload the game and losing progress. The game didn't even notify us when the desync got so bad that one of us was disconnected. The game feels like it was meant to be played on a phone and not with any serious expectations for fun.", "timestamp_created": 1626717817, "timestamp_updated": 1626717817, "voted_up": false, "votes_up": 31, "votes_funny": 0, "weighted_vote_score": "0.711736440658569336", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "29790515": {"recommendationid": "29790515", "author": {"steamid": "76561198009704277", "num_games_owned": 607, "num_reviews": 22, "playtime_forever": 718, "playtime_last_two_weeks": 0, "playtime_at_review": 571, "last_played": 1487534961}, "language": "english", "review": "So far, so good! It's as if Don't Starve and The Long Dark (which I both love) had a child. The minimalistic polygon graphics makes the game look much better than the other games in the genre, which try and fail to look realistic. Sound design is also quality: the ambience of chilly winds and the cracking fire, a wolf howl in the distance - all make it a pleasanty lonesome experience. The gameplay is solid, very intuitive and a perfect base to implement more complex mechanics upon. I dare to say that this game beats every other early access survival game in terms of polish. I haven't encountered any bugs just yet, runs well and smooth on my system. Didn't have the chance to play co-op, but that should make the game much more entertaining.\n\nSo far, the only thing that is in need of improvement is hunger. This stat needs balancing as you get hungry way too quickly. This issue has already been addressed by the developer and will get fixed soon. Also, I wish the time spent sleeping was more sped up, as it's not that interesting to spend a few minutes IRL just doing nothing and waiting for a blizzard or the night to pass.\n\nCongratulations on the launch, dear developers. Now keep on working on this game, implementing new features, expanding the story and you'll have a potential winner. Cheers!", "timestamp_created": 1486592159, "timestamp_updated": 1486639373, "voted_up": true, "votes_up": 36, "votes_funny": 2, "weighted_vote_score": "0.708533406257629395", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "153019142": {"recommendationid": "153019142", "author": {"steamid": "76561198077801547", "num_games_owned": 174, "num_reviews": 3, "playtime_forever": 2016, "playtime_last_two_weeks": 0, "playtime_at_review": 2016, "last_played": 1701910637}, "language": "english", "review": "The start of the game, especially with friends is fun. Me and my best friend are loot goblins and walked every inch of the map checked everything left no stone unturned, however near the end of the game it was garbage. It felt rushed left more questions than answers and not in a good way. There was tons of bugs and glitches, instances where missions that you've completed were left uncompleted, my friend or myself couldn't get to certain places if the other was too far because the game doesn't register. It feels more complete than when I first got it, but it is still a  buggy mess. \n\nSide bar, why even have a mission to help someone out of the arcade, when it literally cannot be done?? \nFighting was a disaster, co-op was a disaster I'd pass on this game if you want to save your sanity.", "timestamp_created": 1701911310, "timestamp_updated": 1701911310, "voted_up": false, "votes_up": 38, "votes_funny": 0, "weighted_vote_score": "0.708386540412902832", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "29788749": {"recommendationid": "29788749", "author": {"steamid": "76561198020085437", "num_games_owned": 1081, "num_reviews": 400, "playtime_forever": 4940, "playtime_last_two_weeks": 0, "playtime_at_review": 1312, "last_played": 1546195136}, "language": "english", "review": "The Wild Eight is a gorgeous low poly Survival game.\nChop trees, Craft, Hunt, Stay warm.\nIts tough in early game, you can die easy.\nThe nights are cold and dangerous, you start out as weak and fragile. Heres a few beginner tips.\nStay put a few days to prepare by the plane (you can get heat from the plane fire)\nUpgrade your tent and your Crafting station (pack them up when you leave and take them with you)\nAs you do stuff you will get points, spend the first in sprint (you will need that for hunting)\nCraft rocks to throw at animals, they stun them.\nGood luck :)\nhttps://youtu.be/hXunQA2Lld0\n", "timestamp_created": 1486585318, "timestamp_updated": 1486585318, "voted_up": true, "votes_up": 99, "votes_funny": 3, "weighted_vote_score": "0.707538604736328125", "comment_count": 7, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "73824807": {"recommendationid": "73824807", "author": {"steamid": "76561198022950565", "num_games_owned": 0, "num_reviews": 110, "playtime_forever": 4625, "playtime_last_two_weeks": 0, "playtime_at_review": 4625, "last_played": 1596410856}, "language": "english", "review": "Bought the game way before 2017 while it was on early access, it promised great gameplay and story. After all those years, I decided to play it in its final form and I am disappointed. Not only there are bugs but clunky mechanics, bland environment and time consuming traveling through the map destroys the fun. You can see the work and passion poured into the project and the exact moment when it was abandoned and exchanged with repetitive steps in order to finnish the story. \nAlso distasteful “ easter egg “ about Chris McCandless is something I find disturbing.", "timestamp_created": 1596649537, "timestamp_updated": 1596649537, "voted_up": false, "votes_up": 14, "votes_funny": 2, "weighted_vote_score": "0.699933409690856934", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "146515915": {"recommendationid": "146515915", "author": {"steamid": "76561198009794585", "num_games_owned": 1777, "num_reviews": 21, "playtime_forever": 1178, "playtime_last_two_weeks": 0, "playtime_at_review": 1178, "last_played": 1694940307}, "language": "english", "review": "I really wanted to like this, but it seems this is just yet another Early Access Unity Open World Survival Craft game.  The beginning feels promising, but then there is just this huge slump that requires grinding out materials and walking, walking, walking.  This clearly was not ready for 1.0, but the developers released anyway, and promptly abandoned the game.  There is no complexity, no logical progression, and simply no fun.", "timestamp_created": 1695012087, "timestamp_updated": 1695012087, "voted_up": false, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.69824683666229248", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "132572399": {"recommendationid": "132572399", "author": {"steamid": "76561198208427183", "num_games_owned": 291, "num_reviews": 25, "playtime_forever": 1817, "playtime_last_two_weeks": 0, "playtime_at_review": 1817, "last_played": 1670994642}, "language": "english", "review": "I Got a lot of game play and exploring for a relatively cheap game with me and my partner but the ending feels rushed and not the most rewarding, I liked the game a lot so it made it more disappointing, as the experience of leveling up and advancing felt alot of fun.", "timestamp_created": 1676074986, "timestamp_updated": 1676074986, "voted_up": true, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.696881532669067383", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "97427496": {"recommendationid": "97427496", "author": {"steamid": "76561198210543320", "num_games_owned": 211, "num_reviews": 9, "playtime_forever": 138, "playtime_last_two_weeks": 0, "playtime_at_review": 138, "last_played": 1628782369}, "language": "english", "review": "The Wild Eight - is about survival.\nThat survival, that we deserve. Everything gonna kill you: cold, starving, animals, and so on, like in the other survival games. But there are some differences: wolf not gonna die only because you a main character, and animals really dangerous. \nCraft system depends on building, that you could move any time, but its showing, that you should stay, make a camp with a bonfire and rest.\n\nSo game represents surviving on other point of view: you cant just run and run, ignoring difficulties: you should survive smart. \nGood looking low-poly graphics style & soft pleasant music will add a bit of comfort to your room, while you playing. Recommended to play in winter with cup of your favorite warm drink.", "timestamp_created": 1628783000, "timestamp_updated": 1628783000, "voted_up": true, "votes_up": 48, "votes_funny": 1, "weighted_vote_score": "0.695117533206939697", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "147533492": {"recommendationid": "147533492", "author": {"steamid": "76561197980010848", "num_games_owned": 846, "num_reviews": 29, "playtime_forever": 365, "playtime_last_two_weeks": 0, "playtime_at_review": 365, "last_played": 1488173518}, "language": "english", "review": "Abandoned by devs, sold off to publisher I believe. I wouldn't waste money on this, wasn't that great when it did work.", "timestamp_created": 1696290499, "timestamp_updated": 1696290499, "voted_up": false, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.692101478576660156", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "148045896": {"recommendationid": "148045896", "author": {"steamid": "76561199555970042", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 5, "playtime_last_two_weeks": 0, "playtime_at_review": 5, "last_played": 1697058021}, "language": "english", "review": "it could be good. but its abandoned and a lost hope. dont even buy it", "timestamp_created": 1697058165, "timestamp_updated": 1697058165, "voted_up": false, "votes_up": 25, "votes_funny": 0, "weighted_vote_score": "0.683665037155151367", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "129220835": {"recommendationid": "129220835", "author": {"steamid": "76561198153426430", "num_games_owned": 154, "num_reviews": 31, "playtime_forever": 1062, "playtime_last_two_weeks": 0, "playtime_at_review": 1062, "last_played": 1671938323}, "language": "english", "review": "The last update was in 2019, but i bought the game in 2022 thinking it was complete. It has issues that should have been fixed by now.\n\nSpecifically,\n-the bow misses shots if your target is slightly higher than you, because the aim isn't something you can control and it doesn't account for distance and arrow drop rate.\n-Items can't be deleted, and you'll get many junk items in the mid-late game. so i hope this doesn't hurt performence later, but i've had to just toss these items on the ground. they block your path and keep you from placing structures there.\n-Sometimes you miss an attack, and it's because the auto-aim has your character facing the oppisot direction of your target because it's really stupid sometimes. other times, you don't even know why you missed, but your ammo is gone none the less.\n-sometimes quest don't update, even though you did the latest task. it keeps telling me to loot a corpse that i already looted.\n\nSo being that they're still selling this game, i find it a bit scammy to not fix these issues that you will certainly notice.\n\nGameplay:\naside from those issues, it is a game that you can enjoy. it's nothing top notch though. not compared to other games you could be playing. anyway i'm fine with the sale price of $6 that i got it for, but tbh even if i paid $15 i would feel like i coulda put that to something better.\n\nMultiplayer: been playing with my son and the MP works fine, only issue we ever ran into was sometimes i see him floating around in a sitting animation, and he can't hear the music box for some reason. both are minor issues. still, i think it plays better as a single player game though because we aren't able to share parts of the map we explored, upgrades to key structures aren't shared very well either. basically the game plays like the MP aspect is an afterthought.", "timestamp_created": 1671941928, "timestamp_updated": 1671941928, "voted_up": false, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.682812511920928955", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "55445272": {"recommendationid": "55445272", "author": {"steamid": "76561198024963888", "num_games_owned": 0, "num_reviews": 55, "playtime_forever": 2097, "playtime_last_two_weeks": 0, "playtime_at_review": 2021, "last_played": 1646848174}, "language": "english", "review": "its a interesting game\nits fun\nit has gamebreaking bugs \n\nfrom flying animals i dont even mind(i talk about foxes and other animals) which u cant attack because they are on an other layer of the map \n\ni talk about skilling\nif u run u get moving exp for the moving skill tree\nif u dig for ores u get can improve the inventory tree(more ore/wood/bigger inventory and so on)\n\nand if u hunt u get no hunting exp and u cant skill the hunting tree\nin other words u get no items from the animals for rafting except meat\n\ni call that gamebreaking", "timestamp_created": 1570208200, "timestamp_updated": 1570208200, "voted_up": false, "votes_up": 66, "votes_funny": 8, "weighted_vote_score": "0.682702600955963135", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1570449731, "developer_response": "Hello! Thank you for reaching out.\n\nI regret to hear that you’ve encountered the problems you’ve described. \nCould you please specify, how and where did you encounter them? \n\nAlso, send us an output log (C:\\Users\\<UserName>\\AppData\\LocalLow\\8 Points\\The Wild Eight\\output_log.txt) to support@hypetraindigital.com, it will go a long way towards improving the game and fixing the issues you’ve mentioned!"}, "42926757": {"recommendationid": "42926757", "author": {"steamid": "76561198065528416", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1478, "playtime_last_two_weeks": 0, "playtime_at_review": 608, "last_played": 1572365922}, "language": "english", "review": "Okay, so this is my first review ever.\nSo keep in mind, that this game made me take the time to write my first review. Ever.\n\nI haven't even gotten very far in the game yet, but there is just so much gameplay already.\nIf you are into survival games and games with a story and quests to follow, then this is definitely the game for you!\nWhile playing the game I get vibes of Don't Starve Together, Portal and Firewatch. Kind of widely spread, I know, but my friend and I agreed.\n\nPros:\n- Immersive story\n- You can control wether you want to continue with the quests or just work on upgrading your skills, workshop and shelter.\n- You realisticly need to eat and stay warm to survive.\n- This is a great, great game to play with friends. You can still play it solo if you want, but it's so much fun to play with friends.\n- You can chop trees and stone with your hands. So you also get the feel of minecraft logic in there.\n\n\nCons:\n- This might be an outdated con, as the bug has probably been corrected:\nWhen I played a while back with my cousin, we would fall in a pit and die, while carrying important quest items. There was no way of getting down to the spot in the pit where we fell, so we could retrieve the items. So we basically had to start all over. I haven't had this problem since though, so I'm assuming the issue has been adressed.\n- When chopping trees it often takes multiple tries to get the character to actually hit the tree and not just waiste energy on hitting the air.\n- Time flies by way too quickly when playing this game.\n\nSo in conclusion: BUY THE GAME and play it with your friends. Guaranteed fun taimz.", "timestamp_created": 1529665148, "timestamp_updated": 1529665148, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.681149840354919434", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "100983562": {"recommendationid": "100983562", "author": {"steamid": "76561198399398206", "num_games_owned": 111, "num_reviews": 13, "playtime_forever": 2427, "playtime_last_two_weeks": 0, "playtime_at_review": 2412, "last_played": 1634124194}, "language": "english", "review": "it was a good game but the devs have given up and public servers are gone\nwould i buy it for £3 ?  nope\n", "timestamp_created": 1634124184, "timestamp_updated": 1634124184, "voted_up": false, "votes_up": 22, "votes_funny": 0, "weighted_vote_score": "0.680960178375244141", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "119905427": {"recommendationid": "119905427", "author": {"steamid": "76561198002588175", "num_games_owned": 511, "num_reviews": 25, "playtime_forever": 8782, "playtime_last_two_weeks": 0, "playtime_at_review": 8782, "last_played": 1659391090}, "language": "english", "review": "Honestly haven't come across the bugs everyone else has mentioned, but that might just be my luck. The story is absolute HOT GARBAGE though. You did all the sidequests so you can get the best ending? [spoiler] YOU GET BLOODY RUN OVER AND DIE. That's not even a joke. [/spoiler]", "timestamp_created": 1659391874, "timestamp_updated": 1659391874, "voted_up": false, "votes_up": 23, "votes_funny": 2, "weighted_vote_score": "0.679582655429840088", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "31387623": {"recommendationid": "31387623", "author": {"steamid": "76561198041803206", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 2879, "playtime_last_two_weeks": 0, "playtime_at_review": 2357, "last_played": 1578808515}, "language": "english", "review": "Wow, I have been looking for YEARS to find a game that I can actually keep my attention span fixed to in the same manner as Diablo 2 or the early days of World of Warcraft. I hop around between games constantly, never settling or finding one that I seem to like enough to follow through with; this is the only game that I've found within the past few years that I immediately fixated upon.", "timestamp_created": 1493268633, "timestamp_updated": 1493268633, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.679223358631134033", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "106950151": {"recommendationid": "106950151", "author": {"steamid": "76561198095022965", "num_games_owned": 403, "num_reviews": 91, "playtime_forever": 2076, "playtime_last_two_weeks": 0, "playtime_at_review": 2050, "last_played": 1640918599}, "language": "english", "review": "Its a ton of fun. The locations are all really interesting, makes exploration very exciting. Its an overall very well made survival game. Everything in it is simply put, awesome, I love the style. The story might be a bit generic, but it definitely has its own awesome creativity which kept me well invested. Gives off some Long Dark vibes, which I really liked. The camera control could be WAY better, but you get very used to it, so also a no problem. Has a very good skills upgrades system. And yeah, an overall recommended.\n\nThe only real con I can think of are the bugs, there's a lot of them and quite a few are very annoying. Fortunately there are no game breaking bugs that I ran into. Examples:\n\n• Your reindeer not visually following you and only teleporting around, in a VERY glitchy manner.\n• Being able to lock yourself to the outside of the ENTRANCE-2 emergency transit system, so that the only exit is through the transit to a different location just to go back there and open the door from the outside so its open again.\n• Falling down somewhere and losing all your items due to them not spawning above ground.\n• The map from time to time shows icons for quests that you already completed.\nEtc.\n\nAnother con is definitely the halt of support on the game back in ~2019. There's quite a few features/ideas that the game could use, a few examples that popped in my head:\n\n• The reindeer is an amazing feature, I love it, owning a pet reindeer who follows you around while expanding your on-go storage with the sledge, HOWEVER, to maintain the reindeer is way too needy, its realistic, yes, but the frequency of when you have to feed him is way too high.\n• You should 100% be able to place chests down in your Bunker.\n• Imo its kinda disappointing that you can't open the door to the Main Reactor room due to an \"unknown error\", I'd really like to get in there as well and everywhere else in the game, that \"unknown error\" is always fixed when you restart the systems, why not make it like that in your own Bunker as well?\n• The dumpster in the Bunker should 100% be times and times bigger, I can only really use it to store actual valuable items, it doesn't have enough room to throw away actual useless junk like rot or ruined/spoiled food.\n• I feel like there could be quite a few more achievements, one that came in mind for example was an achievement for activating all radio stations.\nEtc.", "timestamp_created": 1640915598, "timestamp_updated": 1641201203, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.67898857593536377", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "148162190": {"recommendationid": "148162190", "author": {"steamid": "76561198150444650", "num_games_owned": 183, "num_reviews": 8, "playtime_forever": 223, "playtime_last_two_weeks": 0, "playtime_at_review": 223, "last_played": 1697234634}, "language": "english", "review": "I'm on the fence about this but ultimately you shouldn't buy this, at least unless its on sale for dirt cheap. There is alot of bugs that make it a little hard to play/ progress past 4 hours of gameplay. This game does not receive any updates so just save yourself the money and don't play it.", "timestamp_created": 1697234740, "timestamp_updated": 1697234740, "voted_up": false, "votes_up": 22, "votes_funny": 0, "weighted_vote_score": "0.677760779857635498", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "132595508": {"recommendationid": "132595508", "author": {"steamid": "76561198014896904", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 18, "playtime_last_two_weeks": 0, "playtime_at_review": 18, "last_played": 1676096661}, "language": "english", "review": "Don't buy this if you plan to play multiplayer, it just doesn't work. \nApparently the game is abandoned by the developers.", "timestamp_created": 1676097465, "timestamp_updated": 1676097465, "voted_up": false, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.677226722240447998", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "107943219": {"recommendationid": "107943219", "author": {"steamid": "76561198143210466", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 187, "playtime_last_two_weeks": 0, "playtime_at_review": 156, "last_played": 1642106501}, "language": "english", "review": "plays like an early access game. for ex. theres a bug from 2017 (makin menu music not affected by settings) online i found a post from a player about that bug a (seemingly) mod responded saying theyre aware and will fix it soon. well 5years later still not fixed. overall theres some more annoying bugs that are more relevant for the actual gameplay.", "timestamp_created": 1642106296, "timestamp_updated": 1642106296, "voted_up": false, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.673332035541534424", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "40654457": {"recommendationid": "40654457", "author": {"steamid": "76561198180130274", "num_games_owned": 687, "num_reviews": 78, "playtime_forever": 911, "playtime_last_two_weeks": 0, "playtime_at_review": 911, "last_played": 1520589159}, "language": "english", "review": "I do like this game alot,  my main issue so far with the game tho....... holes. You can land on a ledge saving yourself, but no way out. Touching the ground in a hole is auto death. Why not add ropes? It kinda sucks when i fall on a ledge that looks like i can just walk right over it or act somewhat human and climb up to get back. \n\n   Unsure if this is a bug with animals. I tamed a wolf and at first was giving it the craftable wolf food. Then i started throwing raw meat down for it to eat and saw its hunger meter going up. I got it to max and stopped worrying about the craftable wolf food cuz I figured it would just eat the raw meat i threw down or whatever it killed. Suddenly the wolf untamed at full hunger and attacked me. A dev response on this would be nice, but i'll settle for the community since im fairly new to the game.\n\n  I do reccomend this game, but not for solo play. From my experiences so far its more enjoyable with a friend. You can get quite alot of unexpected laughs with a buddy. My favorite bug is the seizuring body if you die in your tent.", "timestamp_created": 1520516310, "timestamp_updated": 1520517256, "voted_up": true, "votes_up": 15, "votes_funny": 7, "weighted_vote_score": "0.672222912311553955", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44199068": {"recommendationid": "44199068", "author": {"steamid": "76561198420634630", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 2852, "playtime_last_two_weeks": 0, "playtime_at_review": 2569, "last_played": 1569814395}, "language": "english", "review": "its a great game and fun to be able to play online. But i can be beaten fairly quickly. Ther need to expand or make a whole new map. Like you finaly find escape from the cold tundra but then tragedy befalls you again in another new map, something to keep the interest and challenge going. Because once you max out your skills you are very powerful and can deafeat wolves, bears, and monsters easy. CONTINUE THE STORY!!! other than that its a fun game. I really enjoyed it. but now dont really play as I have completed all missions and my charecter is maxed out.\n", "timestamp_created": 1534470073, "timestamp_updated": 1534470073, "voted_up": true, "votes_up": 17, "votes_funny": 1, "weighted_vote_score": "0.671531856060028076", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "55492501": {"recommendationid": "55492501", "author": {"steamid": "76561197998674708", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 4764, "playtime_last_two_weeks": 0, "playtime_at_review": 476, "last_played": 1606972613}, "language": "english", "review": "I fell down a hole and thought I lost everything. The developer personally contacted me advising me to check the edge of the hole on all sides and that my items should still exist. Turns out, I'm not very observant. No wonder I fell down the hole. Would recommend, but don't be surprised if you find yourself getting very emotionally invested!", "timestamp_created": 1570436846, "timestamp_updated": 1570440920, "voted_up": true, "votes_up": 17, "votes_funny": 9, "weighted_vote_score": "0.670741856098175049", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "32263672": {"recommendationid": "32263672", "author": {"steamid": "76561198097871714", "num_games_owned": 0, "num_reviews": 49, "playtime_forever": 3562, "playtime_last_two_weeks": 0, "playtime_at_review": 1375, "last_played": 1571228975}, "language": "english", "review": "LONG STORY SHORT\n\nIf you like crafting, surviving, exploring game then get this.\n\nDespite being in early access the story, gameplay and content feel very polish.\n\n10/10 RECOMMEND TO EVERYONE\n\n==========================\n\nBELOW ARE MY PERSONAL WISH AND RANT\n\nThings i hope to see in future release :\n1. More Craftable items. EXP : A placeable torch, cooking station, etc\n2. More Cooking recipe and more details of what benefit one give.\n3. More upgradable skill/perks and perhaps some useable skill too like double stab, JUMP! JUMP! JUMP!.\n4.PLEASE MAKE THE SURVIVING PART HARDER. As of now the surviving part was not harsh enough once you get the hang of the mechanicsm.\n5. MORE ANIMAL OR ENEMY AND BOSS BOSS BOSS\n6. Make the multiplayer server more stable? As of now i tried to play in multiplayer 9/10 getting disconnect of no reason or instantly disconnect after successfully entering a server. AND MOST OF THE TIME IF NOT ALL, i wont be able to connect to any of the server listed. (look at the community hub it seems i wasnt the only one XD)\n\noh well better stop the rant and greed now.", "timestamp_created": 1496912739, "timestamp_updated": 1496912739, "voted_up": true, "votes_up": 21, "votes_funny": 4, "weighted_vote_score": "0.669862210750579834", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "69415349": {"recommendationid": "69415349", "author": {"steamid": "76561198078242669", "num_games_owned": 111, "num_reviews": 13, "playtime_forever": 436, "playtime_last_two_weeks": 0, "playtime_at_review": 357, "last_played": 1590304152}, "language": "english", "review": "This is a great game, has a lot of potential but it looks like the developer abandoned this game and their community. I've read in their discord that they are focusing more on porting this game to consoles.", "timestamp_created": 1589887313, "timestamp_updated": 1596830790, "voted_up": false, "votes_up": 14, "votes_funny": 1, "weighted_vote_score": "0.669150829315185547", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "52630672": {"recommendationid": "52630672", "author": {"steamid": "76561198032414341", "num_games_owned": 352, "num_reviews": 2, "playtime_forever": 1053, "playtime_last_two_weeks": 0, "playtime_at_review": 1017, "last_played": 1561965136}, "language": "english", "review": "An excellent little game. Sadly, I had to restart my story multiple times due to quite a few different bugs. (losing all inventory upgrades, not respawning after death, not being able to pick up a few quest items.)  I loved the systems in place though. The crafting and skill trees were fun and juggling warmth and food was enjoyable and not as much of a chore as I expected. The combat mechanics were simple and not very rewarding for the most part. Maybe implement a dodge/sidestep ability through the skill tree would make it more engaging. Nonetheless, I would say it was a good game and the developers seem fairly active.\n\nIf you're looking for a polished smooth game I may suggest sitting this one out, but if you don't mind a few hiccups along the way and enduring a few frustrating mishaps due to game bugs I would recommend.", "timestamp_created": 1561932060, "timestamp_updated": 1561932060, "voted_up": true, "votes_up": 12, "votes_funny": 3, "weighted_vote_score": "0.665736973285675049", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "53877996": {"recommendationid": "53877996", "author": {"steamid": "76561198088253825", "num_games_owned": 122, "num_reviews": 5, "playtime_forever": 1457, "playtime_last_two_weeks": 0, "playtime_at_review": 181, "last_played": 1563390900}, "language": "english", "review": "TL;DR - Make a difficulty between Normal and Hard, nerf miniboss/boss damage in Normal, FIX your damn guns because they are a sorry excuse for a weapon.\n\nIt is very difficult to rate this game in its current state, but I'm going to leave it on a thumbs-down for this initial review.  The aesthetics are very pleasing and most things function pretty well, but some of the gameplay aspects are absolutely fuck-all.\n\nI'm a newer player, so I selected the \"normal\" difficulty, as any new player would.  The instructions and quest direction are fairly simple, but the enemy AI on a \"normal\" difficulty that's supposedly for \"exploring the wilderness of Alaska\" is AWFUL.  Wolves are far too fast, come out of nowhere, deal far too much damage, and don't show up on the map as red blips until they're practically up your ass.  You receive no warning other than a very vague audio cue, and a wolf can deal so much damage to someone who doesn't have upgraded abilities that you usually die between 3-4 hits.  This is on NORMAL, mind you.  \n\nOn the topic of enemy AI and enemies, there is a werewolf enemy in one of the abandoned facilities you find, but the thing kills you in 1-2 hits, even with the decent armor you find in another room there.  I'm assuming this thing is a sort of boss or miniboss type of enemy, but there's no reason players on Normal mode should be punished by dying in 1-2 hits, especially considering you find a gun in there too, which one-shots most lesser enemies.  My suggestion is to nerf the damage for this enemy on Normal mode, or create a difficulty between Normal and Hard or whatever the other difficulty is, so players won't feel punished for no good reason other than \"heehee hoho bbeg time\".\n\nGuns are an entirely different can of worms, and not in a good way.  The first gun you find is a little pistol, and the damage is great, allowing you to now one-shot wolves.  Only problem?  The range is UNREASONABLY PATHETIC.  I realize this is a game, but no other games I've played have had bullets from guns take a NOSEDIVE into the floor after only travelling about 3 feet away, and this is a weapon you're supposed to use to kill that miniboss I talked about before that can kill you in two hits.  I would rather have the bullet travel across the map like normal bullets do and do less damage than how they function now.  Also, PLEASE have the character able to be mobile while shooting.  The lock into the aim position takes too long to get out of, and you always take 1-2 hits before you can escape aiming down the sights (which in the miniboss case, kills you every time).", "timestamp_created": 1562477623, "timestamp_updated": 1562477623, "voted_up": false, "votes_up": 66, "votes_funny": 9, "weighted_vote_score": "0.665107488632202148", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "29949419": {"recommendationid": "29949419", "author": {"steamid": "76561197971828236", "num_games_owned": 0, "num_reviews": 63, "playtime_forever": 3295, "playtime_last_two_weeks": 0, "playtime_at_review": 1969, "last_played": 1549933260}, "language": "english", "review": "This is a cool little game that's not ready for prime time.  It reminds me of The Long Dark, which is a much better game.\n\nIf you own The Long Dark and are just looking for something to pass the time, you could do worse than this game.  \n\nIt's very stable, it just gets extremely repetitive extremely quickly after you figure out how to feed yourself by killing animals.  Basically, after you can kill animals it's just endless killing and wandering around and there's not much survival to it.  You'll learn a few strategies, mainly sleeping during blizzards and carrying your tent and workbench with you instead of trying to make a permanent camp, and then the game is pretty static.\n\nKeep an eye out on this if you're interested, but I'd wait a year before purchasing.  This is more of an iOS game than a PC game.  It's just not very complicated.", "timestamp_created": 1487191993, "timestamp_updated": 1487192071, "voted_up": false, "votes_up": 32, "votes_funny": 1, "weighted_vote_score": "0.662523508071899414", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1488194255, "developer_response": "Thank you for your review!\n\nFiguring that movement is the key for survival, that's the first step. Yes, it's easier to survive when you move, but it's made that way so you could explore, complete side-quests and main quests! The main idea is not to settle in and be cozy in this deadly wasteland, but to get out. I suggest finishing all the quests to unravel the story a little and see what comes next."}, "42865802": {"recommendationid": "42865802", "author": {"steamid": "76561198024389894", "num_games_owned": 0, "num_reviews": 42, "playtime_forever": 93, "playtime_last_two_weeks": 0, "playtime_at_review": 67, "last_played": 1549831768}, "language": "english", "review": "Game uses REDSHELL analytics system.   With no option to opt out in game it violates GDPR.  Will not review actual game until \"release\" ( out of EA) and removal of REDSHELL analytics.\n\nReddit discussion about the system being used by many devs \n\nhttps://www.reddit.com/r/Steam/comments/8pud8b/psa_red_shell_spyware_holy_potatoes_were_in_space/\n\nUPDATE : 6.20.2018...  Redshell isnt in the game.  Thanks", "timestamp_created": 1529464097, "timestamp_updated": 1529508816, "voted_up": false, "votes_up": 219, "votes_funny": 15, "weighted_vote_score": "0.660570979118347168", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1529498862, "developer_response": "Hello, and thanks for the feedback.\n\nWe would like to inform you that latest update 0.9.23 has no Red Shell integration. We care about your trust in us."}, "48970733": {"recommendationid": "48970733", "author": {"steamid": "76561198049447391", "num_games_owned": 1578, "num_reviews": 188, "playtime_forever": 2649, "playtime_last_two_weeks": 0, "playtime_at_review": 385, "last_played": 1550602314}, "language": "english", "review": "The Wild Eight to a beautiful icy environment that creates a warm-hearted atmosphere despite the cold.\nAfter the first few steps have been entrusted to you by the intuitive tutorial and you have ignited your first campfire, you will first notice the cozy warm atmosphere, which is well accompanied by the good soundscape.\nThe music and scenery are gorgeous.  The world is fairly harsh and dangerous between settlements and abandoned buildings which often either provide rare resources, dangerous enemies, or both. \nGame mechanics tend to be fairly simple but satisfying and rare items are precious and useful.\nOverall I like where the game is, I like where it's headed.", "timestamp_created": 1550071852, "timestamp_updated": 1550071852, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.6605263352394104", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "87014127": {"recommendationid": "87014127", "author": {"steamid": "76561197976309261", "num_games_owned": 1471, "num_reviews": 123, "playtime_forever": 106, "playtime_last_two_weeks": 0, "playtime_at_review": 106, "last_played": 1613659001}, "language": "english", "review": "Feels like Early Access game what has been abandoned.\nSurvival mechanics feel tedious. \nYou constantly have to worry about eating or staying warm.\nExploring is fun but game gives you items you can't even use until much later.\nThere is Blizzard almost every 2-3 minutes, so you can barely walk big distances without having to stop to make shelter and camp fire.\nMaybe co-op is more fun.\nThere is also severe lack of PC configuration settings.\nDon't buy this.", "timestamp_created": 1613728180, "timestamp_updated": 1613728180, "voted_up": false, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.659525930881500244", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "75207840": {"recommendationid": "75207840", "author": {"steamid": "76561198071159501", "num_games_owned": 366, "num_reviews": 7, "playtime_forever": 830, "playtime_last_two_weeks": 0, "playtime_at_review": 373, "last_played": 1601098705}, "language": "english", "review": "FIRST: Do not buy this game as a multiplayer game unless your friends get it too.\n\nI would REALLY REALLY love to recommend this game. However it is left with a bunch of bugs. Sometimes when you save and exit your game, it will crash. Sometimes you will fall through the map. Sometimes items will just despawn. Although these are very far in-between, nothing hits more as this game development being abandoned. I wish there was constant updates to patch out these bugs. From what I've also hear, a quarter of the map is empty. This game however is fun with friends overall. It is unforgiving with a lower player limit. There hasn't been a sale recently either besides third-party sites like Humble Bundle.\n\nhttps://github.com/abandon-ware/the-wild-eight", "timestamp_created": 1598858341, "timestamp_updated": 1640665464, "voted_up": false, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.659487605094909668", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "29866771": {"recommendationid": "29866771", "author": {"steamid": "76561198112113717", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1109, "playtime_last_two_weeks": 0, "playtime_at_review": 937, "last_played": 1518390732}, "language": "english", "review": "Brutal, unforgiving, and extremely challenging. Very fun game so far, If you're going to buy it make sure to have a friend that's willing to play with you.", "timestamp_created": 1486885286, "timestamp_updated": 1486885286, "voted_up": true, "votes_up": 40, "votes_funny": 0, "weighted_vote_score": "0.657796680927276611", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "42975765": {"recommendationid": "42975765", "author": {"steamid": "76561198003872567", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 521, "playtime_last_two_weeks": 0, "playtime_at_review": 521, "last_played": 1529773816}, "language": "english", "review": "Summary;\nIs nice. I like it.\nPretty simple, but scratches that itch I wanted it to scratch.\nToo many bugs make the game frustrating.\nPlaying with 8 players is going to be difficult.\n\nVerdict;\nWait until they've got everything done and fixed.\n\n\nI wanted to like it. I really did, and I kept trying. Going to keep trying in fact.\nMe and a bunch of friends got this while it was on sale, and one of them and I went ahead.\nIt worked well, but when we got around 6 people..\nConnection issues. Every time we'd rehost, something else went wrong. Eventually we had to leave someone behind. Then it worked well for a while again, until I was unable to pick anything up. (Which isn't great in a survival game, as you might imagine.) Dying didn't fix it. So I just decided to keep hosting and not do anything while my friends played - but as time went on, someone else got the bug too.\n\nRehosting? Maybe after half an hour of trying and getting frustrated. Few friends refunded. (Hamachi might help, but.. No. I don't want that thing on my computer again.)\n\nPlayed with 3 man group. Pick-up bug still happened. Found tears in the ground and someone fell to their death and lost everything. I got stuck with the tier 2 Wasteland debuff, which stayed with me, forcing me into a downed state while my other friend kept getting me up.\n\nI'll probably keep playing. I like it. But don't grab this right now.", "timestamp_created": 1529774410, "timestamp_updated": 1529774410, "voted_up": false, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.657088696956634521", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "30247552": {"recommendationid": "30247552", "author": {"steamid": "76561198171904534", "num_games_owned": 2539, "num_reviews": 109, "playtime_forever": 778, "playtime_last_two_weeks": 0, "playtime_at_review": 228, "last_played": 1488243855}, "language": "english", "review": "You wake up in a airplane crash and find yourself lost in an cold area. Get ready to survive!\n\n[h1]Gameplay[/h1]\n　 The Wild Eight forces you to run after resources for your survival. In the game you can walk, run (with skill), open doors, read notes left by people who didn't have same luck, face wild animals and even other players. The controls are simple and structured.\n　 The game also has an intuitive crafting and skill evolution system. At first you will have a tent and a workshop, these items are unique, you can pack them and load them to another base. They cannot be created again and in case you die, you will receive new ones. They have upgrades, which allow you to craft better tools / weapons and get more advanced skills.\n　 In The Wild Eight, you will face wild animals, and heave to deal with other players, the multiplayer mode has pvp and chat integrated, you can fight or create alliances. System is awesome, no lags and the loadings are fast. The game also has the singleplayer mode to adapt you to the game in the third person. The camera has a great zoom, you have a map and a list of quests to complete.\n\n[h1]Graphic and Soundtrack[/h1]\nThe graphic engine reminds me of \"The Flame in the Flood\", almost on realism but with a cartoonized touch. The scenery is cold, beautiful and the places where you can explore are rich in details. The soundtrack is instrumental and original, always passing a feeling of solitude and isolation, calm and sometimes melancholic songs.\n\n[h1]Rate: 10/10[/h1]\nAmazing. I'm kind suspected to say, for loving survival games, but The Wild Eight has exceeded all my expectations. Game can be beautiful without requiring too much of your computer, the multiplayer system works perfectly, without lags. The game isn't easy but not impossible. HypeTrain has managed to structure everything in the right measure to have an incredible game. Low price for a high quality game. Worth it!", "timestamp_created": 1488313331, "timestamp_updated": 1488509514, "voted_up": true, "votes_up": 47, "votes_funny": 0, "weighted_vote_score": "0.656781792640686035", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "48995720": {"recommendationid": "48995720", "author": {"steamid": "76561198118410883", "num_games_owned": 2288, "num_reviews": 102, "playtime_forever": 431, "playtime_last_two_weeks": 0, "playtime_at_review": 1, "last_played": 1550232134}, "language": "english", "review": "Fierce game with the open world and elements of survival, you will find the interesting quests not boring and well worked open world in it and that it is much important to play an opportunity with friends, besides in a game pleasant graphics and music.", "timestamp_created": 1550184219, "timestamp_updated": 1550184219, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.655098199844360352", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "101986844": {"recommendationid": "101986844", "author": {"steamid": "76561198418897488", "num_games_owned": 389, "num_reviews": 34, "playtime_forever": 1465, "playtime_last_two_weeks": 0, "playtime_at_review": 1465, "last_played": 1574884230}, "language": "english", "review": "Abandoned immediately with no replay value after you finish. Buy it at like $5 or something because that's how much the time to price is worth.", "timestamp_created": 1635710456, "timestamp_updated": 1635710456, "voted_up": false, "votes_up": 25, "votes_funny": 1, "weighted_vote_score": "0.654970705509185791", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "41830704": {"recommendationid": "41830704", "author": {"steamid": "76561198148680509", "num_games_owned": 246, "num_reviews": 27, "playtime_forever": 129, "playtime_last_two_weeks": 0, "playtime_at_review": 42, "last_played": 1538844801}, "language": "english", "review": "===[ ❤ Audience: ]=== \n☐ Kids\n☑ Everyone\n☐ Casual players\n☐ Pro players\n\n===[ ☼ Graphics: ]=== \n☐ Potato\n☐ Really bad\n☐ Bad\n☑ OK\n☐ Good \n☐ Beautiful \n☐ Masterpiece\n\n===[ $ Price/quality: ]=== \n☐ Full price\n☑ Wait for sale\n☐ Average\n☐ Refund it if you can\n☐ Don't buy it\n\n===[ ☣ Requirments: ]=== \n☐ 90' PC\n☐ Minimum\n☑ Medium \n☑ Fast\n☐ High end \n☐ NASA computer\n\n===[ ☼ Difficulty: ]=== \n☐ You just need 2 arms \n☐ Ez\n☐ Easy to learn / Hard to master \n☑ Hard (first few hours)\n☐ Dark Souls\n\n===[ ۞ Game time/length ]=== \n☐ Really short ( 0 - 2 hours)\n☑ Short ( 2 - 8 hours)\n☐ Few hours ( 8 - 12 hours)\n☐ Long ( 12+ hours)\n☐ Endless\n\n===[ ♬ Story] === \n☐ It doesn't have\n☐ Still better than Twilight\n☑ Average\n☐ Good\n☐ Fantastic\n\n===[ § Bugs ]=== \n☐ Game itself is one big BUG\n☐ Bugs destroying the game\n☐ Lot of bugs\n☑ Few Bugs\n☐ You can use them for speedrun\n☐ Nothing\n\n===[ ✦ Others: ]=== \nMultiplayer: Yes\nSingleplayer: Yes", "timestamp_created": 1525360559, "timestamp_updated": 1525360559, "voted_up": true, "votes_up": 101, "votes_funny": 15, "weighted_vote_score": "0.653248965740203857", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "144999006": {"recommendationid": "144999006", "author": {"steamid": "76561198865068720", "num_games_owned": 125, "num_reviews": 70, "playtime_forever": 386, "playtime_last_two_weeks": 0, "playtime_at_review": 375, "last_played": 1703382070}, "language": "english", "review": "I really enjoyed this game for about 4 hours until I started experiencing game breaking bugs. Super thankful I got this for $1.25. Maybe consider it on a super sale but do not buy otherwise. Also, it's long abandoned by dev's.", "timestamp_created": 1692981533, "timestamp_updated": 1692981533, "voted_up": false, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.652260780334472656", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "113003540": {"recommendationid": "113003540", "author": {"steamid": "76561198391157193", "num_games_owned": 320, "num_reviews": 128, "playtime_forever": 1916, "playtime_last_two_weeks": 0, "playtime_at_review": 1916, "last_played": 1648529110}, "language": "english", "review": "This game is not bad, storie, crafting, missions and exploring is fun, but i don't recommend it generally for many reasons:\n1.- It's abandoned by the devps.\n2.- It's too buggy\n3.-.- You'll die because of bugs\n4.- It's uncomplete and ending is disapointing\n5.- A lot of Bugs\n6.- MP is dead\n7.- Game is dead\n8.- I forgot to say it's too buggy.\nIf it had less than 7 years of developing i would truely recommend this game, but i dare to say it's almost like an Early Acces. \nReally disapointing.\n7/10\n", "timestamp_created": 1648529404, "timestamp_updated": 1648529404, "voted_up": false, "votes_up": 29, "votes_funny": 5, "weighted_vote_score": "0.651702165603637695", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "35094762": {"recommendationid": "35094762", "author": {"steamid": "76561197979353861", "num_games_owned": 0, "num_reviews": 85, "playtime_forever": 515, "playtime_last_two_weeks": 0, "playtime_at_review": 456, "last_played": 1536685376}, "language": "english", "review": "A nifty little survival game that has loads of potential. Just surviving, levelling up and working up the tiers crafting new stuff is pretty fun in its own right, and delivers a very acceptable survival experience. However the game is also littered with various intruiging questlines that the player is free to advance whenever they like - and feel they are able. You see, certain encounters are way beyond a player who is not yet properly equipped for them, giving the game a slightly grindy feel, punctuated by significant milestones and boss fights). Fortunately the grind is fun and you always feel like you are progressing and improving your character.\n\nEnjoying it so far (single player only) even if it is a tad over-priced for what you get.\n\nBut I am a sucker for games that feature creepy nightimes spent huddling round a warming campfire.\n\n7.5 / 10 \n\n(this score will rise if the game develops positively and they add the ability to rebind all the keys instead of only some of them)", "timestamp_created": 1505955242, "timestamp_updated": 1505955610, "voted_up": true, "votes_up": 13, "votes_funny": 2, "weighted_vote_score": "0.651661574840545654", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "90444111": {"recommendationid": "90444111", "author": {"steamid": "76561198130658181", "num_games_owned": 786, "num_reviews": 249, "playtime_forever": 238, "playtime_last_two_weeks": 0, "playtime_at_review": 195, "last_played": 1621679459}, "language": "english", "review": "A good game with atmospheric gameplay and musical accompaniment of the scenes. The game is good to play both alone and with friends, there is a large selection of characters for every taste. Of the minuses, I would only like to mention the opponents who could have been better thought out.", "timestamp_created": 1618637948, "timestamp_updated": 1618637948, "voted_up": true, "votes_up": 10, "votes_funny": 2, "weighted_vote_score": "0.648185610771179199", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "89195226": {"recommendationid": "89195226", "author": {"steamid": "76561197966299106", "num_games_owned": 0, "num_reviews": 86, "playtime_forever": 316, "playtime_last_two_weeks": 0, "playtime_at_review": 136, "last_played": 1616879485}, "language": "english", "review": "Its not very satisfying. Most of what you need to advance (tendons and animal parts) have a very low drop rate. So you end up running around chasing after deer and rabbits on foot to slowly whack them to death. Its very grindy because of the low drop rate. The higher tier items aren't so satisfying either. The bow with bone arrows was very underwhelming. If you die you lose all progress; the game is permanently on iron man mode and you cant turn it off. There is some kind of plot that I was unable to follow because I was too busy not dying. Something mysterious like on the tv show LOST. You can only make one crafting station and one shelter. Why? What the heck? Fights with big animals are also not great. Killed my first wolf and it just felt like a stronger boar. There is no way to repair items. You end up having to replace them manually as they break. Its pretty annoying.\n\nNot a huge fan. Many better options like Valheim.", "timestamp_created": 1616863609, "timestamp_updated": 1616863609, "voted_up": false, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.646019935607910156", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "33062425": {"recommendationid": "33062425", "author": {"steamid": "76561198051847235", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 249, "playtime_last_two_weeks": 0, "playtime_at_review": 208, "last_played": 1511580639}, "language": "english", "review": "Reading the reviews, people are complaining after 1 hour of gameplay, thats its too hard. There is an EXPLORER mode which is less challenging and more \"Don't Starvish\". Yes, survival mode is impossible, thats why I only play EXPLORER mode with friends. It's less demanding, challenging, but also fun. I recommend this game to survival/dont starve fans. It has a storyline quest and is fun, challenging, and is constantly being improved.", "timestamp_created": 1498870183, "timestamp_updated": 1498870183, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.64582359790802002", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}}, "query_summary": {"num_reviews": 100, "review_score": 5, "review_score_desc": "Mixed", "total_positive": 1453, "total_negative": 653, "total_reviews": 2106}, "cursors": {"AoIIPyVUuXnhj34=": "Mon Apr 22 23:48:57 2024"}}
