{"reviews": {"160712775": {"recommendationid": "160712775", "author": {"steamid": "76561198290581961", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 2831, "playtime_last_two_weeks": 0, "playtime_at_review": 2792, "last_played": 1710633616}, "language": "english", "review": "The game has a bug that you'll notice if you're the type to play automation games with a spreadsheet. There are tons of instances where your robots will pick up items and some will just disappear in their inventory, making it impossible to calculate needed throughput for late game items.", "timestamp_created": 1710632720, "timestamp_updated": 1710632720, "voted_up": false, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.545454561710357666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "157227685": {"recommendationid": "157227685", "author": {"steamid": "76561197960377144", "num_games_owned": 0, "num_reviews": 42, "playtime_forever": 1366, "playtime_last_two_weeks": 0, "playtime_at_review": 1328, "last_played": 1706996806}, "language": "english", "review": "All in all a decent jab at the automation genre, however the items in the final phase take an inordinate amount of time to be build even in the advanced buildings to the point you MUST paralelize production to fill the needs of all industries, but the nature of the game world acts a dectrator because of the fabricator's rather gigantic foot print. this reminds me off the myriad mobile games utilizing that level of restrictions to scratch at your wallet.", "timestamp_created": 1706665234, "timestamp_updated": 1706877900, "voted_up": false, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.535931169986724854", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "157963813": {"recommendationid": "157963813", "author": {"steamid": "76561198045061508", "num_games_owned": 952, "num_reviews": 222, "playtime_forever": 2888, "playtime_last_two_weeks": 0, "playtime_at_review": 1163, "last_played": 1708576384}, "language": "english", "review": "Starts off fun with lots to learn and explore, but eventually it turns into an idle game. Meaning you don't really do much anymore when you play except let the game run and farm resources that take a long time. More islands to explore would be nice, or more alternative gameplay like the space walk. I enjoyed that mechanic because it was different from the rest of the game. Factory management / space management / time management / resource management. \n\nWhile the end game is definitely less hands on and enjoyable, don't let that spoil the game that comes early on. It is a lot of fun early on up until you get to titanium. If you can enjoy the game for 20+ hours then its worth the money, even if you run out of things to do.", "timestamp_created": 1707529936, "timestamp_updated": 1707529936, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.529523849487304688", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161139686": {"recommendationid": "161139686", "author": {"steamid": "76561198183822723", "num_games_owned": 444, "num_reviews": 14, "playtime_forever": 1442, "playtime_last_two_weeks": 0, "playtime_at_review": 1442, "last_played": 1692472083}, "language": "english", "review": "Wova Wands", "timestamp_created": 1711102376, "timestamp_updated": 1711102376, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.519999980926513672", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140686044": {"recommendationid": "140686044", "author": {"steamid": "76561198014277673", "num_games_owned": 0, "num_reviews": 126, "playtime_forever": 1491, "playtime_last_two_weeks": 0, "playtime_at_review": 1491, "last_played": 1687659514}, "language": "english", "review": "I've completed the game at this point and obtained every achievement. Took me about 25 hours. Here's the skinny:\n\nGame is indeed like a combination of Forager and Factorio but does neither of them better. The beginning is very fun. Probably the first 9-10 hours you'll just be excited to see what's around the corner and what else will unlock. This isn't a bad game. In fact, I enjoyed it a lot. But I feel like I have more criticism than I do positive things to say about it at the moment because the end of the game spoiled the first 3/4 of it.\n\nI've put many, many hours into Factorio. The greatest thing about Factorio is the idea that THE FACTORY MUST GROW. You have a practically infinite map with a blueprint system and can make the most massive factory imaginable.\n\nThis is NOT THE CASE HERE. You have very little space to work with. Towards the end I was cramming all these assemblers on a tiny little island trying to get the last few products (which take a very long time to make by the way) and had no way to speed up production because I was literally out of space to place more production building. This is even with the gem speed-up upgrades.\n\nLogistics and collector robots also need a serious upgrade because only being able to have 5 per island is not enough when you start dealing with packaged products. At no point in the game can the logistics robots carry more than 1 individual item at a time, yet packaged products need 100 of an item to make? So you seriously need to make 100 trips per package? Why can't they carry stacks of an item? It feels like the devs themselves only seriously playtested the game's last 25% to make sure it was at least functional before shipping it.\n\nAnd yet I still recommend the game. It's fun. I think it's going to get better. But you'll see what I'm talking about as the game nears the endpoint. We need more space to work with. If it were me, I would make each island about 50% bigger or add 50% more islands. It's silly that there are at least 3 islands we can't actually build on. Also we need about 10 robots per island instead of 5, with stack carrying being an upgrade for logistics bots.", "timestamp_created": 1687714155, "timestamp_updated": 1687714155, "voted_up": true, "votes_up": 198, "votes_funny": 1, "weighted_vote_score": "0.928994894027709961", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "146187422": {"recommendationid": "146187422", "author": {"steamid": "76561198290392423", "num_games_owned": 80, "num_reviews": 42, "playtime_forever": 1408, "playtime_last_two_weeks": 0, "playtime_at_review": 966, "last_played": 1694637807}, "language": "english", "review": "It's ok. The first couple of hours are quite addicting and fun to play, but around the 10 hour mark I realized just how pointless the game is and I started questioning my life choices that led me to this place.", "timestamp_created": 1694549492, "timestamp_updated": 1694549492, "voted_up": true, "votes_up": 231, "votes_funny": 93, "weighted_vote_score": "0.861711382865905762", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "147238368": {"recommendationid": "147238368", "author": {"steamid": "76561198042287495", "num_games_owned": 0, "num_reviews": 35, "playtime_forever": 1262, "playtime_last_two_weeks": 0, "playtime_at_review": 1176, "last_played": 1701837442}, "language": "english", "review": "This is a great successor to Forager, with the addition of some logistical challenges to solve as opposed to \"eh, just build more furnaces that auto-magically re-stock from your vaults that auto-magically collect their products.\"  Now you have to consider things like throughput and more intelligently arrange your machines across various islands each with specialized resources.\n\nYou can play through one save file for dozens of hours to unlock absolutely every single optional, cosmetic item available but you eventually get to a point where expanding production is simply not possible anymore and you've completed every thing else.  So you wait -- and they even included a feature where you can get bonus productivity while you wait.  That bit was silly but hey, if you want to run this game in the background like an idler, that option is available!\n\nI'm tapping out at ~20 hours played, which was fun and engaging.  If you liked Forager, I think you'll like this, too.", "timestamp_created": 1695936703, "timestamp_updated": 1695936703, "voted_up": true, "votes_up": 49, "votes_funny": 1, "weighted_vote_score": "0.839425802230834961", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140537195": {"recommendationid": "140537195", "author": {"steamid": "76561198005553532", "num_games_owned": 324, "num_reviews": 15, "playtime_forever": 707, "playtime_last_two_weeks": 0, "playtime_at_review": 707, "last_played": 1687499095}, "language": "english", "review": "Took 12 hours to complete the game. Forager meets Factorio meets Stardew valleyish. Good time waster thatll keep your attention. They left some areas open for future content so looking forward to the future content!", "timestamp_created": 1687499242, "timestamp_updated": 1687499242, "voted_up": true, "votes_up": 58, "votes_funny": 1, "weighted_vote_score": "0.827949881553649902", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "141857380": {"recommendationid": "141857380", "author": {"steamid": "76561198017950559", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 1396, "playtime_last_two_weeks": 0, "playtime_at_review": 1367, "last_played": 1702908987}, "language": "english", "review": "Don't get me wrong - game is not good, nor bad. It just feels unfinished. (Therefore it's something in the middle)\n\nBeginning of the game is fun and catchy, but endgame makes you suffer through wait times, even after efficiently planning productions. Endgame upgrades don't feel rewarding, museum rewards are useless, there are few exploits in the game (which were discovered randomly through play through) and who thought that it would be a great idea to not be able to skip cutscenes?\n\nI really hope that Developers won't abandon this game, as it has huge room for growth.\n\nI will give this game another visit after some big update (if any planned) and update this review.", "timestamp_created": 1689106634, "timestamp_updated": 1689106634, "voted_up": false, "votes_up": 81, "votes_funny": 0, "weighted_vote_score": "0.800466358661651611", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1702393455, "developer_response": "Hi there!\n\nWe're thrilled to announce that we've just released a free content-update for Nova Lands – Quantum Gravity :)\nIt adds more story to the end, more automation mechanics, more buildings and more islands!\n\nCheers!"}, "140944834": {"recommendationid": "140944834", "author": {"steamid": "76561198333621998", "num_games_owned": 0, "num_reviews": 63, "playtime_forever": 1242, "playtime_last_two_weeks": 0, "playtime_at_review": 1079, "last_played": 1688101814}, "language": "english", "review": "Though I'm recommending the game, please continue reading about its flaws before you buy.\n\nThe reason I'm recommeding it, is because it's fun to play, it does what it says on the tin, it's simple to control and everything works as it should (at least to my knowledge). However, I felt like the trailer for it is a bit misleading.\n\nIt feels like it's telling you there's exploration, but there isn't. Everything you see is either part of some minigame, or very integrated into the game. For example, you cannot travel to islands before you unlock them. However, each island is a biome, which provides you with materials you need to unlock the next island or tech. Therefore, it's not that you \"happened upon\" that part, it's not that you \"explored\" it either. It's that you had to go there to progress.\n\nThe skills and bonuses you get are an absolute necessity. I'm currently at end-game, and the grind is real, even with every single bonus in the game. Some rewards are skins for your character, which was also a negative for me. Even completing an area at the museum simply gives you a skin and a boost to max HP. I am only struggling to complete it now because I'm a completionist. There really is 0 reason to complete the museum.\n\nThe most necessary bonuses (gem tower, house comfort, etc) are gated, and the gate is at a very low limit. For example, you get a bonus where your buildings work faster. If you upgrade that bonus to the final tier (which will take you a while), that bonus is only 50%. Not even 100.\n\nThough the game starts in a cool manner, you drop to an alien planet, and have to figure out what to do etc, I almost immediately lost immersion as there are many other people who have already built a settlement next to you lmao. Yeah, they're necessary as you can trade for stuff and buy stuff from them, but again, I was expecting something else.\n\nThe limit on the bots per island (yeah, there is one) is just 5. Though 5 is initially more than you need (well, u have to upgrade that to get to 5, it starts from 3 I think), in the end-game it's extremely low. This could be solved if logistic bots could be upgraded to pick up many materials at once, there is no such upgrade. In general there is only a few signifcant upgrades, without which the game would grind to a halt. And then there are many completely unnecessary upgrades, like \"auto-use medkit\" and \"auto-use oxygen bottle\", which you get towards the end-game and by then you no longer need them.\n\nThere's also the flying bots. You have to manually tell them what to bring where. Meaning, get this item and deliver it to that specific storage. However, there are item-specific storages, which the logistic bots see. So there could be an auto-button, that simply delivers that item to any specific storage. Or a setting on the storage itself, like, \"auto-deliver here\". There are no such things. The reason I'm saying this is because at some point in the game you have to deliver up to 4 items to all islands. You have to build 4 storages on each island, then make 4 flying bots (1 for each item), then manually select each route for each island. This is completely silly and needlessly time-consuming.\n\nThere are no priorities. You cannot set any importance of any item delivery. Not even in world-wide logistics. I don't know how priority is calculated (maybe it's just a loop) but it's really bad that you cannot set at least an \"important\" button.\n\nAnyway, I'll stop here, I'm sure you get the gist. The game is fine, it's cool to play, but for this price (10% discount, 18 euros) it's not worth it imho. I don't want to collect skins, I want my character to be what is advertised (that futuristic girl in the trailer) and then I want actual rewards that matter in the game when I do quests.\n\nSo yeah, I recommend it, it's fun, but not at this price, and not at 10% discount either. This would be more like a 5-7 eu game. Even 10 would be fine. Anyway.", "timestamp_created": 1688093237, "timestamp_updated": 1688093237, "voted_up": true, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.79011911153793335", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "155008907": {"recommendationid": "155008907", "author": {"steamid": "76561198064664442", "num_games_owned": 1034, "num_reviews": 18, "playtime_forever": 11, "playtime_last_two_weeks": 0, "playtime_at_review": 8, "last_played": 1705103194}, "language": "english", "review": "Your forced into the data mining by default, to opt out you have to click on a link inside the game and login to some website with a notice that if nothing happens when you click the link it a pop up blocker blocking it. To me this just screams, \"That way we can tie your steam account and hardware specs we harvested with your agent-user (Data used in browsers to fingerprint you) profile. Why not make it a opt in option instead? Or if you must do so, have a button that sends the request directly to the server to delete any data already collected and stop the game from digging anything else? Why force us to click on a button that supposedly opens a link in a browser where you can login and turn it off? (I assume you have to login because I can't get it to work with 3 different browsers swapping them to default. I suspect it may be a linux thing.) The button does nothing.", "timestamp_created": 1704144769, "timestamp_updated": 1704144769, "voted_up": false, "votes_up": 296, "votes_funny": 7, "weighted_vote_score": "0.783016026020050049", "comment_count": 43, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1705928936, "developer_response": "Hi Wazii!\n\nThank you very much for your feedback. We're really sorry for the inconvenience caused by the issue you've described.\n\nBefore we released the game, we took the time to make sure that we met the necessary privacy requirements. Data collection can be turned on by default because we don't sell in-app purchases or use any of the other weird practices that are now common in the games industry.\n\nThe main reason for data collection is to get crash logs, especially from players with old and weird hardware configurations. And if this was turned off by default, those less experienced users who need it the most wouldn't have it turned on.\n\nWe're a small studio that doesn't have the resources of AAA companies, so this option will remain on by default so that we can continue to provide the good support our customers deserve.\n\nOf course you are free to keep the negative review, but we hope we have made it clearer.\n\nHave a good day."}, "140632516": {"recommendationid": "140632516", "author": {"steamid": "76561198231719236", "num_games_owned": 137, "num_reviews": 8, "playtime_forever": 477, "playtime_last_two_weeks": 0, "playtime_at_review": 371, "last_played": 1687645064}, "language": "english", "review": "Nova Lands is a combination of Forager and Factorio (and a bit tiny tiny of Stardev Valley) but it cannot delivery any nice feature from these games and it feels very frustrating. If you never played Forager or Factorio then you could enjoy it but please first check both games before Nova Lands because you will see how Nova Lands is just a waste of money.\nBelow are some small spoilers to the game (but you will experience them in the first 2 hours of the game).\n\nPros:\n- Definitely feels like a vibe of Forager\n- Bots are available almost from the beginning of the game. It can start feeling like a Factorio type of game since the first 20-30 minutes of the gameplay\n- Fantastic animations, sounds, soundtrack, whole visual effects\n- You can do a bit more complex \"base\" compared to Forager (or even Stardev Valley)\n- Really relaxing and chilling for the first 2 hours\n\nCons:\n- After the second hour of gameplay, you cannot return the game on Steam and from this point I started feeling like the whole game has been created to deliver fantastic first 2 hours and then it's going down with whole quality.\n- Costs more than Forager or Factorio and got MUCH MUCH MUCH less content than both games.\n- Feels more like \"copy-paste of Forager\" instead of \"Forager genre\". The way of levelling, the skill tree, etc. Nova Lands is using these systems in a much worse way and the original design from Forager (or Factorio) is much more fun.\n- Compared to Forager: Skills are boring and you cannot go with all directions in the skill tree. Many skills are not extending the content but changing the numbers (\"+15% quicker production\").\n- Compared to Forager: You will have a place to collect items but each collection will give you just a new skin and +20 to health. Disappointing. Each reward is the same and each collection is easy to find in game.  In Forage you could get a star which was used to progress the skill tree or get an additional bonus later but here you have just dissapointing reward.\n- Compared to Forager: Upgrades to weapons and equipment are just numbers: +25% quicker harvesting, +25% quicker walking, etc. Forager had many weapons, many unique upgrades and tools which upgrade could extend the content. Nova Lands hasn't got any of them. The first weapon is your last weapon.\n- Compared to Forager: Enemies are extremely boring and easy to beat. Bosses and \"puzzles\" are even worse and dissapointing. I skipped one boss fight by accident because I resolved really simple puzzle before the fight. I didn't know how I could re-do it and do the proper fight.\n- Compared to Forager: Except 2 puzzles related to 2 bosses, you will not find any more puzzles in the game. It was a big part of Forager. Both puzzles are very simple and feel like placeholder instead of real proper puzzles.\n- Compared to Factorio: You can create a more complex \"factory\" between islands, but what's the point? The \"Factory must grow\" type of vibe isn't here because the space is limited and the game is not offering tools to do it with the same pleasure as in Factorio (or any other Factorio-ish game).\n- Compared to Factorio: Bots are very limited. The complexity is minimal. You can try to speed up a bit this and that in your \"base\" but at the same time game hasn't got mechanisms to do it quickly and without pain. Manual work is always required because Nova Lands is not offering proper blueprints.\n- Compared to Factorio: Nova Lands is trying to borrow some complexity from Factorio-ish games but at the same time, it's stuck in the middle and cannot deliver the proper \"I have automatised my base\" feeling without frustration. Many times I felt like \"oh man, I could do this so faster in Factorio\".\n- Some mechanisms could be cut out. Example? Oxygen. After the first 20-30 minutes (and unlocking some skills and upgrades) the oxygen wasn't a problem till the end of the game. Why add and continue using this mechanism till the end of the game when it can be fully skipped after the first 30 minutes? It's giving a part of survival like in Forager but Forager was connecting it with stamina and health. Nova Lands simplified it in a bad way.\n- Some reviews on Steam mentioned missing tooltips and I fully agree with it. I spent a lot of time trying to figure out what is the third item I need for plasteel (it was a scale from one of the animals - the icon was absolutely rubbish and the tooltip was missing, so I spent ages trying to figure out what's that).\n\nIt's been 1 month since I created this review and since the release of the game and devs didn't update with any future roadmap or future updates.", "timestamp_created": 1687634736, "timestamp_updated": 1690712822, "voted_up": false, "votes_up": 86, "votes_funny": 1, "weighted_vote_score": "0.765478074550628662", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "145879733": {"recommendationid": "145879733", "author": {"steamid": "76561198068249299", "num_games_owned": 197, "num_reviews": 35, "playtime_forever": 2469, "playtime_last_two_weeks": 0, "playtime_at_review": 2469, "last_played": 1694125540}, "language": "english", "review": "7.2/10 \n\nPros:\n+ Automation game play\n+ Nice art style\n+ Decent casual music\n+ Worth while 100% achievements \n\nCons:\n- Very slow late game scaling.\n- Museum is tedious\n- Needs minecraft item stack manipulation \n\nConclusion:\n\nI enjoyed my time spent playing this. I would usually set stuff up in a way where I could leave and return a couple hours later with everything already made for me to progress forward. Late game even with Diamond dashes (production speed) and Super lubricant (production speed) some items took multiple minutes of waiting. Some achievements did need some help from google to figure out but mostly they unlocked naturally. Automatic farms are alot better than I originally thought. The in-game challenges even more over the top than the steam achievements so i'm defo not doing them. 20$ was a little steep of a price tag in hindsight but would purchase for around 15$. Overall this was a somewhat time consuming but generally easy 100% and a decent time sink if you enjoy automation games.", "timestamp_created": 1694126255, "timestamp_updated": 1694126623, "voted_up": true, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.75377047061920166", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140511536": {"recommendationid": "140511536", "author": {"steamid": "76561198812323926", "num_games_owned": 0, "num_reviews": 336, "playtime_forever": 219, "playtime_last_two_weeks": 0, "playtime_at_review": 69, "last_played": 1687563442}, "language": "english", "review": "Hmm, and we have a worthy son of Forager in front of us! A skill tree, an exploration tree, biomes with their own flora and fauna, the ability to improve your equipment to make your routine easier - all of this will be waiting for us. However, I understand that patches or hotfixes will be released for this game. For example, I found several problems:\n\n1) Recipes in the ovens have different font sizes for some reason, such as modular bricks. \n\n2) encountered incorrect display of items in warehouses, ie, they just disappeared (but after some time may appear)\n\nUPD: I've had items disappear after I put them in a warehouse (modular bricks, iron and copper ingots, charcoal, etc). This happened at completely random moments.\n\n3) The thing that annoyed me the most was that backpack items were disappearing, i.e. resources that I was collecting. There was a full inventory, and after restarting the game they were gone...\n\nI can say that, the game will still be refined and has a good chance of being a decent indie. Even though my gameplay experience wasn't perfect because of the bugs, I thoroughly enjoyed the gameplay.\n\nP.S. I'll be waiting for the hotfixes!\nUPD: the first hotfix has already been released! Glad the developers responded so quickly to bug reports", "timestamp_created": 1687459321, "timestamp_updated": 1687565114, "voted_up": true, "votes_up": 27, "votes_funny": 2, "weighted_vote_score": "0.747612893581390381", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "153236464": {"recommendationid": "153236464", "author": {"steamid": "76561197996346472", "num_games_owned": 512, "num_reviews": 41, "playtime_forever": 1267, "playtime_last_two_weeks": 0, "playtime_at_review": 1267, "last_played": 1702041288}, "language": "english", "review": "Nova Lands is a great simplified factory builder in a similar vein to Forager.\n\nWhat I really like about it is that the pacing is well done for the majority of the game. You constantly unlock something new that demands your attention, always doing something to improve your factory - setting up new production chains or reorganizing old islands to be more efficient. The game also throws in a little variety to mix things up, there's an occasional simple boss to defeat and an asteroid mining mini game which rewards you with efficiency upgrades for your whole factory. \n\nUnfortunately as you're nearing the end game the simplified systems start to show their ugly side. There is no way to set consumption priority for buildings or regulate the flow of resources in any way. This manifests in having no way to control what will starve if you're underproducing some resource because you cannot tell the game to deliver more resources to one place than the other. This is especially annoying in the end game where it's hard to overproduce certain resources so you have to rely on turning facilities on and off or manually moving stuff to compensate. It's not as bad as it sounds, but it sticks out. Also, the last story quest as of writing requires a bunch of end game resources that are easier produced just by leaving the game idle for 4 hours than trying to speed up its production. \n\nDespite that I still recommend Nova Lands, It's a fun, rewarding < 20 hour playthrough.", "timestamp_created": 1702151019, "timestamp_updated": 1702151019, "voted_up": true, "votes_up": 21, "votes_funny": 0, "weighted_vote_score": "0.738505899906158447", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "154658281": {"recommendationid": "154658281", "author": {"steamid": "76561198043017274", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 1099, "playtime_last_two_weeks": 0, "playtime_at_review": 676, "last_played": 1704136541}, "language": "english", "review": "The game I wanted Forager to be.", "timestamp_created": 1703797421, "timestamp_updated": 1703797421, "voted_up": true, "votes_up": 35, "votes_funny": 5, "weighted_vote_score": "0.732348799705505371", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "143654260": {"recommendationid": "143654260", "author": {"steamid": "76561197994679213", "num_games_owned": 1012, "num_reviews": 135, "playtime_forever": 588, "playtime_last_two_weeks": 0, "playtime_at_review": 588, "last_played": 1691078999}, "language": "english", "review": "Forager meet factorio light, but not remotely as fun as either. It's not a bad game; I just didn't have fun playing it.\nThe upgrade paths and entire progression is pre-determined, so no free exploration or decision making. The islands are all tiny which hinders creativity. Setting up new factories for new resources felt tedious instead of fun. I really do like the concept, the presentation and sound design. Bottom line is, I felt tedium instead of fun, so - not for me.", "timestamp_created": 1691502884, "timestamp_updated": 1691502884, "voted_up": false, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.71185600757598877", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140519787": {"recommendationid": "140519787", "author": {"steamid": "76561198024120252", "num_games_owned": 162, "num_reviews": 30, "playtime_forever": 819, "playtime_last_two_weeks": 0, "playtime_at_review": 228, "last_played": 1689104896}, "language": "english", "review": "It's pretty good.\nBuy it if you like factory games and you don't need everything at gregtech-level difficulty.\nIt's charming and relaxed.\n\n", "timestamp_created": 1687469496, "timestamp_updated": 1687469496, "voted_up": true, "votes_up": 20, "votes_funny": 4, "weighted_vote_score": "0.710382640361785889", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "141772738": {"recommendationid": "141772738", "author": {"steamid": "76561198044250156", "num_games_owned": 651, "num_reviews": 7, "playtime_forever": 1415, "playtime_last_two_weeks": 0, "playtime_at_review": 1408, "last_played": 1689009393}, "language": "english", "review": "The game is great, just the endgame feels ... not nearly as fun.\n\nThere needs to be upgrades to the logistic bots so that they can carry more than a single item, otherwise all the [spoiler] packing and mega furnaces [/spoiler] feel more like an annoying sidegrade than an upgrade and having islands like the rock island be super inefective in both gathering and smelting as you can only have 5 bots and 2+ of those will be collectors.\n\nAlso the logistic bots could have some setting to shift priorities, not just disable some.\n\nOverall the endgame is just a bunch of waiting as there is no real way to speed the whole thing up as you run out of space pretty quick with these assemblers that take literaly a minute+ to create a single item.\n\nWhy do you get health upgrade from the museum as well when fights are not relevant by the time you complete ~3 out of the 6-ish museum parts (the relic reward is at least nice). Maybe make mounts(or at least the flying one???) able to pass through buildings so that lategame movement is not so annoying? Plenty quality of life things to improve, still gotta recommend", "timestamp_created": 1689009377, "timestamp_updated": 1689009377, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.698804795742034912", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "141229844": {"recommendationid": "141229844", "author": {"steamid": "76561197994812796", "num_games_owned": 865, "num_reviews": 12, "playtime_forever": 723, "playtime_last_two_weeks": 0, "playtime_at_review": 723, "last_played": 1688404189}, "language": "english", "review": "Okay this game has me pretty split.\n\nPositives:\n- Great fun when you get started\n- Nice progression (once you understand some key mechanics)\n- Factoriolight automation!\n- Some exploration too (but it's not main gameplay)\n- Spend some nice 12h that went fast but now I feel there isn't much but grinding left.\n\n\nNegatives:\n- Sometimes confusing progression (sometimes you get stuck because of some mechanic you didn't realize is vital to the game or a place you wanted to explore later but the game doesn't remind you)\n- Really, REALLY limited space for building automation\n- Moving buildings is really annoying. You can \"move building\" but if you want to move them to another island I don't think it's possible. If you setup iron miner in one island GOOD LUCK moving it to a new one.\n- Finding and mapping items & machines can be quite confusing. Much easier on factorio\n- Automation is sometimes too limited (what settings you can choose, what resources you can use)\n- Sometimes I just don't know how to optimize my automation. I know I have to but I am clueless how. I don't really get this feeling in factorio.\n- Combat is rarely that difficult, mandatory or fun, especially in the end. Bosses can be hard until you unlock abilities to make bosses piece of cake.\n\nTL;DR;\nNice factorio light gameplay with severe limitations. If you don't mind spending 20€ on \"new\" automation/exploration experience give it a shot. Not that lengthy of a game.", "timestamp_created": 1688405466, "timestamp_updated": 1688405466, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.68821251392364502", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "153724550": {"recommendationid": "153724550", "author": {"steamid": "76561197992813688", "num_games_owned": 2447, "num_reviews": 69, "playtime_forever": 1720, "playtime_last_two_weeks": 0, "playtime_at_review": 870, "last_played": 1702943411}, "language": "english", "review": "Great labour-of-love-game!\nIf you fancy (simple/casual) automation games á la Forager et al, you'll enjoy this one too. \nThe dev is really caring and pushes (free) updates like EA and blizzard push DLCs. Even though it's already released and working fine.\nOh, and he also offers a Demo. You remember? Pepperidge farm does. Me too. I was a wee lil lad when try-before-buy was a common standard.\n\nI would buy the game again (and I did) just for that reason alone. Devs like this are a dying breed in this cesspool of greed\nwe call gaming-industry.", "timestamp_created": 1702743288, "timestamp_updated": 1702743288, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.687586843967437744", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "153015279": {"recommendationid": "153015279", "author": {"steamid": "76561198253545286", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 383, "playtime_last_two_weeks": 0, "playtime_at_review": 383, "last_played": 1701811796}, "language": "english", "review": "This game is unique and interesting, but has some overarching issues that bring the overall game down.\n\nFirst, the pros:\n*Lovely art style\n*Extremely smooth gameplay, I never had an issue running the game\n*Interesting resource-respawn and robot-based system that effectively takes what other games would use as late-game automation and instead makes it the norm from the start\n\nBut, the cons are too glaring:\n1) The game offers progression trees, but the items on each tree are required to upgrade other tree branches. In many ways this discounts the purpose of having trees, since you can't actually pursue one without pursuing all of them since you won't have the items or upgrades needed for the other. So for example if you wanted to just focus on farming and animals and turn the game into a farm sim you couldn't do it without first upgrading the automation, logistics, and potentially combat trees. So perceived choice without actual choice or depth.\n2) There's a major lack of information in the game of what items are, and instead leaves that part to finding a specific image in a sea of areas. Might be on the upgrade module, might be produced in a building, might be collected from an island you haven't unlocked yet, you just don't know. And when these specific items are needed to upgrade the tree and it's the only thing you need it only makes finding it that much more frustrating, as you're effectively soft-locked in progression until you find a needle in a haystack. At least give it a name, or add a book with items listed so you don't spend 30 minutes trying to figure out what you need to do. \n3) No tutorial :( Not necessary if you're familiar with the genre, but could be tough if it's your first entry.\n4) There's are unnecessary time restraints put into the system that don't add to the game but rather slow it down for no reason. You need a mountain of mushrooms for a specific recipe in order to progress the game, but I was only able to unlock one island that had them, so I wound up spending 2 hours waiting around fully capped in automation because an item just didn't spawn regularly enough to keep things moving.\n\nRECAP: It's a beautiful game artistically and in creativity, but falls short on many of the automation basics that are the bread and butter of the genre. Has so much potentially, but just falls short in really critical areas.", "timestamp_created": 1701904989, "timestamp_updated": 1701904989, "voted_up": false, "votes_up": 73, "votes_funny": 5, "weighted_vote_score": "0.678676307201385498", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "152946223": {"recommendationid": "152946223", "author": {"steamid": "76561198047091807", "num_games_owned": 985, "num_reviews": 88, "playtime_forever": 221, "playtime_last_two_weeks": 0, "playtime_at_review": 13, "last_played": 1701886615}, "language": "english", "review": "Contains data collection enabled by default that cannot be disabled.", "timestamp_created": 1701807090, "timestamp_updated": 1701807090, "voted_up": false, "votes_up": 158, "votes_funny": 5, "weighted_vote_score": "0.675860345363616943", "comment_count": 16, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1701870772, "developer_response": "Hey, ojek! The collected data is exclusively related to errors and balancing of the game, so we can improve it.\nBut of course, you may disable it if you want! You may do it from the game's options menu:\n1. From the main menu, go to \"Options\"\n2. select the \"Privacy\" tab\n3. Click the \"privacy settings\" button\n4. From there, the Unity Analytics form will open in your browser and you can disable data collection following the form instructions.\nPlease, let us know if you have any trouble during the process!"}, "140689932": {"recommendationid": "140689932", "author": {"steamid": "76561198007849146", "num_games_owned": 0, "num_reviews": 17, "playtime_forever": 1755, "playtime_last_two_weeks": 0, "playtime_at_review": 1755, "last_played": 1687718381}, "language": "english", "review": "The game was alright, but honestly WAY to short. The only reason my hours are as high as they are is that there's an idle aspect to the game, so I let it run overnight. I've now finished the game completely and I only bought it yesterday.\n\nIf they game had about twice as much content, I would have been very happy with the game and given it a positive review. But as is, right when I figured I was about to hit the meat of the game, it was actually just over. Checked to see if maybe the game was Early Access, but nope. This is it.", "timestamp_created": 1687718677, "timestamp_updated": 1687718677, "voted_up": false, "votes_up": 21, "votes_funny": 0, "weighted_vote_score": "0.666589558124542236", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1702393527, "developer_response": "Hi there!\n\nWe're thrilled to announce that we've just released a free content-update for Nova Lands – Quantum Gravity :)\nIt adds more story to the end, more automation mechanics, more buildings and more islands!\n\nCheers!"}, "142916871": {"recommendationid": "142916871", "author": {"steamid": "76561198189247493", "num_games_owned": 192, "num_reviews": 38, "playtime_forever": 1214, "playtime_last_two_weeks": 0, "playtime_at_review": 1214, "last_played": 1690491972}, "language": "english", "review": "too short", "timestamp_created": 1690492001, "timestamp_updated": 1690492001, "voted_up": true, "votes_up": 24, "votes_funny": 0, "weighted_vote_score": "0.664774060249328613", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "142755912": {"recommendationid": "142755912", "author": {"steamid": "76561198038276001", "num_games_owned": 292, "num_reviews": 21, "playtime_forever": 1677, "playtime_last_two_weeks": 0, "playtime_at_review": 1677, "last_played": 1690281534}, "language": "english", "review": "Fun game.\nNot as good as Forager or Factorio and filled with lots of small bugs.\nIt doesn't feel finished content whise as well.\nProbably not worth the asking price of 20 bucks.\nGet it on a sale and reserve a weekend.", "timestamp_created": 1690281742, "timestamp_updated": 1690281742, "voted_up": true, "votes_up": 14, "votes_funny": 1, "weighted_vote_score": "0.643745839595794678", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140575951": {"recommendationid": "140575951", "author": {"steamid": "76561198035098030", "num_games_owned": 350, "num_reviews": 10, "playtime_forever": 1182, "playtime_last_two_weeks": 0, "playtime_at_review": 1182, "last_played": 1687552986}, "language": "english", "review": "About 20 hours to beat the game, probably 95%ed it. The space walk, boss puzzles, shipping rocket, and player house sections are all i have left but they aren't enjoyable so i probably wont.\n\nThe main part of the game is well paced, I only felt like idling at the very end because i didn't want to redesign my base for optimal throughput at that stage.\n\nThere are bugs, but they are the \"turn it off and on again\" kind of fixes, nothing that will make you have to start over. For example getting attacked while trying to move a farm took me out of the blueprint mode and then wouldnt let me move anything until i quit to menu then reentered.\n\nThe music is annoying after a bit. Some of it even has parts where it sounds like the game crashed and is just blaring a weird noise it is caught on which is just overall stress inducing in a new game where there could be bugs. Completely muted it by the end. SFX was decent though so didn't mute it", "timestamp_created": 1687553605, "timestamp_updated": 1687553605, "voted_up": true, "votes_up": 9, "votes_funny": 1, "weighted_vote_score": "0.643323242664337158", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140546662": {"recommendationid": "140546662", "author": {"steamid": "76561197994763127", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 208, "playtime_last_two_weeks": 0, "playtime_at_review": 83, "last_played": 1693392836}, "language": "english", "review": "A wonderful spiritual successor to Forager. I'm still in the early game, but if you loved Forager (esp. before the updates) then you'll love this too. I've been obsessed all morning and I'll be thinking about it all day at work...\n\nCrap. I'm late for work.", "timestamp_created": 1687516289, "timestamp_updated": 1687516289, "voted_up": true, "votes_up": 12, "votes_funny": 3, "weighted_vote_score": "0.641982853412628174", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "152961619": {"recommendationid": "152961619", "author": {"steamid": "76561198045137253", "num_games_owned": 0, "num_reviews": 23, "playtime_forever": 540, "playtime_last_two_weeks": 0, "playtime_at_review": 249, "last_played": 1702953217}, "language": "english", "review": "Awesome! forager but focused on automation. Its awesome how they simplify automation without reducing the fun of thinking about the ideal and optimal setup for your factory.", "timestamp_created": 1701828999, "timestamp_updated": 1701828999, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.638234853744506836", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "155842714": {"recommendationid": "155842714", "author": {"steamid": "76561197965207921", "num_games_owned": 838, "num_reviews": 7, "playtime_forever": 1563, "playtime_last_two_weeks": 0, "playtime_at_review": 1563, "last_played": 1705093517}, "language": "english", "review": "Nova Lands takes the automation genre and crosses it with Forager and the result is.....mixed.\n\nEarly game the automation is fun to set up, and the colourful characters and environments are also enjoyable. I spent a good few hours feeling like I was making progress and always had something to do while I was waiting for things to be manufactured.\n\nUnfortunately once you hit end game (15-20 hours in depending on your play speed) the game rapidly slows down. One of the final items I had to build took ages, even with almost all of the speed upgrades deployed into my build chains, and producing more items in parallel wasn't really possible due to the size of machinery required to produce said items. I basically left the game on and went and did other things for an hour or two to while the required items were produced. \n\nAll in all I enjoyed the majority of my time with this game, and despite the last 5 hours feeling like a slog (and the ending being a bit anticlimactic) I do recommend it, but a word to anyone coming in (or reaching that final stretch): Buy the recipe for and make use of the Black Hole Lubricant (oooh matron!)\nCompared to the regular lube (2x) and the super lube (4x) this is a whopping 16x build speed increase, and actually makes producing additional black holes required for the final solution a hell of a lot faster. \n\nI still think some of the late game build times could be reduced (either by the devs tweaking code values or by making other upgrades/systems available to the player, or perhaps at the cost of more complex recipes/material requirements), but as mentioned I did enjoy the rest of the game, and for just under £12 (I grabbed it on sale) I definitely got my moneys worth out of it either way.", "timestamp_created": 1705095822, "timestamp_updated": 1705095822, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.637476444244384766", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "144352796": {"recommendationid": "144352796", "author": {"steamid": "76561197994829594", "num_games_owned": 1333, "num_reviews": 57, "playtime_forever": 1691, "playtime_last_two_weeks": 0, "playtime_at_review": 1691, "last_played": 1692201441}, "language": "english", "review": "This is a conflicted \"no.\" It's a well-made game (with some annoyances), but it just doesn't bring enough to the table. It claims to be a mix of Forager, Factorio, and Satisfactory, but it's much closer to Forager than the other two, in both appearance and gameplay.\n\n[h1]vs Forager[/h1]\nFrom Forager, it pulls:\n[list]\n[*] the general cartoony, hyper-deformed art style\n[*] unlocking islands for progress and building space\n[*] new islands providing new resources to incorporate into production chains (rather than all resources available immediately, as in Factorio/Satisfactory)\n[*] a big focus on unlocking new skins\n[*] a small number of bots performing a large number of actions, trivializing most early-/mid-game needs\n[*] bosses (but Forager's are more interesting)\n[/list]\n\nSome comparisons vs Forager:\n[list]\n[*] the XP curve is much better and cleaning up the last of the skills is much easier\n[*] skill/research details are fully viewable from the start\n[*] bots are divided into three types (vs Forager's omni-type), and are restricted to a certain amount per island, requiring more thought put into deployment strategies\n[*] Forager has more puzzles, better clues for the puzzles, and more curious things to find on new islands; Nova Lands puzzles are mechanically simple and combinatorially complex but give almost no clues, making it near-impossible without a guide and trivial with one\n[*] Forager's NPCs have more and more interesting dialog (nothing real special, but it is a difference)\n[*] Forager's late-game unlocks trivialize most resource-gathering, whereas Nova Lands's change the challenge from resource-gathering to production-chain optimization\n[/list]\n\n[h1]vs the other two[/h1]\nI'm lumping Factorio and Satisfactory together because the only real difference is that Satisfactory's resource deposits are unlimited, while Factorio's can run out. In practice, any Factorio base large enough to chew through resource deposits is also large enough to expand to other territories.\n\nFrom F/SF, it pulls:\n[list]\n[*] production chain management and throughput analysis (but much simpler and without proper analysis tools)\n[*] logistic bots (but much dumber and harder to control)\n[*] a research tree for unlocking new buildings (but much shorter and more limited)\n[/list]\n\n[h1]Unique qualities[/h1]\nIt has a space-mining minigame.\n\n[h1]Suggestions to the devs[/h1]\n[list]\n[*]Expand the mid-game. Once bots and farms are unlocked, the rest of the game is just tedious. You need new mechanics introduced after those, rather than just new recipes.\n[*]Fix the boss puzzles. They are overly obtuse and not fun.\n[*]Add challenge achievements, rather than just time achievements. \"Defeat X boss without firing a shot\" should be something you should strive to be possible.\n[*]Provide a way to direct bots beyond just requester and provider chests. Maybe prioritization settings? Or more types of bots?\n[*]Reduce the overall skin unlock count and just provide most skins as \"alts\" of others, all unlocked at once.\n[*]The final unlock for the museum is pointless by the time it's unlocked. It should be exciting or game-changing.\n[/list]\n\n[h1]Conclusion[/h1]\nMediocre game with enough polish to be worth playing for a few hours if you can get it on massive discount. 4/7", "timestamp_created": 1692209431, "timestamp_updated": 1692209431, "voted_up": false, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.636167585849761963", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1702393389, "developer_response": "Hi there!\n\nThank you for detailed review for nova Lands. We're really appreciate that :)\n\nWe've just released a free content-update for Nova Lands – Quantum Gravity :)\nIt adds more story to the end, more automation mechanics, more buildings and more islands!\n\nCheers!"}, "140715610": {"recommendationid": "140715610", "author": {"steamid": "76561198079440345", "num_games_owned": 432, "num_reviews": 7, "playtime_forever": 1240, "playtime_last_two_weeks": 0, "playtime_at_review": 1240, "last_played": 1687753221}, "language": "english", "review": "A beautiful successor to Forager, honestly could say its better in every way.  Definitely more similar to Satisfactory than Factorio, which is a good thing. Makes for a nice, relaxing experience. My only complaint about the game is its length, THAT IT'S TOO SHORT! I hope the devs add more content but its definitely worth the $20 price tag!", "timestamp_created": 1687753838, "timestamp_updated": 1687753838, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.635164558887481689", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "147687105": {"recommendationid": "147687105", "author": {"steamid": "76561198017059206", "num_games_owned": 772, "num_reviews": 18, "playtime_forever": 2104, "playtime_last_two_weeks": 0, "playtime_at_review": 2104, "last_played": 1696518729}, "language": "english", "review": "Super fun (short) factory game. All achievements took about 35 hours (could probably shave off the 8 I left it on when I fell asleep). Looks like there is a plan for more content as there are some areas that seem to be missing in a later game portion of the game that don't have a way to unlock. Definitely worth it on sale!", "timestamp_created": 1696518933, "timestamp_updated": 1696518933, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.632434368133544922", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140934951": {"recommendationid": "140934951", "author": {"steamid": "76561198068450386", "num_games_owned": 0, "num_reviews": 27, "playtime_forever": 498, "playtime_last_two_weeks": 0, "playtime_at_review": 418, "last_played": 1694541145}, "language": "english", "review": "Feels very half-baked and unfinished. The intro is great, but later islands don't have the same level of polish. Later NPCs don't even get portraits.", "timestamp_created": 1688079810, "timestamp_updated": 1688079810, "voted_up": false, "votes_up": 29, "votes_funny": 1, "weighted_vote_score": "0.625108122825622559", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1702393485, "developer_response": "Hi there!\n\nWe're thrilled to announce that we've just released a free content-update for Nova Lands – Quantum Gravity :)\nIt adds more story to the end, more automation mechanics, more buildings and more islands!\n\nCheers!"}, "154491705": {"recommendationid": "154491705", "author": {"steamid": "76561197990188583", "num_games_owned": 0, "num_reviews": 221, "playtime_forever": 2095, "playtime_last_two_weeks": 0, "playtime_at_review": 2095, "last_played": 1703629983}, "language": "english", "review": "The Forager game is the closest alternative to this game. But multiple Islands economy with strong inter-island transportation issues and lack of space (in the endgame).\n\nIt's good until around middle game. Then suddenly it become more idler-game with few absolutely necessary complete overhauls of infrastructure over the course, because some of buildings become obsolete/too slow/occupying too much precious space.\n\n+ nice game overall;\n+ easy achievements, few secrets, few bosses, few puzzles;\n\n- spacewalk minigame: it's fun first few times, but game require you to grind it many times and it quickly become not fun;\n- dialogues: skipping 3 of same dialogues every time when you want to buy some seeds? seeing same outdated and obsolete gossip? seeing empty window when everything is bought? just lol\n- too slow crafting, it's really hours and hours of just blatant waiting for crafts to finish.. I basically quit game at some point, just because I can't let it run in background for so many hours and there is absolutely nothing to do in the meantime;\n- no option to turn off sounds when alt-tabbing;\n- some issues with AI and lack of priority for targets, the delivery chain may break completely;\n- some hidden limits, like robots can't take resources from drone station, if game want to introduce limits they need to be clear (e.g. marking buildings as input-only), giving hints or provide a workaround.. sure, I could just pickup a stack of packed materials and deliver that myself, but why drones can't deliver that too???\n- lack of direction: I need to google at least twice to figure out what to do next, there is no main quest or anything, there is no help in explaining steps required to finish goal if you stuck, there are some confusion, e.g. at some point game claims you got \"new island\" (singular), but you get \"two islands\" and it's hard/impossible to notice it, because map window is not designed to show you new islands;\n- the game clearly had a long development, because things get changed over time, new content added without respecting initial game mechanics, which may easily confuse, e.g. at start we discover islands by using special device, then we need to deal with \"wild\" islands, then some islands just pops up from the sea out of nowhere...\n- some mechanics are dull, e.g. housing, you just need to buy house, upgrade it, unlock furniture (buying it) until last tier, then put some of if in your house and never visit it again... game could as well just ask me for 100.000 Kredits to give me awesome perk to get 1/7 item crafted for free... ><\n\nI am really happy I could do 100% of achievements without fully finishing all bloated content, like buying all heads. The number of heads is just stupid. Grinding pearls for unlocking all npc heads is stupid.\n\nP.S.: WTF are monuments? I didn't figure out... I wonder who added them to the game and why..", "timestamp_created": 1703631403, "timestamp_updated": 1703631403, "voted_up": false, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.624686062335968018", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "155866243": {"recommendationid": "155866243", "author": {"steamid": "76561197968444328", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 545, "playtime_last_two_weeks": 0, "playtime_at_review": 545, "last_played": 1705124982}, "language": "english", "review": "                 Data miner on by default.\nNeeds registering on the Unity website to opt out.\n                           No thanks\n⣿⣿⣿⠃⣰⣿⣿⡟⠁⣴⣿⣿⣆⠀⠀⠀⠈⠛⢿⣿⣷⡄⣿⣿⠆⢹\n⣧⡘⣿⣦⡘⣿⡿⠀⠸⠛⢿⣿⣿⣆⠀⠀⠀⠀⠘⢿⣿⣥⣿⠁⣴⣿\n⡟⢰⣿⣿⣿⡿⠁⣀⣀⠀⠸⣿⣿⣿⣧⠀⠀⠀⠀⠀⠙⢿⣷⣤⣽\n⣇⠸⣿⣿⡿⠁⣰⣿⣿⣷⣾⣿⣿⣿⣿⣧⠀⢰⣿⡆⠀⠀⠻⣿⣿\n⣿⣿⣿⣿⡇⠠⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⣀⠉⠀⠀⠀⠀⠀⠙⢿\n⣿⣿⣿⣿⡇⢀⣄⡀⠉⠛⢿⣿⡿⠟⠉⢀⣀⣤⣿⣦⠀⠀⠀⣀⡀⠀⠹\n⣿⣿⣿⠟⠁⣸⣿⡇⠀⠀⣼⣿⡇⠀⠀⢸⣿⣿⣿⣿⡇⠀⢾⣿⣿⡆⠀⣿\n⣿⡿⠁⣰⣾⣿⣿⣷⣄⣴⣿⣿⣿⣦⣤⣼⣿⣿⣿⣿⣧⡀⠀⠉⠉⠀⠀⣿\n⣿⠇⢠⣿⣿⣿⣿⣿⠋⠉⠁⠀⠀⠉⠙⢿⣿⣿⣿⣿⣿⣷⣄⠀⠀⠀⢠⣿\n⡟⠀⣾⣿⣿⣿⣿⣧⣴⣶⣿⣿⣿⣶⣦⣼⡿⢿⣿⣿⠛⠛⢿⣦⡀⠀⢸\n⠁⢸⣿⣧⣨⣿⣿⣿⡟⠛⢻⣿⣿⣿⣿⣿⣄⣼⣿⣷⣀⣠⠿⠿⠋⢀⣼\n⣧⡀⠙⠛⠻⠿⠿⠿⠷⣤⣾⣿⡿⠿⠿⠟⠛⠛⠉⣉⣀⣀⣠⣤⣶⣿", "timestamp_created": 1705125271, "timestamp_updated": 1705125271, "voted_up": false, "votes_up": 14, "votes_funny": 1, "weighted_vote_score": "0.618533670902252197", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "141697876": {"recommendationid": "141697876", "author": {"steamid": "76561198034889404", "num_games_owned": 636, "num_reviews": 8, "playtime_forever": 1895, "playtime_last_two_weeks": 0, "playtime_at_review": 1311, "last_played": 1700627000}, "language": "english", "review": "The Nova Lands is an alright game.  I'm glad the description of the game mentions Factorio, Forager, and Satisfactory, because those are definitely the most apt comparisons, while I haven't played Forager myself, I am a huge Factorio addict, so I decided to take a chance on this game, wondering how it stacks up.\n\nI would say that, if you are looking for a more relaxed and casual Factorio experience, this is probably what you're looking for.  While the game does feature combat, it isn't particularly deep and I would not say I was challenged at any point, however for those that DO find the combat challenging, the fact that there are alternative solutions to the few boss enemies in the game that don't involve combat is a neat addition.\n\nWhile you won't get the absolute HIGH of Factorio, you will still get that great experience automation games give you, of having an incomprehensible and complex looking factory, where logistics bots are flying around, collector bots collecting, crafting stations crafting, and items in general just flying around the map to where they need to go, and as such I think it succeeds at being an automation game.\n\nI would say the first 3/4ths of the game is very solid, and I have very little criticism I feel I could give.  The last 1/4th however, just after you finish Plasteel research, is where I felt the game was dragging.  process timers in Assemblers and Refineries are pretty excessive, forcing you to build at larger scales, however this comes at the cost of resource generation.  I think ultimately the math works out because I would say there's at least 2 islands that I think you would have no issues if you just filled out the entire space with your actual factory, and the rest you would want to carefully think about how you're laying things out, but once again thinking about the process timers, i feel like there's just something to be said that one of the end game mechanics is just laying in bed to get a productivity bonus, really encourages just speeding up the timer rather than expanding out.\n\nThe game isn't very long, probably 20-30 hours to 100% it in it's current state, but I think that's absolutely fine for a game at this price.\n\nUltimately, if you're looking for a casual Factorio experience, it's a game I can recommend.", "timestamp_created": 1688923780, "timestamp_updated": 1688923780, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.618146240711212158", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140511089": {"recommendationid": "140511089", "author": {"steamid": "76561198142019150", "num_games_owned": 0, "num_reviews": 254, "playtime_forever": 445, "playtime_last_two_weeks": 0, "playtime_at_review": 60, "last_played": 1688329747}, "language": "english", "review": "Good game with open world. Cute graphics, easy gameplay.\nVery relaxing game.", "timestamp_created": 1687458789, "timestamp_updated": 1687458789, "voted_up": true, "votes_up": 17, "votes_funny": 2, "weighted_vote_score": "0.617530345916748047", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140708984": {"recommendationid": "140708984", "author": {"steamid": "76561198117097116", "num_games_owned": 1012, "num_reviews": 15, "playtime_forever": 666, "playtime_last_two_weeks": 0, "playtime_at_review": 260, "last_played": 1687955499}, "language": "english", "review": "Very similar gameplay to Forager but expands on a lot of what that game did while still being very unique and having its own charm.", "timestamp_created": 1687741716, "timestamp_updated": 1687741716, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.617026090621948242", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "155661210": {"recommendationid": "155661210", "author": {"steamid": "76561198079888410", "num_games_owned": 0, "num_reviews": 41, "playtime_forever": 1316, "playtime_last_two_weeks": 0, "playtime_at_review": 1018, "last_played": 1705167130}, "language": "english", "review": "GREAT LITTLE \"CITY BUILDER.\" however the end game feels clunky. thrown together and extremely confusing. i did not enjoy that part at all and actually stopped playing it was extremely frustrating. having 5 bots maxed out and they couldn't even keep up with demand. the end game needs to go in a better direction. its not fluid like most other city builders i enjoy", "timestamp_created": 1704852013, "timestamp_updated": 1704852013, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.613201260566711426", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "143745530": {"recommendationid": "143745530", "author": {"steamid": "76561198072066954", "num_games_owned": 0, "num_reviews": 47, "playtime_forever": 1707, "playtime_last_two_weeks": 0, "playtime_at_review": 1408, "last_played": 1691662825}, "language": "english", "review": "enjoyed the game, feels like a light resource management type sim, easy to get into, easy to hop on for 30 mins and continue where you left off. hopefully development for the game continues as it does feel a bit unfinished in the late game. art and vibes are on point! \n\ncomplaints: early - mid game is really fun and it feels like you have pretty consistent upgrades and minor logistic challenges to overcome and then you start to hit bottlenecks in the late game. namely production time (even with 1.5x upgrades), island size and bot limitations. things like not being able to set limits for logistics bots so you can control the flow a bit better. eg. only take from an output once there are at least 50 items sitting there. or not being able to set a lower number of max output it's either 1, 50 or 100. the last upgrades for production don't really feel like upgrades and take up a huge amount of space which is already limited.", "timestamp_created": 1691620541, "timestamp_updated": 1691620541, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.611926734447479248", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "151755841": {"recommendationid": "151755841", "author": {"steamid": "76561199181905076", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 1040, "playtime_last_two_weeks": 0, "playtime_at_review": 315, "last_played": 1712517685}, "language": "english", "review": "A nice, cozy take on automation games. Really enjoying my time with this title so far.", "timestamp_created": 1700894963, "timestamp_updated": 1700894963, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.609915614128112793", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140751234": {"recommendationid": "140751234", "author": {"steamid": "76561198069133301", "num_games_owned": 684, "num_reviews": 10, "playtime_forever": 1200, "playtime_last_two_weeks": 0, "playtime_at_review": 1200, "last_played": 1687806580}, "language": "english", "review": "I really wish i could recommend the game but i cannot. I was really waiting for this game to release cause i already loved forager. In the end the game offers too little for the price. The last parts of the game are just pure waiting for the ressources and it is not fun. The islands are very limited in space and in quantity, which limits how much and how fast you can produce. \n\nThere are also parts of the game which cannot be automated (asteroid grind) and it is just annoying. There are only 3 boss fights and they are way to easy. \nI recommend getting it on a 50%-75% sale.", "timestamp_created": 1687808422, "timestamp_updated": 1687808422, "voted_up": false, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.609723746776580811", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1702393500, "developer_response": "Hi there!\n\nWe're thrilled to announce that we've just released a free content-update for Nova Lands – Quantum Gravity :)\nIt adds more story to the end, more automation mechanics, more buildings and more islands!\n\nCheers!"}, "155796945": {"recommendationid": "155796945", "author": {"steamid": "76561198072550566", "num_games_owned": 514, "num_reviews": 17, "playtime_forever": 1420, "playtime_last_two_weeks": 0, "playtime_at_review": 1420, "last_played": 1705038841}, "language": "english", "review": "I like the style, I like the amount of skins that can be found, the music, and the secrets are all nice.\n\nEarly and mid game felt rewarding and fun, but late game everything takes way too long, and with the max amount of robots (5)  per island automation at this point can be a nightmare.  The point I'm at in the game it basically turns into an idle game where sleeping can get you 1 bonus product every X item created.  Not sure If i will finish this game which is unfortunate as I feel the devs put their hearts into this.", "timestamp_created": 1705039221, "timestamp_updated": 1705039221, "voted_up": false, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.605815529823303223", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140646170": {"recommendationid": "140646170", "author": {"steamid": "76561198165140634", "num_games_owned": 165, "num_reviews": 18, "playtime_forever": 177, "playtime_last_two_weeks": 0, "playtime_at_review": 177, "last_played": 1687653806}, "language": "english", "review": "I think this might be the first time I have down voted a game. Nova Lands isn't awful or broken, it is just boring. I liked Forager a lot and managed to get pretty into Factorio despite being pretty bad at scaling the factory. In this game, by the 3 hour mark I just had to ask myself \"what is the goal of this game?\" There is likely an answer but it is not made clear in the gameplay and I didn't find myself motivated to upgrade my gear or keep scaling up the production and going up the research tree. For a game that is $20, I shouldn't be completely bored and over it so soon in. What sucks is that I have been looking forward to this game since it was up for wishlist on Steam. I even really enjoyed the demo that they made. I don't know what happened between here and there, maybe it is me. Who really knows. I think it might be a fun game for some, but in trying to simplify factory games (which I can appreciate as someone who gets overwhelmed by the complexity), I feel that it lost all of the \"the Factory must grow\" urgency that other games have had that really pushes you to scale up. I'm going to put this game down for awhile and hope that coming back to it later may make it something I can be interested in again but until then I am going to have to say that it wasn't worth the money for me.", "timestamp_created": 1687654646, "timestamp_updated": 1687654646, "voted_up": false, "votes_up": 22, "votes_funny": 2, "weighted_vote_score": "0.601290702819824219", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140598673": {"recommendationid": "140598673", "author": {"steamid": "76561198071443140", "num_games_owned": 0, "num_reviews": 85, "playtime_forever": 189, "playtime_last_two_weeks": 0, "playtime_at_review": 30, "last_played": 1687694939}, "language": "english", "review": "Forager meets Factorio done right. Recommended for casual fans of the Automation genre.", "timestamp_created": 1687587801, "timestamp_updated": 1687587801, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.600121140480041504", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140523052": {"recommendationid": "140523052", "author": {"steamid": "76561198100858192", "num_games_owned": 541, "num_reviews": 28, "playtime_forever": 38, "playtime_last_two_weeks": 0, "playtime_at_review": 38, "last_played": 1687474326}, "language": "english", "review": "Factorio x Forager x Astroneer\nPretty fun so far.", "timestamp_created": 1687474370, "timestamp_updated": 1687474370, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.597572267055511475", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140718606": {"recommendationid": "140718606", "author": {"steamid": "76561197968426469", "num_games_owned": 0, "num_reviews": 59, "playtime_forever": 1041, "playtime_last_two_weeks": 0, "playtime_at_review": 1041, "last_played": 1687759694}, "language": "english", "review": "As others note end of the game is a bit of a drag with how painful it is to get end game production rolling with such small spaces to work with, but overall still enjoyed enough to recommend", "timestamp_created": 1687759855, "timestamp_updated": 1687759855, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.590934813022613525", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140791441": {"recommendationid": "140791441", "author": {"steamid": "76561198016215073", "num_games_owned": 769, "num_reviews": 6, "playtime_forever": 1227, "playtime_last_two_weeks": 0, "playtime_at_review": 1227, "last_played": 1687866913}, "language": "english", "review": "Fun little adventure. Won't fry your brain like factorio does.", "timestamp_created": 1687874253, "timestamp_updated": 1687874253, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.590015530586242676", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "142246437": {"recommendationid": "142246437", "author": {"steamid": "76561198078665071", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 703, "playtime_last_two_weeks": 0, "playtime_at_review": 703, "last_played": 1689541568}, "language": "english", "review": "Has elements of Forager, but it feels more similar to Factorio than anything else. Primarily will be a game of optimizing resource gathering, production of materials, ect. Balancing gathering and production is important. Has some pacing issues near plasteel stage where the production times being so low means spamming so many buildings you lower the amount of space where resources can spawn and islands feel very cramped. Overall if the industrial refinery and assembler times got lowered even more by a order of magnitude with the lubricant game would actually be amazing.", "timestamp_created": 1689568678, "timestamp_updated": 1689568678, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.586942076683044434", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "142692857": {"recommendationid": "142692857", "author": {"steamid": "76561197980772894", "num_games_owned": 0, "num_reviews": 50, "playtime_forever": 1227, "playtime_last_two_weeks": 0, "playtime_at_review": 1221, "last_played": 1701708645}, "language": "english", "review": "In general a recommendation, but the content is more like 10 bucks.\n\nThe first few hours are fun, but this fizzels out at some point.\nTheres obviously cut content to the point where I kept going just to see if I missed something, only to be left with a feeling of wasting my time for nothing.", "timestamp_created": 1690190391, "timestamp_updated": 1690190391, "voted_up": false, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.58681875467300415", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1702393442, "developer_response": "Hi there!\n\nWe're thrilled to announce that we've just released a free content-update for Nova Lands – Quantum Gravity :)\nIt adds more story to the end, more automation mechanics, more buildings and more islands!\n\nCheers!"}, "142645330": {"recommendationid": "142645330", "author": {"steamid": "76561198852136136", "num_games_owned": 73, "num_reviews": 21, "playtime_forever": 2978, "playtime_last_two_weeks": 0, "playtime_at_review": 823, "last_played": 1702308922}, "language": "english", "review": "i love it and im excited for more new content", "timestamp_created": 1690121191, "timestamp_updated": 1690121191, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.586466193199157715", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "141320593": {"recommendationid": "141320593", "author": {"steamid": "76561198021891180", "num_games_owned": 1678, "num_reviews": 14, "playtime_forever": 1605, "playtime_last_two_weeks": 0, "playtime_at_review": 1605, "last_played": 1688501237}, "language": "english", "review": "I hope the devolopers read this review, as I'm only trying to help.\n\nSo first of all:\nI really liked the game, even though I can't recommend it, in it's current state.\nThe game just feels like an early access game at this point in time.\nI'm pretty sure there is a reason, why it had to be released in this state.\nLike just a quick example: There is a research for Modules, that upgrade your bots in a way.\nCool feature, but there are only 2 at the moment. It wouldn't have bothered me, if I didn't knew that there were supposed to be more, as the research is called \"Modules 1\". The only researches with numbers always have a \"xxx 2\" at least, but not this one, as if they removed it or didn't have time to implemente it.\nThis is just one of the many examples, where you feel that this game should have been in devolpment for a longer time or start in early access.\nI will surely play this game in some years and all it will feel like a finished game and I can change the review to recommended, but we will have to see.\nIf you want any feedback, feel free to comment or write me directly, as I see the potential, what this game could have been.", "timestamp_created": 1688502392, "timestamp_updated": 1688502392, "voted_up": false, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.585589706897735596", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "142578061": {"recommendationid": "142578061", "author": {"steamid": "76561198011231502", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 1475, "playtime_last_two_weeks": 0, "playtime_at_review": 1465, "last_played": 1702394635}, "language": "english", "review": "Great game for some casual fun. Cute graphics, enticing gameplay, clear-enough UI, it's all in all very well-done. While there are multiple Stardew-farming-sim kind of game, I wonder why there is not more of this, it's great when this is so nicely done!\n\nHighly reminescent of Forager, but with some welcomed twists, including the early automation which makes you rethink your setup several times during your playthrough.\n\nThe early game has some nice onboarding, with quests to guide you, while the endgame and everything space-related seems a bit more rushed, and hopefully there will be DLC or updates for even more content. I'll most certainly buy it.\n\nNote that like Forager, you'll have around 25 hours of fun and not much to do afterwards, so if you require endless gameplay the game won't provide it (as of now).", "timestamp_created": 1690024692, "timestamp_updated": 1700594662, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.583229959011077881", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "153316819": {"recommendationid": "153316819", "author": {"steamid": "76561198051421864", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 1770, "playtime_last_two_weeks": 0, "playtime_at_review": 1636, "last_played": 1702238040}, "language": "english", "review": "Wonderful game. If you liked Forager this is for you. I hope they continue to update. So far nice QoL has been added and it's been a pleasure to play these past 25+hrs. Thanks for the great content!", "timestamp_created": 1702231240, "timestamp_updated": 1702231240, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.580399036407470703", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140506432": {"recommendationid": "140506432", "author": {"steamid": "76561197999451870", "num_games_owned": 2547, "num_reviews": 82, "playtime_forever": 300, "playtime_last_two_weeks": 0, "playtime_at_review": 300, "last_played": 1687450452}, "language": "english", "review": "Nova lands will remind most people very heavily of Forager - but with better automation, and a better graphical style.\n\nPros:\n- Nice, clean graphics\n- simple, but enjoyable gameplay loop\n- better automation than forager, and more interesting\n- has a bit of grind, but nowhere near as bad as other games in the genre\n- Boss fights are interesting\n\nCons:\n- Islands feel \"samey\" even though they have different enemies and resources\n- the resource balance could still use a little work\n- doesn't have the same replay-ability as some other titles like this that are more rng heavy.\n\nFull video review can be found here: https://youtu.be/GVJMvnzvdYI", "timestamp_created": 1687453352, "timestamp_updated": 1687453352, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.579684734344482422", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "145634407": {"recommendationid": "145634407", "author": {"steamid": "76561197992030206", "num_games_owned": 3076, "num_reviews": 83, "playtime_forever": 2114, "playtime_last_two_weeks": 0, "playtime_at_review": 1482, "last_played": 1693838055}, "language": "english", "review": "Fairly short game. Definitely very similar to forager. There are definitely many things that could be improved upon, such as the automation system, but the game is short enough that it isn't a huge deal.\n\nNote that there isn't much to do once you've completed the game, but there are more things to do than there are achievements.\n\n\nExamples of issues below:\n\nAs an example, it seems like bots somewhat break if you have too many buildings on an island as some of my bots stopped taking certain actions such as refilling lubricant despite having two of them idle. (This was fixed after a restart).\n\nOther issues include that excess stock is not used to fill up the production buildings. I'd expect that it fill the unused slots as priority, but then when the stock of a material hits 100 (cap), that it start using that stock to fill up production building slots. This is mainly an issue for power sources that need to be always running or they break the supply chain and potentially cripple your entire island set.s\n\nAdvanced twig farms can only have their first tree turned into a bee hive. Doing this makes the entire tree farm do nothing as the beam is stuck on the first tree and does not automatically harvest the hive.\n\nHarvester priority can be somewhat annoying when trying to capture creatures that move a lot as the harvester (on controller) will often prioritize everything but the creature. This can be made worse if you have a fighter bot on the island as you can't temporarily disable them except by removing them from the antenna and in many cases, the bots will often either kill the creature first or it will be very close (bots can kill a creature that is in the capture animation or being mounted).\n\nTrying to send bots on more than 7 islands is effectively impossible on m+kb because it will keep trying to return to the top, but there are 8 islands that you'd want to send to. On controller it is just barely possible if you hold down the button.\n\nAs a note: It is possible to jump into the water instead of onto an island. If you do, you'll just walk on the water for a bit until you jump back onto an island.", "timestamp_created": 1693800972, "timestamp_updated": 1693835028, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.576987683773040771", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "156477851": {"recommendationid": "156477851", "author": {"steamid": "76561198332701463", "num_games_owned": 0, "num_reviews": 28, "playtime_forever": 6679, "playtime_last_two_weeks": 0, "playtime_at_review": 6676, "last_played": 1711930983}, "language": "english", "review": "I bought this game in part for the exploration, combat, and zelda-like presentation, but then I realized it was 90% a factory/automation game. Then, I realized I actually like factory games and I want to play more factory games. So if you're looking for a good way to get into the genre, this is a nice beginner-friendly introduction.", "timestamp_created": 1705853134, "timestamp_updated": 1705853134, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.574679017066955566", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140745912": {"recommendationid": "140745912", "author": {"steamid": "76561198324434450", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 2201, "playtime_last_two_weeks": 0, "playtime_at_review": 1235, "last_played": 1702028960}, "language": "english", "review": "Cool one, you don't need absolute crazy automation, but still offers enough to be satisfying. Only grinding is the last hour or so, when you mostly wait, If you have less automation, this wait could be longer though.\n\nNot re-playable but really chill and fun for 20 or so hours.", "timestamp_created": 1687802323, "timestamp_updated": 1687802323, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.572219312191009521", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "143878699": {"recommendationid": "143878699", "author": {"steamid": "76561199050115230", "num_games_owned": 69, "num_reviews": 26, "playtime_forever": 985, "playtime_last_two_weeks": 0, "playtime_at_review": 789, "last_played": 1702039928}, "language": "english", "review": "i killed the planet, started a war with the bees, got betrayed by my own company and abused all lifeforms on the planet. 10/10 best real life sim", "timestamp_created": 1691754819, "timestamp_updated": 1691754819, "voted_up": true, "votes_up": 5, "votes_funny": 3, "weighted_vote_score": "0.572164952754974365", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "155551545": {"recommendationid": "155551545", "author": {"steamid": "76561198035894643", "num_games_owned": 0, "num_reviews": 35, "playtime_forever": 10, "playtime_last_two_weeks": 0, "playtime_at_review": 10, "last_played": 1704544520}, "language": "english", "review": "Rebinding my controller was a pain, and I couldn't even get it to work with xpadder either.\n\nAnd no, I'm not going to let you Data Mine me.  \nnice try.", "timestamp_created": 1704718328, "timestamp_updated": 1704718721, "voted_up": false, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.569395661354064941", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140569331": {"recommendationid": "140569331", "author": {"steamid": "76561198022142449", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 2297, "playtime_last_two_weeks": 1, "playtime_at_review": 1451, "last_played": 1713083101}, "language": "english", "review": "Ok holy cow. Listen, Jsut get it and play it. I would and could say more in 23 hours but it'd just spoil it. Just trust me. Get it yo. You will NOT regret it. I am not. I was sad cause i thought it was coming to an end and then....\n\nThank you dev for taking my money but i need to be honest here- idk if you took enough of it for what i'm being exposed to.", "timestamp_created": 1687545769, "timestamp_updated": 1687545769, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.568345308303833008", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140590584": {"recommendationid": "140590584", "author": {"steamid": "76561198009016797", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 3480, "playtime_last_two_weeks": 0, "playtime_at_review": 227, "last_played": 1703197094}, "language": "english", "review": "Fun, if you liked Forager you will enjoy this", "timestamp_created": 1687573910, "timestamp_updated": 1687573910, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.563535332679748535", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "142823866": {"recommendationid": "142823866", "author": {"steamid": "76561198041812857", "num_games_owned": 0, "num_reviews": 29, "playtime_forever": 1776, "playtime_last_two_weeks": 0, "playtime_at_review": 1776, "last_played": 1689671622}, "language": "english", "review": "This is a mildly entertaining time waster with a few fun elements.  it is NOT worth $30 or your local equivalent.  DO NOT PAY FULL PRICE FOR THIS GAME.  If you absolutely want to try it out, please wait until its at least 75% off.  Then it might be worth it.", "timestamp_created": 1690365005, "timestamp_updated": 1690365005, "voted_up": false, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.560617566108703613", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1702393423, "developer_response": "Hi there!\n\nWe're thrilled to announce that we've just released a free content-update for Nova Lands – Quantum Gravity :)\nIt adds more story to the end, more automation mechanics, more buildings and more islands!\n\nCheers!"}, "141073628": {"recommendationid": "141073628", "author": {"steamid": "76561198079895141", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 1979, "playtime_last_two_weeks": 0, "playtime_at_review": 1979, "last_played": 1688238019}, "language": "english", "review": "I highly recommend this game if you love base building and automation. \nI managed to finish the game and unlock all the achievements in about 33 hours of relaxed play. \nI REALLY hope more will be added to the game over time, would definitely come back and play some more.", "timestamp_created": 1688238274, "timestamp_updated": 1688238274, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.559050261974334717", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "146422330": {"recommendationid": "146422330", "author": {"steamid": "76561198121758741", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 2124, "playtime_last_two_weeks": 0, "playtime_at_review": 2085, "last_played": 1702083256}, "language": "english", "review": "A great little base-builder game! It is similar to Forager in that resources respawn after a time, and new areas must be unlocked by expanding your facilities to manufacture new products. Nova Lands expands on this with amazing pixel-art aesthetics as well as some light automation.\n\nMy only real complaint is that there isn't more of it, but at the time of this review there is a content patch being developed, so I'll definitely be coming back for another run once that drops.  That said, the game is still worth the pricetag as-is.", "timestamp_created": 1694892353, "timestamp_updated": 1694892353, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.558823525905609131", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "141376070": {"recommendationid": "141376070", "author": {"steamid": "76561197988488741", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 3037, "playtime_last_two_weeks": 0, "playtime_at_review": 1014, "last_played": 1701795321}, "language": "english", "review": "Prepare to lose hours of your life.", "timestamp_created": 1688568903, "timestamp_updated": 1688568903, "voted_up": true, "votes_up": 5, "votes_funny": 2, "weighted_vote_score": "0.558753132820129395", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "155913121": {"recommendationid": "155913121", "author": {"steamid": "76561199044023247", "num_games_owned": 0, "num_reviews": 17, "playtime_forever": 16, "playtime_last_two_weeks": 0, "playtime_at_review": 16, "last_played": 1705176338}, "language": "english", "review": "data miner lol", "timestamp_created": 1705176623, "timestamp_updated": 1705176623, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.557091116905212402", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "154555076": {"recommendationid": "154555076", "author": {"steamid": "76561198331646252", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 106, "playtime_last_two_weeks": 0, "playtime_at_review": 106, "last_played": 1702827827}, "language": "english", "review": "Not enough new here. Sticking to forager until some sort of content injection.", "timestamp_created": 1703697548, "timestamp_updated": 1703697548, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.556949973106384277", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "155996304": {"recommendationid": "155996304", "author": {"steamid": "76561197982180891", "num_games_owned": 1450, "num_reviews": 62, "playtime_forever": 1998, "playtime_last_two_weeks": 0, "playtime_at_review": 1998, "last_played": 1705268679}, "language": "english", "review": "It's not really a good game... it's fine. It's basic, but you can tell the devs sort of lost their way as the game went on. I feel like it was heavily inspired by Forager (but Forager is way more fun), and if it wasn't... it's very similar.\n\nThe \"end\" is basically a massive grind/wait for some items that take 38 minutes and 24 seconds to craft... and you need 31 of them. I basically just went and played something else and left it running. There's not enough space to scale up massively like other logistics games, so you'll be stuck waiting either way.\n\nAlso, the game pretends to have a story, but if \"land on planet, mine some stuff, send some stuff to earth, earth people try to come to planet so you murder them all\" is a story... then... sure...\n\nIf you're interested wait for a large discount (50%+). There are much better logistics games out there.", "timestamp_created": 1705268924, "timestamp_updated": 1705268924, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.555624902248382568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "141388956": {"recommendationid": "141388956", "author": {"steamid": "76561197961604048", "num_games_owned": 1023, "num_reviews": 4, "playtime_forever": 1452, "playtime_last_two_weeks": 0, "playtime_at_review": 1452, "last_played": 1688347185}, "language": "english", "review": "This game is fun dont get me wrong but there isn't $20 worth of content here.... you beat it super quick and then what? theres nothing to do.  needs way more content to justify the $20 price tag... fun game dont get me wrong just its so dang short.", "timestamp_created": 1688580549, "timestamp_updated": 1688580549, "voted_up": false, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.555403947830200195", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1702393467, "developer_response": "Hi there!\n\nWe're thrilled to announce that we've just released a free content-update for Nova Lands – Quantum Gravity :)\nIt adds more story to the end, more automation mechanics, more buildings and more islands!\n\nCheers!"}, "144295904": {"recommendationid": "144295904", "author": {"steamid": "76561198242115026", "num_games_owned": 0, "num_reviews": 17, "playtime_forever": 4082, "playtime_last_two_weeks": 0, "playtime_at_review": 1793, "last_played": 1706873566}, "language": "english", "review": "Very Forager inspired. And as a Forager fan, as well as a Factorio fan, let me just say that this game ticks all the checkboxes in ways the other games didn't. Forager lacked enough automation while having a bit of it. Factorio lacked enough action while having a bit of it. This game has a proper mix of both.\n\nHowever, the game is very short and it feels like it's easy to clear through everything rather quickly. However, in my opinion, being too short is better than being too long as it's a sign that the devs know how to put heart into the intended fun and make it count. Also, since it is short, it has already allowed me three playthroughs, each getting more fun.", "timestamp_created": 1692140413, "timestamp_updated": 1692140413, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.553145825862884521", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "141065439": {"recommendationid": "141065439", "author": {"steamid": "76561198140962071", "num_games_owned": 160, "num_reviews": 20, "playtime_forever": 2318, "playtime_last_two_weeks": 0, "playtime_at_review": 2318, "last_played": 1688230365}, "language": "english", "review": "this game was exactly what i needed so thank you, developers, i thoroughly enjoyed playing your game", "timestamp_created": 1688230924, "timestamp_updated": 1688230924, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.550898194313049316", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140675566": {"recommendationid": "140675566", "author": {"steamid": "76561198021080609", "num_games_owned": 0, "num_reviews": 45, "playtime_forever": 1385, "playtime_last_two_weeks": 0, "playtime_at_review": 1009, "last_played": 1688058142}, "language": "english", "review": "Very much like Forager, but with a bit more focus on automation and more complex recipes. Expect less exploration. Less tools/weapons. Less fighting. Less puzzles. \n\nI'd say I finished the game after some 10 hours and completed all achievements after almost 17 hours. I did some idling in the end to craft some high tech stuff, but no more than 1-2 hours.\n\nAfter it's release into early access the game feels very polished. I've encountered not a single bug.", "timestamp_created": 1687702248, "timestamp_updated": 1687702331, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.550449550151824951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "142102841": {"recommendationid": "142102841", "author": {"steamid": "76561198045844328", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 320, "playtime_last_two_weeks": 0, "playtime_at_review": 320, "last_played": 1688503766}, "language": "english", "review": "Pros:[list]\n    [*] The graphics are cute and charming as anything. The aesthetic holds up well, and the interface seems well-polished for doing the kinds of things one might want to do in a base-builder. You can tell a lot of care went into this game. Typically, the game does a great job of showing the player what's going on.\n    [*] Controls for your main character are great, and seem to work equally well on keyboard / mouse and with a controller: I was able to enjoy the game with a gamepad from my couch, and didn't ever feel like I was missing out on anything. I never felt like I was getting stuck on obstacles or that I was building myself into a corner.\n    [*] Amazingly \"chill\" vibe, subtly amazing music, and a great library of \"techy\" sounds that fit the whole theme and make the world feel like the best parts of your favorite sci-fi movie. The game is relaxing to hear as you play it. Even the \"out of air\" warning chime is kind of adorable.\n[/list]\nCons:[list]\n    [*] Gameplay is deceptively linear, especially if you're starting with a firm grounding of other games in the genre: there's about five seconds of \"decision\" at each step, which is just going into the research tree and discovering what you need to unlock the next thing, followed by several minutes of waiting for your bots to make it. Any time that the game looks like it's about to \"branch off\" into possible tasks A and B, I end up \"conveniently\" gated behind some arbitrary limit where I end up having to do everything in A-B-C order anyway, no matter what. The tech tree isn't really a \"tree\", but a very twisted tree-shaped line.\n    [*] There's no REASON to do any of the things you're doing, except for the sake of following the formula to say that you've completed it: no overarching villain, no pressure to keep going, no reason to actually spend your resources on anything. Just... Harvest A. Use A to make B. Repeat X times to unlock C in the research screen. Use C to open up a new island with resource D, and then repeat. Instead of unlocking cooler machines to automate stuff better, I end up just giving myself more work to do. After unlocking bio fuel and seeing the absolute slog it takes to get to plasteel, my soul gave up.\n    [*] Related to the above: I couldn't see any real consequences for failure. It'd be REALLY hard to lose this game in any meaningful way, and without any real challenge there isn't any sense of accomplishment for doing anything. With every obstacle I came across there wasn't ever any question of being able to complete it, but just a lot of groaning at how long it was going to take to collect that many resources.\n    [*] There aren't really any differences to all your tech levels; nothing unlocks a new gameplay mode or a new way to harvest stuff. Upgrading equipment and such makes you faster, or tougher, or better at mining, etc... in other words, it allows you to do the exact same stuff a bit faster. Nothing feels like an upgrade or progress, it's just moving from Some-Furnace to Slightly-Better-Furnace. \n    [*] Each research just gives you a new building that can process a different set of things. I then produce some other arbitrary resource in that building and wait to produce some arbitrary number of those for the tech tree, unlocking the next resource in the chain. Then I repeat the whole shebang again to harvest a new resource on another island, with the same five bots and a slightly different biome and (oh, joy!) another NPC with a slightly different list of grocery shopping I need to do for them before I can unlock the next doodad I need, which is just another building that can process the stuff you've conveniently just unlocked.\n[/list]\nMaybe there's more depth as you progress onward past the first seven islands... but I got completely burned out on the gameplay loop far before then. There's a lot to love here, but I personally had a hard time finding any motivation to keep playing, and got to that point very quickly. Someone looking for a more casual experience might love it, but if you're a die-hard Factorio player like me then I don't think this will have enough depth to keep you hooked.", "timestamp_created": 1689390055, "timestamp_updated": 1689390055, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.550421476364135742", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "154854014": {"recommendationid": "154854014", "author": {"steamid": "76561197993544162", "num_games_owned": 169, "num_reviews": 15, "playtime_forever": 1062, "playtime_last_two_weeks": 0, "playtime_at_review": 1062, "last_played": 1703983638}, "language": "english", "review": "Really enjoyed this game, gave me similar feelings playing it as Forager did but like 10x less grind to get everything done. Both the music and art style were pleasing, progression felt good and I always felt like I knew what next goal I should be working towards.", "timestamp_created": 1703983926, "timestamp_updated": 1703983926, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.548022627830505371", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "154642058": {"recommendationid": "154642058", "author": {"steamid": "76561198059264317", "num_games_owned": 390, "num_reviews": 37, "playtime_forever": 496, "playtime_last_two_weeks": 0, "playtime_at_review": 496, "last_played": 1703776495}, "language": "english", "review": "While not the worst entry within the craft and automate genre, Nova Lands doesn't bring anything new to the table. The art style and graphics are cute, but they feel generic. Early game starts off interesting, but gets tedious and slow towards the middle. If the concept of this game interests you, I would recommend checking out forager instead.", "timestamp_created": 1703784191, "timestamp_updated": 1703784191, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.54771125316619873", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140527223": {"recommendationid": "140527223", "author": {"steamid": "76561197972611112", "num_games_owned": 0, "num_reviews": 35, "playtime_forever": 1599, "playtime_last_two_weeks": 0, "playtime_at_review": 433, "last_played": 1687655410}, "language": "english", "review": "Forager with automation, cute bots, and a better UI. The controller support is great and works well. The gameplay is fun and the artwork is pretty.", "timestamp_created": 1687481422, "timestamp_updated": 1687481422, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.547300100326538086", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "144092633": {"recommendationid": "144092633", "author": {"steamid": "76561198011724781", "num_games_owned": 0, "num_reviews": 34, "playtime_forever": 1236, "playtime_last_two_weeks": 0, "playtime_at_review": 1156, "last_played": 1703302506}, "language": "english", "review": "I like automation/factory games and this is a shorter (~20h) and fun one.\n\nThere were only two negative things in my opinion:\n[list]\n[*] I would have liked some bigger islands because it gets cramped but i was very close too the end so it wasn't a big deal.\n[*] The [spoiler]spacewalker[/spoiler] minigame isn't very good just a bit tedious.\n[/list]\n\nMusic is fine. Somewhat fitting but not something i would listen to outside the game.\nAll in all I found the game good and had a fun time playing.", "timestamp_created": 1691933777, "timestamp_updated": 1691933777, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.544554471969604492", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "147851437": {"recommendationid": "147851437", "author": {"steamid": "76561198037153007", "num_games_owned": 342, "num_reviews": 47, "playtime_forever": 1525, "playtime_last_two_weeks": 0, "playtime_at_review": 1524, "last_played": 1705292386}, "language": "english", "review": "My first thought after seeing a screenshot was 'hmm.. Forager met Factorio'. Read the description, was confirmed and immediately wishlisted for when time would be right. I loved all games this one took inspiration from and was very happy to see old ideas well recreated and new things sprinkled in so it does absolutely not feel like a plain rip off. \nI quickly lost track of time and just enjoyed the gameplay, which feels natural and relaxing. Mostly. I like games where the devs managed to find the right balance between guiding the player too much or not at all. Nova Lands is like Factorios younger sibling. Ab bit more friendly, not as serious and unforgiving. Basically cuter, more colorful and of course way simpler to deal with in general.\nStandard early game, collecting stuff, slowly mining by hand and then start delegating most of the repetitive tasks to the bots. \nAssigning them works mostly fine, only while handling crops they mess up from time to time. I missed some way of setting priorities to prevent the bots from using up complete harvests and not filling up the extractor enough to resow the farm. It felt like this behavior gets worse, when using multiple advanced farms on one island and only one extractor.\n\nExcept from this I've had a lot of fun exploring the world, the mechanics and the unexpected surprises for the first ten or fifteen hours. After that, when the endgame comes in reach, I should have just quitted, because the next long hours have been nothing but chore. Part of this goes on me, as I tend to overthink the simplest decisions, like what island to use for what production (or only a part of it?), while having a hard time keeping the perfectionist down. But here is my complain: in true style of Factorio the endgame is mostly not exploring or managing new things, but instead repeating everything you've done so far in a bigger scale. You basically have to, or it would take forever to get the massive amounts of everything you need. \nWith completely upgraded everything the construction of the final items take around 15 minutes each. So, of course, you just build a massive machinery that makes multiples of the desired item at the same time, so you don't have to wait for 25 hours for one assembler crafting the 100 hypercomputers. That's what these games are about, right? I'd love to, but in my opinion the map is simply too small to fit as many buildings as you'd need. I planned for at least 25 assemblers for the hypercomputers, to reduce the total waiting time to around an hour. Preferably even more assemblers, but after basically filling most of the map with everything for the final chain, it took four hours of mostly waiting, until the last numbers finally ticked towards 100. I covered 3/4 of Rock Island in furnaces, but even 25 continuously smelting steel were not able to keep up with the demand. I used advanced furnaces, as the game shows the same ratios for furnace 2 and 3. If I had checked the wiki while playing I probably would have realized, that the mega furnace has the same ratio indeed, but is waaaay faster und using it would have probably solved most of my trouble.\nI'd like to suggest to increase the island sizes in general, for people who prefer to spread out a bit and not like building cramped factories. Also it would be so very handy to have the corresponding times shown together with the recipes.\n\nAnd one more thing: Please change the way the player selects buildings. This 'selection depending on the characters previous walking direction' is just so annoying, especially when navigating between multiple buildings. Please create an option for using the cursors position or at least 'select what the character is facing'. That would be awesome.\n\nEven I missed the part with the different durations and scrubbed hard against the rage quit, I enjoyed enough of my time with the game to absolutely recommend it. But maybe not for completionists with a low frustration tolerance.", "timestamp_created": 1696751363, "timestamp_updated": 1696751363, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.54356849193572998", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "147462333": {"recommendationid": "147462333", "author": {"steamid": "76561199186362689", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 2036, "playtime_last_two_weeks": 0, "playtime_at_review": 1885, "last_played": 1703719542}, "language": "english", "review": "Very addicting game. I am always thinking about the most efficient way to do things so this was the perfect game for me. It is very much a thinking game, developing strategies to improve throughput times, and early game is full of exploration. For the end game, it could use some work, it was a lot of waiting for materials to be produced with not many rewards. Nova Lands has very cute graphics and skins; that is what first drew me in :)", "timestamp_created": 1696191512, "timestamp_updated": 1696191512, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.542412161827087402", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "141265694": {"recommendationid": "141265694", "author": {"steamid": "76561198036584684", "num_games_owned": 1801, "num_reviews": 139, "playtime_forever": 935, "playtime_last_two_weeks": 0, "playtime_at_review": 935, "last_played": 1688444298}, "language": "english", "review": "This game is amazing, it's just like Forager but 10X better, also the dev isn't a huge POS", "timestamp_created": 1688444734, "timestamp_updated": 1688444734, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.542400062084197998", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "141409706": {"recommendationid": "141409706", "author": {"steamid": "76561198027436446", "num_games_owned": 818, "num_reviews": 109, "playtime_forever": 3871, "playtime_last_two_weeks": 0, "playtime_at_review": 2997, "last_played": 1689093165}, "language": "english", "review": "Similar to Forager, Nova Lands makes you want to amass large amount of items, while automating everything in that process. Gem of an indie game, the sad thing about it is that it ends.\n\nMy quick video review about it is found here:\nhttps://www.youtube.com/watch?v=9rur1PNjBw8", "timestamp_created": 1688601673, "timestamp_updated": 1688918932, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.541778981685638428", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "142815408": {"recommendationid": "142815408", "author": {"steamid": "76561198047056354", "num_games_owned": 0, "num_reviews": 32, "playtime_forever": 215, "playtime_last_two_weeks": 0, "playtime_at_review": 139, "last_played": 1690399166}, "language": "english", "review": "Mix of Forager and Factorio but doesn't do either of them well unfortunately.  The game is extremely limited in the amount of factory building you can do, it kind of just felt like tedious busywork to me, progression feels bad, especially since there's a 5 bot limit and an annoying amount of inventory management.  Maybe I'll come back to this later if there's a big patch but for now it's an easy skip unless there's a deep sale.  Play the games that inspired this instead.\n\nEdit: Got to the endgame by chipping away at the game in short sessions and it's pretty bad.  There's basically no meaningful progression in terms of scaling up your production, and the controls for interacting with your buildings and resource nodes and moving them around are really clunky, especially when you need to start spamming buildings together because of the space constraints.  Bosses have been really simplistic too, not sure if this game even needed player combat.  There's just a lot of bad QoL and a subpar gameplay loop. Sadly this is just one of those games where the idea sounds great but the execution is way off.", "timestamp_created": 1690350260, "timestamp_updated": 1690903212, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.541284441947937012", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140696093": {"recommendationid": "140696093", "author": {"steamid": "76561198006164600", "num_games_owned": 2775, "num_reviews": 22, "playtime_forever": 1171, "playtime_last_two_weeks": 0, "playtime_at_review": 1171, "last_played": 1687725306}, "language": "english", "review": "I couldn't stop playing, which is a good thing (for the developers, not for my health)! The only other game that has ever done that to me is Factorio, which this game definitely took some inspiration from. Finished the game in 20 hours (over two days...), including all the achievements. Combat is optional, has some fun ideas, but in the end it's just way too easy. The factory part is enjoyable, it requires some revisions of your layout as you unlock more items, but pretty basic compared to the true factory games. It scratched my Factorio itch, so definitely recommend if that's what you like!", "timestamp_created": 1687726086, "timestamp_updated": 1687726239, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.540636062622070313", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "156392970": {"recommendationid": "156392970", "author": {"steamid": "76561198215674553", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 116, "playtime_last_two_weeks": 0, "playtime_at_review": 116, "last_played": 1705170624}, "language": "english", "review": "Nova lands is like Forager if it was set in the future and allowed a lot more in terms of automation. Every skill feels useful, and the progression is fun and easy to understand.\n\nHowever they opt you into data mining without giving any kind of warning or giving you an option.", "timestamp_created": 1705770359, "timestamp_updated": 1705770359, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.540588140487670898", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140510840": {"recommendationid": "140510840", "author": {"steamid": "76561198034961725", "num_games_owned": 0, "num_reviews": 32, "playtime_forever": 2796, "playtime_last_two_weeks": 0, "playtime_at_review": 31, "last_played": 1702823382}, "language": "english", "review": "So far a very nice relaxing game.\nBasically it's a blend of Forager and Factorio.", "timestamp_created": 1687458526, "timestamp_updated": 1687570701, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.538778960704803467", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "144380225": {"recommendationid": "144380225", "author": {"steamid": "76561197991263358", "num_games_owned": 2887, "num_reviews": 226, "playtime_forever": 1463, "playtime_last_two_weeks": 0, "playtime_at_review": 295, "last_played": 1697664987}, "language": "english", "review": "Basically Forager, but actually fun. Removes the grind of forager, and makes the progression fun and interesting. Significantly less buggy than forager, with a neat story and characters. Highly recommend it!", "timestamp_created": 1692241967, "timestamp_updated": 1692241967, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.538461565971374512", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140659683": {"recommendationid": "140659683", "author": {"steamid": "76561198141560704", "num_games_owned": 429, "num_reviews": 47, "playtime_forever": 1975, "playtime_last_two_weeks": 0, "playtime_at_review": 650, "last_played": 1688079754}, "language": "english", "review": "Great survivalcraft game for people with day jobs. You know how a lot of open world games are bigger than they need to be and therefore the content is either very sparse or repeated ad nauseum? This game does the opposite. It has no issue with you finishing the game in 10 hours (I took my time with it and expect to get about 15 out of it) and will make sure that 10 hours is a complete experience.\n\nEDIT: I was completely wrong. It probably takes about 10 hours to get a third of the way through the game lol. There's a lot more to do once you've reached the last tech tier. Not even close to the end. \n\nYou should go into this expecting something along the lines of Don't Starve, but with a couple bosses that might remind you of something out of Core Keeper, and a crafting/automation system that's similar to Cryofall but with less micromanagement. \n\nOne of the game's really big strengths is that it makes sure not to get in your way with anything mildly infuriorating, such as being too picky about how you need to position around a resource node to gather it, or sending you on some unnecessarily long side trip to be able to craft something you just unlocked, It just lets you keep your momentum up and gives you enough to do that you don't ruin your own fun by going too fast. \n\nIf I had to criticize something it'd be the claw arms- like what purpose do those really serve whatsoever if bots can't grab from them?", "timestamp_created": 1687679011, "timestamp_updated": 1687759756, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.537987709045410156", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "141343804": {"recommendationid": "141343804", "author": {"steamid": "76561198075882432", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 739, "playtime_last_two_weeks": 0, "playtime_at_review": 739, "last_played": 1687797708}, "language": "english", "review": "Absolutely my favorite automation game out there. The eventual issue with Factorio, and Satisfactory, and the like, is honestly building hyper colossal mega factories is a tremendous time sink and isn't really that rewarding. \n\nNova lands changes that. The game is significantly smaller, with progression being a lot faster and more rewarding. The end game isn't some rocket that needs 50 billion items to build, it's a cool ass hat you get to wear while you watch your hypersonic logistic bots break the sound barrier while snagging your twigs from the farm.\n\nYou very consistently get new content, new machines, new upgrades. There's a whole leveling skill tree. There's combat. There's home building. It does everything in a really enjoyable bite sized snippet that never gets overwhelming or tedious. \n\nIf you've ever played any of the big factory building games and just eventually got overwhelmed or bored, give Nova lands a try. You won't regret it.", "timestamp_created": 1688529611, "timestamp_updated": 1688529611, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.537368834018707275", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140561132": {"recommendationid": "140561132", "author": {"steamid": "76561198141967531", "num_games_owned": 0, "num_reviews": 146, "playtime_forever": 768, "playtime_last_two_weeks": 0, "playtime_at_review": 8, "last_played": 1687806981}, "language": "english", "review": "I dunno with steam's reviews sometimes. Game is rated as \"only\" positive with 20 positives and 1 negative.\nAs for adding to the balance, I do not see the \"lack of tooltips\" as something so bad that it's \"a bad game\". Some years ago people were crying that every game & tutorial was too handholdy.\nJust go and check your options. Games are your playground. Experimentation is key to everything. You get a blueprint, build it and experience the joy of seing what it does by doing rather than reading.", "timestamp_created": 1687535884, "timestamp_updated": 1687535957, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.5367279052734375", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "141831691": {"recommendationid": "141831691", "author": {"steamid": "76561198018028996", "num_games_owned": 1551, "num_reviews": 93, "playtime_forever": 649, "playtime_last_two_weeks": 0, "playtime_at_review": 649, "last_played": 1688651323}, "language": "english", "review": "Forager but not as good.", "timestamp_created": 1689081985, "timestamp_updated": 1689081985, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.536663949489593506", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "155649584": {"recommendationid": "155649584", "author": {"steamid": "76561198253365962", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 4700, "playtime_last_two_weeks": 0, "playtime_at_review": 4700, "last_played": 1704341025}, "language": "english", "review": "When I first started playing this game, the only thing that kept me interested was the cute, basic art style of the game. Some people might not like it - but it's a style I love, and one that isn't too hard on most PCs, which is rare these days. Despite there being no tutorial, I managed to figure out the majority of the controls and the shortcuts, which is great. For example, if you hold the ctrl button + and left click on a stack of items it separates one. There's two ways to defeat every boss, and I love that one way is a puzzle - but that you get a sort of achievement for doing both.\n\nInitially, although I knew the creators still want to add more content, I was worried that the game would be too short. I ended up playing it for almost 80 hours total to get all of the quests, relics, deliveries, etc., and I really did have fun for the entire 80 hours. I kinda wish I could forget the game and start over. It maybe have just been a great little dopamine boost for someone with ADHD, but yeah - very worth it.", "timestamp_created": 1704836514, "timestamp_updated": 1704836514, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.536136269569396973", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "141736197": {"recommendationid": "141736197", "author": {"steamid": "76561198244580420", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 2445, "playtime_last_two_weeks": 0, "playtime_at_review": 2186, "last_played": 1689033717}, "language": "english", "review": "Great Game. I picked the game up Friday, put 36 hours into it before i went to sleep Sunday. Very simple game with great automation features. Challenging in the sense that if something seems hard, it is because you're simply not doing it right. With limited amount of space to create and automate a large variety and amounts of outputs, Optimization is key! I will definitely return to the game if any updates are created! 10/10 would recommend.", "timestamp_created": 1688965599, "timestamp_updated": 1688965599, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.535242199897766113", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140670103": {"recommendationid": "140670103", "author": {"steamid": "76561197992854088", "num_games_owned": 947, "num_reviews": 34, "playtime_forever": 37, "playtime_last_two_weeks": 0, "playtime_at_review": 37, "last_played": 1687695052}, "language": "english", "review": "it's just not very fun. It's a carbon copy of Forager but with less content and not as fun mechanics. I don't understand why people compare it to Factorio either, if I remember my 50000 logistic bots supplying my factories, I am NOT reminded of Nova Lands with the incredibly limited amount of bots and a thousandth of the possibilities...\n\nIt'd be a nice game for 10 bucks or lower, at the current price point neither the content nor the enjoyment is there.", "timestamp_created": 1687695270, "timestamp_updated": 1687695270, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.533825874328613281", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1702393536, "developer_response": "Hi there!\n\nWe're thrilled to announce that we've just released a free content-update for Nova Lands – Quantum Gravity :)\nIt adds more story to the end, more automation mechanics, more buildings and more islands!\n\nCheers!"}, "140811378": {"recommendationid": "140811378", "author": {"steamid": "76561198056141429", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 1574, "playtime_last_two_weeks": 0, "playtime_at_review": 393, "last_played": 1698645959}, "language": "english", "review": "I have literally been addicted to crack before and that was easier to set down for a day then this game is, super fun automation game with very rewarding payoffs.", "timestamp_created": 1687897692, "timestamp_updated": 1687897692, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.533548057079315186", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "141822782": {"recommendationid": "141822782", "author": {"steamid": "76561198028040796", "num_games_owned": 785, "num_reviews": 4, "playtime_forever": 848, "playtime_last_two_weeks": 0, "playtime_at_review": 773, "last_played": 1689146425}, "language": "english", "review": "Mini Factorio. Scratches the same itch in a more digestible package.", "timestamp_created": 1689071530, "timestamp_updated": 1689071530, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.533239066600799561", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "143182651": {"recommendationid": "143182651", "author": {"steamid": "76561198118777787", "num_games_owned": 1273, "num_reviews": 14, "playtime_forever": 1054, "playtime_last_two_weeks": 0, "playtime_at_review": 1054, "last_played": 1689066751}, "language": "english", "review": "[h1]7/10 - Forager x Factorio[/h1]\n\n[h2]Pros[/h2]\n- Cute pixel graphics\n- Factorio Lite\n\n[h2]Cons[/h2]\n- Research tree almost feels unfinished & some things are pointless \n- Incredibly easy - makes the game feel tedious at points \n- Some things are a bit unbalanced\n- The puzzles are kinda weird\n\n[h2]Conclusion[/h2]\nDefinitely worth a play-through, I ended up 100%-ing it. I hope the game keeps getting more updates :)", "timestamp_created": 1690861847, "timestamp_updated": 1690861938, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.532374083995819092", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "155343340": {"recommendationid": "155343340", "author": {"steamid": "76561197994638376", "num_games_owned": 0, "num_reviews": 27, "playtime_forever": 1873, "playtime_last_two_weeks": 0, "playtime_at_review": 1312, "last_played": 1704806629}, "language": "english", "review": "Factorio, Satisfactory and the likes never really did it for me, because it's just too much like a job.\n\nGotta really think carefully about everything, and a single mistake could potentially ruin a whole production line kinda job.\n\nThis is simpler, and much more fun for me. There's some complexity approaching the end of the tech tree, a big part of it being simply the incremental upgrading/replacement of a lot of buildings, but it's not TOO MUCH. It feels just right.\n\nThere's always something new to unlock juuust at your fingertips that feels satisfying.\n\nThat being said, I know that the complexity is kind of the point of games like Factorio, and that it can give them a huge lifespan; I haven't finished this game yet, but by design, I don't see how I would spend hundreds of hours in it. I figure it's gonna be more like 30-40h to unlock and use everything, and when that's done, the game is basically finished.", "timestamp_created": 1704495264, "timestamp_updated": 1704495443, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.532186031341552734", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "144532418": {"recommendationid": "144532418", "author": {"steamid": "76561198027203516", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 960, "playtime_last_two_weeks": 0, "playtime_at_review": 612, "last_played": 1692886084}, "language": "english", "review": "Perfect mix of Factorio-Lite and Forager. Buy it.", "timestamp_created": 1692412938, "timestamp_updated": 1692412938, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.532019674777984619", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "151689114": {"recommendationid": "151689114", "author": {"steamid": "76561199052700001", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 2043, "playtime_last_two_weeks": 0, "playtime_at_review": 1740, "last_played": 1703934990}, "language": "english", "review": "been playing this game since before the beta test even came out and it was still amazing. I would absolutely recommend", "timestamp_created": 1700862160, "timestamp_updated": 1700862160, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.531291604042053223", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140655788": {"recommendationid": "140655788", "author": {"steamid": "76561198196434015", "num_games_owned": 197, "num_reviews": 34, "playtime_forever": 1844, "playtime_last_two_weeks": 0, "playtime_at_review": 465, "last_played": 1687932418}, "language": "english", "review": "Played the hell out of the demo a while back, and absolutely loved it. Played that to completion and then decided to make an entire island of bees.\nIf you liked Forager, this game is better in both gameplay and having good developers.\nBuy it, and you won't regret your decision.", "timestamp_created": 1687671864, "timestamp_updated": 1687671891, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.530386745929718018", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}}, "query_summary": {"num_reviews": 4, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 830, "total_negative": 84, "total_reviews": 914}, "cursors": {"AoIIPwUeuHa+2eYE": "Mon Apr 22 23:48:50 2024"}}
