{"reviews": {"75703127": {"recommendationid": "75703127", "author": {"steamid": "76561198076189790", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 2896, "playtime_last_two_weeks": 0, "playtime_at_review": 1199, "last_played": 1702514071}, "language": "english", "review": "[h1] Pros and Cons [/h1]\n[u] PROS [/u]\n[list]\n    [*]Beautiful art and design along with approximately 8 expansive maps to explore excluding the starter island.\n    [*]You can set animals on fire.\n    [*]Setting fire to trees gives you charcoal. This bypasses the step of having to cook logs in a fire to get charcoal. \n    [*]Some automation for processes are enabled like gathering wood and gathering rocks.\n    [*]There is a lot of recipes for food. \n    [*]Tool and progression of unlocking equipment is interesting and easy to learn.\n    [*]Sound quality.\n    [*]User interface is smooth no staggering. \n    [*]A lot of new maps to explore via the teleportation gate. \n    [*]Varied options for skills and talents for different use like combat, magic, and gathering. \n    [*]Graphics user interface is easy to navigate. \n    [*]Devs are actively patching bugs that are brought up in the discussion board. Keep it up!\n[/list]\n[u] CONS [/u]\n[list]\n    [*]Generated maps repeat only with higher difficulty and no new ores/ unlimited ore sources to be found higher than silver.\n    [*]Translation quality of dialogues and descriptions are rough around the edges .\n    [*]Description for certain items does not reflect what the item does, or what the item is used for. Instead, a vague haiku is in place. \n    [*]Dungeon maps are repetitive and need more variety .\n    [*]Recipes including seaweed and cocoa beans are included, but there is no way to get these items.\n    [*]There are still unimplemented items such as the drying rack, and the loom that are available within the first 5 ages, but unusable.\n    [*]There is no automated way to collect crops that have been chopped down by rotating saw. \n    [*]Instructions on usage of some equipment need to be improved (such as the large pot) .\n    [*]There is only 4 total kinds of armor you can craft. 2 are leather, and 2 require metal but still a limited amount with very little stat value. \n    [*]Breeding: when you breed animals it seems that the spawn takes the level of the map or your level, and not its own level. For example: taking a level 42 and level 43 cow to the beginning island, when bred, gives me a level 5 cow and not a level 40 or so as one would expect. Breeding the same set of cows on a level 40+ map when I am level 25, will result in a level 25 cow.\n[/list]\n\n[h1] SUGGESTIONS [/h1]\n[list]\n    [*]Add a way to automatically gather crops into storage. Maybe a robot to collect and store into a container?\n    [*]Add a way to automatically plant seeds on plantations. \n    [*]Have the ability to milk cows for a continuous source of milk.\n    [*]Add a way to change gamemodes so you do not die as easily. Similar to minecraft's peaceful setting. \n    [*]Drop cooked meat when animals are set on fire. This would bypass cooking similar to minecraft and a good source of early, quick food options. \n    [*]Add more maps so that they do not repeat when you go into teleportation, maybe at a later stage in the development. \n    [*]Add more dungeon type maps maybe with puzzles. \n    [*]Add items that can be found underwater, which would include having the ability to dive. This could be where seaweed is found. \n    [*]Add the option to be able to dye equipment. This could be done by utilizing the herbs (red, yellow, and blue) to be able to craft other colors using the color wheel. \n    [*]Change the cactus to be like trees, or like the mushrooms in the swamp biome: drop more than 1 piece of cactus per plant. \n    [*]Add in different types of arrows that you can get as drops or crafting from different biomes: slow from frost biome, poison from swamp biome, fire arrows from volcano biome, piercing damage from desert biome. \n    [*]Have the option of upgrading chests instead of reorganizing everytime. \n    [*]Add a backpack as a wearable storage option. Start with leather for earlier stages, and eventually requiring different metals. \n[/list]\n\n[h1] TIPS [/h1]\n[spoiler] \n[list]\n    [*]Gold: Easiest way I found personally, was selling the peach fruit. Once you have breed the seeds to the top 14 star tier, it gives you an excellent payday for very little work. Estimate for around 15 plots of peaches could generate you 6mil gold in 10 minutes sell time in the market.\n    [*]Merchants: You can catch, and breed merchants and interact with each new bred baby. The level of the merchant corresponds to the items you can get. At level 40+ you can get diamond ingots even though you cannot utilize them yet. At level 5 they sell bird feathers, leather, and lower tier items. You also get exp from killing your spawns.At level 20 they sometimes give you the option to grab more monster prisms. \n    [*]Wheat farms: There are already youtube videos on how to set up automated wheat farms although it is still not an ideal compact solution. \n    [*]Hosting Table: It spawns a villager everytime the countdown goes down and gives you an egg. The egg has special buffs on it that will apply to you when cooked. It also augments food recipes that includes eggs in them. Thanks to Bell Cranel in the comments for this. \n[/list]\n[/spoiler]\n\n\n[i]  Even during development this game is tonnes of fun, definitely worth a try and the devs seem to be fixing bugs as they are being brought up in the discussion page. An example was when the rice seeds would not plant, the next day it was fixed! Definitely recommend this and excited for things to come. [/i]\n\nEdit: 2020.09.10\nEdit: 2020.09.13", "timestamp_created": 1599665026, "timestamp_updated": 1600041666, "voted_up": true, "votes_up": 697, "votes_funny": 14, "weighted_vote_score": "0.958253264427185059", "comment_count": 36, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "84637952": {"recommendationid": "84637952", "author": {"steamid": "76561198061038289", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 499, "playtime_last_two_weeks": 0, "playtime_at_review": 354, "last_played": 1695939964}, "language": "english", "review": "The Legend of Minecraft Breath of the Pokemon. Basically what this game is.", "timestamp_created": 1610575714, "timestamp_updated": 1610575714, "voted_up": true, "votes_up": 581, "votes_funny": 425, "weighted_vote_score": "0.951248884201049805", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "75429785": {"recommendationid": "75429785", "author": {"steamid": "76561198102655138", "num_games_owned": 243, "num_reviews": 41, "playtime_forever": 315, "playtime_last_two_weeks": 0, "playtime_at_review": 41, "last_played": 1600100252}, "language": "english", "review": "this game will either go one of two ways. \n\nThey abandon it. \nor \nIn a few years this game becomes one of the best survival crafting games available. \n\nThere is no in-between, i dont make the rules.", "timestamp_created": 1599230681, "timestamp_updated": 1599230681, "voted_up": true, "votes_up": 1086, "votes_funny": 191, "weighted_vote_score": "0.947324693202972412", "comment_count": 38, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "75457115": {"recommendationid": "75457115", "author": {"steamid": "76561197968183047", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 3888, "playtime_last_two_weeks": 0, "playtime_at_review": 518, "last_played": 1651179722}, "language": "english", "review": "Edits after 40 hours of playing:\nHad my eye on this for the last half a year. It's definitely a steal for the price.\n\nPros:\n-Looks to be at least 8 unique areas/maps. But as you expand the map they you can get maps you've been to before at a higher level.\n-Controls are tight\n-Lots of build and fool around with\n-Cool skill/level up trees I did not expect\n-I've actually been killed by some enemies... Like, it's not just ez mode roflstomping bad guys.\n-You make your own fun. There is no plot, there's no point where you say \"Okay, I've beaten the game\". You sort of need to continuously find new challenges for yourself.\n-You can mass create hundreds of massive level 89 elephants in breeding chambers,  lagging the map until you leave the area or slaughter them all for massive XP gains.\n\nCons:\n-Poor translation (but who cares if the gameplay is solid). I suspect this will improve in a few weeks/months\n-Multiplayer has been improving each day since day 1. My friends are always able to connect to my game, but sometimes we have to use Hamachi's IP connection. Which isn't really an issue.\n-No XP sharing. Which isn't actually all bad, but it kind of sucks when a boss dies and only 1 person levels up.\n-Leveling up more than 1 level at a time only yields 1 skill point. I hope this is a bug that will soon be fixed.\n-Fucking Alexandria spawning in my base because of the social table, pooping everywhere, catching fire off my camp fire, running around burning, running into me, and causing me to catch fire. Actually, this is a pro.", "timestamp_created": 1599268029, "timestamp_updated": 1599513538, "voted_up": true, "votes_up": 253, "votes_funny": 131, "weighted_vote_score": "0.930034399032592773", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "148680090": {"recommendationid": "148680090", "author": {"steamid": "76561199270509137", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 5013, "playtime_last_two_weeks": 0, "playtime_at_review": 352, "last_played": 1698946215}, "language": "english", "review": "Library-Home-Right click Craftopia in games list. Manage-Betas- click drop down menu and choose legacy version at the bottom. Thank me never. Shout out to Hiro for his review telling me how to play the fun version. His was just a throw away comment at the end of his review so i wanted to make this so the skimmers could see it.", "timestamp_created": 1697990002, "timestamp_updated": 1697990002, "voted_up": true, "votes_up": 219, "votes_funny": 1, "weighted_vote_score": "0.929109871387481689", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "77702865": {"recommendationid": "77702865", "author": {"steamid": "76561199089514102", "num_games_owned": 98, "num_reviews": 26, "playtime_forever": 695, "playtime_last_two_weeks": 0, "playtime_at_review": 507, "last_played": 1604769865}, "language": "english", "review": "To the new people looking at my review please read starting here. But to the people that came back looking for my comment I added a extra bit to the end giving my thoughts now (Nov 25th) I will be updating again before the sale ends.\nIs it fun: Kinda\nIs it buggy: Yes\nIs it worth it: Maybe\nShould you buy it????\nWell I'll start the long answer to that question, don't forget to mark this as helpful if it is. \n  The game is buggy, a bit of a mess, and doesn't feel great. Its also very fun, simply because it really scratches every itch you can have. Single player yup, Multiplayer you betcha, exploration sure its fine, and most importantly crafting. I love crafting it really can get me into games see my 2500 hours on POE on Xbox and like 4 years of my childhood on Minecraft. So if you enjoy crafting, enjoy building, enjoy bad ui/easy fights.... I forgot to mention that. The UI and AI and general play style of the game suck. I have about 9 years of hardcore gaming experience. I can tell when the pathing of AI mobs are bad, they are lol. So what about the UI that I mentioned? Its just so gross, the style doesn't match the game the screens are clunky if I'm being nice, but the kicker is that the UI has terrible descriptions. You kinda need those for a crafting game. Am I gonna stop shitting on this game yet? No. Why? Because they don't have a very obvious plan for the game going forward.(Edit: The game is slowly working on fixing the glitches and the Ui/Ai, so that is the current direction. While its not what I meant when I wrote the review, they are moving forward.) You can read it in the bio of the game. They took a whole bunch of games put them all together and said, \"Ok whats next?\" \n  The game feels really bad right now easily a 3/10 stars.\nWhy do I still think its worth recommending? Well I'm glad you asked. These are all very easy to fix. The games a month old. Come back in two or three months. Look for my comment I will be editing it often to take out what has been fixed. \nI feel that old Minecraft feel from this. Its like a bad ark Lmfao never thought I'd say that as a good thing. Like a fantasy rust. We just gotta give it time to figure out what game it is. I wanna say this game has its own feel but it doesn't. Yet. I'll be playing this in my off time as much as I can bare and lets hope it gets better.\nEdit 1: It is better now after the huge update. Like a lot better. Multiplayer was ok. Now it works well. The Ui isn't nearly as bad as it was. \n\n*New bit starts here*\nEdit 2: So I'll mention it first. I haven't had the time to sit down and play the new update. But I have read though the full thing. Along with the autumn sale I think that if you are willing to play an unfinished product then its worth it. From what I have seen It looks like the devs are responsible. They wont just take your money and run. This seems to be a passion project. So Before I touch the new update I'm willing to recommend it to you.\nEdit 3: Ya its worth it. I have 15 hours on a different account rn and its so much better then a month ago.\nEdit 4: Now that the sale is over you shouldn't buy it. If you see a huge sale like last time then go for it. But the games not worth what they are asking for it rn.\nP.S. I really would like to thank you guys as well. I added the please mark as helpful tid bit but honestly I wasn't expecting my review to be this well received. So again thank you for the likes and awards. <3\nAlso no matter what I do I cant find my own review in the store so, I'm just gonna come to terms with it. I don't think my review is view-able anymore. I will no longer be updating it. If you somehow find this review then thanks for reading until now (Last updated 12/12/2020) have a good one.", "timestamp_created": 1602940825, "timestamp_updated": 1607808679, "voted_up": true, "votes_up": 983, "votes_funny": 22, "weighted_vote_score": "0.918141543865203857", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "75734963": {"recommendationid": "75734963", "author": {"steamid": "76561198064069639", "num_games_owned": 1171, "num_reviews": 29, "playtime_forever": 709, "playtime_last_two_weeks": 0, "playtime_at_review": 460, "last_played": 1613300885}, "language": "english", "review": "[h1]Summary: Wait to buy, keep it in your radar unless you want to support the development[/h1]\n\nThis game is your run of the mill early access survival game with a Breath of the Wild art style. What sets this game apart is that it also glues on several different mechanics from other games, you got vehicles, building, farming, automation, factories(?), taming, dungeons and more, however everything has a very clear alpha vibes to it with its rough edges. Some examples include janky animations, art style that doesn't fit with the rest of the game, multiplayer woes, bugs, unimplemented mechanics, balancing issues and translation issues. Even with its rough edges, this game can be pretty fun, its a very easy way to kill a couple of hours since you have lots of different things to do and learn, and there is a good enough amount of content to keep you busy. So far the game is being updated regularly with critical bug fixes, I hope the dev team behind this keep on developing this game further, since there is high potential here.\n\n[b]Pros:[/b]\n- Good art style (There are some bought assets, so..)\n- Different variety of mechanics\n- 8 (or more) different types of islands to explore\n- Different skill trees\n\n[b]Cons:[/b]\n- Dungeons are very similar to one another, and once you see the first 8 islands, you've seen it all, so hoping for randomly generated ones soon\n- Some animations are rough, and some combat animations do not flow well with each other\n- Machine translated, so some descriptions are confusing or not translated. This is improving over time\n- Multiplayer doesn't work for most people. Some may get it to work instantly, others can only get it with port forwarding, and some can only get it to work through Hamachi\n- Bought assets\n- Some balancing issues, such as durability being set too low or no XP sharing in multiplayer, resources not respawning", "timestamp_created": 1599722245, "timestamp_updated": 1599722396, "voted_up": true, "votes_up": 155, "votes_funny": 1, "weighted_vote_score": "0.912201821804046631", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "142505467": {"recommendationid": "142505467", "author": {"steamid": "76561198242902364", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 2637, "playtime_last_two_weeks": 0, "playtime_at_review": 1603, "last_played": 1711466525}, "language": "english", "review": "Elden Impact: Breath of the pokemon", "timestamp_created": 1689912517, "timestamp_updated": 1689912517, "voted_up": true, "votes_up": 219, "votes_funny": 185, "weighted_vote_score": "0.910368084907531738", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "75425329": {"recommendationid": "75425329", "author": {"steamid": "76561197991019367", "num_games_owned": 0, "num_reviews": 60, "playtime_forever": 778, "playtime_last_two_weeks": 0, "playtime_at_review": 60, "last_played": 1703258729}, "language": "english", "review": "It's a pretty laid back game if I'm being completely honest. The game is pretty where it counts, offers plenty of options for combat, and of course its a giant game of crafting and surviving.\n\nThink of the game like a expanded on Breath of the Wild with a lot of side content and silly things you can work with. 20ish dollars is a pretty reasonable cost for a sandbox game where you can run around and act as goofy as can be. My only real concern is that the dev team take time to look over their assets for what may be really close to copywritten content; the team had stated that quite a few assets were purchased from stores and I've had to take a few glances early on with \"wait is that ITEM from GAME?\"\n\nEdit:\n\nHey so after reading the flood of reviews that came out around the same time my review did I would like to make the brief comment that I did not run into any of the bugs mentioned regarding translation, item wonky-ness, or enemies just \"poofing\" out of existence. I played the game in English and while the translations were a bit rough, which is pretty normal for international indie titles in their early stages, everything was easy enough to understand.", "timestamp_created": 1599225194, "timestamp_updated": 1599231635, "voted_up": true, "votes_up": 160, "votes_funny": 3, "weighted_vote_score": "0.907786786556243896", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "153561499": {"recommendationid": "153561499", "author": {"steamid": "76561198312497993", "num_games_owned": 0, "num_reviews": 59, "playtime_forever": 4194, "playtime_last_two_weeks": 0, "playtime_at_review": 445, "last_played": 1708183111}, "language": "english", "review": "genshin of the wild", "timestamp_created": 1702544152, "timestamp_updated": 1702544152, "voted_up": true, "votes_up": 305, "votes_funny": 151, "weighted_vote_score": "0.903087615966796875", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "79496039": {"recommendationid": "79496039", "author": {"steamid": "76561198016959209", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 1009, "playtime_last_two_weeks": 0, "playtime_at_review": 521, "last_played": 1656502446}, "language": "english", "review": "This game is what you get if Zelda, Factorio, Pokemon, and Minecraft were left in the oven to bake at 220 degrees overnight.\n\nGlitches? \n[+] I played this game with my only friend. He spawned in and was on fire, except he couldn't see he was on fire and took no damage.\n[-] He ran around setting everything on fire, and I mean everything...\n[-] Cows - Dead\n[-] Chickens - Dead\n[-] Me - Dead\n[-] Our Home - Destroyed\n\n18.2 / 10 would ruin my only friendship while playing Zeldorio PokeCraft again.\n\nYou should buy this game though because it's great for building things. \n\n....unless those things are friendships.", "timestamp_created": 1605770563, "timestamp_updated": 1605770563, "voted_up": true, "votes_up": 244, "votes_funny": 486, "weighted_vote_score": "0.901835799217224121", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "76042975": {"recommendationid": "76042975", "author": {"steamid": "76561198063532282", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 3493, "playtime_last_two_weeks": 0, "playtime_at_review": 424, "last_played": 1688951934}, "language": "english", "review": "Just passed 7 hours in this game and here are my thoughts.\nTo get things started:\n-The stamina system sucks, I have upgraded my max stamina twice and still run out in like 3 feet.\n-The durability on items is a little excessive. I understand wanting to make things more \"realistic\" but a real sword doesn't break after like 20 swings. It also makes building things like the helicopter feel like a waste of materials.\n-I personally don't like having to travel to the different islands. I feel like this game would work beautifully if it was just one large world or continuously randomly generated like Minecraft. The inclusion of the multiple vehicles is pointless dues to how small the islands actually are.\n+I enjoy the feeling of progression, but it is easy to just quickly spam forward, and reach a point where progressing feels pointless.\n+I love the combination of the rpg mechanics with \"survival\" and crafting.\n+The automation of things flows pretty nicely, honestly was really happy to find out the autodrills didn't have durability, probably would have quit if that was the case.\n\nOverall I love this game so far and despite it's flaws, I don't see myself quitting anytime soon. I am looking forward to the future of this game. Don't really have anything else to say at this time.", "timestamp_created": 1600212140, "timestamp_updated": 1600212140, "voted_up": true, "votes_up": 162, "votes_funny": 4, "weighted_vote_score": "0.900296628475189209", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "89916527": {"recommendationid": "89916527", "author": {"steamid": "76561198349773913", "num_games_owned": 63, "num_reviews": 1, "playtime_forever": 13576, "playtime_last_two_weeks": 126, "playtime_at_review": 2396, "last_played": 1713381892}, "language": "english", "review": "Craftopia.\n\nThis is the first time I have ever written a Review for a game.  And I will try my hardest not to drop any spoilers.\n\nAt the time of writing this, I have logged 39.8 hours in the 3 days I have owned this and don't want to stop playing.  It's been a long time since an Early Access game has caught my attention like this.  Almost to the point of Addiction. (lol).  So lets begin.\n\nThe game is an amalgamation (from my perspective) of game features, that, just seem to work well together.  At first when I started playing, it reminded me of Genshin Impact.  The third person View, the ease of controls.  The more I played, the more I found.  \n\nFeatures\n\nCrafting – I don't think I need to explain this feature.  But the crafting system is (even though its still in early development) quite extensive.  You gain more crafting stations as you progress your “AGE” (more on that to come)  \n\nTaming – This reminds me of (and please don't laugh), Pokemon.  You craft “Monster Prisms”, then bring a Monster to near death, then “throw” said Prism, to catch the Monster.  You can then either breed  them, use them, and I believe, even have them fight with you. (I've seen a skill that makes your pet attack)\n\nBuilding – Build your house.  Seems basic, But as you progress your “Age” you get more and better options for building your Dream house.\n\nExploration – Exploration is accomplished with the “Door of Transportation”. {insert accual name} New Islands are opened up through spending Resources.  Higher level Islands Require more and higher resources.\n\nSkill Tree – There are 5 Skill Trees.  Skill points are acquired through leveling and completing Sub-missions (Main Mission is not implemented as of yet)\nBasic – these are your Basic Skills.  Stamina, jumping, ect...\nCombat – What kind of Character do you wanna play?  The Archer, The Warrior, The Mage, Maybe a Monk or a Knight.  Play how you like.\nMagic – This is where your Spells live.  If anything,  Get Heal and Resurrection. (just my opinion to)\nLiving – Passives to increase your gathering skills.\nTrick – Best description I can come up with is Miscellaneous Skills.\n\nThere is a Second section in the skills that is not implemented as of yet.\n\nMultiplayer\nYes, there is a Multiplayer system in place, albeit, buggy at the moment.\n\nAutomation System\nYou can Automate almost every gathering aspect of this game from what I've seen so far.\n\nQuest System\nAt this moment in the Games development, there is no Main Mission/Quest line, But there are sub-missions to wet your appetite.\n\nThere's bound to be more that I haven't found yet, or have forgotten.  Plus, the devs will most likely add more.\n\nPros\n-The skill system is really nice.  Lets you customize how you want to play your character.  \n-The Gathering and Crafting system is Good to.  Lots to build and enjoy.\n-Automation.  I'm really just starting to play with this, but, I like the fact that I can go explore another Island, and production will continue.\n\nCons\n-Multiplayer.  I do understand that Craftopia is still in Early Access. That being said, At times it works great, other times its a nightmare.  My biggest thing with it is that, when you travel to another island, every one who is playing in the current world will be transported with you.  My wife likes to build, and I like to gather and explore.\n\nOverall Impressions \nI, Personally, am looking forward to see what the Devs have planned for the future of this game.  Even though Multiplayer is a big issue at the moment, I have faith the Devs will fix this soon.  Single player and Multiplayer play exactly the same (atm), so you can play Single Player, learn the system, and then when Multiplayer is flushed out, you already know what to do.  And for $25, I think its well worth the price.\n\n", "timestamp_created": 1617842197, "timestamp_updated": 1617842197, "voted_up": true, "votes_up": 145, "votes_funny": 5, "weighted_vote_score": "0.899855494499206543", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "75927241": {"recommendationid": "75927241", "author": {"steamid": "76561198332742524", "num_games_owned": 159, "num_reviews": 5, "playtime_forever": 3895, "playtime_last_two_weeks": 0, "playtime_at_review": 937, "last_played": 1688681010}, "language": "english", "review": "Just like someone else stated. This could either be a complete dead waste of time in the next few months, or the best craft RPG ever made. Pray the devs keep up with this gem.", "timestamp_created": 1600028944, "timestamp_updated": 1600028944, "voted_up": true, "votes_up": 114, "votes_funny": 2, "weighted_vote_score": "0.899438560009002686", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "75575640": {"recommendationid": "75575640", "author": {"steamid": "76561197986119959", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 2588, "playtime_last_two_weeks": 0, "playtime_at_review": 1456, "last_played": 1600214151}, "language": "english", "review": "I've played 24 hours of this game, done about 90% of whats available, played both single player and multiplayer. \nThis game is super fun and addicting, especially with friends if you have hamachi and get the multiplayer working. \n\nIts like Terraria/Minecraft and Breath of the wild combined. \n\nThis game has something for everyone, exploration, leveling/fighting, magic, building, farming, making money, its very much choose what you enjoy and have at it!\n\nThat being said their are TONS of bugs right now, the opening video is a bit deceptive cause it looks like a finished product. if you choose to buy this game you are supporting a fledgiling game that will give you many hours of fun in the future, but you will have mixed feelings for now cause some of these bugs will really annoy you. LIKE SLKJFSLKFJS:LFKDJS:FDJ annoy you.\nif you don't have anything better to do and have patience, it will give you several hours of fun in the mean time.", "timestamp_created": 1599447383, "timestamp_updated": 1599952583, "voted_up": true, "votes_up": 167, "votes_funny": 8, "weighted_vote_score": "0.896975159645080566", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "143784538": {"recommendationid": "143784538", "author": {"steamid": "76561198158977891", "num_games_owned": 1481, "num_reviews": 21, "playtime_forever": 4646, "playtime_last_two_weeks": 0, "playtime_at_review": 3572, "last_played": 1691965575}, "language": "english", "review": "Great game, especially for playing with friends. I'm sure that ya'll have seen the other reviews talking about how 'waah, they removed 90% of the content' and so on in regards to the new Seamless World update. Allow me to explain a bit, so you can see why this isn't actually a problem. Originally, the game had one island you would start on, with a limited world-space. However, you could build portals to traverse to new island worlds. It worked a little like how Minecraft handles going to the nether, except it was other islands. Each was their own biome, with a decent bit of variation in enemies and resources.\n\nWhat this Seamless World update did was get rid of that world style. Instead, they changed it so that, instead of a bunch of small worlds that you used portals to go between, you instead have one large landmass that you can explore and adventure on much like Legend of Zelda: Breath of the Wild or Genshin Impact has. They did leave out a large chunk of features from the game when they made the switch however, and this is what people are getting hung up on.\n\nSimply put, the content is not GONE, but rather rearranged. Some things are in the game and people just don't realize that they are because they have yet to encounter them, either due to rarity, placement, or other things. As for the rest, they wanted to get this update out so we could play and enjoy it as soon as they could. This meant that, even though not all of the content from those island biomes had been placed in the world, we're getting it much sooner. In other words, the some 30% of things that aren't in the game currently are only not in the game for a temporary length of time while they work on fitting them into the new design, since disjointed island biomes are very different from the far more continuous and connected design of the new world. Just give it some time, and it'll all be back.\n\n~~~~~~\n\nIn conclusion, it's a very fun game, and definitely worth picking up. The asking price of ~$25 is honestly a steal in my opinion, and, if you can get it on sale, even better. It has fun mechanics and, even though it isn't super well written, a rather funny story. The combat generally feels pretty fluid, striking somewhere between a soulslike and the aforementioned Breath of the Wild. It has adjustable difficulties, letting it be as casual or as hard as you want with a custom one. Modding, courtesy of BepInEx's modloader and the Steam workshop. Lots of RPG elements, such as levels, varied equipments, potions, skill trees, etc. And you can even use the monster taming system to basically play Pokémon instead of the normal fighting, if that's more your speed.\n\nFrankly, this game has just about everything, and is definitely a hidden gem. Could not recommend more. :)", "timestamp_created": 1691678128, "timestamp_updated": 1691678128, "voted_up": true, "votes_up": 374, "votes_funny": 10, "weighted_vote_score": "0.896226108074188232", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "91312737": {"recommendationid": "91312737", "author": {"steamid": "76561198881558534", "num_games_owned": 49, "num_reviews": 3, "playtime_forever": 672, "playtime_last_two_weeks": 0, "playtime_at_review": 290, "last_played": 1621110316}, "language": "english", "review": "Legend of Minecraft Breath of the Fortnite, Crystal Version.", "timestamp_created": 1619985017, "timestamp_updated": 1619985017, "voted_up": true, "votes_up": 237, "votes_funny": 242, "weighted_vote_score": "0.891658484935760498", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "76309379": {"recommendationid": "76309379", "author": {"steamid": "76561198046610907", "num_games_owned": 614, "num_reviews": 60, "playtime_forever": 701, "playtime_last_two_weeks": 0, "playtime_at_review": 677, "last_played": 1640376699}, "language": "english", "review": "Still buggy & lacking in content at this point in time, also worried about the dev process knowing that the devs have abandoned another game in the past. The discord community tauts them for daily patches but they're not that groundbreaking and they did the same thing to the game they abandoned. Also some content in trailer isn't available in game- I want to believe there's good reason for this but can't trust them knowing dev's history. Give it some time on your wishlist and check back in later. Will update this as needed.", "timestamp_created": 1600651565, "timestamp_updated": 1600870612, "voted_up": false, "votes_up": 605, "votes_funny": 6, "weighted_vote_score": "0.888635218143463135", "comment_count": 9, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "81499303": {"recommendationid": "81499303", "author": {"steamid": "76561198006446573", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 2231, "playtime_last_two_weeks": 0, "playtime_at_review": 1422, "last_played": 1691216756}, "language": "english", "review": "This review is out of date.\n\nAlright I played enough of this game that I think I can give a fair review.\n\nThe Good: \n\nFun gameplay, solid graphics, combat feels good (melee, magic, and bows atm), the crafting/gathering is solid, the talent system is good.\n\nThe OK:\n\nBase building can be annoying, placement of objects seems to bug out sometimes, there are exploit regarding planting crops that can give you tons of crops without much space, some of the automated mechanics (machines and robots) are wonky and while they work they get stuck sometimes. Animal breeding for foods/feces/batteries is very annoying to manage. \n\nItems have different affixes that change the enchants of whatever they are used to craft. (i.e wolf/sheep/cow/elephant leather have different enchants and when crafted into armor provide those enchants). This means that none of the items stack with the same items from other animals.\n\nThe dungeon is the same everytime (minus the race/ball/jump challenges) with only a different boss sometimes.\n\nThe Bad:\n\nInventory - Chests provide absolutely criminal low storage when items don't stack with each other. You will literally need like 3 of the largest chest just to hold 1 type of item (all the different leathers for example). Character inventory is criminal as well considering the above. You will need to frequently do inventory management.\n\nWeapon Durability - You literally just spend money when you repair your items and its not even a lot of money, and they break so fast. It's just an extra chore in a game with plenty of chores.\n\nEnchanting Gear - This one broke me. This is the only reason I cannot recommend this game and it is why I stopped playing it. RNG on RNG. As I mentioned, crafting materials have affixes on them to enchant your gear so here is how it works.\n\nSay you want to make a SPECIFIC enchanted hat with 4 (the max) enchants on it and it takes 1 steel (which is 5 iron) and 1 wood. Let's say the affixes you are looking for are \"Wolf\" \"Cow\" \"Sheep\" \"Fire Spirit\". You will need to acquire 1 Fire Spirit log from the volcano biome. Easy enough. Now for the Wolf Cow Sheep Steel Bar. You acquire some Iron with each affix. Now you smelt them and HOPE you get \"Wolf Cow Sheep Steel Bar\" but it can be 0-all affixes on the bar. you gotta hope you craft a bar that nabs all 3. This will take a lot of bars or a lot of luck.\n\nYou get lucky, you have your Fire Spirit log and your Wolf Cow Sheep Steel Bar so you craft your hat, but the same rules apply. Now you need to hope your hat rolls all 4 affixes but it can roll any combination of 1, 2, 3, or 4 of the affixes. You don't get the hate you need, go back to step one. Some items have you repeat this process more than twice.\n\nI spent 4 hours acquiring materials to make a new shield and the end result was enough Steel to make 1 attempt at the shield, I did not get it.\n\n\nTLDR - RNG killed this game for me, otherwise its a really solid game.", "timestamp_created": 1606961242, "timestamp_updated": 1621307515, "voted_up": false, "votes_up": 281, "votes_funny": 9, "weighted_vote_score": "0.887888252735137939", "comment_count": 9, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "92059199": {"recommendationid": "92059199", "author": {"steamid": "76561198145088157", "num_games_owned": 279, "num_reviews": 3, "playtime_forever": 911, "playtime_last_two_weeks": 0, "playtime_at_review": 418, "last_played": 1621303837}, "language": "english", "review": "I captured Anubis, Faithful minion of Krael the god twice with a Pokeball only to place him in a tiny manmade house with a breeding machine. I then spat out the Anubis children straight into a treadmill forcing them to create batteries for the rest of their living days. All until I accidentally caught myself on fire and walked into the Anubis breeding hut and burned it to the ground causing hundreds of Anubis to invade my island.\n\n10/10", "timestamp_created": 1621107480, "timestamp_updated": 1621107480, "voted_up": true, "votes_up": 131, "votes_funny": 155, "weighted_vote_score": "0.88394540548324585", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "86550992": {"recommendationid": "86550992", "author": {"steamid": "76561198067705016", "num_games_owned": 0, "num_reviews": 55, "playtime_forever": 3013, "playtime_last_two_weeks": 0, "playtime_at_review": 3013, "last_played": 1613227433}, "language": "english", "review": "The endgame boils down to one thing: crafting good gear. This will make or break your experience. The crafting in this game is an elusive mechanic, and I will attempt to describe it to you so that you can better understand it before going in.\n\n[h1] Now, one might ask, \"What is possibly wrong with an incentive to craft in a game called Craftopia?\" [/h1] \nThe problem(s): A completely RNG driven crafting system. The difference between a base item and one with good enchantments is so astronomical that you should almost never consider using a base item over one with enchantments (exception would be a weapon with high base attack or magic attack). \n\n[b] Enchantments work like this: [/b] Enchantments are tied to proper words. These proper words each reflect a set of stats and can be incorporated into items through crafting materials. For instance, if an iron ingot has the proper word \"Crimson\" and is used to craft a sword, then the sword has a chance to receive the proper name, \"Crimson\" and the stats associated with the name. \n\nAs far as I have seen, an item can hold up to four enchantments. For example an item is called \"The Never Ending Sky's Ancient Veteran Griffin's Broadsword\", and it has the four enchantments: \"The Never Ending Sky's\", \"Ancient\", \"Veteran\", and \"Griffin's\". Without the enchantments, a broadsword would just be that, a broadsword. On paper this system sounds really fun and interesting, but in practice the crafting is tedious and can feel completely unrewarding because of two things: no indication of success chance (or tutorial explaining the chances involved with enchanting items), and inventory management.       \n\n[h1] Now, one might ask, \"How is crafting RNG if the inputs always guarantee the outputs?\" [/h1] \nThe problem(s): The inputs only guarantee the base item being produced. Enchantments are, as far as I can tell, completely randomly assigned each time an item is crafted. The possible name of the item produced is pulled from the crafting materials used to produce it. I'll repeat: having crafting materials with proper names does not guarantee that crafted items will have those proper names. It is entirely possible to use a significant amount of very rare crafting materials to produce a white/common/base item! \n\nThis is a HUGE problem when some items require dozens of crafting materials to produce just one unit. The rudimentary experience I've had with the crafting is something around 1 in 75 to 1 in 50 (~1.33% to ~2% chance) to produce an item with 4 proper names. \n\nEnchantments or modifiers distinguish items and crafting materials from each other. Unless an item has the same enchantments and base item, then it will not stack with items with similar bases. This leads into problems with inventory (and storage) management. Frankly, I think this problem mostly stems from the lack of inventory slots (not carry capacity), and I think it can only be resolved by introducing something like a backpack or a straight upgrade to storage/item slots. \n\n\n[h1] I will not leave the developers out on a limb here. Here is how you improve your game: [/h1]\nDisplay roll chances for enchantments when crafting; also, improve the chances to craft said loot. People do not have the time (or patience) to slog through hours of gameplay only to come up with a white/common/base item. That leaves a really sour taste in your player's mouths and you want them to feel good about crafting gear with the loot they EARNED. \n\nIncrease player inventory and storage SLOT amounts (not carry capacity per slot) to alleviate the item bloat that inevitably happens in the endgame. \n\n\nIf none of this has dissuaded you from jumping into early access, then you'll like the game. I had fun with it myself, but I cannot earnestly recommend it to everyone in its current state.", "timestamp_created": 1613229247, "timestamp_updated": 1613229247, "voted_up": false, "votes_up": 513, "votes_funny": 12, "weighted_vote_score": "0.882050633430480957", "comment_count": 25, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "75573716": {"recommendationid": "75573716", "author": {"steamid": "76561197968572630", "num_games_owned": 246, "num_reviews": 64, "playtime_forever": 1580, "playtime_last_two_weeks": 0, "playtime_at_review": 544, "last_played": 1696176848}, "language": "english", "review": "Set a cow on fire with a torch. Cow took off and set other animals on fire, trees, bushes. \n\nMy whole little corner of the island aflame from one little poke with a torch, I knew immediately at that moment I would be giving this game a thumbs up. \n\n\nAs long as the Devs stick with it, will be fantastic. Even in Early Access, it's worth the 25$", "timestamp_created": 1599443915, "timestamp_updated": 1599443915, "voted_up": true, "votes_up": 228, "votes_funny": 223, "weighted_vote_score": "0.873565495014190674", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "116101996": {"recommendationid": "116101996", "author": {"steamid": "76561198027372201", "num_games_owned": 1135, "num_reviews": 215, "playtime_forever": 1842, "playtime_last_two_weeks": 0, "playtime_at_review": 1800, "last_played": 1700947148}, "language": "english", "review": "Addition from the 25.11.23:\n\nSo what they did with recent updates is to remove one of the only unique elements the game had to offer. The world in the old versions was separated into various island. You had to construct a sort of warp thing and then activate that. THEN you got to CHOOSE what kind of island you wanted and where, on a grid, you wanted it to be.\n\nThey removed that and built a giant open world. Which is a disaster in every regard. The pop in is ridiculous. And not just in the half distance. If you TURN YOUR CAMERA you can literally see world elements like rocks dither in before your eyes.\n\nEven worse is that the visuals now have a sort of blurry sheen all over them. Sure the overall world in the old version looked asset flippy (it still does but I get to that in a moment) but now it looks really, really bad. I am assuming the game renders the world in a really low resolution and the scales it up. And I also assume that the standard scale of 1, that it is set to in the settings is actually REALLY low. Because characters that stand 20 meters away from you have a blurry blob where a face should be. I am pretty sure that they are doing that because what ever engine they are using is killing itself with the massive open world they now made.\n \nWhat they basically and pretty blatantly did is give up and do a \"Mom can I have Legend of Zelda - Breath of the Wild?\" \"We have Breath of the Wild at home!\" Breath of the Wild at home = see this game.\n\nCollision detection in combat has gotten even worse and the moves are still as bad. You can stand a meter from a small enemy and miss standart attacks while both you and the enemies are standing still because the attacks are so absolutely uselessly \"flashy\" for no fucking reason. \n\nI would love to applaud the team for now trying to create a more coherent vision for the enemies within the game if many of those didn't fucking look like EXACT and then watered down copies of the goblins from, you guessed it, Breath of the Wild. Hunched over stance and everything. \n\nI am sorry for the frequent cursing. When I saw the frequent update activity I thought to give this a chance. I did not have any expectations but holy cow am I surprised if not baffled what they did to an already lackluster game. \n\nThe changes they made erased the tiny bit of individuality the game had in the first place. The technical requirements for this then seemed to have forced them to downgrade the visuals even more. Which is just... why?\n\nIn one of the recent Updates the Developer said that new Items created and placed by the player are now spawning as \"charmed\" so that they do not disappear when the player leaves. \n\nIf I interpret this correctly that means that player crafted items like furniture are actually NPCs, like roaming monsters and animals, that have to be assigned this status so they do not despawn as soon as the player leaves render distance to them!\n\nIf this does not give you an idea how hacked together this game is, I do not know what will. That is why I say to still read the older part of this review. The issues mentioned in it very much probably still apply to the game, some of which I could recognize within minutes of playtime.    \n\n[b]Older part of the review:[/b]\n\nSo, recently i have been going trough my Early Access purchases to weed out the chaff that clearly has gone awry. And as you can see Craftopia has hit that criterium, for now at least.\nHere are Craftopia's most pressing problems:\n\nThere is a lot of stuff in this game. Really a lot. However, everything is... just unfinished and disconnected.\n\nThis game has building with prefab parts, like different walls, slopes, roof tiles, instead minute blocks. Like for example Valheim, which is fine and works well in other games. However, building and placing these parts is inaccurate at best and a broken at worst. It just feels wrong and anything build is just janky.\n\nThere is crafting, but it is not really finished in any way. Within literally 1 hour you can go from nothing to silver (basically tier 4) weapons and tools. There is also no real flow to drive you to make better stuff because what you use tools on and for is just no fun.\nThere are the roots of automation, but the whole thing is very illogical, contrived and janky. It is also not worth doing because there is not really anything you are doing this FOR (we come back to this part later again).\n\nThere are dungeons, but they are plain garbage. Built from the same few assets, flatly lit, ugly and without any atmosphere or flair. And they have nothing going for them that could remotely be called level design.\n\nThere are vehicles, but the controls are utter garbage. I found a race dungeon with hover boards and speed up pads but it was so bad i'd rather tried to finish it on foot.\n\nThere is combat, but it is stiff, flailing and floaty.\n\nThere are rarity and status prefixes for loot and items (like flaming, freezing etc.). But those can be attached to ANY item, weapon or consumable! Which leads to your inventory often filling with the same type of item that need 5 different fields in your inventory because they have different prefixes. \n\nThis one needs a bit more explaining. Imagine, if you will, you kill a few cows. The cows then drop horns and leather and so on. Every piece of leather and every horn could theoretically have a different prefix, like fiery cows horn and scary cows horn, stuff like that. And any time this is a case these items need their own field in your inventory. Now there is a lot of space in your inventory to begin with. But the issue is that this makes no sense whatsoever, it serves no purpose and just causes a mess that adds NOTHING to the gameplay. \n\nThat also counts for the prefixes on weapons. Because the differences between them feel minuscule and I am not putting in the time it would need to fill out that massive skill tree so it MAYBE makes a difference way later. \n\nA Story isn't there. Just forget it.\nTranslation is classic engrish.\n\nEven the most basic things in this game work in janky ways. Raising the FOV for example, doesn't actually raise the FOV, it zooms out the camera. Setting the FOV to 100 moves the camera so far from your character that it is hard to play. \nTrying to open and use items (and I mentioned building earlier) is janky as hell and collision detection is a mess. Trying to open a chest that has been placed between crafting tables or other chests is a mess causing the player to regularly open or activate something that is nowhere near your Crosshair.\n\nCrafting tables, workstations and building elements have INDIVIDUAL PHYSICS. Meaning they could be kicked around and have collision detection and physics. Anyone that remembers early 2000s physics knows what happens next. Sometimes when you load into your world, tables or building elements have fallen trough the world or other building parts. Or you have to search your entire base for the one tiny thing that causes a constant collision sound because it slipped into a another object somehow, somewhere. \n\nThere are more issues with this unfocused disaster. However, the worst part is that NONE of it feels like it serves a uniting vision. There is no reason for the crafting and the automation and the vehicles and EVERYTHING else!\nAt no point does it feel the the developers have a encompassing vision for these disparate parts nor does it feel like they have the ability and focus to give any of them the necessary base finish or polish.\n\nThis game ultimately feels cheap and shallow to play. It feels like a waste of time, especially when Steam is full off better alternatives. Don't waste your time. Maybe come back far later. \n\nThough considering that the team clearly has bitten off too much AND are starting development on a second game that looks eerily similar in many aspects, I would not count on it.\n\nOf course, if this improves one day, and i'll notice it, then I will update this review.", "timestamp_created": 1653679474, "timestamp_updated": 1701257178, "voted_up": false, "votes_up": 202, "votes_funny": 0, "weighted_vote_score": "0.871003627777099609", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "107593725": {"recommendationid": "107593725", "author": {"steamid": "76561198021469634", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 10614, "playtime_last_two_weeks": 0, "playtime_at_review": 8658, "last_played": 1688569786}, "language": "english", "review": "ZeldaPokemonMinecraftDragonslayerSatisfactoryCooking Simulator", "timestamp_created": 1641650572, "timestamp_updated": 1641650572, "voted_up": true, "votes_up": 125, "votes_funny": 35, "weighted_vote_score": "0.87043529748916626", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "140924675": {"recommendationid": "140924675", "author": {"steamid": "76561198026400915", "num_games_owned": 106, "num_reviews": 30, "playtime_forever": 6749, "playtime_last_two_weeks": 0, "playtime_at_review": 5984, "last_played": 1688774868}, "language": "english", "review": "I'm a game developer. Last year, I spent 40 minutes in a call explaining how this game had accidentally solved one of the biggest problems in open world level design: The feeling that there's plenty to explore, but not much incentive to do so. The enchanting system, at that time, was accidentally genius. Why \"accidentally?\" Because these guys can't make anything that isn't buggier than a $200 New York apartment. And yet they'd implemented a series of integrated systems that would set the player out on a journey across 10 biomes to do something as mundane as harvesting wood... I'd be fighting dragons in Hell just to get a bundle of logs with a \"More Scorching\" enchantment. There wasn't just a big world, but there was this integral reason to want to go everywhere, even if your goal for today was small and specific like \"craft a new shield upgrade.\"\n\nThen they dropped this Seamless World Update.\n\nIgnoring that the bugs are far worse than I remember, across every field (animation hangs, armor clipping, AI just outright breaking or running an infinite loop (even teleporting back to the start and repeating after each loop) etc.. But no, they took the one thing they'd done exceptionally and made it the most mundane, \"20 minute a day\" mobile grind you could imagine:\n\nKnow how you get enchantments now? Open Map. Teleport to dungeon door. Fight easy boss. Get a pile of 1 time use scrolls, containing random enchantments. Repeat. Mindlessly. For eternity. Just spam the exact same fight, over and over and over..\n\nAnd while you're at it: be aware that the seamless world update REMOVED bosses (approximately half of all existing bosses if not more), REMOVED 2 out of 7 ages (the end-game progression arcs) and REMOVED MOST (At least 70, probably more likely 90%) of enemy types. Content from two years ago is no longer present.\n\nSo basically, they watered down the best mechanic they had, removed the best part of the game, removed a good portion of bosses, bugged it all to hell and back (sadly Hell no longer exists) and lost all of their unique individuality that made this game stand out despite being programmed in such a buggy, poorly optimized, amateur way, all to make it a more \"digestible\" variant of so many nearly identically pointless games where you just loop the exact same behavior over and over with no real reason or incentive to do so.\n\nAs a programmer, artist, animator, and everything else.. I am entirely self taught. So it's pretty bad that I can so openly criticize the implementation this badly. Because with all of 3 years of experience, I don't have a single prototype that's as badly programmed as this whole game.\n\nI enjoyed it despite that. Then returned to see what the Seamless World update would add. I'm sorry, but I see nothing worth recommending since that update. Everything good was removed and replaced with the most watered down, restricted, repetitive version you could possibly imagine.\n\nOh, and they removed most of the build system's snap and placement logic, too. You can't change the voxel size for building placement anymore. Just one poorly planned giant grid and nothing else.\n\nVideo 1 - Craftopia Presently:\nhttps://youtu.be/vQaLEfHcGJA", "timestamp_created": 1688068109, "timestamp_updated": 1688910087, "voted_up": false, "votes_up": 1035, "votes_funny": 35, "weighted_vote_score": "0.868277311325073242", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "75478554": {"recommendationid": "75478554", "author": {"steamid": "76561198448768317", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 588, "playtime_last_two_weeks": 0, "playtime_at_review": 127, "last_played": 1671815349}, "language": "english", "review": "Zelda breath of the item farming", "timestamp_created": 1599303524, "timestamp_updated": 1627134996, "voted_up": true, "votes_up": 201, "votes_funny": 199, "weighted_vote_score": "0.86636042594909668", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "75729628": {"recommendationid": "75729628", "author": {"steamid": "76561198056643947", "num_games_owned": 144, "num_reviews": 7, "playtime_forever": 856, "playtime_last_two_weeks": 0, "playtime_at_review": 335, "last_played": 1663442977}, "language": "english", "review": "When clipping the camera through a wall I could see my characters tits. 10/10", "timestamp_created": 1599709831, "timestamp_updated": 1599709831, "voted_up": true, "votes_up": 595, "votes_funny": 783, "weighted_vote_score": "0.864438235759735107", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "75429998": {"recommendationid": "75429998", "author": {"steamid": "76561198024793320", "num_games_owned": 698, "num_reviews": 56, "playtime_forever": 1147, "playtime_last_two_weeks": 0, "playtime_at_review": 112, "last_played": 1600439589}, "language": "english", "review": "For now there is not much in the game, it's not really worth 20€ yet but it has big potential to become one of the best games in my opinion if the developers keep developing this game, which i hope they will for a long time :)\n\nTip: If you have missing text in english, switch to japanese and back to english, that should fix it.", "timestamp_created": 1599230950, "timestamp_updated": 1599841950, "voted_up": true, "votes_up": 129, "votes_funny": 3, "weighted_vote_score": "0.863663315773010254", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "100134406": {"recommendationid": "100134406", "author": {"steamid": "76561198157425946", "num_games_owned": 156, "num_reviews": 13, "playtime_forever": 750, "playtime_last_two_weeks": 0, "playtime_at_review": 712, "last_played": 1633002591}, "language": "english", "review": "Breath of the Genshin Impact: Minecraft edition", "timestamp_created": 1632885822, "timestamp_updated": 1632885822, "voted_up": true, "votes_up": 110, "votes_funny": 106, "weighted_vote_score": "0.862881720066070557", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "75778968": {"recommendationid": "75778968", "author": {"steamid": "76561198174810306", "num_games_owned": 148, "num_reviews": 17, "playtime_forever": 1775, "playtime_last_two_weeks": 0, "playtime_at_review": 506, "last_played": 1663451995}, "language": "english", "review": "Devs: We made a game\nEveryone: What genre is it \nDevs: Yes", "timestamp_created": 1599797943, "timestamp_updated": 1599797943, "voted_up": true, "votes_up": 153, "votes_funny": 286, "weighted_vote_score": "0.858769118785858154", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "89528005": {"recommendationid": "89528005", "author": {"steamid": "76561198174556891", "num_games_owned": 107, "num_reviews": 8, "playtime_forever": 2653, "playtime_last_two_weeks": 0, "playtime_at_review": 749, "last_played": 1706812405}, "language": "english", "review": "You can teach Kevin a lesson for stealing from you by capturing him in a prism ball, capturing his clone, breeding him with his clone, and then using the Kevin children in your generators and watch them run until they die!\n\nTrust me, he'll learn his lesson. Or maybe his children. Or maybe his childrens children.", "timestamp_created": 1617318173, "timestamp_updated": 1617318173, "voted_up": true, "votes_up": 95, "votes_funny": 125, "weighted_vote_score": "0.85811084508895874", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "128544649": {"recommendationid": "128544649", "author": {"steamid": "76561198296409881", "num_games_owned": 79, "num_reviews": 2, "playtime_forever": 4997, "playtime_last_two_weeks": 0, "playtime_at_review": 4982, "last_played": 1693852713}, "language": "english", "review": "When this game first came out, it seemed to have potential. You can craft a large variety of items, from building blocks to breeding machines and robots. The combat was interesting, the best being the Ice magic that literally throws your friends if it hits them lol The dragons were tough to beat and the boost for gliding speed was cool too. AND you can light ANYTHING on fire. Fantastic!\n\nBut it very quickly ran out of content. Every dungeon had the same boss, the trials were minimal and the enemies went from hard to juvenile after a few levels. There wasn't much of a story and you can't progress past a certain point because the content isn't there. On top of that, after crafting a few different buildings, the game slows to a crawl with lag. The worst was the warps between several small maps and though there was plenty of maps, there were only 8 designs, so most of them were the same anyway. \n\nWhen I heard the \"Seamless Map\" update was coming, I was pumped! I really wanted to see where this game could go and being able to explore freely without warps would be awesome! And having more content and being able to progress further would be amazing as well. \n\nIts been nearly two years since then and barely any new content has been added. I think they added a few new bosses, but nothing worth picking the game up. I still can't go any further in the game. The devs are actively working on a pocket monster rip off instead of sticking to the zelda rip off they already released. \n\nThis is almost like No Man's Sky, which released and wasn't up to par, but the development team worked hard to release massive updates that made the game awesome. Craftopia released and had potential, but instead of being polished and taken care of, it was abandoned for the next game idea.\n\nThey say \"Thank you for the support!\" but as this point, I can't support this game. The more they release videos of pal world or craftopia, I see they are highly lacking in creativity. Some designs are far to similar to other games and it's deplorable to say the least. Even the combat and boss mechanics are straight from Breath of the Wild and the newest update preview features Bokoblin with smoother faces. \n\nWith their new game set to release in 2023, I wouldn't be surprised if Craftopia was completely abandoned and the new game would take priority. And even then, after what I have seen with this game, why would I want to jump on their next game only to find out that too has been abandoned for their next rip off? \n\nIf the \"Seamless Map\" ever becomes reality, I will be picking this game back up for sure. Hopefully the update comes with a story and new bosses and more ages to progress through. One can only fight the same boss on repeat for so long.\n\nI guess expecting something new and fresh in todays age is asking too much. With games like Pokemon Scarlet and Violet recently released or the new Breath of the Wild coming next May, I'd say it's a much safer bet to put your time and money there.", "timestamp_created": 1671024516, "timestamp_updated": 1671088002, "voted_up": false, "votes_up": 137, "votes_funny": 6, "weighted_vote_score": "0.85303497314453125", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "105908308": {"recommendationid": "105908308", "author": {"steamid": "76561198163433531", "num_games_owned": 116, "num_reviews": 9, "playtime_forever": 11420, "playtime_last_two_weeks": 0, "playtime_at_review": 290, "last_played": 1710442933}, "language": "english", "review": "This review has been edited multiple times, and was initially a negative review. With the release of the Seamless Map Update near the end of June 2023, however, I'm quite happy to finally make this a positive review. As I type this, I'm still very early in the game, so I don't know if it's worth a full 25 dollars yet, but if it isn't already, I'm highly confident that it will be someday, if future updates are as beneficial to Craftopia as the Seamless Map update has been. I may update this later on as I proceed through the game, but in the interest of keeping this updated review short but still getting my opinions across, let's go over what I've perceived as the ups and downs of the new and VASTLY improved Craftopia.\n\nTHE GOOD:\n+The combat overhaul has made combat fairly interesting. Perfect dodges and counterattacks aren't a particularly revolutionary thing, but it's a bit of spice Craftopia's combat desperately needed.\n+At least in the early game, Craftopia has a much better sense of focus, and gives the player a non-zero amount of actual instruction on how to get into the core gameplay loop.\n+The world is satisfying to explore; I got lost in Geezah Peninsula for several minutes at one point and had the most fun I've had being lost in a long time. I'm looking forward to getting lost again in the future.\n+In old Craftopia, getting guns and tamer skills was more of a mid/lategame thing, but now both are accessible pretty early in the game. Combined with skill resets seeming to no longer cost gold, you're now much more free to experiment with different builds.\n\nTHE BAD:\n-Crafting at the very start of the game feels a bit too restricted. I feel like the player should at least get access to copper crafting before finishing the Geezah Tower, perhaps by unlocking the recipes after bringing copper ore to Camille?\n-I wasn't going to talk about technical faults like bugs in this review, but this one deserves a special mention. The motorcycle, which is on the title screen and given to you by Camille for finishing the tower, has a lot of trouble traversing the new terrain for some reason. I know this will be patched, probably sooner rather than later, but considering the apparent focus the devs have put on this specific vehicle, I feel like this shouldn't have been an issue in the first place when the update launched.\n-That's it. Just those two negatives.\n\nI was a fan of the ideas behind Craftopia when the I first got my hands on the game, and seeing the Seamless Map Update release both renewed my interest in the game and definitely made it feel more like the game I imagined when I first got it. Great work on the update, devs.", "timestamp_created": 1639638969, "timestamp_updated": 1688070007, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.850080549716949463", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "75507173": {"recommendationid": "75507173", "author": {"steamid": "76561198298627392", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 97, "playtime_last_two_weeks": 0, "playtime_at_review": 97, "last_played": 1599339450}, "language": "english", "review": "Not gonna lie. it is super buggy. Things will randomly disappear, cows will randomly kill themselves, and bears will get stuck in walls.\n\nImagine breath of the wild meets Rust. It's such a gong show that it works. It is early so it's super rough but there is so much potential here. Just don't go in expect a smooth game. The first Island is all over the place.", "timestamp_created": 1599340940, "timestamp_updated": 1599340940, "voted_up": true, "votes_up": 57, "votes_funny": 9, "weighted_vote_score": "0.846599459648132324", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "129524524": {"recommendationid": "129524524", "author": {"steamid": "76561198010478703", "num_games_owned": 0, "num_reviews": 38, "playtime_forever": 742, "playtime_last_two_weeks": 0, "playtime_at_review": 742, "last_played": 1672101710}, "language": "english", "review": "As wide as an ocean, As deep as a puddle.", "timestamp_created": 1672241285, "timestamp_updated": 1672241285, "voted_up": false, "votes_up": 134, "votes_funny": 20, "weighted_vote_score": "0.844999730587005615", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "75957539": {"recommendationid": "75957539", "author": {"steamid": "76561198211618908", "num_games_owned": 0, "num_reviews": 45, "playtime_forever": 510, "playtime_last_two_weeks": 0, "playtime_at_review": 321, "last_played": 1685977499}, "language": "english", "review": "Yes, it's a work in progress. No, it's not a minecraft clone.  As  a comparison, it's like a superior Runescape. Simple intuitive mechanics.  Nice building system.  It has a 5 page, tiered skill system that sets up for neigh-limitless character skill customizations. It's the foundation for an \" everything \" game.  Multiplayer is best done through Steam. The devs should be proud of what they've done so far. I'm looking forward to seeing their future work.  Well done guys! :)", "timestamp_created": 1600089637, "timestamp_updated": 1600089637, "voted_up": true, "votes_up": 142, "votes_funny": 6, "weighted_vote_score": "0.844242870807647705", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "76589328": {"recommendationid": "76589328", "author": {"steamid": "76561198137728235", "num_games_owned": 2231, "num_reviews": 90, "playtime_forever": 3183, "playtime_last_two_weeks": 0, "playtime_at_review": 1543, "last_played": 1651541909}, "language": "english", "review": "What a pleasure this game is.\n\nIt feels like Breath of the Wild had a child with No Man's Sky and tried to teach that child the importance of The Elder Scrolls Morrowind.\n\nAs a base, the game takes a little too much from BotW, But at the end of the day, it feels like it was supposed to be mechanically anyway. Get gear, level up, craft equipment, fish, climb, cook, sell... It just feels natural. Combat is exactly what you would expect, except the part where being Link felt grounded, when the going gets rough, you can bolt away from most things and glide away, as it has two speeds. \n-It also mixes mechanics so well that if you like one concept or another, you can play on those strengths until you get the skills or gear you need to either feel comfortable with the combat, or feel comfortable with the crafting and equipment mechanics. \n-Overall, it feels like they targeted a lot of the quips people have had with crafting games such as, bad combat, areas being too large, carrying weight being too cumbersome, moving inventory to stores taking too long, etc. It isn't small, but it also isn't too big, but if you want more there are so many areas you can visit, and if you want less all you have to do is make money and get enough materials to press into new areas... Just watch your stats, you might get mowed down if you go too far.\n\nNow, allow me to explain why the similarities are what they are in my opinion.\n-The Legend of Zelda: Breath of the Wild\nObvious... But running, exploring, combat, gliding, dungeons, loot, inventory UI, even some of the things they are going to add feel like someone loved BotW so much that they wanted to pull everything they could get away with while adding their own personal touches, even some things like skulls the goblins hide in and the excessive amounts of scout towers they look out from feels verbatim to say it lightly, heck, even the way Link gained hearts or stamina by visiting shrines is in here. But when you like something so much, but just want to add your personal touch to it, I would imagine a fan wanting to go about it the same way. Frankly, the games mechanics work so well with the feel of BotW that you might want to forgive them for borrowing a little too liberally at times, though I hope they find better ways to do so, because it feels a little overdone sometimes.\n\n-No Man's Sky\nThe game spreads itself around locales that has varying levels as you progress, and as you progress, you can take any and all materials you pull from the environment aside from the door you use to leave the locale you're in and the one you arrive on. There are differing environments, habitats, enemies and resources that you can harvest, and even capture monsters and NPCs that you can bring with you across locales to build the perfect instance of whatever ecosystem you would like to have. This addition to the gameplay design allows a lot of forgiveness for the otherwise small building area, but also leaves so much untouched potential for things like survival, and randomly generated islands to take on with your friends, or alone. You could even try to be timed on how long it takes you to get to the god's alter from scratch, and get on a leaderboard or whatever. Regardless, this mechanic is basically the band aid that makes the game stronger than it should ever be if used properly.\n\n-The Elder Scrolls: Morrowind\nNow... Morrowind fans might get a little bit irritated at why this is here, but with the addition of traited equipment as well as equipment that grants a spell on it that you can cast when equipped, the game has the potential to be so intricate that it can be utterly broken in the best of ways. \nFor example, equipment has a chance to adopt traits from materials to used to craft it. Normally that means using various materials and hoping that those traits get adopted, to the point where a few tries of rare equipment could expend the materials altogether. But if you make a bucket, or a ring, or an arrow... You could get those same powerful effects without having to lose your mind over the chance normally required to get those things to happen. So now your equipment bag is full of arrows, buckets and rings that allow you to adjust your character without having to flip your blacksmith desk. Far out right?! I hope they never change this. \n\n-Another fantastic thing about this game is the automation potential, you can breed animals you catch, mass produce crops and have robotics manage your areas with some know how. Even have mechanizations deal with ore deposits (bedrocks) that are otherwise futile to mine physically. If you have the need to do more things, there are options there that provide you the tools to automate everything you need if you get the materials to make it all. \n-There is also no weight system, so if you set out with the goal of getting ore, each item type can hold four stacks of items of its own type, and supports different inherited values too. So if you got tired of how long it took for you to move your ore and wood in other games... Just come here and play this one. You can carry like 5000 logs. I hope they up the amount of equipment space you have though, and add support for dying clothes. As it is now there are only 8 armor sets. 4 for each gender, and 4 of which are just recolors of the different two types for each gender. There are supposed to be vanity clothing coming... I'm very excited for that too.\n\nWell, there are a few gripes that I do have, but they might not be that serious. \n-In crafting games, investment is almost necessary, maybe actually necessary. So when you buy a spell for the first time and use it, and consider starting over because you know if you put those two points into jumping you would jump twice as high, it gets pretty annoying. Do yourself a favor and try skills with a throwaway character so you don't get burned by a bad description, or a bad skill overall. They said they were using a translation thing to translate, so, it is what it is.\n-Sometimes fighting an enemy over the course of a long time might make them disappear between night or day. I remember fighting a dragon and not being particularly ready offensively, and ended up watching it go up in smoke when the day was over... It might be a mechanic so you don't catch enemies you aren't technically ready for, but it freaking sucks when you go back to your base and have to sell off all the weapons you just wore down trying to fight that thing... Maybe it was a bug, but Christ if there are more challenging fights later on, I really don't want to be mechanically told that I either have to only fight things I can plow through or not even try. I beat it after I did the Morrowind thing above. But I won't expect that to be possible with future enemies.\n\nShould you get it? I'm not sure... For me, I told myself that I wanted something like Genshin Impact to waste away on, but I lost all interest in it after I saw it was free-to-play. I played a few other crafting games like Dark and Light, and Citadel Forged in Fire, and while some of those have more intricate item gathering mechanics, and bigger maps as well as a more tolerable fast traversal option. (the hover boards are super clunky in here...imo, didn't make the others yet) Overall, this one feels the most like a game that you happen to be able to build in, instead of a game you build in, that happens to have exploration. Though I will say that other survival games handle traveling in the dark a little better. But if I'm honest, unless Monster Hunter, Lost Planet or Dragon's Dogma make a survival game with all of their mechanics intact, it'll be hard to top the limitless potential this game has. If you're like me, sure, give it a go. But if the games that come together to make a game like this satisfy you on their own? Come back when regular people are playing the game on YouTube, and draw your conclusions from there.\n\nI can't wait to see what they do next. Don't let us down.", "timestamp_created": 1601116899, "timestamp_updated": 1601116899, "voted_up": true, "votes_up": 128, "votes_funny": 14, "weighted_vote_score": "0.843748152256011963", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "78252912": {"recommendationid": "78252912", "author": {"steamid": "76561198147415277", "num_games_owned": 218, "num_reviews": 1, "playtime_forever": 17127, "playtime_last_two_weeks": 0, "playtime_at_review": 1914, "last_played": 1711291822}, "language": "english", "review": "After 29 Hours of Playing i can say, yes this is the maggi for my Gamefeelings.(I Hope Germans will Understand xD)\nYou have everything from survival to RPG and yeah Dungeon crawler.  it wasnt lame not one time. (Sorry my First Review ever xD) I can feel that the Devs are working with so much love for this Project, that they do what they love. And i hope i can see that this Project (Craftopia) is going trough the ceiling(I hope so). \nFrom me a BIG YES.\nAnd sorry for my Bad English and for my Bad Grammar i am from Germany and i \ntaught English by myself.", "timestamp_created": 1603829421, "timestamp_updated": 1603829421, "voted_up": true, "votes_up": 160, "votes_funny": 30, "weighted_vote_score": "0.840571582317352295", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "102341014": {"recommendationid": "102341014", "author": {"steamid": "76561198025174707", "num_games_owned": 0, "num_reviews": 58, "playtime_forever": 1583, "playtime_last_two_weeks": 0, "playtime_at_review": 781, "last_played": 1697430838}, "language": "english", "review": "While I would love to recommend this game to people because it does have a lot of potential; I cannot do so in good faith due to the actions of the Development team and whomever they hired to \"moderate\" their Steam discussions.\n\nThe main issue here is censorship: any and all threads mentioning how these developers abandoned one or two of their old games were forcibly deleted and apparently some users were even banned for making those threads. It's horrifying that people who are simply trying to warn others about bad developer behavior would be banned simply for speaking the truth on a forum and this alone is enough to make me say \"not recommended\". \n\nMaybe this will become a fantastic game before development ends, or maybe it will be abandoned like previous projects, it is hard to say. All of that would be fine if the development team chose to be truthful and not try to cover up the past but because they are trying so hard to erase their past and trying not to make themselves look bad it makes me very suspicious that the same thing might end up happening to this game in the future for their next game. (Which they have already announced is in development.)\n\nBefore anyone thinks \"oh this guy is just giving a negative review because his thread was deleted\" no- I did not play any of this development team's old games and I'm not interested in them. I did not make a negative thread about it at the time either. I am just so against this kind of horrible censorship that it completely changed my opinion about this game.\n\nCraftopia does look promising and I will surely be trying the game some more when their real open world maps are released but I won't be recommending anyone else to purchase this until I see a good version 1.0 that is improved greatly and I can say for certain that this game was not abandoned. Something else worth mentioning is that the Early Access description states \"Craftopia incorporates unique mechanics and crafting systems that have never been seen in a game before.\" and that is so false. Everything within this game has been taken from another previously well established genre, I haven't seen anything truly unique to this game so far.", "timestamp_created": 1636227565, "timestamp_updated": 1636227565, "voted_up": false, "votes_up": 225, "votes_funny": 4, "weighted_vote_score": "0.838400483131408691", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "83276811": {"recommendationid": "83276811", "author": {"steamid": "76561198214097707", "num_games_owned": 239, "num_reviews": 14, "playtime_forever": 6652, "playtime_last_two_weeks": 0, "playtime_at_review": 2739, "last_played": 1689403083}, "language": "english", "review": "---------- Thought I'd update my early review to explain where the game's at right now ----------\n\n[strike]45 hours in, I still haven't gotten bored.[/strike] [i]80-something hours in, I still haven't gotten bored.[/i]\n\nThis game [u]WAS[/u] a buggy mess, multiplayer [u]USED TO BE[/u] fucked and the gameplay loop can still feel kinda same-y and repetitive. This game is like if you let a child open five different flavors of ice cream out of the freezer, throw some of each in a bowl, and stirred it around until it all turned into a weird, brown soup with little \"unique\" bits sticking out of it everywhere. That said, that's a sweet fucking soup and dear god does this game not lack in the charm-department.\n\nThis game still draws HEAVILY on some BOTW themes, through the lenses of the same toddler who didn't think the anime Arifureta was a comedy. Thematically, and with quite a few of the basic gameplay elements, you'll find it wears Zelda not just on it's sleeve, but printed all over it's grimy t-shirt and sweatpants. Underneath that hyper-stylized (and honestly, still gorgeous) art/world design, you'll find some really quite sophisticated guts holding it up. This game will scratch your itch for everything from Factorio to Diablo, and it'll still have you playing five different slot machines at the end of the day.\n\nYou can pretty much draw connections between any games you want, but if the above sounds interesting, go for it. 25 bucks is still less than you wasted on [insert more relevant game that flopped on release than Cyberpunk here].\n\n[i]I'd also like to say, holy shit, the skills and build options are only getting better and better as time goes on. No other game will let you not only enslave children inside pokeballs, but also build your character around releasing said children only to cause them to explode in order to kill your enemies.[/i]\n\nThat said, a TON of work still needs to be put into this game, though it seems like it is getting put in.\nAt the current time:\n- [strike]crafting enchanted weapons is 100% RNG based leading to uneccesary grinding[/strike]\n- [strike]the only viable mid-game damage that will kill bosses without taking 20 minutes per fight is two-handed[/strike] (it's okay, now everyone just dual wields instead, though spears are looking promising as a versatility option.)\n- farming. Peaches are [u]STILL[/u] fucked, negate the entire eco of the game by farming up to peaches on the tutorial island and then breed old men for infinite resources if you want. Farming doesn't need to be removed, it just needs to be balanced and then expanded to be fun.\n- speaking of farming, let us farm herbs. Mana potions are [strike]so hard to source the resources for that[/strike] [i]easier to make, but still less rewarding than food, so[/i] you're better off just making rice crackers.\n- helicopters which last [strike]5[/strike] [i]10[/i] minutes before breaking. Likely made in either China, or one of it's many Apple factories. [i]But who cares, because now you can use a fucking TANK.[/i]\n- there's [i]STILL[/i] no way to make salt despite even a half-naked Gandhi figuring out that where there's ocean there is salt, and salt is used in EVERYTHING when it comes to cooking.\n- [strike]killing tamed animals sometimes outright makes them immortal until you reload the world.[/strike]\n- [strike]ground pounding enemies through the floor... including their loot.[/strike]\n- magic is [strike]pretty[/strike] [i]still somewhat[/i] under-developed and cast times really make it a bad experience in some high-aggression bosses like the \"fuck you\" lizard and the griffon.\n- [strike]the griffon is an asshole who has a VERY short window of time where you can safely damage it without getting stun-locked and subsequently dying.[/strike]\n- [strike]crop/tree harvester bots get stuck on walls, or teleport through them when they're not being rendered, or sometimes just outright disappear.[/strike]\n- everything except the player dying from water-poisoning leads to suicidal merchants.\n- the blacksmith will be happy whether you give him one or one-hundred logs.\n- need a way to automate fishing, or just generate fishing pools in a set location at the player's choosing. [i]this has been somewhat addressed... kinda... who cares, you just buy your fish from Smith anyways?[/i]\n- need a way to kill animals in your house without breaking your house. [i]STILL WAITING ON THIS ONE PLEASE[/i]\n- [strike]multiplayer hosts t-posing for the first half hour after connecting to them.[/strike]\n- [strike]and of course, the game needs a lot of back-end optimization work, or potentially just a ground-up rebuilding since this thing will kill your computer as soon as you decide it would be cool to play with conveyor belts as a player-transport solution.[/strike] [i]The game still needs more optimization, but it runs very well compared to how it used to.[/i]\n\nSo basically, you've got a big-ass sandbox, a lot to do, great fun in multiplayer and a lot of early-access charm for what it's worth... which in this case, is 25 bucks.\n\nJust go for it, support the devs and convince them to [i]continue being awesome with consistant updates and[/i] not to abandon this project like every other early-access on this platform.", "timestamp_created": 1609057264, "timestamp_updated": 1620944395, "voted_up": true, "votes_up": 126, "votes_funny": 19, "weighted_vote_score": "0.834524154663085938", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "89487478": {"recommendationid": "89487478", "author": {"steamid": "76561198064808101", "num_games_owned": 191, "num_reviews": 24, "playtime_forever": 5176, "playtime_last_two_weeks": 0, "playtime_at_review": 4930, "last_played": 1676914264}, "language": "english", "review": "---{Graphics}---\n☐ You forget what reality is\nX Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{Gameplay}---\n☐ Very good\nX Good\n☐ It‘s just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{Audio}---\n☐ Eargasm\n☐ Very good\n☐ Good\nX Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{Audience}---\n☐ Kids\nX Teens\nX Adults\n☐ All\n\n---{PC Requirements}---\n☐ Check if you can run paint\n☐ Potato\nX Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{Difficulity}---\n☐ Just press 'W'\n☐ Easy\nX Significant brain usage\n☐ Easy to learn / Hard to master\n☐ Difficult\n☐ Dark Souls\n\n---{Story}---\n☐ No Story\nX Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It‘ll replace your life\n\n---{Game Time}---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\nX To infinity and beyond\n\n---{Price}---\n☐ It’s free!\nX Worth the price\n☐If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{Bugs}---\n☐ Never heard of\n☐ Minor bugs\nX Can get annoying\n \n\n---{?/10}---\n☐1\n☐2\n☐3\n☐4\n☐5\n☐6\n☐7\nX 8\n☐9\n☐10", "timestamp_created": 1617272088, "timestamp_updated": 1617272088, "voted_up": true, "votes_up": 413, "votes_funny": 24, "weighted_vote_score": "0.833523154258728027", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "141429232": {"recommendationid": "141429232", "author": {"steamid": "76561198276465608", "num_games_owned": 122, "num_reviews": 13, "playtime_forever": 3215, "playtime_last_two_weeks": 78, "playtime_at_review": 2733, "last_played": 1713473598}, "language": "english", "review": "New update litrally removed 70% of the content. Its full of bugs and crashes and WAY WAY less stuff to do. THis is a downgrade not and upgrade. This update is a shell of its former self SHAME ON YOU DEVS. I wish i could get my money back.\n\n\nEDIT: I will rewrite this in a few months to see the product.", "timestamp_created": 1688628555, "timestamp_updated": 1690291404, "voted_up": false, "votes_up": 292, "votes_funny": 6, "weighted_vote_score": "0.832681179046630859", "comment_count": 18, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "75525788": {"recommendationid": "75525788", "author": {"steamid": "76561197996155556", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 598, "playtime_last_two_weeks": 0, "playtime_at_review": 575, "last_played": 1600252250}, "language": "english", "review": "This game has so much potential !\n\nPOCKET PAIR, INC. is a Japanese company with a small team of seven that made a game called Over dungeon which received many positive reviews on steam which gives me hope this game will become amazing given more time and money.\n\nI feel they need more exposure to really take off with this game. (notice me senpai !)\nIf they made this game free for one weekend I feel they would gain the traction they need to really make it something special.", "timestamp_created": 1599373150, "timestamp_updated": 1599373150, "voted_up": true, "votes_up": 103, "votes_funny": 5, "weighted_vote_score": "0.831517219543457031", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "85404927": {"recommendationid": "85404927", "author": {"steamid": "76561198202781686", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 927, "playtime_last_two_weeks": 0, "playtime_at_review": 813, "last_played": 1665261885}, "language": "english", "review": "This game is extremely buggy and feels like a student's Unity project. That being said, this is early access and the devs seem to be updating the game constantly. In it's current state, I'd say it's more so worth $10 than $25, but that could change in the upcoming months depending on how much this game changes. I'll outline the pros and cons to help you decide if this is worth your $25:\n\nPros: * Beautiful background music\n\n         *Design of enviroment looks like a lower budget breath of the wild world\n\n         *Crafting and building is pretty fleshed out, with lots of items to craft and automated farming\n\n         * Some sort of character customization \n\n         *Multiplayer is mostly stable (for me at least) although there are a few issues I will point out\n\n          * There are multiple skills and skill trees, which allow an array of classes for you or your friends to play (Ie. Tank, Mage, healer, archer etc)\n\n          *Bosses in dungeons scale and can be challenging the further you get into the game.\n\n\n\nCons: *While the music is lovely, there isn't much variety, and the same 1 or 2 tracks are looped in the same zones.\n\n           *The dungeons look pretty bad compared to the rest of the world. It looks very low budget (like Unity store asset cheap) and the dungeon format is ALWAYS the same; go to room one, kill x amount of mobs, proceed to the next room straight across and repeat. It'd be cool to have more of a Elder Scrolls or BOTW format, where puzzles need to be solved to proceed further down the dungeon.\n\n             *While the combat for bosses is fine, combat for any other mob is very wonky. Mobs disappearing, or being super sped up to the point where you can't stand up from being constantly knocked down \n\n             *Animation is not very good, especially for combat. It annoys me that I attack and then immediately sheeth my weapon. Most games have it so that when you attack, your weapon remains out so that you can continue to attack. Instead, after attacking you weapon immediately goes back on your back, making combat very clunky and awkward. *The running/chopping/mining animations also look awkward. \n \n                   *The physics and controls for some of the vehicles IS AWFUL. Specfically the motorcycle, which seems to veer in a certain direction no matter what you press.\n\n             *Mobs seem VERY randomly placed at times. Like, I'll find a cow in the desert or a group of pigs by a volcano.\n\n             *Just get rid of the skeletons please. They're awful.\n\n             *Multiplayer does have a few bugs, like a character being stuck in T-pose until you travel to another island, not being able to see the same items as the person you're playing with, phantom trees or rocks not being able to be mined or chopped down, etc.\n\nIn conclusion, is this a good game? For farming and base building, yes. Is it worth $25 dollars currently? In my opinion, no. But it surely could be in the future.", "timestamp_created": 1611694986, "timestamp_updated": 1611695229, "voted_up": true, "votes_up": 79, "votes_funny": 4, "weighted_vote_score": "0.831385016441345215", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "81834900": {"recommendationid": "81834900", "author": {"steamid": "76561198293439634", "num_games_owned": 0, "num_reviews": 49, "playtime_forever": 5428, "playtime_last_two_weeks": 0, "playtime_at_review": 1009, "last_played": 1703774106}, "language": "english", "review": "This is the most awesome game crafting and fun. I so love it! I am level 18 plus and i played two days.\nEnemies are so balanced and its fun fishing and crafting. I am trying to learn how to build a house lol.\nThank you for the most wonderful game! God Bless You. I am disabled veteran and it is easy for me.", "timestamp_created": 1607432031, "timestamp_updated": 1607432031, "voted_up": true, "votes_up": 93, "votes_funny": 11, "weighted_vote_score": "0.83057790994644165", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "82994633": {"recommendationid": "82994633", "author": {"steamid": "76561198082228607", "num_games_owned": 0, "num_reviews": 28, "playtime_forever": 4062, "playtime_last_two_weeks": 0, "playtime_at_review": 839, "last_played": 1703141032}, "language": "english", "review": "You can catch wandering humans as pets.", "timestamp_created": 1608761659, "timestamp_updated": 1608761659, "voted_up": true, "votes_up": 134, "votes_funny": 147, "weighted_vote_score": "0.83017653226852417", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "154445137": {"recommendationid": "154445137", "author": {"steamid": "76561198041988723", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 2143, "playtime_last_two_weeks": 0, "playtime_at_review": 893, "last_played": 1709504758}, "language": "english", "review": "For a game that's been in early access for 3 years this is extremely disappointing. So many issues plague this game beyond just bugs that it makes it impossible to actually enjoy the game play or the world as you'll have frustrating, broken or unpolished mechanics to struggle against and massive amounts of empty item descriptions. Everything from combat to menu navigation to crafting feels extremely clunky and awkward, quests and story just feel thrown on, npc dialogue is... well I'm sure localization is a different beast but it would at least be nice to have all the item descriptions. I think the dev's need to take a step back and look at their game with fresh eyes as if they were brand knew players that didn't understand any of the mechanics so that they can play it and see that while they made a decently interesting world with mechanics that sound good on paper the game experience itself isn't very fun and should be polished rather than expanding on the game which is only going to make retroactively localizing and balancing the game an absolute nightmare. \n\nSorry I just cannot recommend this game in its current state.\nGood luck, I really do hope something great comes of this game.", "timestamp_created": 1703591380, "timestamp_updated": 1703591380, "voted_up": false, "votes_up": 370, "votes_funny": 23, "weighted_vote_score": "0.829673349857330322", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "88574365": {"recommendationid": "88574365", "author": {"steamid": "76561198331118809", "num_games_owned": 0, "num_reviews": 41, "playtime_forever": 3913, "playtime_last_two_weeks": 0, "playtime_at_review": 239, "last_played": 1688098170}, "language": "english", "review": "Me and my husband enjoyed this game. It's exactly what we're looking for - a mix of Skyrim and Minecraft. The best part is being able to play co-op in a private world, where no, annoying, public players would intrude. This game has offered everything other games failed to. I hope the developers will continue to work on this game and never abandon it. I'm confident the majority of players, including me, would do our utmost to support the developers.", "timestamp_created": 1615964402, "timestamp_updated": 1615964402, "voted_up": true, "votes_up": 89, "votes_funny": 4, "weighted_vote_score": "0.827377438545227051", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "129202707": {"recommendationid": "129202707", "author": {"steamid": "76561198048126894", "num_games_owned": 448, "num_reviews": 60, "playtime_forever": 1699, "playtime_last_two_weeks": 0, "playtime_at_review": 1015, "last_played": 1699179431}, "language": "english", "review": "Breath of the Minecraft: Satisfactory Gaming", "timestamp_created": 1671917915, "timestamp_updated": 1671917915, "voted_up": true, "votes_up": 88, "votes_funny": 28, "weighted_vote_score": "0.827188432216644287", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "77580527": {"recommendationid": "77580527", "author": {"steamid": "76561198080479192", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 1699, "playtime_last_two_weeks": 0, "playtime_at_review": 1699, "last_played": 1601006553}, "language": "english", "review": "I captured a God. Made him spawn again, Captured him a second time and made him breed with himself. 12.5/10 Would breed a God again.", "timestamp_created": 1602734411, "timestamp_updated": 1602734411, "voted_up": true, "votes_up": 179, "votes_funny": 327, "weighted_vote_score": "0.824950933456420898", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "75550530": {"recommendationid": "75550530", "author": {"steamid": "76561197996639872", "num_games_owned": 673, "num_reviews": 37, "playtime_forever": 477, "playtime_last_two_weeks": 0, "playtime_at_review": 313, "last_played": 1600007279}, "language": "english", "review": "TL;DR--> Follow or wishlist this game but be careful about buying it unless you want to support its early development.\n\n\n\nI can't recommend this game in it's current form, it's very VERY early access and it's incredibly rough around the edges. Building is a chore with terrible snapping, it's difficult to place buildings exactly where you want them and every once in a while whatever structure you're placing will fall straight through the world. Combat is really basic and boils down to M1 spamming and occasionally dodge rolling. There's also a pretty interesting skill tree, but about half of the skills aren't implemented yet and the other half are poorly translated and lack enough information about each talent to tell if the investment is worth it.\n\nAnother thing that might turn people away is the translations; there's a notification the very first time you boot up the game letting you know that the majority of the translations are done by machine and are currently being worked on. This didn't bug me very much because I've played enough survival games to figure it out, but for more casual players or younger players this could lead to a poor experience. \n\nWith those glaring cons out of the way, I can say that I'm excited to see how this game develops because it has a lot of great elements to it and shows a lot of potential. If I had to compare this game to just one other, I'd say it most closely resembles Satisfactory, with elements of Ark and Minecraft mixed in. The crafting and automation elements are off to a good start and fans of Factorio or Satisfactory will have a lot of fun setting up complex mining operations and fabrication stations, once the aforementioned snapping issues get fixed. \n\nThis is definitely a game to keep an eye out for and track the development of, but I'd hold off on buying it until it gets some more of the basics nailed down.", "timestamp_created": 1599407911, "timestamp_updated": 1599407911, "voted_up": false, "votes_up": 388, "votes_funny": 14, "weighted_vote_score": "0.821525990962982178", "comment_count": 24, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "92182423": {"recommendationid": "92182423", "author": {"steamid": "76561198032282354", "num_games_owned": 961, "num_reviews": 33, "playtime_forever": 1690, "playtime_last_two_weeks": 0, "playtime_at_review": 442, "last_played": 1621479673}, "language": "english", "review": "I usually dislike survival/crafting games, because I feel hollow playing the classic pattern of \"hit some wood, then go hit some stone and idk, upgrade your stuff till you are tired of the game I guess?\", especially because I don't think the content presented is worth the trouble. \n\nCraftopia, while it follows the same \"material evolution\" logic, hits different. I will now present the reasons I prefer this one to most of the others survival/crafting hybrids.\n\n-Getting materials is not a headache. There are some slightly rare unlimited supply of materials on some maps. Thanks to them, running out of ores to get isn't a thing. The \"automation\" marketed helps, too.\n\n-Running from point A to B is easy. The map system works like this -- there is a teleport system where you can unlock islands and teleport to them (their level gradually increases). The size of each island is limited. Thanks to that, there is not a sense of \"I want to go there but it is way too far away and I will take hours walking\". It allows for easily accessible diversity. \n\n-This game is quite goofy, having a clear zelda influence, with gliders and even bonfires making gliders fly higher. A lot of climbing included. There are cannons to launch you higher. There is a fortnite like building system allowing to make stairs to heaven. And, of course, there are rewards waiting for you on high places. \nThanks to this, the game feels fun. My friend, for example, made a system where he used cannons to launch him to the sky, where he then quickly made another platform while still flying and placed a second cannon there and so on until he reached a high platform where God Anubis was. What he did then? Transformed Anubis into a pokemon, and used him to generate battery (by placing him on a \"hamster wheel\"). Yes. \n\n-Skill tree is fun because it unlocks active actions, not just passive buffs. You can unlocked dual wielding swords, use of dual handed weapons, OP magic and so on. \nThe combat honestly isn't a strong point because it is still clunky, but I like it, especially because I like using the active skills present on the game. \n\nThe negatives are:\n-The game is still in EA so it has a lot of \"Under test items\" and locked content. \n-The english used is clearly ESL. It does not feel machine translated, however. It is understandable.", "timestamp_created": 1621298121, "timestamp_updated": 1621298431, "voted_up": true, "votes_up": 74, "votes_funny": 2, "weighted_vote_score": "0.820860505104064941", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "75679123": {"recommendationid": "75679123", "author": {"steamid": "76561198106908695", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 671, "playtime_last_two_weeks": 0, "playtime_at_review": 114, "last_played": 1652944815}, "language": "english", "review": "The game is good, hoping the developers could put a more RPG element like NPC quest or town with living NPC.\n", "timestamp_created": 1599621031, "timestamp_updated": 1599621031, "voted_up": true, "votes_up": 87, "votes_funny": 3, "weighted_vote_score": "0.82032090425491333", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "75572743": {"recommendationid": "75572743", "author": {"steamid": "76561198910106112", "num_games_owned": 0, "num_reviews": 23, "playtime_forever": 2139, "playtime_last_two_weeks": 0, "playtime_at_review": 223, "last_played": 1696226613}, "language": "english", "review": "Zelda: Breath of the Wild + Harvest Moon + Pokémon + My Time At Portia + World of Tanks + Everything", "timestamp_created": 1599442109, "timestamp_updated": 1599442109, "voted_up": true, "votes_up": 108, "votes_funny": 61, "weighted_vote_score": "0.812865138053894043", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "142939258": {"recommendationid": "142939258", "author": {"steamid": "76561198163578335", "num_games_owned": 1158, "num_reviews": 3, "playtime_forever": 22045, "playtime_last_two_weeks": 0, "playtime_at_review": 18029, "last_played": 1704850764}, "language": "english", "review": "I don't normally write reviews but I'm going to for this one seeing as I played before seamless world update and after it.  People seem to be getting on the developers for changing over to a seamless world and saying it takes away 70% of content but it really doesn't the content is locked behind the ages the items still exist and I have proven this with the workshop mod aka the Sivet command workshop mod proves that these items that supposedly have been removed are just locked behind ages and adjustments right now. Some of the world bosses and dungeon bosses are hidden as well I will not get into that because I would like to point out the rules on Early Access games on steam saying that the game could be completely different upon full release.  If you look at most of the negative reviews they haven't even played 200 hours and if you look at any of the decent positive reviews they have done 250 hours plus..... That being said I'm not too thrilled about already existent items being locked behind the ages again but the same time no one talks about the legacy branch and how I could open up 15 Cherry blossom biomes and not have any residential and one whole layer of the map was straight up hell I remember having to blow up one of my map areas 20 plus times just to get a biome I had never gotten before but no one talks about that pre-seamless.  And no offense to the majority seamless has only been out when the negative reviews started in full a week..... I'm writing this review a month after seamless came out and this is more in response to all the negative reviews that seem to forget these facts.\n\nIf you don't like the seamless world currently go to the gear in your game page which is your settings go to betas and go to the legacy branch and play there if you want access to Brigandine Valley already before their update deal with more bugs and go into alpha branch. They have given you the choice which is more than some games do whether or not they are in Early Access.  \n\nI'll point out I am neither a game developer or a game critic but even I have the common sense to realize that all the negative reviews and all the positive reviews can't cover this game in full and you all can have your own opinions fine but don't get mad at me for mine either.  But at least don't take one review that is negative about this game and take it as gospel the same as the positive but look at the game itself go to YouTube and look at videos that are pre seamless world AKA legacy and seamless world and make your own decision.", "timestamp_created": 1690529789, "timestamp_updated": 1690529789, "voted_up": true, "votes_up": 134, "votes_funny": 0, "weighted_vote_score": "0.811848878860473633", "comment_count": 14, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "97321646": {"recommendationid": "97321646", "author": {"steamid": "76561198055976209", "num_games_owned": 135, "num_reviews": 67, "playtime_forever": 473, "playtime_last_two_weeks": 0, "playtime_at_review": 473, "last_played": 1613059418}, "language": "english", "review": "Looking at this game now, it's a fine mess. The devs have also started a new project called Palworld, and looking at the reviews of their earlier game Overdungeon, they don't have a good track record at keeping projects alive until completion. I would skip this until much more progress is made and they show more commitment.", "timestamp_created": 1628636529, "timestamp_updated": 1628802910, "voted_up": false, "votes_up": 312, "votes_funny": 8, "weighted_vote_score": "0.811211228370666504", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "75445836": {"recommendationid": "75445836", "author": {"steamid": "76561198063667768", "num_games_owned": 338, "num_reviews": 3, "playtime_forever": 266, "playtime_last_two_weeks": 0, "playtime_at_review": 199, "last_played": 1621230413}, "language": "english", "review": "I normally don't write reviews, But for this product I thought I would. \n\nBefore I dive in, I also wish to add, [b]Hamatchi is not required for multiplayer.[/b] You just need the host to port forward their router. There are many guides on the internet for this if you have not done this before. The defualt port for Craftopia is 8787.\n\nMy experiences were through multiplayer, and while I had some glitches and bugs, none of them I encountered were devastating. I should also note this review I'm writing is after 3 hours deep of gameplay, and while that may not be much, I feel like it is enough to evaluate the game to some degree. \n\n[b] .:Aesthetics:. [/b]\nFirstly the aesthetic of the game are fantastic, from a visual sense it reminds me of breath of the wild. I personally found the music to get annoying after awhile as it was on a constant loop and sounded low quality (coming from a bit of an audiophile). So I simply turned that off. Some of the animal sounds also seemed off. Such as the deer, didn't sound like a deer to me, though this is a minor flaw. There really isn't anything I can complain about visually, and I didn't encounter any issues or bugs with graphics. The interface is standard of an RPG, easy to understand so there's not much more you can ask for in that regard. \n\n[b] .:Performance:. [/b]\nThe game ran alright, At 1440p my fps were almost always ~60 (capped at 60) with a 8700k, 1080 TI. Sometimes they'd drop a little into the 50's. This title can be demanding on your graphics card depending your resolution and graphics card choice. At the current moment their graphics settings are rather simple in terms of customization or optimizing your performance. The best you can do is downscale resolution and disable antialiasing, so some additional graphical options would be a great improvement for players.\n\n[b] .:Gameplay:. [/b]\nGameplay is fun, melee combat is movement based with wide sweeps, jump attacks, and charge attacks (additional attacks and skills can be unlocked) it feels very classic-like. the combat felt familiar, such as titles like Ratchet and Clank. Magic seemed to be blended with melee and range, as those weapons also offered bonuses to magic attack. I'm unsure if there's specific magic weapons, but with what I've seen if you were to go pure magic the best stat stick is the best sword you can get your hands on. This gave magic more of a supportive, side class feel rather than one of the trinity (melee, ranged, magic).\n\n[b] .:Building:. [/b]\nBuilding is simple, not that I feel it needs to be complex, but it has floors, walls, ramps, conveyors, and simplistic automation. Your autonomous devices mostly serve as a quality of life, and still require player interaction somewhere along the line. \n\n[b] .:Progression:. [/b]\nProgression is short, but also fun. With 3 hours I'm at stage 4 out of 5 (There are currently only 5 stages released, but there are more planned). Even though each stage expands on the grind and the requirements to progress, I found it's still pretty fast progression. This is alright for me, as I'm fine making my own goals in a sandbox environment, such as going out and discovering things rather than focusing on gathering and crafting. I plan on investing a lot more time in the title later, but I'm waiting for a few hotfixes and patches before progressing further. It's obvious in-game that they plan to expand it much more. \n\n[b] .:Exploration:. [/b]\nWhile progression is short currently, exploration seemed to have many places to go. This game isn't open world entirely, but instead you can travel to new maps, with different level design, monsters, and resources. The zones seem to have a level recommendation, though I did not check if you need a level requirement to move to a new tile. You would definitely have a harder time if you went underleveled though due to enemy scaling.\n\n[b] .:Glitches:. [/b]\nThere were some glitches I've encountered, while I wasn't host in the multiplayer session, I encountered a fair amount of desyncing. Enemies that were there for me, but not for host. Boss went into a lazer attack, died for host, but never stopped firing the lazer. Host got stuck in a default pose, no animations. (re-equipping armor fixed that) and host had a couple of UI bugs that a quit to menu and relaunching the session fixed.\n\n[b] .:Do you recommend the game?:. [/b]\nThis game is very much \"early access\" If you're willing to be a early adopter, and enjoy what the game has to offer, while it isn't alot. it's still substantial and there's alot of fun to be had. If you're looking for a in-depth experience I think it'd be best to wait and see where development goes and what Pocket Pair adds. There are quite a few skills, and some weapons/items that show in the menus but are locked out labeled, \"coming soon\". Past that, I have no idea of their direction, it's too early to tell. But as is; It is a game with a hand full to things to do, places to explore. And I will admit an enjoyable one.", "timestamp_created": 1599249751, "timestamp_updated": 1599258785, "voted_up": true, "votes_up": 54, "votes_funny": 0, "weighted_vote_score": "0.808965682983398438", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "144782493": {"recommendationid": "144782493", "author": {"steamid": "76561198066149447", "num_games_owned": 0, "num_reviews": 82, "playtime_forever": 45, "playtime_last_two_weeks": 0, "playtime_at_review": 45, "last_played": 1620133706}, "language": "english", "review": "Wish version of Zelda.", "timestamp_created": 1692701005, "timestamp_updated": 1692701005, "voted_up": true, "votes_up": 158, "votes_funny": 118, "weighted_vote_score": "0.807407140731811523", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "76261087": {"recommendationid": "76261087", "author": {"steamid": "76561198166632561", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 1046, "playtime_last_two_weeks": 0, "playtime_at_review": 837, "last_played": 1620529300}, "language": "english", "review": "Pros:\n- The Minecraft aspect is fantastic.\n- I love the automation.\n- Archery is pretty cool\n\nCons:\n- It certainly isn't open world.\n- Too many stupid and unnecessary varieties of minerals. Let's say for example: ''iron''. You have: ''iron'', ''golem iron'' ''dry iron'' and the list goes on. At the end of the day it takes an extra chest space because it's ''dry'', and its ''dry'' enchantment has no value.\n- RPG element sucks at the moment. Mobs hit like flies who collide with you and they're extremely slow. (May change in the future)\n- Vehicles are a slippery sliding mess. Managed to drop everything into the sea or river because it's impossible to control them, which then makes them explode.\n- Fucking Mono's \n- Not much variety. Every dungeon is a copy-paste, every area is a copy paste, every mob/dungeon boss is a copy paste, etc. It's been 16 days since it's release though. \n- I N F I N I T E  M O B  S P A W N. I can't get rid of them from my base.\n- Mute the background music and open up something from Elder Scrolls or something.\n- Bad optimization\n\nConclusion:\nCan't recommend it at the moment.", "timestamp_created": 1600578319, "timestamp_updated": 1600578319, "voted_up": false, "votes_up": 200, "votes_funny": 7, "weighted_vote_score": "0.80599522590637207", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "131455318": {"recommendationid": "131455318", "author": {"steamid": "76561198139626630", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 12826, "playtime_last_two_weeks": 0, "playtime_at_review": 8375, "last_played": 1706709441}, "language": "english", "review": "<EDIT: The part below is from before Seamless World Update(I'm still near the beginning of that, but definitely enjoying so far. Just about to enter the story dungeon. My internal lore is that I dropped my \"inherited\" gold Fafnir axe into a lake, Lake Spirit came up and asked if an \"inherited\"silver/gold/Adamantite axe was mine, I gave truth, and she gave me Inherited Adamantite axe as a reward). Most mechanics seem to be the same so far. And the inheriting system allows for a very good head start, definitely save your wings, helicopters, pets, and best weapons/machines/stations and materi-PEACHES!-before starting your seamless world.>\n\nYes, I like capturing creatures so I can put them on the hamster wheels to transfer their life to batteries, turning a god into a pokemon so I can get an xp boost, beating up merchants until I can shove them into a prism and put them in my merchant farm, then waiting for the possibly higher level one to spawn in. Occasionally I hit them too hard, so they drop an egg and the top item in their inventory...Griffin wings are fun, but that took a while. A polar bear is a faster mount than a dragon. humans drop an egg and/or milk jars. Helicopter is still one of my best friends. Do I know what I'm doing? Not yet, but I haven't really been looking up a million tutorials either. PEACHES. REPAIR HAMMER. COLLECT YOUR POOPS, COLLECT EVERYONE'S POOPS. spend millions to buy max amount of an item from a merchant to sacrifice to the mighty picture book.  \nHoly Water has one of my most favorite descriptions. Water, is so, expensive. FRY EVERYTHING YOU CAN, because that's actually a lot. Never trust a Kevin.\n\nYes I recommend. Craft, build, hoard, invest in a few monoliths that I think keep chunks loaded. Your customization options available are not restricted to the body type you choose, which is really nice and fun. I really hope they keep that.\n\nIf you have spare money and want to play  botw, fortnite-style building, pokemon, Genshin-y, human-capturing, animal-hoarding, villager bat making, feed them to the mario pipes, stick them in the material extracting toaster kind of game to toodle around in and maybe try inviting a friend, DO IT. The funnest of most worlds in my book.\nHave doubts? wait until a sale or a holiday when you get a giftcard, or save your coins to turn into a digital wallet code at coinstar.\n\nIt can be janky on a few things, but it's early access and most other things are great. And I really like it. It's 30% off right now, which is more discounted than I've seen it so far.", "timestamp_created": 1674557928, "timestamp_updated": 1688205735, "voted_up": true, "votes_up": 41, "votes_funny": 21, "weighted_vote_score": "0.804901063442230225", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "75670294": {"recommendationid": "75670294", "author": {"steamid": "76561198055203007", "num_games_owned": 0, "num_reviews": 23, "playtime_forever": 1014, "playtime_last_two_weeks": 0, "playtime_at_review": 235, "last_played": 1688432367}, "language": "english", "review": "Extremely fun game but needs A LOT of work still. If you buy the game now, be prepared for bugs. Keep in mind it is early access.\n\nThings that need fixing:\n• Better English translation, currently there are a lot of errors with translation.\n• EVERYTHING catches fire if you have a campfire. Monsters will walk into the fire and catch fire and then walk into you, your structures, and spread the fire.\n• Item durability needs to be adjusted. Higher tier tools and weapons do not last longer. They are a bit stronger but take the same amount of time to break.\n• Fishing sometimes doesn't work. There are times I will try to fish in an area that has fish in it and the line will not stay in the water.\n\nOther than that, the game is really fun. You can unlock new and bigger maps as you advance that have different biomes. Finding chests around each island is exciting and I enjoy doing the dungeons. The dungeons right now are generally all the same and don't offer much different, but it is still fun and will likely get better as they update.\n\nAll in all, typical early access with bugs but has amazing potential to be a really incredible game as more updates roll out. Highly recommend. :)", "timestamp_created": 1599604736, "timestamp_updated": 1599604736, "voted_up": true, "votes_up": 49, "votes_funny": 1, "weighted_vote_score": "0.804713666439056396", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "130042327": {"recommendationid": "130042327", "author": {"steamid": "76561198265352183", "num_games_owned": 220, "num_reviews": 17, "playtime_forever": 753, "playtime_last_two_weeks": 0, "playtime_at_review": 678, "last_played": 1688034863}, "language": "english", "review": "devs basically abandoned this game and pretend their still working on it by adding laughably  poor and short bug fixes every month, dont waste your money they arent and havent added any new content in a long time", "timestamp_created": 1672766325, "timestamp_updated": 1672766325, "voted_up": false, "votes_up": 115, "votes_funny": 4, "weighted_vote_score": "0.802632927894592285", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "96637469": {"recommendationid": "96637469", "author": {"steamid": "76561197989295398", "num_games_owned": 1906, "num_reviews": 49, "playtime_forever": 347, "playtime_last_two_weeks": 0, "playtime_at_review": 347, "last_played": 1600031963}, "language": "english", "review": "Seeing this company start another game project well before the promises of Craftopia have been met is disconcerting. I have no faith in this company to provide a good product. I don't care if you are tired of developing the game, you released on early access and have an obligation to polish your game and give what you promised. Warning to others, read what people have to say because the anger for this game is real. I bought it when it released as early access because I wanted to support them but if they just do minimal effort and move onto another project then you will only ever get a half ass game.", "timestamp_created": 1627657603, "timestamp_updated": 1627657603, "voted_up": false, "votes_up": 155, "votes_funny": 4, "weighted_vote_score": "0.800273001194000244", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "122492310": {"recommendationid": "122492310", "author": {"steamid": "76561198045672960", "num_games_owned": 0, "num_reviews": 28, "playtime_forever": 15306, "playtime_last_two_weeks": 0, "playtime_at_review": 9080, "last_played": 1695675326}, "language": "english", "review": "Fun game to kill some time on with friends but VERY unfinished. You can capture an old man and make him run to his death to generate power for your creations. You can also put him in a toaster and milk him.\n\nMake sure you buy it on sale (it goes on sale A LOT) because I personally don't think it's worth the 25 USD price tag in it's current state.", "timestamp_created": 1663608963, "timestamp_updated": 1664426458, "voted_up": true, "votes_up": 34, "votes_funny": 9, "weighted_vote_score": "0.800242006778717041", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "142697800": {"recommendationid": "142697800", "author": {"steamid": "76561198006330423", "num_games_owned": 471, "num_reviews": 2, "playtime_forever": 4780, "playtime_last_two_weeks": 0, "playtime_at_review": 2365, "last_played": 1708175901}, "language": "english", "review": "Steam-library>Right-click Craftopia>Properties>Betas>Choose \"Legacy version of Craftopia before Seamless World Update has been released on June 28, 2023\"", "timestamp_created": 1690198254, "timestamp_updated": 1690198254, "voted_up": true, "votes_up": 164, "votes_funny": 17, "weighted_vote_score": "0.799847126007080078", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "79421097": {"recommendationid": "79421097", "author": {"steamid": "76561198007847377", "num_games_owned": 894, "num_reviews": 139, "playtime_forever": 507, "playtime_last_two_weeks": 0, "playtime_at_review": 405, "last_played": 1605641596}, "language": "english", "review": "You see a nice looking game on steam, with interesting graphics, and decide to give it a try.\n\nWhat could possibly go wrong? Why, quite a lot of things. \n\nYou start a the game, enjoy the visuals, craft the very first pickaxe.... and then, In a few hours you'll end up running your own version of cow hell. Where you'll have a hundred cows stuffed into a tiny room where they'll be breeding non stop only to be stuffed into your machines where they'll run in giant hamster wheels til they die to produce batteries. To prevent the building from overflowing you'll cleverly redirect excess cows into pit of fire where they'll be burned alive... and they'll all be mooing non-stop.\n\nI'm not kidding. That's part of the mechanics. There's facility that breeds animals, except it produces such insane amount of them, that in minutes you'll end up swimming in cows, and cow meat from the dead cows. As you'll frantically try to clear some room, you'll end slaughtering the cows, which till their last breath will be displaying hearts above their head, demonstrating that despite everything you did, they still love you. Once the slaughter is over you'll end up with ground covered with meat and poop. Because animals poop. Your character poops too, which something I discovered when upon reaching the first boss my character left the boss steaming present on the floor. At least this isn't animated, and poop just spawns on the ground. But, boy, was that awkward. I swear I could feel judgemental stare from the boss.\n\nLong story short.\n\nThis game is nice looking, has nice music, and they nailed the atmosphere. However, it is janky, unfinished, and broken in more ways than you could imagine. The main issue is that the game tries to do many things, but they're usually shallow and unfinished. For example, you can build a stone wall, but you can't build a stone window or a stone doorframe. There is combat, but it is very badly done, with very awkward animations and enemy behavior. There are automation features, but, for example, when you build a machine that is supposed to help you harvest crops, the machine can bunny hop over the wall and run away. I wish I was kidding. Everything's weird, broken, unfinished or shallow. But it looks nice. That's the story.\n\nOh, right. The translations are also very poor. Lots of machine translated text, some untranslated text (in japanese) and so on.\n\nDespite the mildly amusing poop and cow hell shenanigans, I do not recommend buying the game in current state. It feels like the developers tried to bite off more than they can chew, and even though they have great visuals, everything related to mechanics just isn't well done. It might be a good idea to keep an eye on this, though, and see how it develops.", "timestamp_created": 1605631545, "timestamp_updated": 1605631545, "voted_up": false, "votes_up": 161, "votes_funny": 163, "weighted_vote_score": "0.798845231533050537", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "139251528": {"recommendationid": "139251528", "author": {"steamid": "76561198286149249", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 7176, "playtime_last_two_weeks": 0, "playtime_at_review": 5716, "last_played": 1686833054}, "language": "english", "review": "Craftopia is Zelda + pokemon if that sounds fun to you, you will enjoy the game as much as i do.", "timestamp_created": 1685425555, "timestamp_updated": 1685425555, "voted_up": true, "votes_up": 53, "votes_funny": 8, "weighted_vote_score": "0.795322775840759277", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "91328440": {"recommendationid": "91328440", "author": {"steamid": "76561197972035570", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 430, "playtime_last_two_weeks": 0, "playtime_at_review": 430, "last_played": 1620006043}, "language": "english", "review": "This game exists in a strange place; It looks like an asset flip, feels like an asset flip, sounds like an asset flip, but has the soul of a game that someone cares about. To start with, the game looks and sounds awful. There's no consistency with the art, anime humans are next to realistic animals are next to chibi slimes are next to dark souls weapons. You ride a hoverboard through an Aztec ruin while dressed like a medieval European peasant. All the sound effects are grating, notably the seagulls sound like a squeaky toy for some reason. None of the crafting stations look like they should be next to each other.\n\nThe \"Enchantment\" system is actually pretty novel, but lacks polish. In short, getting resources from certain sources holds certain modifiers, so leather from a bear grants a different bonus than leather from a deer. In practice, this causes your inventory to be filled with garbage that won't stack. While inside your inventory you can stack 4 like materials, in a chest they don't, meaning that two inventory spaces can turn to 8 spaces in a chest. This wouldn't be awful except for the fact that (At least the first three) storage options suck, only giving 8,16, and 24 spaces, with the 16 space one being a gigantic piece of machinery. \n\nI think this game has a lot of good ideas, but badly needs to organize itself and make considerable quality of life changes.", "timestamp_created": 1620007946, "timestamp_updated": 1620007946, "voted_up": false, "votes_up": 256, "votes_funny": 16, "weighted_vote_score": "0.792441427707672119", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "106871610": {"recommendationid": "106871610", "author": {"steamid": "76561197971468331", "num_games_owned": 2430, "num_reviews": 139, "playtime_forever": 14237, "playtime_last_two_weeks": 0, "playtime_at_review": 1987, "last_played": 1703887222}, "language": "english", "review": "Pros\n\nMod support\nRelaxing music\nLarge open maps\nMany crafting options\nLots of loot\nVroid support for custom avatars\nAbility to make a base on every island\nMultiplayer\n\nNegatives\n\nCut and paste dungeons\nPoor building options\nMissing building pieces\nLimited island variations \nSnap to grid options don't always work\nPoor balance\nBad translations\nMany bugs and missing content\nJanky Controls\nVery grindy in certain areas\n\nCraftopia just barely receives a positive from me and I'd really recommend purchasing on a sale until some of the worst issues are resolved, and really due to the fact its got a enough gameplay and features that outweigh the worst of the negative issues the game also has, bearing in mind the early access that is quite apparent. \n\nGraphics wise, it tries to copy BOTW and Genshin Impact and fails at both, whilst the graphics are not terrible, I'd say it reminds of me PS3 era graphics, with some textures looking okay, whilst others are just plain terrible and has clipping issues in many places,  its functional just don't expect too much from it,  whilst the sound is actually better than the graphics with good vehicle sound effects and the music is actually quite relaxing even if it plays on a loop.\n\nGameplay is a mixed bag though,  first off lets not forget this is early access and whilst that is fine, don't expect some of the core issues to get easily fixed such as the janky control method especially when placing building pieces and expect a bit of frustration from it.   Combat is archaic but isn't bad per say,  occasionally some skills are a bit strange with some OP skills and others are just plain useless making the balance pretty off in certain aspects,   the loot is varied and can have a fairly good array of different modifiers both good and bad so expect enough content for min/maxers here.   \n\nOne issue is the fact you can progress through Era's very quickly and then around the 5th era hit a huuge brick wall because of really poor balancing,  instead of making it harder to progress through earlier Era's to maintain some balance, they hit you hard right out of the blue making for a significant grind to progress after that.   Also, the game can be quite grindy but only if you decide to grind case and point is the picture book which is basically a collection tab that you can add items you have crafted for a small reward,  and the rewards for stage 2 and stage 3 are pretty poor considering you might be required to turn in 100s if not 1000s of the same item to reach the next reward level, which is often just a 0.1% boost in a particular stat. \n\nAnother issue is crafting certain items is once again, heavily unbalanced and the general idea is to make ghastly looking automatic production lines in order to do the worst of the grind for you,  one such example is making 5000g from selling water,   boiling water in a pot takes several minutes for one and they sell for 10g each, so it doesn't really take a genius to figure out how much of a time waste this is unless you follow a guide to make an ugly looking and somewhat complicated production system to automate the process,   this goes for several other areas too like farming.   General controls for vehicles are actually not terrible and work quite well,  one negative is that wall climbing is very janky and option bugs out which can be quite annoying in wall climbing challenges. \n\nThe maps would be so much better if they were randomly generated with different biomes, but it appears many just recycle over and over with just higher level monsters and dungeons which is a let down,  it is entirely possible to unlock two identical islands right next to each other,  you can 'destroy' which I believe is essentially the same as reseeding that particular island.    Respawning is also a chore and doesn't make that much sense,  one of the items is the bed which allows you to respawn on that island but is somewhat useless since there is another item which requires higher level materials which lets you load into that particular spot and without it, each time you go back to your island base you could be a significant distance away.\n\nIn closing,  Craftopia is more of a MIXED game but has more positives for me to give it a thumbs up but only on a sale,  the game has enough content and future content to provide enough enjoyable playtime for casual and hardcore players with the promise of greater and more difficult challenges,  just don't expect too much right now.\n\nAs of 4/14/2023 playing again to see any new content drops, I noticed that some of the new patches seems to have completely broken the Vroid Hub and no longer functions.", "timestamp_created": 1640829849, "timestamp_updated": 1681451995, "voted_up": true, "votes_up": 52, "votes_funny": 8, "weighted_vote_score": "0.79138028621673584", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "97897271": {"recommendationid": "97897271", "author": {"steamid": "76561198055509653", "num_games_owned": 0, "num_reviews": 17, "playtime_forever": 14538, "playtime_last_two_weeks": 0, "playtime_at_review": 8048, "last_played": 1697962225}, "language": "english", "review": "very good game but i can't say i can ever support Pocketpair as a developer any more. Made alot of promises and when they come up with new idea's they just make a new game with the updates and such and basically stop with their current progress to so they can get more money out of you. Found out was a different game before this one, now it's PalWorld instead of this one. sadden's me when a game had so much promise to be ruin by greed ..", "timestamp_created": 1629431519, "timestamp_updated": 1629431519, "voted_up": false, "votes_up": 170, "votes_funny": 2, "weighted_vote_score": "0.789987504482269287", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "95859298": {"recommendationid": "95859298", "author": {"steamid": "76561198123360755", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 3749, "playtime_last_two_weeks": 0, "playtime_at_review": 2864, "last_played": 1671221930}, "language": "english", "review": "Played this game about 8 months ago, IMO put in enough hours for an educated opinion(50ish). Just started playing again this week and i can truly say that i have not noticed any improvements and in fact quite a few of the major and minor issues are WORSE than they were almost a year ago.\n\nDec 2022 update*\nCame back again, numerous updates and quality of life changes. Much better", "timestamp_created": 1626463282, "timestamp_updated": 1671221225, "voted_up": false, "votes_up": 56, "votes_funny": 2, "weighted_vote_score": "0.789378821849822998", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "111683192": {"recommendationid": "111683192", "author": {"steamid": "76561198012617860", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 34281, "playtime_last_two_weeks": 0, "playtime_at_review": 29361, "last_played": 1657650453}, "language": "english", "review": "Its been a while since i put some many hours in one game. Now ticking on 500 hours I can only say I love it! The engineering factor, the base building, the farming (agriculturally), pet managing it is all adorably there. Heck , if I get cabin fevered on my island, I'll leave for the bosses hunting for those legendary enchantments or unexplored islands. The higher you explore on the world map, the harder the enemies. But not only that. Some island are harder than others, giving you quit some variation on when to tackle them and their bosses. \n\nInventory management can be a hassle, especially the higher the evolution age you are in, with easily 100+ materials and objects (excluding weapons etc.) But personally I find it soothing sorting all my stuff in all plausible containers and sorting tools the game has to offer. Me and my wife play solo and co-op and I have the possibility to share my base builds between multiple characters. So only positives for me on Craftopia. If I have to put in a negative i can only say my pet flies to slow :D", "timestamp_created": 1646579875, "timestamp_updated": 1646579875, "voted_up": true, "votes_up": 37, "votes_funny": 3, "weighted_vote_score": "0.788052260875701904", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "121502591": {"recommendationid": "121502591", "author": {"steamid": "76561198027353408", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 5529, "playtime_last_two_weeks": 0, "playtime_at_review": 5303, "last_played": 1699425261}, "language": "english", "review": "TL:DR: There are many aspects to this game. So many that I can confidently say there is likely something for everyone. However nearly every single aspect to Craftopia is incomplete. Another reviewer described Craftopia, \"As wide as an Ocean, as deep as a puddle.\" This sentiment is spot on.\n\nOK, the long version. Craftopia is a survival sandbox esq, rpg esq, experience. Like some other games of similar nature you have Characters and you have Worlds. They exist separately. Character options and World options are fairly common. Each world is composed of a series of \"islands\". You must locate islands of certain types, at certain distances from the origin (this is referred to as \"levels\"), in order to obtain certain resources. Should you discover all of your islands of a level range you are SOL until you reach endgame. The only way to replace an island is using late to end game recipes. Islands with the same name are identical. There is no apparent randomization as to the content of an island. The level of the mobs, and the loot is determined by the level of the island. Each island has some dungeons on it (except empty islands). Dungeons come in a couple of varieties. Zone dungeon (some mobs then a boss). Mine dungeon, these have resources of the appropriate level plus clay, rare ore, coal, lime stone, and a couple of others that may not occur outside of mines, at the end of the mine there will be a boss fight. Challenge Dungeons, in a challenge dungeon you are challenged to complete a task, kick a ball into a hoop, escape a maze, complete an obstacle course, no boss fight, but loot at the end. Basically you explore an island, collect resources, go up levels, unlock high level islands, repeat.\nRight now you may be thinking, \"Ok, that sounds like fun for a while\" I will admit that was me when I bought the game. Here is the kicker. In order to unlock higher level islands, you need to consume some ingredients. The ingredients required change from level to level, and may not be consistent from world to world (more investigation required to confirm). The first 5 levels of islands are relatively easy to unlock. I go to an island, gather a bunch, clear the dungeons, then return to my home base to process loot. Here is where things break down fast. If you are not on an island, nothing on that island continues to function. This means that while I am out exploring my crafting jobs are not running, my animals are not populating or [spoiler] pooping (which you need a crap load of btw) [/spoiler]. Which means that I then need to spend a couple of hours at my base waiting for crafting to finish so that I have the ingredients for the next age or island. This is fine a good for a while. There are many other things that can distract us ADD brain people. However, after a while all that is left is to stare at the crafting station and wait for it to finish. For those that are thinking \"but there is automation!\" I say not really. There are mechanisms that may allow for crafting tasks to be chained, but the players must be on the Island for those to run. Which means, in mutiplayer, you have a number of frustrated players that all want to go hunt the next boss(es) but are stuck waiting for ingredients. Then, once you do have your ingredients it rolls on a random table to generate islands. Which means it is very possible to generate 6 empty islands in a row. Which then means more HOURS of afk crafting, or collective waiting. \nThe automation tools that do exist seem like they came as several different asset packs from the Unreal marketplace, and they were strapped together with duct tape. They may work, they may not, depending on how you set things up. The automation tools are also significantly larger, provide no additional throughput, but may allow for afk crafting.\n\nAside from the core mechanics above, there are three general combat styles Melee (receives most love), ranged (seems like they almost forgot about this), and magic. In my time playing I made sure to explore each of these. Melee has the most options. I can add skills for 1h + shield, 2h, dual wield, or fists (unarmed). There apear to be unique options for 'katanas' which are different from other weapons. Ranged combat made it a bit easier to learn some boss mechanics. Ranged combat does require ammunition, does the least DPS, and has the least skills associated. Magic offers a wide array of options. You can be a dedicated damage caster with damage spells, AoE, single target, dot, multi-target, you have a bunch of options. You can augment a melee or ranged build with some spells. Like chance to not consume ammo for a time, healing, or melee attacks increase the damage of your next damage spell. I strongly suggest that every player use the starting dodge skill, and heal. There is no content that I have completed where these two skills did not help. \nBoss fights are fairly simple. they have slow, obvious mechanics that should be easy to dodge (with dodge skill). Despite that they move very erratically which means ranged attackers should expect to do 10-40 damage to a boss or a few hundred on the rare weak spot or critical hit. While Magic casters are consistently ~300dps throughout the fights, and melees may be on again and off again for large damage. Overall I think the game would be better if the devs focused on the island exploration, and dungeon mechanics, and either removed or reduced the age mechanic.\n\nThere are vehicles at this time. They are super janky and will explode for little to no reason. With two exceptions. The raft, which is virtually useless (its too slow), and the helicopter. The helicopter is an excellent way to explore a map and scout areas while avoiding significant dangers. The hover boards, buggies, and motorcycles were hard to control effectively or would over react to physics in destructive ways. There seem to be a few more vehicles but after 88 hours in I still have not experienced them.\n\nAt this time I do not recommend Craftopia. Its a janky garage project that is woefully incomplete. You can lose a dozen or two hours into easy, but you are not likely to have enjoyed that time, or be made better for that time investment.", "timestamp_created": 1661911183, "timestamp_updated": 1661911183, "voted_up": false, "votes_up": 89, "votes_funny": 2, "weighted_vote_score": "0.785825788974761963", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "86860464": {"recommendationid": "86860464", "author": {"steamid": "76561198021963203", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 6398, "playtime_last_two_weeks": 0, "playtime_at_review": 122, "last_played": 1705282847}, "language": "english", "review": "1 Part Zelda BOTW\n1 Part Genshin Impact\n1 Part Skyrim\n1 Part Factorio\n1 Part Pokemon\n1 Part Sid Meyer's Civilization\n\nThrow it into a crockpot and *Zelda crockpot noises* \n\nCraftopia. \n\nAlso the minimalist backstory for your player character made me laugh out loud. If you're starting a new character in a new world, the first thing you see after character creation is a big red button. Click it and Earth blows up. You're then greeted by some antlered pagan fae-looking... entity... in heaven who basically tells you you fucked up and destroyed all of humanity and as punishment you get to start all over again from the Stone Age. Was not expecting this level of drama in a crafting game. \n\n10/10 would nuke the planet and start fresh again", "timestamp_created": 1613546964, "timestamp_updated": 1613546964, "voted_up": true, "votes_up": 60, "votes_funny": 39, "weighted_vote_score": "0.78451007604598999", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "75472658": {"recommendationid": "75472658", "author": {"steamid": "76561198197947707", "num_games_owned": 125, "num_reviews": 3, "playtime_forever": 283, "playtime_last_two_weeks": 0, "playtime_at_review": 155, "last_played": 1599478353}, "language": "english", "review": "Thank you Nintendo for making new Zelda game for PC\nPraise Miyamoto", "timestamp_created": 1599294441, "timestamp_updated": 1599294441, "voted_up": true, "votes_up": 83, "votes_funny": 108, "weighted_vote_score": "0.783058702945709229", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "97781211": {"recommendationid": "97781211", "author": {"steamid": "76561198023490291", "num_games_owned": 0, "num_reviews": 64, "playtime_forever": 841, "playtime_last_two_weeks": 0, "playtime_at_review": 841, "last_played": 1615989653}, "language": "english", "review": "Stay clear of this game - as they're working on their new game Palworld - and most likely be using this game to test and break stuff. They're reusing most of the stuff in this game for Palworld even the intro music of both game is so similar..just avoid this company until they can show some sort of commitment.", "timestamp_created": 1629264964, "timestamp_updated": 1629264964, "voted_up": false, "votes_up": 77, "votes_funny": 1, "weighted_vote_score": "0.782409846782684326", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "105987096": {"recommendationid": "105987096", "author": {"steamid": "76561198110363465", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 3488, "playtime_last_two_weeks": 0, "playtime_at_review": 3088, "last_played": 1654642154}, "language": "english", "review": "Fun game. I don't love how much gold it takes to upgrade your era once you get to a certain level, but gold isn't hard to come by.  It just takes a lot of killing and selling stuff to get it.\n\nOne BIG downside to this game: on multiplayer, you and all other players have to be in the same map.  I'm more into building, and my friend is more into exploring, but I can't stay on our base island and work unless he's there as well, which is boring for him.  I basically have to play alone when he's busy with other stuff just so I can get our base built.  I'd love it if the developers altered that feature.\n\nAll in all, it's definitely worth the price.  I like the new stuff they added, I had stopped playing for several months and just checked the patch notes today.  I'll be playing it more now.", "timestamp_created": 1639763145, "timestamp_updated": 1639771781, "voted_up": true, "votes_up": 39, "votes_funny": 0, "weighted_vote_score": "0.781195521354675293", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "75725779": {"recommendationid": "75725779", "author": {"steamid": "76561198118353769", "num_games_owned": 172, "num_reviews": 3, "playtime_forever": 319, "playtime_last_two_weeks": 0, "playtime_at_review": 159, "last_played": 1621938278}, "language": "english", "review": ">>>> IF YOU ARE HESITANT ON BUYING THIS GAME PLEASE READ THIS!!!<<<<\n\n- Is this game fun? Yes, it has brought a new spin on survival games by taking a lot of features of other survival games with the crafting and exploration and added it's own few touches to make it refreshing. You can easily poor hours upon hours into this game! \n\n   - Is this game worth the $23? In my opinion, If you have the expendable income and don't care than yes but, if you are more cautious with your money at the moment and are hesitant, than no. The reason for this is because:\n\n  - The game has a lot of bugs, but just because this game is in Alpha and is only $23 does not excuse some of the things that are glaringly apparent and some down right game breaking. Glitches such as; if you travel from one area and back your progress and things that you have built disappear, Some objects are completely non functioning or can't be interacted with, If you position your character in the right spot in front of a tree, you can see straight through the entire map, and many more. \n\n  - The game runs poorly, Even with uncapped frames (I was playing on highest settings at 1080p with a Ryzen 7 3800x and a 2080 So your experience may vary dependent on your specs and settings) the game struggles to stay above 60 fps, even while doing the most minute things such as running. I even capped the frame rate with the in game option it provides and the game still could not hit that 60 fps mark consistently. No I did not test any other settings lower so of course the game could run better at lower settings, I would hope. \n\n -  THE GAME IS MISSING MORE THAN 80% OF THE SOUNDS!! ENEMIES DO NOT HAVE SOUNDS, THE ENEMIES ATTACKS DON'T HAVE SOUNDS, YOUR ATTACKS DON'T HAVE SOUNDS, THE BOSSES DON'T HAVE SOUNDS, YOUR MOVEMENTS DON'T HAVE SOUNDS, YOUR GLIDER DOESN'T HAVE A SOUND, I have read a lot of the reviews for this game AND NO ONE IS MENTIONING THIS GLARING ERROR!! \n\n - There are too many features that the trailer shows that are not in the actual game and if they are, they are extremely buggy!\n\n - The multiplayer damn near does not work the connection and ping are through the roof! (I have limited experience with this so again experiences may very.\n\n   - Yes I have only a few hours played with this game, but if I have run into that many bugs and issues in such a short time, that should tell you something. I believe this game can be something great and for those who don't mind diving in and seeing what this game has to offer then go for it. On the other hand this game is very enticing but, it can not deliver on the full package just yet. If you are hesitant, just wait on it, better days are to come! This game will be something amazing, just not right now.\n\n    AND IF I AM WRONG ON SOMETHING PLEASE FEEL FREE TO LET ME KNOW, OF COURSE THESE ARE MY EXPERIENCES SO KEEP THAT IN MIND!!", "timestamp_created": 1599701813, "timestamp_updated": 1599740473, "voted_up": false, "votes_up": 286, "votes_funny": 23, "weighted_vote_score": "0.780523180961608887", "comment_count": 23, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "108017900": {"recommendationid": "108017900", "author": {"steamid": "76561198046971394", "num_games_owned": 0, "num_reviews": 97, "playtime_forever": 4065, "playtime_last_two_weeks": 0, "playtime_at_review": 286, "last_played": 1654304909}, "language": "english", "review": "The best sandbox survival you'll ever play.\n\nAlso you can stuff a child in a capture monster prism, which is like a Pokeball, and then sell them on the market.", "timestamp_created": 1642203603, "timestamp_updated": 1642469691, "voted_up": true, "votes_up": 65, "votes_funny": 55, "weighted_vote_score": "0.777853965759277344", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "147308198": {"recommendationid": "147308198", "author": {"steamid": "76561198018805874", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 5354, "playtime_last_two_weeks": 0, "playtime_at_review": 966, "last_played": 1699722165}, "language": "english", "review": "Unique and fun as hell when you get past the jank and bugs, it has an absurd amount of content for this price and the map being separated in dozens of smaller maps to explore and build makes peformance pristine. A game that joins automation with survival \"breath of the Wild\" style of game.\n\nTHIS IS WHAT I WOULD SAY ABOUT THIS GAME IF NOT FOR THE JULY UPDATE.\n\nFor some god awlful reason devs ditched the game structure to make an open world map called Seamless, it is now a low quality Genshin Impact map. \n- Now peformance is at its worst, only people with i9 core and above can actually play it. \n- Much of the content from the original game was removed or went under work again to fit the new map.\n- The variety of mobs, bosses, weapons, items and resources was cut by 70%.\n- Because of the points above the map is empty and devoid of things to do.\n\nEssentially the game regressed 1+ years of dev work to fit this new map and game structure.\nThe only caveat is that you can set (in Steam) to play \"Legacy\" craftopia, the original and IMO the better version of this game.", "timestamp_created": 1696021215, "timestamp_updated": 1696214172, "voted_up": false, "votes_up": 65, "votes_funny": 0, "weighted_vote_score": "0.7764778733253479", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "75962745": {"recommendationid": "75962745", "author": {"steamid": "76561198401477724", "num_games_owned": 231, "num_reviews": 12, "playtime_forever": 6032, "playtime_last_two_weeks": 0, "playtime_at_review": 204, "last_played": 1608912173}, "language": "english", "review": "My Review :\n~ Graphic : Beautiful\n~ Story : none\n~ Character : nice\n~ Gameplay : good\n~ Sound : Good\n~ Difficulty : Easy to learn\n~ Bugs : Too many bugs\n~ DLC : not need to buy (it's just a soundtrack)\n~ Price : Worth the price \n~ PC Requirements : Ram 8GB & VRAM 2GB\n~ overall rating by me : 7.5/10\nMy Comment :\nThis game is still under development, so there is still a lot to add. This game is very good because it combines RPG with surival crafting and Sandbox games. I would recommend waiting for this game to finish development before actually buying.", "timestamp_created": 1600096825, "timestamp_updated": 1607696831, "voted_up": true, "votes_up": 48, "votes_funny": 1, "weighted_vote_score": "0.775795400142669678", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "75441426": {"recommendationid": "75441426", "author": {"steamid": "76561197987460717", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 1794, "playtime_last_two_weeks": 0, "playtime_at_review": 180, "last_played": 1688843329}, "language": "english", "review": "A common trend I'm finding with reviews is that this game has some serious potential and I agree. Some of the reasons I think it has amazing potential:\n\n-The degree of movement options, you can run, crouch, sprint, dodge roll, glide, cling to walls, climb, slow time in air (with bow skill)\n-Combat animation is fluid\n-Lots of crafting options, enjoyable crafting\n-Art style, it is a fairly aesthetic game\n\nThe biggest issues I have identified:\n\n-Bug fixing\n-English translations\n-Climbing needs to be more fluid\n-Combat needs stun lock for enemies or enemies to telegraph attacks\n-Crafting needs more options. It is varied, but I would love to see the system expanded\n\nI was expecting a large open world, but it is more like several small instanced islands as part of a larger world. Similar to dragon quest builders 2. Not sure if they want to make this a single large open world game, but I would definitely appreciate a move in that direction.\n\nIn its current state the single player is playable and enjoyable, even if they dropped the game right now you can still get quite a few fun hours. I highly recommend you support this game for what it could become.", "timestamp_created": 1599244198, "timestamp_updated": 1599244198, "voted_up": true, "votes_up": 33, "votes_funny": 2, "weighted_vote_score": "0.771095216274261475", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "152168911": {"recommendationid": "152168911", "author": {"steamid": "76561198069465330", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 1539, "playtime_last_two_weeks": 0, "playtime_at_review": 1539, "last_played": 1681683639}, "language": "english", "review": "It's an amazing idea for a game, the best of lots of open-world games all rolled up into one epic game. Sadly this is another one of those unfinished games this will be in \"Early Access\" for the rest of your life. It's been that way for years and there seems no end in sight. They keep on adding more side features and UI changes that don't get the game any closer to a complete game. As it is, it's a somewhat entertaining and buggy sand-box game that quickly becomes pointless because there is no complete story or quest lines. There's doesn't seem to be a point to anything. Will keep checking back every year or so to see if they ever decide to finish a complete end-to-end game and take it out of early access. For now save your money and buy a finished game. This early access crap is getting old, it's been years...either just finish the game or take it down.", "timestamp_created": 1701053669, "timestamp_updated": 1701053781, "voted_up": false, "votes_up": 86, "votes_funny": 2, "weighted_vote_score": "0.769869029521942139", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "83492553": {"recommendationid": "83492553", "author": {"steamid": "76561198062868993", "num_games_owned": 145, "num_reviews": 14, "playtime_forever": 5801, "playtime_last_two_weeks": 0, "playtime_at_review": 5005, "last_played": 1610162239}, "language": "english", "review": "Fantastic game. Got this a while ago and at first the multiplayer barely worked, but with subsequent patches (the devs are working hard on it) this improved and became playable.\n\nGame has a lot of depth to it and found time after time there was an additional layer of complexity after ascending ages, or figuring out new mechanics with gear, or skill trees. The game gets even better with friends as you can actually make a composition of tank, heal (kinda) and dps, and I definitely reccommend this game to be played with friends.\n\nThe sweet spot seems to be 4 people, especially if you pick different roles, more than that and gear fighting becomes a thing as it is incredibly material consuming and RNG to get 1 set, let alone 4. Going over 4-6 people becomes a bit of a mess, especially when magic gets involved. One ice spell is particularly frustrating as it interacts with players and creates a very large impassable obstruction which can interrupt healing, abilities or trap you. As a tank I found this to be very disrupting in fights (looking at you chris).\n\nThe combat itself, while relatively deep for melee with a lot of different routes to take whether you want to go in hard with damage or tankyness, a lot of builds are viable, though there is an annoyance with archery where you are effectively \"losing\" a gear slot (arrows) due to firing them. \n\nThe netcode is the game's main weakness, and this ties in heavily to combat. While I would say combat is \"fun\" it can be pretty frustrating with hit detection, animation lock, and ESPECIALLY in multiplayer having everyone seeing consistent results in the same combat. Often when doing a boss with a lot of abilities, different people will see abilities used on different people, or at different times, but only one or the other will be \"real.\" The game's netcode seems to be a bit of a mess, though it's understandable for a beta game.\n\nI have come across a few serious bugs and issues though (mostly to do with netcode) and the main one that comes to mind is where I made the mistake of building on land at ground level on the starter island. Me and a bunch of friends built a very nice and large base which Alexa very nicely decorated and arranged with chests, but due to one stray blue blob creature getting stuck undernearth, the game decided it had enough. A load of lag and audible hit detection later, I came back to the base to see that a hole had been blown from the base, all the way through multiple floors, taking out our entire chest room with it, from one small mob which got bugged in the wall, destroying half of the base. Suffice to say I've built high in the air or over water ever since.\n\nWhen you get to the \"endgame\" you start to really notice some of the game's other flaws. While at first, dungeon variation seems pretty nice with multiple dungeon types and different end bosses on each map, by the time you've run a few they will quickly get stale and repetitive, and you have to run quite a few of these for materials, gear and stat upgrade tokens. The maps have a similar issue, where you feel like the game has endless variation until about 10 or so hours in, when you realize there's about 10 different map types repeated, leading to knowing the map's layout as soon as you arrive. However, I fully expect both of these issues to resolve the more development goes into the game, as the core building blocks, with the gearing and levelling loop being fantastic.\n\nThe game additionally has a lot of \"minecraft-like\" QOL stuff. You can set up self-sustaining farms, breeding plots, and automate entire mining, refining, and crafting lines if you spend a bit of time setting it up. There's also a ton of customization, both building wise and player wise, with a lot of hard-to-get cosmetics which look great and are satisfying once earned.\n\nAll in all, the game is very rough around the edges and needs a lot of development, but with friends this game is really a 9/10 and a great laugh. Just don't let Maddie near any open flames or she will set everyone and the whole base on fire.\n\nAlso dragons are cool as hecc. If you can look past the growing pains of this game, and understand it will get much better with time, then this is an easy buy.\n\nEDIT: Forgot to mention, due to the repetitive nature of endgame, the game can get pretty boring once you're maxed out at endgame (which I was for a while) in gear, levels and achievements. Though with the newly released \"hell\" region, a nice degree of challenge has been added with a lot more complexity for gear, which is a nice addition. We had a blast hunting for the new age upgrade materials and battling stronger dragons while getting swarmed by waves of respawning mobs, though as usual the buggy nature of the game showed with dead bodies seemingly being able to hold aggro for a while as long as you don't hit respawn. Hopefully this is patched in the next update.\nThe game is very friendly to new players too, as if you know what you're doing, you can level and gear up pretty quick, catching up in no time, so you can always add new friends to the group (max size 8 online at any one time). The game is also alt-friendly and I highly reccommend have a combat character at max level, and a crafting/lifeskill character at max level. You can respec for a small cost, but it can get tedious constantly changing skills.", "timestamp_created": 1609261256, "timestamp_updated": 1609261586, "voted_up": true, "votes_up": 27, "votes_funny": 1, "weighted_vote_score": "0.769179105758666992", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "139675090": {"recommendationid": "139675090", "author": {"steamid": "76561198274480861", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 2512, "playtime_last_two_weeks": 0, "playtime_at_review": 1893, "last_played": 1688172617}, "language": "english", "review": "As of now the game is a hands down recommend. I have been waiting to write a review until open world update had a date, and while it doesn't have a set date in june it is close enough. I will adjust my review after the update as it will be a game changing update. This game is an almost must recommend. It is a super sand box the only thing that holds it back is some micro choices they made.\nPros:\n-Game has a variety of decor items\n-There are so many builds to mix and match\n-The progression between the ages and skill tree feels so good\n-The game does not take itself too seriously\n-It is stable *for the most part*\n-The devs are awesome\n-Your first time on each biome feels like a true adventure\n-Some bosses are REALLY fun.\n\nCons:\n-Some bosses are really shit (yea no kidding bosses here are either really fun or really ass.)\n-The dungeon puzzles are easy to cheese and just easy period\n-All biomes have the same exact layout when youve seen one island youve seen all the others with matching names\n-Some abilities are TOO strong and are a must take if you have to min/max like me\n-Some items are too strong. Why would I use a car when I can use a helicopter in same age and cheaper.\n-Some items could use balancing between the ages (pushing some forward and some back.)\n-There are fun ideas that are not fully explored yet like the rocket ship.\n-It CAN be Janky but this is honestly almost a plus in this game esp with its small team\n-(Personal Gripe) the humans you capture dont do anything different than the animals besides some of them trading. Wish they had more they could do or could be assigned housing and jobs or something.\n\nOverall as the game stands now it is an 8.5/10 would highly recommend esp if you are playing with friends. This is a TRUE sandbox where you can do whatever you want basically.", "timestamp_created": 1686120066, "timestamp_updated": 1686120066, "voted_up": true, "votes_up": 51, "votes_funny": 2, "weighted_vote_score": "0.767678678035736084", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "75695435": {"recommendationid": "75695435", "author": {"steamid": "76561198275332992", "num_games_owned": 159, "num_reviews": 7, "playtime_forever": 1253, "playtime_last_two_weeks": 0, "playtime_at_review": 462, "last_played": 1613263733}, "language": "english", "review": "So far : First 2 hours, seriously having the “Zelda, satisfactory, rogue light, dark souls vibe” and the more you play the more you get addicted, this game is horribly bad because of how addicting and time consuming it gets.\n\nPurchased it yesterday, nearly played 8h and made two others of my friends purchase it!\n\nSadly, I have some positive and negative cons;;\n\nPositive : Game is fun, the more options, the possibilities to be able to craft more and more items when you upgrade civilization. The RPG/MMORPG like of the game amaze me of how amazing it all works out together.\n\nNegative : Due to the multiplayer not fully working I’m forced to host the server with “hamachi” due to this we’re limited with who we can play. I have a friend from EU and I’m from CA so it was impossible for her to play with me.\nThe optimization could be way better, I have quite a good computer and there random drop from\n50-60 FPS to 20. \n\n\nOverall : Quite a funny experience so far, having a lot of fun with my friends but sadly cannot play with all of them as of now due to multiplayer limitations. Looking forward into the updates and can’t wait that it’s workable! \n\nWhatsoever, really enjoyable game and I recommend you getting it before the price raise.", "timestamp_created": 1599654509, "timestamp_updated": 1599654509, "voted_up": true, "votes_up": 29, "votes_funny": 1, "weighted_vote_score": "0.767038941383361816", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "88728624": {"recommendationid": "88728624", "author": {"steamid": "76561198000735646", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 1235, "playtime_last_two_weeks": 0, "playtime_at_review": 666, "last_played": 1619418691}, "language": "english", "review": "Look. \nIf there was an 'eh' review option, I'd have put it there.\n\nHaving just finished off the early access content of Valheim, Craftopia doesn't stack up, but making a direct comparison is a bit unfair. I've given it thumbs up, but it still has a ways to go. Scroll all the way down for the TL;DR.\n\nContent\nThere is a lot that is WIP with Craftopia, but there is still plenty to do that you'd expect in this genre. Mine stuff, fight stuff, build stuff. For me the downfall here is a lack of immersion.\nMy interactions with the content of this game are VERY surface level. Pretty enough graphics, but nothing really new. NPC villages, but not much in the way of interaction except the merchant. Islands you branch out to are copies of one another. It's all fun enough, but as it is, is not going to have much in the way of staying power.\nIf you're anxty about where to put your meat (hurhur) don't fret! There is a power you can acquire that fills all  your empty inventory spaces with meat.\n\nCombat\nAwkward and stuttering at the best of times. Weapon and tool swapping is a pain in the ass. The dungeons are VERY simplistic, and will offer little challenge to those who have experience dungeon crawling.\n\nBuilding\nVery simplistic. You can snap to a grid, and there is a check box on my screen to turn that off but I can't figure out how to check i!. There is no build camera, and you cannot zoom in on your character, so placing items is sometimes difficult. I also found there was a vertical grid that sometimes forced benches and other construction under the ground. Still less frustrating than ARK.\nNo terrain manipulation.\nPlacing benches was also a bit hit and miss. Often I'd put something down, and it would fling sideways and roll down a hill. Benches when placed seem to drop a little before hitting the ground, so is it's a little too close to a wall or other item when placed, it will tip over. Luckily, it's easy to pick things up.\nFences can stop creatures, but will not stop the annoying noise machines from spawning inside the perimeter.\n\nDuel Language\nAccording to some of the notes within the game, there are elements of the game that has not yet been translates into English from Japanese. That's fine. The naming conventions of items so far seems pretty good, but there are certainly translations that are janky such as \"Island of Dungeon\". Having used Google Translate for many reasons, I know it does a pretty good job on simple phrases and individual words, so I have to put 'Island of Variety' and friends into the lack of imagination basket.\nYeah okay, I'm being picky, but as a writer and English teacher, this bugs me, and as a gamer, it's one negative to my experience.\nProgression\nIn Valheim there is a clear and present danger when you want to go for that new resource so you can advance your character. It necessitates the building of a base, some fortifications, and encourages you to prettify your abode with select items that have a direct impact on your gaming experience via buffs. \nCraftopia lacks this.\nI found myself just throwing down benches to make the resources requisite for the next advancement in age, as there is no real benefit to building structures. The next age unlocks more things, but also teases what else there is to unlock in the next, which just tempted me back to making what I needed to unlock that. It's relatively easy and swift to 'age-up', and the challenge so far is minimal.\nAgain, it's very shallow, but this may be as a result of my play-style.\n\nSound\nI wanted to mention this especially because this stood out to me. The music is light and unobtrusive, but the constant prattle of cows dropped upon you by the cow-god Anubis (go look for yourself!) and the crack induced hyper-panic of alarmed chickens drove me to turn my game sounds all the way down. Another boo-urns for immersion I'm afraid.\nThen there is the sound effect for when you kill a deer... which is a heavy, creaky door slowly opening. No clue what's going on there!\n\nConclusion\nIf you're hanging out for something to fill your time until Valheim gets more content, but you're expecting the same experience, you're going to be disappointed.\nIf you're looking for a light, time filler, and a no-stress, level-up orientated mine-craft-build, then it may tide you over until something more rigorous comes along.\nThe game lacks polish, as we've come to expect from early-access, but is playable and enjoyable on a very surface level.\n\nTL:DR\nSummative statement: An okay time waster but that's about it.\n\n- Playable and not too buggy.\n- Dropping benches too close to things can cause them to acrobat in random directions.\n- Shallow immersion level.\n- Pretty enough graphics but nothing new.\n- Combat is janky and unsatisfying.\n- Building is basic and often wonky. Snapping to grid is fine but cannot figure out how to turn this off.\n- Progression that doesn't really 'mean' anything. Mine-craft-advance age, rinse repeat.\n- Low level challenge, good for playing which listening or watching something else.\n- Annoying sound effects.\n- Some lack of imagination in naming conventions, perhaps attributable to language/translation issues.", "timestamp_created": 1616188763, "timestamp_updated": 1616200095, "voted_up": true, "votes_up": 58, "votes_funny": 2, "weighted_vote_score": "0.765417695045471191", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "122287950": {"recommendationid": "122287950", "author": {"steamid": "76561198215715351", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 6146, "playtime_last_two_weeks": 0, "playtime_at_review": 6146, "last_played": 1641289130}, "language": "english", "review": "Nice game! Can't craft a father figure though.", "timestamp_created": 1663267656, "timestamp_updated": 1663267656, "voted_up": true, "votes_up": 66, "votes_funny": 122, "weighted_vote_score": "0.763512015342712402", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "104144339": {"recommendationid": "104144339", "author": {"steamid": "76561197995286437", "num_games_owned": 0, "num_reviews": 37, "playtime_forever": 2093, "playtime_last_two_weeks": 0, "playtime_at_review": 512, "last_played": 1700023894}, "language": "english", "review": "Takes inspiration from Zelda, Pokemon, Minecraft. Instead of one huge open world, you have access to randomly generated small islands you can teleport to. Has you explore, fight, and collect you gain EXP and level up and receive points to allocate skill points into trees to build your character. They have a road map they plan on adding things. Their trailer shows stuff that they havent put in yet but plan to add into the game so dont let that fool you, it truly is a prototype showcase of what is planned (most likely showed for investors and early adopters). While I consider it cheap Id still wait for sales if you are weary of it. I purchased it during the beginning and must say they havent taken a step back yet and everything has been a welcome improvement to the game.", "timestamp_created": 1637949498, "timestamp_updated": 1637949498, "voted_up": true, "votes_up": 31, "votes_funny": 0, "weighted_vote_score": "0.762489855289459229", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "141636675": {"recommendationid": "141636675", "author": {"steamid": "76561198070505625", "num_games_owned": 149, "num_reviews": 2, "playtime_forever": 15918, "playtime_last_two_weeks": 0, "playtime_at_review": 11753, "last_played": 1703520174}, "language": "english", "review": "[h1]Seamless World Update[/h1]\n\nWith a heavy heart, I have to dish out harsh criticism for one of my favorite games.\n\n[b]---- Short version ----[/b]\n[b]Con:[/b]\n- Seamless World Update has changed the game feel a lot, and the new graphics style is not everyone’s cup of tea\n- Dungeons are tedious, monotonous and uncreative. The dungeon bosses and their drops are always the same\n- Quests take away the appeal of exploring and freedom from the game. The story is unnecessary and annoying\n- Map is very monotonous in the biomes and mobs. There is hardly any new content or surprises\n- Crafting has taken a back seat. The old system with different materials and bonuses was clearly superior\n- Game is full of bugs that spoil the fun. The version can hardly be called early access\n\n[b]Pro:[/b]\n- Saveable skill builds\n- Improved control of vehicles\n- Proper climbing is now possible\n- Map has some nice details and buildings\n\n[b]---- Full version ----[/b]\nThe Seamless World Update is more or less a completely new game and has not much to do with Craftopia anymore. The graphics style may be a matter of taste, but it does not suit my taste at all, it looks more like a Zelda rip-off to me.\n\n[b]Dungeons:[/b]\nThe dungeons, as far as I have seen so far, seem to be more or less the same, much longer and stricter in terms of the solutions. For example, by invisible barriers that prevent shortcuts. As a compensation for the length, there is an interface with “challenges” where you start directly in the boss chamber. This leaves no room for creativity. Also, the dungeon bosses seem to be fixed, we will come to the drops in general later.\n\n[b]Quests:[/b]\nTo be honest, I don’t know what a story has to do in Craftopia. The quests stifle any explorer instinct in the bud. Wasn’t it once a core of Craftopia to explore and discover secrets? Since the update, you are sent by NPCs to the necessary materials to level up with a map marker, to the next dungeon etc. You run more or less from map marker to map marker.\n\n[b]Map:[/b]\nThe map itself is very nicely designed, but unfortunately not very varied, neither in terms of biomes nor mob diversity. Very well done, on the other hand, are some lovingly designed buildings, villages and small fortresses. The map could have great potential if it were filled with more variety and a certain dose of randomness. Unfortunately, there is practically hardly any new content, the tried and tested is scattered over most of the map, so you are not really surprised for many hours and can’t discover anything new.\n\n[b]Drop & Crafting:[/b]\nCrafting feels like it plays only a minor role, which is somehow ironic for a game called Craftopia. If you like, you can of course build a base as usual and have fun there, but when it comes to equipment, you are relatively quickly at the end equip. Farming special materials in the different biomes to get the matching bonuses on the EQ falls completely by the wayside. Instead, you get scrolls in dungeons with random bonuses on them that you can use to enchant equipment accordingly. In my opinion, this is a complete misdecision, as the old system was an absolute unique selling point of Craftopia.\n\n[b]Bugs:[/b]\nWell, here I don’t even know where to start. The version is so buggy that you can hardly call it early access. Even the unstable alpha of the previous version was much more bug-free than this update. I can only speculate that there was possibly pressure to use the Steam Summer Sale with the update, but releasing a version in this state is more than questionable. \nTo name a few examples of bugs:\n-Sometimes mobs don’t die when their HP drops to 0 (if that happens with a dungeon boss, very annoying because you can’t get out of the dungeon normally without killing the boss)\n-Pets somehow get lost (run around aimlessly, glitch through the floor sometimes)\n-In multiplayer bosses consistently ignore all players except the host\n-Sometimes dismantling becomes impossible while building\n-The head glitches through all helmets so far (you can hide the helmet but that’s unfortunately also buggy)\n\nBut not all changes are worse, so what has improved:\n\n[b]Skill system:[/b]\nThere are now more skill points and free skill reset, and the best improvement in my opinion is the ability to save/load skill builds. The slots for saving have to be bought, and each change of the build costs something, but that is a good balance since you can now reset for free. The skills themselves have also been visually revised in part, which I think is quite well done in contrast to the general graphics style. The only point of criticism here is the magical shield, which is unfortunately much too over-present (brightly glowing) and just annoying at night.\n\n[b]Controls:[/b]\nEspecially the control of vehicles has been improved significantly, the hoverboard for example can now be driven really well. You can also climb normally now.\n\n[b]Conclusion:[/b]\nI still see great potential in Craftopia despite all the difficulties. The developers have already shown once that they are capable of developing a great game concept. I hope that they will reintegrate many old features in upcoming updates. After all, they react quickly to the numerous bugs and deliver almost daily current updates with fixes. I haven’t given up on Craftopia yet and hope that the team will respond to the feedback from the community.\n\nCurrently I can’t recommend anyone the state of the game and hope that we will keep the legacy version before the Seamless World update for a long time, even though I am aware that this Craftopia is unfortunately dead. But maybe something better can come out of the new Craftopia with a little more time, as long as the criticism from the community is taken seriously.\n\n[b] ---- Kurzfassung ---- [/b]\n[b] Con:[/b]\n- Seamless World Update hat das Spielgefühl stark verändert, und der neue Grafikstil ist nicht jedermanns Sache\n- Dungeons sind langatmig, monoton und wenig kreativ. Die Dungeonbosse und ihre Drops sind immer die gleichen\n- Quests nehmen dem Spiel den Reiz des Entdeckens und der Freiheit. Die Story ist überflüssig und störend\n- Map ist in den Biomen und den Mobs sehr eintönig. Es gibt kaum neuen Content oder Überraschungen\n- Crafting ist in den Hintergrund gerückt. Das alte System mit verschiedenen Materialien und Boni war deutlich überlegen\n- Spiel ist voller Bugs, die den Spielspaß trüben. Die Version ist kaum als Early Access zu bezeichnen\n\n[b] Pro:[/b]\n- Speicherbare Skillbuilds\n- Verbesserte Steuerung von Fahrzeugen\n- Richtiges Klettern ist jetzt möglich\n- Map hat einige schöne Details und Bauwerke", "timestamp_created": 1688857139, "timestamp_updated": 1688895378, "voted_up": false, "votes_up": 52, "votes_funny": 0, "weighted_vote_score": "0.760901093482971191", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "156169581": {"recommendationid": "156169581", "author": {"steamid": "76561198072389633", "num_games_owned": 0, "num_reviews": 21, "playtime_forever": 31, "playtime_last_two_weeks": 0, "playtime_at_review": 31, "last_played": 1613874618}, "language": "english", "review": "Not much time in this game, maybe an additional 2 hours on Xbox. Although, I do like it regardless of the jank.\n\nMy biggest problem is the developer. Three games in early access since 2020? With a new one coming out in q1 2024? How large is this studio to be managing 4 EA games?", "timestamp_created": 1705500432, "timestamp_updated": 1705500432, "voted_up": true, "votes_up": 235, "votes_funny": 18, "weighted_vote_score": "0.758915483951568604", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "153538069": {"recommendationid": "153538069", "author": {"steamid": "76561198053515250", "num_games_owned": 0, "num_reviews": 148, "playtime_forever": 131, "playtime_last_two_weeks": 0, "playtime_at_review": 131, "last_played": 1701574864}, "language": "english", "review": "Cool game and I hate to down vote it, but the optimization is terrible. If they ever optimize it I would recommend.", "timestamp_created": 1702508370, "timestamp_updated": 1702508370, "voted_up": false, "votes_up": 76, "votes_funny": 7, "weighted_vote_score": "0.758597731590270996", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "75589619": {"recommendationid": "75589619", "author": {"steamid": "76561198199883786", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 938, "playtime_last_two_weeks": 0, "playtime_at_review": 619, "last_played": 1599743405}, "language": "english", "review": "This game caught me off guard I wasn't expecting that much but turned out to be a really fun game. I see a huge potential to where this game can go in the future, with lots of items and places to be discovered, boss fights and dungeon trials, magic and transportation, and also automated production systems. Not to mention they have pretty character designs. \n\nThere some bugs I would like to mention but don't let that stop you from trying out the game since it's really new and obviously there will be some bug errors. So there are a few bugs that I see during my time playing the game, I'm not sure if it violates the guidelines but I hope it doesn't but here:\n\n-Health and level bar of npc and enemies disappears after some time playing or traveling in game.\n\n-A treasure chest inside a cave where you have to destroy the stone first looks invisible at certain times and also no clipping.\n\n-The Gods in the sky sometimes move like they're stuck running in one area \n\n-The flying orc wizard sometimes get invulnerable with a bow when they're flying stuck to the wall.\n\n-Some item drops that are big in size sometimes can't be picked up when they're drop in a stone or somewhere.\n\n-A grown plantation sometimes disappear and can't be harvested after you travel through the portal, so you have to disassemble it instead.\n\n-Everything can be build mid air from walls to production stuffs.\n\n-Some enemies are still in Japanese katakana even though my language is in English.\n\n-There's an option to remove fps cap but it's still capped in 60fps, It's not vsync since I'm using a monitor above 60hz so it shouldn't be capped at 60fps.\n\n-You can climb on literally anything even bosses.\n\n\nThis one might not be a bug but I really can't figure out where I can upgrade my weapons or other stuffs.\nThe vehicles are also really hard to control but that might just be me being terrible.\n\nI might not be 100% accurate with my statements so please try not to hate. These are the only bugs I was facing during my time playing, and I do feel the health/level bar and the mid air builds the one affecting my gameplay the most. I would also find it helpful to have a health bar and HUD that can be toggled. There is also no advanced video settings to adjust graphics such as depth of field---it happens when you aim with a bow. Overall it is a really good game, I see the future with many features and stories the game can gives that even playing single player wouldn't be boring, and I do feel multiplayer will be really fun as well with the dungeon raids and boss raids. 10/10 would recommend.", "timestamp_created": 1599474968, "timestamp_updated": 1599474968, "voted_up": true, "votes_up": 28, "votes_funny": 1, "weighted_vote_score": "0.753408670425415039", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "76109340": {"recommendationid": "76109340", "author": {"steamid": "76561197968624797", "num_games_owned": 3503, "num_reviews": 41, "playtime_forever": 2172, "playtime_last_two_weeks": 0, "playtime_at_review": 1449, "last_played": 1691790605}, "language": "english", "review": "Craftopia is like a teenage relationship. It's fun, it's exciting, you get an overwhelming feeling of anxiety when apart. Yet, it's also immature and prone to missteps ultimately leading to frustration.\n\nAs of the time of this review what you're getting with Craftopia is jack of all trades master of none experience. You've got exploration (albeit on limited sized islands). You've got dungeons and rpg elements (albeit simple dungeons and imbalanced skills). You've got base building (albeit with limited options and janky placement). You've got automation (albeit still needing a lot of hand holding and hit or miss success).\n\nI think you get the idea and this runs through nearly all elements of the game, an initial WOW factor and then just under the surface the deficiencies become apparent.So why the positive review? Well of course this is Early Access and you do have a solid foundation here to build a game upon. While the entry price is high for an Early Access title in this state I, personally, weighed up the risk of the game never achieving its goals (and that is entirely possible given the small dev team) with the fact that the only way it can have the possibility to achieve the goals is to be adequately funded.\n\nAs such, while I recommend this, I do so warning all potential buyers that you must accept you're taking a big gamble. You'll get some fun out of the game as it stands right now but it's not complete and frankly may never be the game it deserves to be. The choice is yours and in this case you really are making that risky choice to participate in the Early Access development.\n\nIt's also probably worth noting that FPS in the game's current state is pretty poor even with a 1080TI in my system I've seen it drop to 15fps at times and rarely get above 40fps. This is made worse once you start building and laying down automation. Those with medium and low spec systems may want to wait until there is a performance pass on the roadmap or take advantage of the refund system to test it out on your system.", "timestamp_created": 1600330109, "timestamp_updated": 1600414829, "voted_up": true, "votes_up": 29, "votes_funny": 5, "weighted_vote_score": "0.752896010875701904", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "119020778": {"recommendationid": "119020778", "author": {"steamid": "76561198113187001", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 446, "playtime_last_two_weeks": 0, "playtime_at_review": 347, "last_played": 1658170425}, "language": "english", "review": "The concept for Craftopia is awesome with a ton of possibilities, however the execution is broken and simply unfinished. Now you may argue that this is the point of early access games, but this has been out for a while and development energy is already being redirected to a new game (Palworld) that looks just as promising at a first glance. Honestly looks to me as if they're milking hype and are simply putting out early access games for popular tags that promise a lot with the studio never intending on delivering it. Guess I'm going back to Portia/Sandrock.", "timestamp_created": 1658165427, "timestamp_updated": 1658165427, "voted_up": false, "votes_up": 43, "votes_funny": 0, "weighted_vote_score": "0.75251317024230957", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "79106104": {"recommendationid": "79106104", "author": {"steamid": "76561197970001769", "num_games_owned": 0, "num_reviews": 55, "playtime_forever": 396, "playtime_last_two_weeks": 0, "playtime_at_review": 396, "last_played": 1605109116}, "language": "english", "review": "mile wide. inch deep, fairly buggy.  needs to cook a bit longer.", "timestamp_created": 1605109218, "timestamp_updated": 1605109218, "voted_up": false, "votes_up": 120, "votes_funny": 16, "weighted_vote_score": "0.7508697509765625", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "124846994": {"recommendationid": "124846994", "author": {"steamid": "76561197993100850", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 457, "playtime_last_two_weeks": 0, "playtime_at_review": 436, "last_played": 1667680428}, "language": "english", "review": "This game has a lot of potential, but at the end of the day, tries to do far more than it should. There are surface level systems of every kind, and they all sort of work, but it's largely opaque, and is extreme overkill to the point of ruining the experience. While there are a lot of the following, none of them feels like it has any depth: The dungeons are boring, the NPCs are soulless, the enemies are stupid, the weapons are clunky, the enchantments are not fun, and the skills are hard to use. \n\nThe UI is horrendous. for a game that has 10 million things to craft, navigating the different crafting menus is a chore. Storage is also awful to use. Automation is clunky. \n\nThis game could benefit from focus, the people who made it are obviously talented, but it feels like the creative director had the ambition and idealism of a 13 years old.", "timestamp_created": 1667420621, "timestamp_updated": 1667420621, "voted_up": false, "votes_up": 48, "votes_funny": 1, "weighted_vote_score": "0.747532665729522705", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "99035007": {"recommendationid": "99035007", "author": {"steamid": "76561198208618507", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1052, "playtime_last_two_weeks": 0, "playtime_at_review": 1052, "last_played": 1631159899}, "language": "english", "review": "This is  a pretty good game so far. I played it about 6 months ago and the texture packs were a bit jankie and looked out of place. However, I tried it again recently and can say that the updates really make the game better.\n\nThat being said I truly think that the Devs need to take a look at item stacking in chests. It seems a bit silly to have an item (example talons) and have multiple different types. in  your inventory you can stack 4 different kinds in one stack in chests they need to be stacked individually per type. I would like to see some better organisation options for chests because having one chest completely filled with stacks of 1x talons of different types is a bit excessive. Is it possible for certain items (ore, wood, animal leather etc) really need to have many different types? \n\nOnly other thing I have noticed is the geometry on certain building materials (ex Roofs) could use more than a corner and a slants if you want to make buildings that aren't just a square. \n\nThank you for coming to my Tedx", "timestamp_created": 1631166556, "timestamp_updated": 1631166556, "voted_up": true, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.747211813926696777", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114717009": {"recommendationid": "114717009", "author": {"steamid": "76561198009828363", "num_games_owned": 0, "num_reviews": 41, "playtime_forever": 1064, "playtime_last_two_weeks": 0, "playtime_at_review": 312, "last_played": 1651495888}, "language": "english", "review": "craftopia is so awesome, but i am really scared...\n\nthe game didnt receive a single update for about 3 1/2 months. the devs say they are working on two new updates at once, but then i noticed they had announced a totally NEW GAME (palworld) for 2022 with similar mechanics and graphics. how can a studio with just a few people put their love in two projects simultaneously and concentrate on both? if i imagine the devs from grim dawn would have done that, impossible. i thought this is a project from the developers heart.\n\nthat really scares me and makes me a bit angry. i started playing this on xbox game pass and then bought it on steam outside of sale, even host a paid server now. this game is just awesome. rpg elements, crafting, in such a way no other game like ark or whatever can compare and compete. please dont drop this to milk money from a new game.. please let this become a great evolving game. why do you develop a similar game at the same time instead of making this one perfect.... to jump on the pokemon train, hoping to become a viral hit and generate more income? :( i can imagine the core of the new game is somehow copy pasted code of craftopia anyway as it looks like. fact is, money that was made from craftopia has been transfered into the development of palworld.\n\nregarding the first published game (overdungeon) of the developer, the people on steam also say in the rating and comment section that the game was not really finished. so.... please, dont repeat that behavior! till then, thumbs up. lets see ;)", "timestamp_created": 1651321039, "timestamp_updated": 1651322358, "voted_up": true, "votes_up": 44, "votes_funny": 1, "weighted_vote_score": "0.746733784675598145", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "86453777": {"recommendationid": "86453777", "author": {"steamid": "76561198061748548", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 3087, "playtime_last_two_weeks": 0, "playtime_at_review": 1120, "last_played": 1614402331}, "language": "english", "review": "Simply Put.....This game is amazing and here is why\n\nRuns absolutely great, no falling through map etc, or ANY gamebreaking bugs in 18 hours\nGraphics are great and again, great performance\nTONS of things to do. Crafting, Dungeons, Taming, Building, Leveling, Exploring new islands, Fishing, Farming, etc etc etc\nVery fun long-term progression system aka Missions, Achievements, Picture book, ERA Progression etc\nEverything you do has MEANING and is FUN\nIN DEPTH skill system that has something for everyone over 100+ skills as of writing this\nTONS of ores, crafting mats, enchantments, affixs for EVERYTHING, you can make god tier armor, weapons, tools, etc\nAs stated above its very FUN and ADDICTING, wanting to get to that next skill point or the next tier of tools or armor ex: copper, iron, silver, gold, titanium etc etc (over 12 ORE types already!!!) keeps you going for hours.\nI have barely scratched the surface and i am addicted\n\n\nIf you love, Terraria, Minecraft, Zelda, Pokemon, RPG's, Farmville, building/crafting, gaming with friends, gaming solo. This is the game for you. I paid $25 for this yesterday and it went on sale today for $20...and you know what? I'm not even mad, they totally deserve the full $25. I was gonna get this or Valheim and i am so glad i got this. Showed 2 friends and they got it as well and all 3 of us havent looked back since. \n\nHands down one of the best mmo rpg games i have played in a very long time, cant wait to see what they do with this. This game is gonna be HUGE!!\n\nVery simple, yet very masterful at the same time. But the most important part is its just plain fun.\n\nThanks for reading.", "timestamp_created": 1613120690, "timestamp_updated": 1613164103, "voted_up": true, "votes_up": 39, "votes_funny": 1, "weighted_vote_score": "0.746224462985992432", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}}, "query_summary": {"num_reviews": 100, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 6341, "total_negative": 1427, "total_reviews": 7768}, "cursors": {"AoIIPz8IiXHh5ckC": "Mon Apr 22 23:40:52 2024"}}
