{"reviews": {"162783583": {"recommendationid": "162783583", "author": {"steamid": "76561198059806542", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 104, "playtime_last_two_weeks": 104, "playtime_at_review": 104, "last_played": 1713004782}, "language": "english", "review": "Game is ok but lacks players, definitely deserves some more attention from players. Bought on sale, wouldn't buy it for the regularly listed price.", "timestamp_created": 1713004893, "timestamp_updated": 1713004893, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.53125", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "162662321": {"recommendationid": "162662321", "author": {"steamid": "76561199655291448", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 7145, "playtime_last_two_weeks": 5567, "playtime_at_review": 2352, "last_played": 1713798124}, "language": "english", "review": "super grindy! if your looking for something grindy with a friendly community this might be for you! tame a pet or buy one on the auction house and fight along side your companion! heal your guildmates through boss fights and fight the mess of things on plague island to get huge xp gains. Createyour base to suit your skill needs. ive put in over 1000 hours and stil lovin it", "timestamp_created": 1712842915, "timestamp_updated": 1712842915, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523114383220672607", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "162068189": {"recommendationid": "162068189", "author": {"steamid": "76561199214515315", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 63111, "playtime_last_two_weeks": 859, "playtime_at_review": 61162, "last_played": 1713738096}, "language": "english", "review": "The crafting in this game is awesome.  Definitely worth the money.  I have met players that have been playing for a few years and still haven't mastered every skill.  Great game.", "timestamp_created": 1712097110, "timestamp_updated": 1712097110, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523114383220672607", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161892006": {"recommendationid": "161892006", "author": {"steamid": "76561199575105127", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 4665, "playtime_last_two_weeks": 0, "playtime_at_review": 4646, "last_played": 1712170918}, "language": "english", "review": "Its a good game for those who like to level up and build their own little towns. Its not a very popular game but worth it.", "timestamp_created": 1711901501, "timestamp_updated": 1711901501, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523114383220672607", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "88142148": {"recommendationid": "88142148", "author": {"steamid": "76561198017433434", "num_games_owned": 498, "num_reviews": 13, "playtime_forever": 91599, "playtime_last_two_weeks": 0, "playtime_at_review": 51581, "last_played": 1693258389}, "language": "english", "review": "DO NOT BUY. This game has protected and promoted real money traders/bots at an alarming rate. They ban anyone who exposes it or speaks out about it. The top guilds admit it. Players outright tell you that you're too poor in real life to catch them in game. Progress is made by spending money. The developers will allow it. But do not allow you to expose it. My review was removed by Juvty's staff/mod team earlier. Now I leave you with this review. PM Me for screenshots of it all. Beginning to end. We have more than enough evidence that this game is a virtual scam. I will be banned or removed from Discord (Again). but who cares. DO NOT BUY THIS SCAM.\n\nTHIS COMPANY IS A SCAM YOU WILL NOT BE REFUNDED BY THE TIME YOU SEE THROUGH IT. The tutorial is over 2 hours for a new player.\n\nEDIT: As expected. Myself and others were banned from Discord again for exposing the actions of a certain Discord mod named \"Kirtis\". He has been known to delete player support posts inquiring about \"Global chat harassment\" and other forms of abuse in game. Resulting in deletion of posts and banning of multiple early access supporters/backers. He is an active player, profiting in game from the behaviors explained above.  I have been told he is responsible for removing all of my negative discussions as well on Steam Via Mod Wholf. So I will continue to write more and more. \n\nUntil Real Money Trading, Terrible Discord Moderation (Especially Kirtis), In game global chat harassment from players such as \"Noslive\" on NAE, and exploitative behaviors by a certain group of players are handled in game. You have absolutely ZERO reason to play this game.\n\nWe also have a screen shot of Mod Kirtis saying \"Do not forget to give me your gear when you quit\" When being confronted about his toxic behavior. Just stay away. I only play it anymore to literally warn others. I want this game to succeed. I really do. But at this point. You are helping a very scummy group of people by spending ANY money here.\n\nEither Juvtys Developers are actually scamming everyone. Or a few bad apples are ruining this community from top to bottom.\n\n\n\nEdit 2: I am now banned permanently on the Discord and Steam discussions forum by mod Kirtis. Confirming that Juvtys Staff is still trying to silence me. This review will be updated with each patch. Outlining the developers negative behavior and lack of moderation. Daily, I am still harassed in game on a very personal level. It's allowed. The developers are ensuring this by not creating a Terms of Service. Anything you want to say, no matter how hateful. They allow it. They can not ban anyone and have mentioned they are nervous to do so, out of fear for legal repercussions, as no Terms of Service exists. Therefore the game is pure anarchy.\n\nThe developers have now announced a functioning report system and bans were said to have been issued. But upon logging in. The same dudes who run the RMT market in game are all still here. No change. Still selling items only one group of players has access to via Player Auctions.. Some items are obvious and only 1-2 people on the server have them. But they are \"for sale with 20 min response time\" It would seem RMT is the way the devs want to go with this game. I'm still banned from Discord for mentioning it months ago. I have screenshots of mods admitting RMT is an issue. But mods are not devs. The devs haven't taken any long term actions against the actual characters with levels to harvest the items they sell. Basically banning alts and saying they are fixing it. Where the real offenders are playing on there main accounts all day long farming the items they sell via alts. At one point I got a gold seller named \"Art\" to even try and sell gold to a mod. So far that is the only known ban to have come out of this with any positive impact/setback to RMT. And only because a mod reported it, not a player. Any player who mentions it is banned from the Public Discord.\n\nI'm not changing my review to positive in any way until we see actual proof and progress that the developers care to stop/intervene and unban the wrongfully banned.\n\n5/7/21 - Devs have now allowed a man to openly harass me and try to sell my personal home address in game for in game gold. I took screenshots and have him admitting it in Discord to a moderator. This kid didn't get even a silence. This is apparently allowed. And instead of banning these toxic players. The potential to be swatted because someone doesn't like you is just allowed. This is malicious behavior outside the game. ALLOWED. \n\nWe have a EULA and a fake report system. The dev team is too small for them to care about literally anything. So don't come here for fun. Games dying. It's Real money traders vs like 1 guild. Abandon this game. \n\nTold yall it would end up dead because of the devs. They got your initial cash and they are dippin. What a great scam this was. Now that the player base is dead. The devs have all but abandoned the game and slowed updates. This is the same story of a cash grab remake using old code to pass as a new game. Fraud from beginning to end.\n\nWARNING TO WHALES: You can spend hundreds of dollars on cosmetic packs and in game items. That is what this game is entirely based on. \"pack sales\". I strongly advise you read the reviews and understand your money is wasted here on virtual goods with no meaning. The packs are nonsensical at inflated prices. You will get a mount or some house items for hundreds of dollars. You can spend 60$ on an entire game somewhere else. Or buy a mount here for 200+.  You will only be standing out among the 10-15 people who play daily. Just know that buying these packs is what the main focus of the game is for the devs. The updates are small/useless and few. Just know that YOU are the true victim of this game. This product is entirely based on the hopes to sucker in a few people with too much money. That is why the RMT is/was so rampant as well. This is nothing more than a cash grab in all regards, with little interest in the actual game development.", "timestamp_created": 1615309924, "timestamp_updated": 1693253890, "voted_up": false, "votes_up": 584, "votes_funny": 7, "weighted_vote_score": "0.944991588592529297", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "86447752": {"recommendationid": "86447752", "author": {"steamid": "76561198003139563", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 3530, "playtime_last_two_weeks": 0, "playtime_at_review": 3530, "last_played": 1613111625}, "language": "english", "review": "Found out about 58 hours in that you can spend 130$ to get a bag that makes it so you don't drop items stored in the bag on death. Ruined the whole game for me.", "timestamp_created": 1613113186, "timestamp_updated": 1613113186, "voted_up": false, "votes_up": 375, "votes_funny": 12, "weighted_vote_score": "0.926011085510253906", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "88209849": {"recommendationid": "88209849", "author": {"steamid": "76561198325027142", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 6077, "playtime_last_two_weeks": 0, "playtime_at_review": 6077, "last_played": 1615314075}, "language": "english", "review": "I just found out that they have huge P2W. \n+90% Speed Mount bought for $$\nBag which doesn't drop items on death bought for $$\nImagine this for a Survival PvP game...\n\nDo not buy this, i regret my kickstarter pack now.", "timestamp_created": 1615409217, "timestamp_updated": 1615409217, "voted_up": false, "votes_up": 180, "votes_funny": 2, "weighted_vote_score": "0.906489551067352295", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "87101001": {"recommendationid": "87101001", "author": {"steamid": "76561198011578904", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 17732, "playtime_last_two_weeks": 0, "playtime_at_review": 17272, "last_played": 1697667531}, "language": "english", "review": "I don't normally post reviews, in fact this is the first.  I've played MMOs since UO, EQ, WOW, Shadowbane, LoA, etc etc etc and I really wanted to love this game.  There are some very good things, but mostly poor things currently in this game.  \n\nThe Devs did a GREAT job addressing the lag issue in this game very early on.  I still \"rubber band\" from time to time, but nothing like before where the game was basically unplayable. \n\nCrafting:  The map size is too small for the massive grind you are required to play with, if you want to gather/craft at all.  What do I mean?  In UO for example, I may have been required to farm  1,000,000 ingots to gain a level.  That's a grind right?  Sure no problem.  Because in UO there are hundreds of caves in different zones, and almost \"endless\" mountains I could get ore from.  In WT2, there might be 4 iron nodes in the gorge, and if you're lucky another 5 or so in the Cave after you spend an hour clearing it.   So you spend about 1.5 hours to get at best 9-10 iron nodes.  Which then turn into a few ingots.  The problem is, when you need tens of thousands, spending a few hours for 20 ingots isn't going to work.   The crafting system is designed so each level you are required to earn more exp, 100k one level, 113k another level, etc.  (Numbers are estimates are level 48 ish skill).  That isn't the real problem, as I said the real problem is the fact that the item/thing what have you to EARN the skill is VERY LIMITED.  So when you require 113,000 exp points, but you only earn 05 exp from making one item that took you 4 hours to grind the mats to make that one item, you get the idea. \n\n*IF YOU ARE A SOLO PLAYER YOU WILL NOT BE ABLE TO PROGRESS IN CRAFTING.* (Or if you try it, it would literally take you years, yes YEARS)  Again, not because the crafting is hard, but because of the LACK of resources in the world to gather to then craft.  \n\n\nThis doesn't just apply to blacksmith work either.  It's basically the same for every crafting skill.  As a tamer you need to tame wolves, hundreds of them.  Well when the world has a total of about 35 wolves, shared between you, other tamers, people leveling weapon skill, and people farming for leather, you get the idea.  \n\nThe grind itself isn't the problem; it really comes down to the lack of available resources to even try to work the grind.  \n\nDesync - Ever press an instant cast spell and have to wait 3-5 seconds before it is applied to a target?  No? Me either until I played WT2.  I have gig fiber and run pretty smooth 40-60 MS ping.  The game is so based on a stun, that it's basically who gets stunned first? Okay then die.  There is no real way of healing, so everyone is stuck with 100 HP.  But the desync issue is, a player can be right in front of me, I press an instant cast stun, but because it takes 3-5 seconds for that stun to show up in game, the player I was attempting to stun is now 7 paces away from me.  So now you're stuck trying to press a stun 5-7 paces in FRONT of a player with your shield in hopes that that player will continue to run in the same direction to then have your stun applied.  Understand? Yeah... complete B/S.\n\nPVP- I don't care about loot dropping in PVP.  It's a PVP sandbox, people should learn that before you buy it.  BUT what I do care about in PVP is balance.  When 90% of PKers have throwing stun --- > Fire arrow --> poison arrow, and the other 10% of  PKers is Throwing Stun -- > backstab.  It gets old.   There is no balance. There is no melee-based PKer in the entire NA server.  Not without Throwing Stun.  Why?  Because there is no stun break (see above) and no gap closer (lack of WOW warrior Charge).  So if you are an axe/sword/dagger/mace user, you can be kited -- slowed and stunned, all fight until you die and there is nothing whatsoever you can do about it.  Balanced?  \nPKs aren't flagged, they don't show up RED, or anything like that.  The player's guild name don't show up above there head either until you mouse over their names, which if they are a PK by the time you do all that, you're already stunned and basically dead.  And because the zones are so small, the PK can loot your body, run 8 spaces north, south, east, or west, and be back into a PVE zone, free from risk of dropping loot.  \n\nLastly RNG:  Everything in this game is RNG.  There is no player skill, there is no difficult boss fight, there is no WOW hardmode type of thing.  There are no interrupts, effective stuns (see Desync/PVP Stun), etc.  It's purely RNG.  What do I mean?  The Cave has level 50 bosses, 3 of them.  And all you do is one person stands in front being a dodge tank, hoping the RNG is in their favor.  While at the same time the other group members stand behind and hold R-Click (attack).  That's it.  No seriously, that's it.  You might fight this boss 100 times, 30 you never get touched once, 30 you die from getting hit twice in a row, 40 you get hit, and dodge the rest.  It's 100% completely random.  There is no such thing as a \"good tank\" like in WOW for example.  Its just purely RNG.  \n\nI mean there is so much more but I'm done typing.  If you want to play, check it out, the devs are talking about good things for the summer of 21, such as an auction house, and stuff like that.  But for me, until they fix the desync issues, the pvp balance, and the pure RNG of the game, I wouldn't play this game. \n\nMaybe in the future if they address the above issues and others, maybe.  Again I really wanted to love this game as it reminded me of UO, LoA, and others.", "timestamp_created": 1613833988, "timestamp_updated": 1613857755, "voted_up": false, "votes_up": 134, "votes_funny": 0, "weighted_vote_score": "0.893052041530609131", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "85544401": {"recommendationid": "85544401", "author": {"steamid": "76561198006233460", "num_games_owned": 580, "num_reviews": 14, "playtime_forever": 864, "playtime_last_two_weeks": 0, "playtime_at_review": 775, "last_played": 1611965208}, "language": "english", "review": "Even tough the game is enjoyable it's currently worth half its cost at best.\n\nThe PvE content is hidden behind open PvP areas.\nThe open PvP can be fun (when not laggy during server peak time) but backers started a day earlier and already are well geared. The map is very small so there is no avoiding other players.\n\nAlso backers have fast speed mounts (the game images advertise dragon mounts but it's behind a paywall) allowing them to easily gank players and cross the high level areas without threat from the mobs, common plebs can also get mounts but they'll first have to tame the beasts and grind for the beasts to reach level 20 (goat is an easy mount to get with low taming skills but it's only a goat).\n\nAt the current version the game doesn't offer much, there is a few dungeons (basically mob bashing) and few bosses doable in a few days, once you do these to get endgame gear all that is left is a glitchy PvP.\nIn the end if you want to try out the game I recommend choosing a fresh server if possible (Europe 2 might be the youngest at the moment).", "timestamp_created": 1611904658, "timestamp_updated": 1611904658, "voted_up": false, "votes_up": 137, "votes_funny": 5, "weighted_vote_score": "0.869903624057769775", "comment_count": 17, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "87699554": {"recommendationid": "87699554", "author": {"steamid": "76561198935920113", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 15608, "playtime_last_two_weeks": 0, "playtime_at_review": 14912, "last_played": 1668827605}, "language": "english", "review": "ive put a lot of time into this game since release, i paid 35$. The game is basic but has depth because of its community. My guild GRAVE STREET had a ton of fun messing with people. The grind is unreal, the amount of time you spend gathering and crafting and trading takes a really long time to achieve. There are a some supporters packs you can buy from their website which im not mad at. The day i saw a man standing on a street corner selling 1 gold for 6 dollars paypal is when i started wondering whats happening here. \nwhen our group confronted the devs they called us liars, the mods banned us from the discord for posting pictures of the person. The person is still out there preying on people and theyll do nothing about it. so today was my last day playing this game.    GOLDGATE", "timestamp_created": 1614646229, "timestamp_updated": 1614647128, "voted_up": false, "votes_up": 92, "votes_funny": 3, "weighted_vote_score": "0.858453094959259033", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "97866054": {"recommendationid": "97866054", "author": {"steamid": "76561198060099301", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 183327, "playtime_last_two_weeks": 0, "playtime_at_review": 183327, "last_played": 1630066191}, "language": "english", "review": "TL;DR;: if you want a week or two of fun and there's a nice discount, maybe go for it; if you want a MMORPG, wishlist it and wait till the game (hopefully) stops losing all players.\n\n3000 hours in and, though most of them were afk, I certainly played a lot, since the Alpha (before EA). And I also had some nice time of fun, but...\n\nI have lost confidence that the devs will make it a good game, one that, as an MMORPG, is expected to offer fun for many months. You probably can still have some fun for a week or 2 though, as the early game feels very nice. Ok, some examples:\n\n- Crafting was a very nice feature in the game. Though many hours of grinding were required, it felt very nice when you finally could hit that level and upgrade your gear. Now, unless you are the top crafter across all servers, you don't get rewarded for upgrading your crafting skills, because no one will buy your low-quality gear as everyone (including you) can just buy it, with much less grinding, in the cross-server Auction House.\n\n- Fishing is notably (including by the devs) one of the worst features in the game and people have been botting a lot at that. What did the devs do? They made fishing mandatory for obtaining some of the end-game items. Quite hard to understand that decision.\n\n- Heavy armor has been much superior to light armor, specially in late-game; it is so imbalanced, most people use heavy armor all the time, even for DPS roles. What do the devs do? They make light armor even worse by virtually taking away your main protection when you are mounted: your dodge chance is now divided by 4. While for heavy armor, you don't lose quite as much protection.\n\nI am not to say they haven't made some good decisions as well, but these examples show they are not minding the consequences of their design decisions, making the overall game experience degrade over time. Sometimes it looks as though they are just throwing random stuff around.\n\nSo now they go ahead with more and more imbalanced gameplay, a faulty economy, close-to-irrelevant crafting and a 30% monthly reduction on an already small player base with the illusion that more content will make the game better. Some people think more content will be a game-changer, I don't. Maybe you'd better wait and see, but don't expect those basic problems to be corrected anytime soon, as devs seem oblivious to them, even when presented with strong evidence on some bad choices.\n\nI don't think the game is beyond salvation, as it has some really interesting premises, but I don't see it getting good anytime in the next one or two years, unless the devs start thinking hard about their decisions and their consequences. And I wish they do, this game could become awesome.", "timestamp_created": 1629386707, "timestamp_updated": 1629386707, "voted_up": false, "votes_up": 109, "votes_funny": 8, "weighted_vote_score": "0.85793912410736084", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "86267687": {"recommendationid": "86267687", "author": {"steamid": "76561198023490291", "num_games_owned": 0, "num_reviews": 64, "playtime_forever": 13457, "playtime_last_two_weeks": 0, "playtime_at_review": 12046, "last_played": 1629417327}, "language": "english", "review": "I believe its fair to say after this amount of hours i could give a genuine review for this game..\n\nLet me start by saying by all means this game is far from being a perfect game but ..  a lot of people seems to expect most games which is titled \"Early Access\" to be some what of a complete and smooth game..  most of the negative reviews are either people getting banned for duping ( Which has been fixed) or they were experiencing server lag issues/rubber banding which additional servers been added. \n\nHowever from what I've experience I have really enjoyed and will continue to do so due to the reason this game reminds me a lot of all old good old classic games like Ultimate Online and other games alike from Runescape to Albion Online.\n\nThere is a very indepth crafting system, yes some may even say it's grindy and it's too RNG but if you've played similar games - that's why drives you to try to craft that perfect item/weapon. The game currently offers a vast range of crafting and gathering - so if you like to go out into the wilderness and get lost while foraging or even just mining this is the game for you... \n\nI do like the rng/chance side of the game, yes it does feel like shit when you don't get the perfect roll on your first craft... but man it's freaking pog when you do or when you first try on an item you've been saving your mats for.. and that's what I play this game for.\n\nThe combat system does need some work and love but again it's early access .. The combat seems a bit sluggish or slow/un-responsive  though in due time i'm sure that'll will get looked into - With almost daily (every 1-2 days) patches and update and a great community on discord I'm sure this game will work towards to be something amazing.\n\nIf you're unsure then there is a Road map stating what they've planned for this game - however the price tag is a bit hefty for some especially for a game that is Early Access..\n\nOh right forgot the Big Elephant in the room - is this game pay to win? Of course it is - when you have pre support packs and current Packs which gives you an advantage over others like - faster mounts - no loot drop bag (items can't be dropped in these slots) then yes i'm sorry but that's my definition of pay to win -But that doesn't stop me from enjoying this game everything they've offered in the game to have over other players I've yet to have it bother me in any of my experience with the game...\n\nHaving said all that I would still recommend this game to those who are a fan of the old style Ultimate Online and other games a like. I will try to come back to this review at a later date in time.\n\nThank you for reading.", "timestamp_created": 1612874690, "timestamp_updated": 1614466959, "voted_up": true, "votes_up": 79, "votes_funny": 5, "weighted_vote_score": "0.824126243591308594", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "86543776": {"recommendationid": "86543776", "author": {"steamid": "76561198000550416", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1044, "playtime_last_two_weeks": 0, "playtime_at_review": 1044, "last_played": 1613036295}, "language": "english", "review": "Game was decent at first, got cucked early on because a friend and I started at the same time and since he chose lord I figured I'd choose peon and just focus on gathering... until I found out that there was absolutely no advantage to being a peon AT ALL, and I was just wasting time because re-rolling lord would have benefited us more. While preparing a few things before going and rerolling I happened to see the packs on the website at work, realized there is some insanely P2W garbage in the cash shop... and it wasn't JUST p2w, it was also FULL CRINGE. One pack for 300,000$ (real money) gives you a private island, angels carry you everywhere, ect ect... and I'm not even exaggerating... needless to say the pack that gives you literally a bag that people can't loot on death in a sandbox pvp game has by far the most backers... waste of life force, Mortal Online 2 is arround the corner, bye felicia", "timestamp_created": 1613223073, "timestamp_updated": 1613223073, "voted_up": false, "votes_up": 68, "votes_funny": 5, "weighted_vote_score": "0.799381852149963379", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "118661340": {"recommendationid": "118661340", "author": {"steamid": "76561198025875663", "num_games_owned": 788, "num_reviews": 13, "playtime_forever": 226893, "playtime_last_two_weeks": 0, "playtime_at_review": 16081, "last_played": 1681343026}, "language": "english", "review": "Update TLDR; A recent patch makes leveling a few skills far harder for newbies while not really effecting established players and messes with the combat system significantly in a game where training even one weapon skill takes a long time... the most up-voted suggestion in a long time is \"roll back the patch\". When the game was released the devs introduced a first-to-achievement competition for the new servers when they released the game and sold 1-2 day early access. Most of the prizes are won before most people even get to play. That's more than a bit pay to win.\n\nEdit: Before reading this review, please keep in mind that I do want to like this game and I hope I can give it a recommendation in the future. Negative feelings about the game are mostly tied to the actions of the developers and my concerns about the direction they are taking this game in right now.\n\nWhat I like: I like that the game takes effort and cooperation, and overall is a decent game in it's genre. I also like the friendliness of a lot of the community.\n\nCaveat: Keep in mind the devs say they want a skill to take 1k hours to bring to level 60 (with max level being 80) so it's going to be slow going: there are 6 gathering skills, 6 crafting skills, 4 assistance skills, 4 'other' skills, 6 weapon type skills, and 5 defense type skills. If you don't want to put in as much time as a full time job playing a game, this game won't be for you even when the devs goal of 1k hours to level 60 is reachable.\n\nWhat I don't like: It's in alpha so some bugs are to be expected, but a lot of the updates seem poorly thought out. A fair while ago update to the taming skill increased it's difficulty and cost significantly, making leveling it to 60 take way over the dev's target of 1k hours. On top of that a new update has to the combat system been almost universally hated by the community.\n\nShould you buy it? That's up to you. I personally can't recommend it because of the dev's willingness to give people who played the game earlier an advantage while making the skill harder to level for everyone who did so after the update. I will be updating this review as the game develops. [strike]One reason to get it is that the devs do somewhat listen to feedback[/strike], but only sometimes and sometimes they just seem like they are not around. This review will be updated as I play the game more and as the devs make new changes.\n\nUpdate: They made an update to the game that reduced everyone's speed by ~20%. This was not in the patch notes and refused to answer if this was a bug or if it was intentional for over a week. This is part of a pattern of non-communication with the community.\n\nUpdate 11/10/2022: The devs had what I thought would be a great idea, introducing a first to achievement competition for the new server with prizes. Unfortunately they made most of the achievements easy to get and sold 1 to 2 day early access to the new servers. Unsurprisingly, most of the competition prizes are already won before most players even had the ability to log in. Talk about pay to win in a literal sense...\n\nUpdate 11/11/2022: [strike] The devs banned the word Dupe and Exploit from the discord to stop people from telling others about the existence of an item duplication exploit. Seems like a messed up choice, people should be able to warn others of potential server resets. [/strike] EDIT: The moderator who did this stepped down from the moderation team.\n\nUpdate 11/24/2022: The devs made a really good patch to the game. They had an issue with the release that they quickly patched, but overall it's a great storage update. I also appreciate that I don't have to click on the well hundreds of times anymore!\n\nUpdate 2/4/2023: I found out that horses (The only not-paied 100% speed mount) could randomly get a penalty of summoning speed as a level up perk at level 40. That's just objectively stupid.\n\nUpdate 2/9/2023: The devs decided to make it harder to level some skills for newer players joining now, made a previously one handed weapon two handed completely obseleting it's use cases outside of PvP and making it impossible to switch between it and one handed weapons, and just generally made a lot of changes the community is not happy about. They also made kiting most bosses essentially impossible", "timestamp_created": 1657574899, "timestamp_updated": 1677691946, "voted_up": false, "votes_up": 58, "votes_funny": 2, "weighted_vote_score": "0.794012486934661865", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "88733812": {"recommendationid": "88733812", "author": {"steamid": "76561197997812090", "num_games_owned": 327, "num_reviews": 16, "playtime_forever": 44740, "playtime_last_two_weeks": 0, "playtime_at_review": 36044, "last_played": 1618662645}, "language": "english", "review": "****DO NOT BUY**** Game is dead as of 03/19/2021\n\nGame was a great run up until 03/19/2021. Devs have a test server and rather than utilize it, they release a patch to live that has an anti pvp mechanic that is easily abused. PvP was fine in the game but needed tweeking and the new system needed to be tested. Yet here we are alt fest pvp. Alt gets low hp runs in while you're swinging in pve because other players can mount in before they load on your screen and you kill them and you get instant criminal and their friends come in and kill you consequence free.. GJ", "timestamp_created": 1616196486, "timestamp_updated": 1616196486, "voted_up": false, "votes_up": 82, "votes_funny": 2, "weighted_vote_score": "0.78712010383605957", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "127392885": {"recommendationid": "127392885", "author": {"steamid": "76561198872423508", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 95509, "playtime_last_two_weeks": 170, "playtime_at_review": 15763, "last_played": 1712935548}, "language": "english", "review": "The devs need to get their heads in the game, listen and respond to players.\n\n-Give them a PVE server\n-Repair the bugs\n-Allow items to be select-able when underneath other objects, for instance, when fruit falls below a tree\n-Do something for servers who do not have 5 people and therefore cannot progress through content\n-Get rid of the invisible walls forming while building\n-Repair the gathering buff which doesn't seem to work on greenery, there is no indication of the 25% increase and with a 69% +25% success but failing 10 out of 12, something is not working correctly.  I have suspicions that this is not the only area negatively affect by this mathematical error.  Some things, however, are very accurate.\n-Remove the ridiculous increased mounting speed times to horses when they are higher level\n-Allow chests to be build on half walls\n-Give experience to player when upgrading buildings, if applicable and 100% chance of success\n-Increase the benefits to plague gear on the main island\n-Increase the seeds received from most agriculture\n-Add more wild plants\n-Increase building speed or amounts for massively produced items with no experience benefit (for instances, hewn sling ammo)\n-Increase the opportunity to raise healing skill\n-Allow guilds abandoned by their leader to take over the guild\n-Repair the bug that lags inventory and causes items to disappear\n-Give peons some level of automation\n-Lessen trees in THE DESERT", "timestamp_created": 1669646311, "timestamp_updated": 1669646311, "voted_up": false, "votes_up": 54, "votes_funny": 3, "weighted_vote_score": "0.784249722957611084", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "101177944": {"recommendationid": "101177944", "author": {"steamid": "76561198027489900", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 593, "playtime_last_two_weeks": 0, "playtime_at_review": 593, "last_played": 1634438954}, "language": "english", "review": "I bought this game mainly for the crafting and building aspect. I knew it was PVP but after reading a comment saying the community on EU2 was pretty nice I thought I'll give it a try.\n\nAnd I had a blast playing on the starting island, enjoying the oldschool feel with a lot of QoL features, building my small camp, doing quests, hunting, taming, fishing, crafting gear, food and finally my very own ship to leave for the main land. \n\nBut this is where the fun stopped.\n\nThe mainland is small. Very small. I would guess around five minutes to run from one side to the other. And a big chunk of this land are full PVP areas with mobs. So you probably don't want to build your new home in the hostile areas. And if you are like me you don't want to just build it in the middle of a grassland either or right next to the main city, but somewhere near or in a forerst, a little bit secluded, maybe a fishing spot close by. Yeah, those spots were all taken.\n\nOf course you could just settle close or next to another player. But first of all you never know how they will react to that - this still is a PVP game. And second: the building system makes you put down a stonemark as center of your land and you can build in a  square around that. Most players kinda obviously opt for putting walls around their dominion. So what you get all around the map are equally big wallsquares with buildings inside. And if you put a few of those next to each other it looks like a darn prison complex.\n\nSo to make sure there is enough space to build the devs went for a decay option: if you aren't online for some time, your dominion will be packed up and sent to your inventory. You don't loose anything, except your building spot. The time you got? Five days. Can only play once a week? Too bad. Vacation planned? Family emergency? Business trip? Too bad. It's your fault you have a life afterall.\n\nAnd all that said - considering every player should have his own dominion - the server was empty. Of course I didn't check the whole map, but I saw maybe ten or twenty dwellings. Yes, you can make characters that can't own land, and maybe that's how guilds work, no idea about that, but at that scale it more seemed like one guild playing on a server together and not an mmo.\n\nSo for me, my very joyfull journey ended there.\n\nThe game needs a LOT bigger maps to explore, gather, hunt and build. And more players.\nPVE servers would help with that, so all the peaceful crafting folk can gather, as the forum shows.\nDedicated or private servers won't help the public servers, but might get some sales in for guilds or groups of friends who actually just want to settle together and do expeditions, or RPG project servers. Especially if you can turn off the decay.\n\nBut the devs are obviously more concerned about creating item packs to sell; right now Halloween, five cosmetic items for 20 €. Or the item packages on their homepage for up to 250 € - which all have the disclaimer \"Most of the rewards are still in development. You will be able to receive unlocked rewards within a couple of months.\"", "timestamp_created": 1634443426, "timestamp_updated": 1634443426, "voted_up": false, "votes_up": 47, "votes_funny": 2, "weighted_vote_score": "0.776201725006103516", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "133016159": {"recommendationid": "133016159", "author": {"steamid": "76561198331897529", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 13325, "playtime_last_two_weeks": 0, "playtime_at_review": 13325, "last_played": 1676180252}, "language": "english", "review": "If you're considering getting this game, it's an absolute grind fest, which is something i generally love.  However, the 2 devs for this game punish the players in extreme ways for not being at the end game.  Like taking a skill and/or tier weapon you've spent hundreds or thousands of hours developing, then nerfing it into oblivion, making your weapon investment an absolute waste. \n\nGetting tier weapons early on is no joke, it's very expensive and the auction house is probably the only thing moving slower than the pace of this game.\n\nTo make this game better yet, you're also going to get ganked the second you leave the starting zone by guilds who dedicate themselves to just ganking new players and robbing their tools, which are also expensive to get.\n\nAs much as i want to rant, just join the games discord and watch the tens of players who frequent the game argue about how bad the game is.\n\ntl;dr If you're considering playing, just take the money you were going to spend on the game, burn it, then go do absolutely anything else.", "timestamp_created": 1676619918, "timestamp_updated": 1676620496, "voted_up": false, "votes_up": 36, "votes_funny": 5, "weighted_vote_score": "0.77223891019821167", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "127498393": {"recommendationid": "127498393", "author": {"steamid": "76561197984985614", "num_games_owned": 0, "num_reviews": 37, "playtime_forever": 7577, "playtime_last_two_weeks": 0, "playtime_at_review": 7137, "last_played": 1670033876}, "language": "english", "review": "Fun until about lvl 20 then you realize it's just a boring ass grindfest for about 1k hours where pvp is just ganksquads spamming stuns.", "timestamp_created": 1669699510, "timestamp_updated": 1669699510, "voted_up": false, "votes_up": 36, "votes_funny": 1, "weighted_vote_score": "0.754533529281616211", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "118834879": {"recommendationid": "118834879", "author": {"steamid": "76561198129469894", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 8338, "playtime_last_two_weeks": 0, "playtime_at_review": 6357, "last_played": 1659105786}, "language": "english", "review": "PROS\n 1: Land ownership\n 2: Crafting is rewarding\n 3: I have noticed some patching and work being done\n 4: Have not noticed many bugs, but there are some (EA) after all.\n 5: This game on sale for 8$ usd feels perfect for what it is. \n 6: The auction house is cross server.\n 7: Very low population so leveling areas are not over flooded, and land is available.\n\nCons:\n1: The Auction house has to be built on your or a friends lot to use - however the auction house is for the most part Empty.\n2: Very low population- so the economy is stagnant and there is a  lack of social engagements.\n3: The map is currently very small.\n5: Not a lot of diversity with pve content.\n6: For a PvP focused game the npc mobs are way overpowered.\n8: The food system in this is ridiculously exaggerated, and if u do not eat you basically crawl around even on a mount which is irritating to say the least.\n\n  I got my monies worth, but this is a very niche game that is more of a slow stroll then a good jog as far as progression goes. If you have time to burn, and don't mind repetitive tasks you very well may find this game worth your 8$ usd.", "timestamp_created": 1657859208, "timestamp_updated": 1664680841, "voted_up": false, "votes_up": 38, "votes_funny": 0, "weighted_vote_score": "0.740338563919067383", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "85782147": {"recommendationid": "85782147", "author": {"steamid": "76561197968062093", "num_games_owned": 361, "num_reviews": 7, "playtime_forever": 828, "playtime_last_two_weeks": 0, "playtime_at_review": 828, "last_played": 1611981728}, "language": "english", "review": "I'm going to keep this simple and civil.\n\nDo not buy this game.\n\nThis game was released on Thursday of last week.  It is now Monday, as of this review.  The game is unplayable by any normal measurable standards.  The lag is atrocious and seemingly spread across all servers.  This is an impressive feat considering that the total population of the game at peak hours on a Sunday evening was around 1,500 - spread across several different servers.  This is billed on the store page as an MMORPG.  What kind of MMO cannot handle 1,500 people?  I'll tell you.  The same one that cannot handle less than half of that at 3am on a Friday morning.  The developers have released several patches since Thursday and they have made almost zero (and I'm being generous here) effect on the insufferable rubberbanding and general high latency that for moments at a time is tolerable but never goes away.\n\nAt one point I was willing to give the developers the benefit of the doubt that they would fix this.  Now I am dubious they have any clue how to make an online game.  Given time, they will - probably - fix the lag issue, but the game has other issues as well that should make it a pass for most sane people.  Briefly, the chief negatives for me beyond the obvious are the fact that the game is - intensely - grindy for no real overall purpose beyond padding playtime, the mainland is very small and has little to actually do beyond grind, the potential for griefing its population away with Alpha guilds is already beginning to manifest, and in general the game is not pleasant to look at graphically or artistically.\n\nLastly, I'd like to mention that while I have nearly 14 hours played in this game, at least 3-4 hours of that were spent in the tutorial.  The tutorial itself is a long grind to get off a small island overpopulated with other newbies to get to a slightly bigger island populated by no-lifer Chads and their victims.  If you were to try this game with the intention of getting a refund if it was not your cup of tea, it is extremely unlikely that you would get to the \"main game\" before the two hour refund limit.  I'll give the developers the benefit of the doubt that they did not do this by design, but nevertheless, I would advise anyone from buying this game at least until they \"fix\" the lag issue.  If they fix it.  \n\nYou've been warned.  Stay away.", "timestamp_created": 1612214710, "timestamp_updated": 1612215033, "voted_up": false, "votes_up": 80, "votes_funny": 5, "weighted_vote_score": "0.731100320816040039", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "86304810": {"recommendationid": "86304810", "author": {"steamid": "76561198257785644", "num_games_owned": 0, "num_reviews": 77, "playtime_forever": 111, "playtime_last_two_weeks": 0, "playtime_at_review": 111, "last_played": 1612050909}, "language": "english", "review": "dude just go play valhiem. this isnt worth your time.", "timestamp_created": 1612920132, "timestamp_updated": 1612920132, "voted_up": false, "votes_up": 114, "votes_funny": 17, "weighted_vote_score": "0.730894267559051514", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "85527019": {"recommendationid": "85527019", "author": {"steamid": "76561198018676507", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 6688, "playtime_last_two_weeks": 0, "playtime_at_review": 6688, "last_played": 1611778787}, "language": "english", "review": "It's got solid crafting system and the progression feels rewarding but PvP is horribly balanced and very shallow, controls feel pretty jenky, and devs are pushing through launch with known duping exploits. I hope I can change this review in the future but I can't recommend this game right now.", "timestamp_created": 1611875727, "timestamp_updated": 1611875727, "voted_up": false, "votes_up": 51, "votes_funny": 2, "weighted_vote_score": "0.721945285797119141", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "123228232": {"recommendationid": "123228232", "author": {"steamid": "76561197973490554", "num_games_owned": 0, "num_reviews": 81, "playtime_forever": 522, "playtime_last_two_weeks": 0, "playtime_at_review": 522, "last_played": 1635028907}, "language": "english", "review": "Bought this game in early access. Still not done. But...I can buy all new DLC!?!?! Just for that I give it two thumbs down!", "timestamp_created": 1664722744, "timestamp_updated": 1664722744, "voted_up": false, "votes_up": 41, "votes_funny": 0, "weighted_vote_score": "0.704054832458496094", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "91985670": {"recommendationid": "91985670", "author": {"steamid": "76561198058001316", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 123918, "playtime_last_two_weeks": 0, "playtime_at_review": 24801, "last_played": 1711300468}, "language": "english", "review": "After 400 hours in the game its time to do a review!\n\nIf you love a slow but rewarding profession grind this is the game for you!\n\nI love the relaxing grind this game has its a perfect casual game for me, the grind basically never ends there is so many skills and proffessions to lvl up that it will keep you going for ages. \nIts for sure not for everyone but if you looking for a relaxing grind game that will keep you going for a months and more and more content being added this could be for you.\n\nI atleast think its worth trying the game out!\n\nPros and cons:\n\n+ Relaxing \n+ Friendly community (atleast on EU 1)\n+ The crafting with RNG % feels really rewarding when you get that max % on a gear piece\n+ The dungeons are faily fun both solo and with friends\n--------------------------------------------------------------\n- Sadly verry low population, hopefully grows!\n- Combat can feel a bit clunky and delayed.\n- Not to much group play but thanks to the nice community on eu1 we still get a bit fun out of that.\n- A bit lack of content but fully understand that it takes time to add content.\n\nI really recommend this game but its for sure not for everyone!", "timestamp_created": 1621005133, "timestamp_updated": 1621005133, "voted_up": true, "votes_up": 30, "votes_funny": 5, "weighted_vote_score": "0.7033957839012146", "comment_count": 0, "steam_purchase": true, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "85536222": {"recommendationid": "85536222", "author": {"steamid": "76561198017947624", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 125, "playtime_last_two_weeks": 0, "playtime_at_review": 125, "last_played": 1611889811}, "language": "english", "review": "Cant say id recommend this game at the moment. Server issues aside (thatll get sorted im sure) it opens up with a multi hour long tutorial thats some epic quest chain you need to complete before you can leave the starting area. Maybe im alone on this one but i dont think a tutorial should ever be longer than like 20 minutes. Show me how to craft, manage my dominion, attack, catch things, all of the basics as quickly as possible and once ive been shown a system, dont make me use it again. its a tutorial. I dont need to be shown how to tan small AND medium hides, craft multiple different levels of gear, fish multiple different fish (ill come back to this one...). Show me the systems and get me out as quickly as you possibly can.\n\nFishing.... jfc the fishing. It is, without a doubt, the WORST implementation of a fishing system ive ever seen in a videogame. The game gives you 3 buttons, drag out, yank and pull. Gives you ZERO explanation of what each of those does, or when to use them, and forces you to just \"figure it out\" and by figure it out what i really mean is go to discord and ask questions and get pointed to a visual guide on how the hell you catch a certain type of fish required by the tutorial. (for those wondering, you catch a roach by waiting for 2 bite messages, hoping the 3rd message says \"tension loosens\" (if it doesnt, try again), then you get a third bite, and then you press R and then you press E. If youre reading that thinking \"what the fuck\" yeah, me too dude. It also takes like 20-30s per fish. This whole system needs to be highlighted and deleted and remade into something that isn't awful.", "timestamp_created": 1611890377, "timestamp_updated": 1611890377, "voted_up": false, "votes_up": 39, "votes_funny": 1, "weighted_vote_score": "0.685465097427368164", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "155847350": {"recommendationid": "155847350", "author": {"steamid": "76561198061685113", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 334469, "playtime_last_two_weeks": 56, "playtime_at_review": 320912, "last_played": 1712929221}, "language": "english", "review": "The game is really great but has one big problem. The game doesn't get any new groups of dungeons or a new island. Clearly no major game updates. And that has been the case for over two years. You only ever get small updates. Don't get me wrong, there's a lot to do and you can always set new goals. Only if there are no new major updates in the game, such as new group dungeons or new islands, all the small updates are of no use. They don't advance the game. Four islands have been announced that will rotate. Of the 4 islands, we have gotten 1 island since early access 3 years ago. Sorry, but this is no longer acceptable in the long term. This is how it stands at the time of the game on January 12th, 2024\n\nI will be happy to revise my review if something changes in the direction of new islands or new group dungeons.\n​", "timestamp_created": 1705100945, "timestamp_updated": 1705100945, "voted_up": false, "votes_up": 20, "votes_funny": 1, "weighted_vote_score": "0.685353875160217285", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "95258135": {"recommendationid": "95258135", "author": {"steamid": "76561198021307138", "num_games_owned": 0, "num_reviews": 42, "playtime_forever": 209, "playtime_last_two_weeks": 0, "playtime_at_review": 209, "last_played": 1625667206}, "language": "english", "review": "Was \"killed\", then camped in the starting tutorial zone by a higher level player. \"PVE zones\" are useless against people that want to troll. Requested a refund because I wasn't expecting such a cold welcome. Very grindy, like Albion.", "timestamp_created": 1625667805, "timestamp_updated": 1625667805, "voted_up": false, "votes_up": 27, "votes_funny": 7, "weighted_vote_score": "0.684726119041442871", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "127763982": {"recommendationid": "127763982", "author": {"steamid": "76561197996056681", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 24273, "playtime_last_two_weeks": 0, "playtime_at_review": 9112, "last_played": 1676590488}, "language": "english", "review": "You need to understand what kind of game this is before you join.  This is a SLOW game.  This is a GRIND to level skills.  You will be happy that you build something because you earned it.  When i get ready to make a new recipe it's because i grinded, not only for the cooking experience but also the agriculture to support making it.   Yes, there's PvE combat and the potential for PvP (i think the server is a little young for a lot of PvP yet).  And it's worth leveling your combat skills to get some resources, but i've noticed these really push you towards grouping up for the highest difficulty, which is great.  It makes you work with your guild mates.  I have 150 hours since launch, and i didn't play the betas, and i love it.  \n\nPros:\nSlow grind that certain types of players will love.  Skills take a long time to level.  Crops/animals take a long time to grow.  Leather a long time to produce.  Etc.\nRuns well\nOwning land and building in a way where each plot of land can be unique.  \nOn the flip side, if players go inactive, their town and all items/buildings are picked up for someone else to build on after 3-9 days of inactivity based on the size of the property.  This ensures lands being open for new players while not harming old ones.\nFeeling like you earned what you have\nWhile there are \"packs\" you can buy, they're not pay-to-win and no where near required.  No microtransactions.\nInspiration system - You can store up to 50k xp worth of 'inspiration' which is gathered by being offline.  So if you can't log on and do alot for a couple days it's ok.  You get triple XP when it's turned on until it depletes and fills up over 3 days.  \n\nCons:\nGraphics are effective, but simple for today's games\nLow population according to steam charts (I'm on NA East and we have a good population, i can't speak for other servers)\nLimited Gameplay (what's there takes a long time for newer players like myself to get through, and i'm not through even a quarter of it 150 hours in, but i could see how experienced beta players could consider it a limited amount of content).  \n\nThe game has a lot of potential and room to grow.  I just hope the development team can push out content quickly enough to keep people interested.  Even if content does turn out to be low, and i eventually get bored, i'll probably still log on and do my crops and animal stuff in preparation for future content. This game isn't going to require you to be online every day or fall behind.", "timestamp_created": 1669990078, "timestamp_updated": 1669990078, "voted_up": true, "votes_up": 25, "votes_funny": 1, "weighted_vote_score": "0.679317593574523926", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "113079850": {"recommendationid": "113079850", "author": {"steamid": "76561198067954704", "num_games_owned": 0, "num_reviews": 90, "playtime_forever": 31130, "playtime_last_two_weeks": 0, "playtime_at_review": 31130, "last_played": 1648947516}, "language": "english", "review": "I unfortunately can't recommend this game in its current state.\n\nThere is one active server left with a few players.\n\nIf you try to play on the active server you will be griefed from the moment you log on to the moment you log off and will be unable to do anything. One player in particular is gatekeeping the server and preventing anyone new from joining it.\n\nIf you join any other server you will be completely alone. All of the other servers are ghost towns. Don't know how much motivation you can muster in a game as grindy as this with absolutely no community. The dungeons are also going to require teamwork to initially clear. Once you get the drops from them you'll be able to solo them. Makes it seemingly impossible to progress if the server is completely dead.\n\nMaybe one day the last remaining server will not be blocked to new players. Until then I can't recommend anyone play this.\n\n\nMy experience:\nReturned to server 1 with my character I invested 500 hours into. I had nothing except buildings because I gave everything away before I left. I was immediately ganked and blocked from doing anything. They followed me around everywhere I went and would push into me and attack me to make sure I could do absolutely nothing. They did this for 2 hours. After 2 hours I uninstalled.\n\nI reinstalled the game later and tried another server. Grinded for 26 hours over 1.5 days. I did not see a single other person. I completely lost motivation since the server was completely dead and uninstalled again.", "timestamp_created": 1648663092, "timestamp_updated": 1648950234, "voted_up": false, "votes_up": 23, "votes_funny": 4, "weighted_vote_score": "0.677948892116546631", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "113918766": {"recommendationid": "113918766", "author": {"steamid": "76561198309790289", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 3833, "playtime_last_two_weeks": 0, "playtime_at_review": 3716, "last_played": 1650362362}, "language": "english", "review": "i played 62 hours in this game and i've been waiting for the devs to do something about PVP areas. after waiting a long time i put a topic about saying this game needs single player. anyhow someone from the devs respond saying this game won't be a single player and when i tried to explain to him that i lost my good items like my epic weapon that i bought with all my money collecting it from day one he called me a liar and said you can't lose all good items you only lose equipment in your inventory and if you don't want to lose that don't bring it to the PVP areas (he basically called me stupid) he forgot that you have to equip your best weapon to enter PVP areas cause in those areas either you face a clan waiting for you or more higher level player and you need any advantage plus you want to kill the animals more quickly to get out fast. you know how it works. anyway i put a lot of thinking whether i put a good review or bad one but after the dev attacking me like that i will make it a bad one. it's really good game it's my genre really but the PVP areas ruin it for me and more the dev talking to community like that. i never heard an arrogant response from any other devs like that. i'm uninstalling the game and deleting it from my account permanently.", "timestamp_created": 1650062532, "timestamp_updated": 1650062532, "voted_up": false, "votes_up": 49, "votes_funny": 22, "weighted_vote_score": "0.673246622085571289", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "125817761": {"recommendationid": "125817761", "author": {"steamid": "76561198007819342", "num_games_owned": 0, "num_reviews": 72, "playtime_forever": 1031, "playtime_last_two_weeks": 0, "playtime_at_review": 579, "last_played": 1669500669}, "language": "english", "review": "Might re-look later if they get PVE only servers.   Not a fan of PVP areas that you end up getting one shot by a group of campers. That is just locking out areas to explore.", "timestamp_created": 1668949967, "timestamp_updated": 1668949967, "voted_up": false, "votes_up": 19, "votes_funny": 4, "weighted_vote_score": "0.671840786933898926", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "88735543": {"recommendationid": "88735543", "author": {"steamid": "76561198207995148", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 764, "playtime_last_two_weeks": 0, "playtime_at_review": 554, "last_played": 1617298940}, "language": "english", "review": "Waste of money. starting island was a scam. Mainland you get plowed by high levels.... can't even refund.", "timestamp_created": 1616199391, "timestamp_updated": 1616199391, "voted_up": false, "votes_up": 30, "votes_funny": 1, "weighted_vote_score": "0.66790926456451416", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "89615282": {"recommendationid": "89615282", "author": {"steamid": "76561198160537477", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 4192, "playtime_last_two_weeks": 0, "playtime_at_review": 4166, "last_played": 1619117759}, "language": "english", "review": "I don't know where to begin.  I originally played this game when it launched.  Purchased a pack because I enjoyed Wild Terra 1 a lot.\n\nThen I come to find out that Wild Terra 2 took all of the worst things from Wild Terra 1 and left out all of the amazing parts of Wild Terra 1.\n\nThe PVP was quite a bit of fun, the survival, the crafting in Wild Terra 1 was done very well.  The PVP in Wild Terra 2 is dead.  Sure there are pvp zones but most people are smart and don't carry anything they can lose.  You keep all of your worn gear, you can make a secret bag to keep even more stuff.\n\nI quickly gave up on the game and decided to give it another go much farther down the development path.  Here I am more than a year later and the game has barely changed.  \n\nAnd to all of the people complaining about the mods/staff especially Kirtis.  They are not wrong.  Kirtis is an absolute child.  He had mod privileges in discord and will give people he likes special treatment and go out of his way to torment those he doesn't like (which is quite a few people).  He will delete your chats that don't break any rules, he will take away your channel privileges because he finds you annoying.  \n\nThey also have real money trading problems, no in game moderator support to stop it.  They have pay 2 win mechanics with mounts that give you greater speed than what you can normally get in game.\n\nThe servers are mostly dead.  Do not buy this game, turn around, run away very fast.", "timestamp_created": 1617432660, "timestamp_updated": 1617474232, "voted_up": false, "votes_up": 30, "votes_funny": 2, "weighted_vote_score": "0.665537595748901367", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "139262006": {"recommendationid": "139262006", "author": {"steamid": "76561198080708480", "num_games_owned": 312, "num_reviews": 44, "playtime_forever": 336, "playtime_last_two_weeks": 0, "playtime_at_review": 336, "last_played": 1681259415}, "language": "english", "review": "The game could be good fun if there weren't forced open world pvp. It's never a good idea in this type of game to have no servers that allow pve only, as only the people who sit on the game for hours on end will ever get anywhere as they will gank new players \"because it's fun\". The moment I saw I couldn't progress past the tutorial without pvp I quit. It takes long enough to get there that you can't refund the game at that point as well, so that's fun.", "timestamp_created": 1685448597, "timestamp_updated": 1685448597, "voted_up": false, "votes_up": 19, "votes_funny": 1, "weighted_vote_score": "0.655798733234405518", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "107114768": {"recommendationid": "107114768", "author": {"steamid": "76561198937392279", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 259645, "playtime_last_two_weeks": 3366, "playtime_at_review": 142143, "last_played": 1713771798}, "language": "english", "review": "Banned from Wild Terra 2 Discord for posting a Twitch Stream link in the Stream page where everyone else post there stream links on there Discord promoting there game and sending positive to the Twitch world. Pretty sad Juvty Worlds have power hungry discord mods 'Kirtis' that hurt the game by joining a sever and start muting people for no reason just because they don't like a certain player and/or PVP Guild. 2350+ hours in the game and always helping out new players if they ask and these power hungry mods ruin that.", "timestamp_created": 1641103676, "timestamp_updated": 1641118605, "voted_up": false, "votes_up": 36, "votes_funny": 6, "weighted_vote_score": "0.651853859424591064", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1644844691, "developer_response": "Hello! I'm very sorry that this happened. Probably the reason was different, since it is allowed to publish links to the stream. We double-check all controversial cases, whether the moderator's reaction was really fair, but so far we have not found any violations on the part of the moderators.\n\nI have added you as a friend and would love to hear your story to better understand the issue. I'm sorry this happened to you."}, "117972679": {"recommendationid": "117972679", "author": {"steamid": "76561197984975109", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 4890, "playtime_last_two_weeks": 0, "playtime_at_review": 4775, "last_played": 1685244788}, "language": "english", "review": "My advice, adjust the drop rate of inventory items on death to a chance to drop an item or two.. That or open some areas where you can progress your character without the need to go into drop inventory on death areas. Until that is addressed, I cannot recommend this game. However if you do end up playing. Watch chat for a kid who logs on in the evenings and says in global chat 'sup b*tches' named 'That_Was_Cringe' or something childish like that. If you see that, it's best to just log off, since he will just grief you. I'm amazed the developers haven't banned him and allow that kind of toxic behavior and language.", "timestamp_created": 1656650190, "timestamp_updated": 1656650807, "voted_up": false, "votes_up": 16, "votes_funny": 4, "weighted_vote_score": "0.651143014430999756", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "85666852": {"recommendationid": "85666852", "author": {"steamid": "76561198046670396", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 150, "playtime_last_two_weeks": 0, "playtime_at_review": 150, "last_played": 1612063693}, "language": "english", "review": "In it's current state, this game isn't playable. The rubber banding is what's making this so bad, once the servers are fixed and able to hold all the people trying to play, then I would recommend playing. Tried in beta and it was great, but currently not playable until they're fixed.", "timestamp_created": 1612063800, "timestamp_updated": 1612063800, "voted_up": false, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.645351231098175049", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "103591421": {"recommendationid": "103591421", "author": {"steamid": "76561199135463118", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 308376, "playtime_last_two_weeks": 4780, "playtime_at_review": 87177, "last_played": 1713750365}, "language": "english", "review": "Game is great the moderators \"Kurtis\" and his napoloen attitude are ruining it...You should really oversee what he does as his banning of innocents is abusive...So ask people for more money and then ban them ...Smart business", "timestamp_created": 1637799429, "timestamp_updated": 1637799429, "voted_up": false, "votes_up": 25, "votes_funny": 4, "weighted_vote_score": "0.640126585960388184", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1644845592, "developer_response": "Hello! I'm very sorry that this happened. We double-check all controversial cases, whether the moderator's reaction was really fair, but so far we have not found any violations on the part of the moderators.\n\nI have added you as a friend and would love to hear your story to better understand the issue. I'm sorry this happened to you. And I am very pleased that you like our game.\n\nSorry for answering after a long time, a small team of 5 people is working on the game and we do not always have time to follow everything."}, "148504042": {"recommendationid": "148504042", "author": {"steamid": "76561198167726082", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 1987, "playtime_last_two_weeks": 0, "playtime_at_review": 1987, "last_played": 1692318319}, "language": "english", "review": "scam selling updates as dlc packs games not even worth half the the price with lack luster content", "timestamp_created": 1697744169, "timestamp_updated": 1697744236, "voted_up": false, "votes_up": 21, "votes_funny": 0, "weighted_vote_score": "0.638994395732879639", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "86267651": {"recommendationid": "86267651", "author": {"steamid": "76561198057436899", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 22996, "playtime_last_two_weeks": 0, "playtime_at_review": 5447, "last_played": 1617829878}, "language": "english", "review": "Great game...responsive developers...lag is much less of a problem...hope you like grind/leveling/crafting", "timestamp_created": 1612874655, "timestamp_updated": 1612874655, "voted_up": true, "votes_up": 20, "votes_funny": 2, "weighted_vote_score": "0.634075939655303955", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "98956085": {"recommendationid": "98956085", "author": {"steamid": "76561197985162989", "num_games_owned": 35, "num_reviews": 2, "playtime_forever": 211321, "playtime_last_two_weeks": 104, "playtime_at_review": 2036, "last_played": 1713021109}, "language": "english", "review": "This is a pretty old school type MMORPG that I am absolutely loving. Its hard and challenging. Nothing is easy to obtain and you have to spend the time developing skills and obtaining items to craft and master abilities. You going to have to spend more than 2 hours a day on the weekend to get anywhere but I really enjoy this game and the sense of accomplishment you get when you finally do reach your goal. Not everyone's cup of tea but loving the sips I've taken so far.   \n\n9/10 For Me!", "timestamp_created": 1631047516, "timestamp_updated": 1631047516, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.630269646644592285", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "132508784": {"recommendationid": "132508784", "author": {"steamid": "76561198352620306", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 37269, "playtime_last_two_weeks": 0, "playtime_at_review": 5983, "last_played": 1682440956}, "language": "english", "review": "In response to the 2/9/23 patch:\n\nAs a new player, I'm left feeling disgusted are more than one of these changes. Namely, light armor dodge/sprint passive 1/10 of the buff, reduced to near nothingness. One poster says \"Bow gaming ftw\"...to you sir, with no offense intended, I say to you \"it must be nice to be able to afford to use one...the repair costs alone are expensive, now I HAVE to use higher tier'd ammo too? Where's the profit going to be in dungeons with a bow any more? I guess we use bow for survivability so we can dig a hole in our coin purse. Coming from a new player where the struggle was already real to begin with, I don't see it getting any easier if we want to continue with light armor/bow. I even swap to light/sword/shied but even that hasn't been unsoiled (shield strike nerf). Food too? Wrecking every new adventurer's experience from the start to the end lol. Well maybe this post is a little dramatic, but these are some dramatic changes to say the least. Not excited about this update...doesn't make me look forward to updates in general if this is how it's going to go. Maybe, who knows, the devs want us to quit whining about not having regular updates and this was some passive aggressive way of shutting us up. Again, I haven't played long at all, but I know a feeling when I feel it and I know kneejerk balance changes when I see them too. It's not all bad, but the bad is just that...harsh.   The new player experience will be brutal, and will leave many that would normally suffer this game from the beginning, quitting before even getting started. I honestly can't see many that would tolerate it, even knowing ahead of time that this game is challenging.  Making it harder on day 1 isn't the solution!", "timestamp_created": 1676016160, "timestamp_updated": 1676016160, "voted_up": false, "votes_up": 20, "votes_funny": 1, "weighted_vote_score": "0.629482507705688477", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "85605181": {"recommendationid": "85605181", "author": {"steamid": "76561197969988223", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1152, "playtime_last_two_weeks": 0, "playtime_at_review": 1133, "last_played": 1612375703}, "language": "english", "review": "This is the first time a game has been bad enough for me to take the time to post a review.  EA has become such an abused title to excuse just absolutely horrible programming.  At a full release price this game would hardly be worth 30 dollars and in this state it is just plain fraud.", "timestamp_created": 1611987036, "timestamp_updated": 1611987036, "voted_up": false, "votes_up": 25, "votes_funny": 2, "weighted_vote_score": "0.626840114593505859", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "99489663": {"recommendationid": "99489663", "author": {"steamid": "76561198157280080", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 1532, "playtime_last_two_weeks": 0, "playtime_at_review": 1297, "last_played": 1653206606}, "language": "english", "review": "I would not recommend this game specifically because of players like Door_Camper who start problems and then tries to blame everyone else for it. Players like that drive away new players. Players like Door_Camper should not and do not deserve to remain.", "timestamp_created": 1631867850, "timestamp_updated": 1631867850, "voted_up": false, "votes_up": 18, "votes_funny": 12, "weighted_vote_score": "0.625858008861541748", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "88959607": {"recommendationid": "88959607", "author": {"steamid": "76561198142592531", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 11306, "playtime_last_two_weeks": 0, "playtime_at_review": 3988, "last_played": 1674781013}, "language": "english", "review": "Piece of shit game P2W. Can't even progress because of end game players camping low level areas that are needed to progress. Can't believe it is $35 straight robbery.", "timestamp_created": 1616524996, "timestamp_updated": 1616524996, "voted_up": false, "votes_up": 37, "votes_funny": 2, "weighted_vote_score": "0.622580647468566895", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "85516328": {"recommendationid": "85516328", "author": {"steamid": "76561198068057100", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 2871, "playtime_last_two_weeks": 0, "playtime_at_review": 661, "last_played": 1614283393}, "language": "english", "review": "It's like a mix of minecraft, diablo and runescape. Very simple. Very nice. Very fun!\n\n\n", "timestamp_created": 1611861110, "timestamp_updated": 1611861110, "voted_up": true, "votes_up": 29, "votes_funny": 2, "weighted_vote_score": "0.622315883636474609", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "118931962": {"recommendationid": "118931962", "author": {"steamid": "76561198280913742", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 7698, "playtime_last_two_weeks": 0, "playtime_at_review": 7698, "last_played": 1624746468}, "language": "english", "review": "This is a full loot drop game. You can spend many hours grinding out mats to make epic and legendary gear and tools only to have some snot-nosed PVP/Greifers lie in wait and ambush you, take your gear and then you basically have to start from scratch. It wouldn't be so bad if they made PVE and PVP servers separate, but the devs don't want to do that. Garbage game, Garbage playerbase, don't waste your time and money on this POS.", "timestamp_created": 1658019156, "timestamp_updated": 1658019156, "voted_up": false, "votes_up": 20, "votes_funny": 2, "weighted_vote_score": "0.621668040752410889", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "85613112": {"recommendationid": "85613112", "author": {"steamid": "76561198068814623", "num_games_owned": 276, "num_reviews": 6, "playtime_forever": 3237, "playtime_last_two_weeks": 0, "playtime_at_review": 1246, "last_played": 1612874007}, "language": "english", "review": "Absolutely Toxic behavior from the biggest ASIA country. Here's to hoping for a server catered to them specifically so they do not disrupt any other servers,", "timestamp_created": 1611998804, "timestamp_updated": 1611998804, "voted_up": false, "votes_up": 19, "votes_funny": 1, "weighted_vote_score": "0.61817854642868042", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "112512735": {"recommendationid": "112512735", "author": {"steamid": "76561198075810550", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 750, "playtime_last_two_weeks": 0, "playtime_at_review": 750, "last_played": 1646704488}, "language": "english", "review": "Uh.. 39.99 FOR WHAT!?? DO NOT BUY THIS GAME. My boyfriend and I enjoy old school RPG styles games and it was on sale for 19.99, so we decided to get it. We literally spent like 6-7 hours in this tutorial making all this random stuff and doing little mini quests.. about an hour in, I thought I better get on discord and make sure the game was active knowing that it cannot be returned after a couple hours. In the Wild Terra 2 discord there were many people, assumed it was active. ( I wish I would have paid closer attention.) Anyways after several hours, we finally get in the the game and there was literally NO ONE there AT All.  It was literally one road of merchants with noone there only npc's just standing there with any animation!~!! I looked back at the wild terra 2 discord and noticed that they do not allow any one to comment at all since the discord/ game launched. wtf? Its a total scam! Don't even bother with this game. I also attempted to ask Steam back for a refund, and they had no reply... They need to take this game down. $39.99?? Serious? oh, hell no.   I feel totally scammed of my 20 bucks, I'd be really PISSED if I paid $40. DONT BUY IT.", "timestamp_created": 1647746014, "timestamp_updated": 1670106962, "voted_up": false, "votes_up": 31, "votes_funny": 2, "weighted_vote_score": "0.617385685443878174", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "128505425": {"recommendationid": "128505425", "author": {"steamid": "76561198124450363", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 82314, "playtime_last_two_weeks": 8, "playtime_at_review": 44015, "last_played": 1712946069}, "language": "english", "review": "Most people who played this game have left because of the Developers.  They are absolutely unwilling to listen to the community and do what the community wants.  Do not buy this game and do not support these types of developers.", "timestamp_created": 1670963303, "timestamp_updated": 1670963303, "voted_up": false, "votes_up": 19, "votes_funny": 5, "weighted_vote_score": "0.612820982933044434", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "109415427": {"recommendationid": "109415427", "author": {"steamid": "76561199131135866", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 241339, "playtime_last_two_weeks": 1940, "playtime_at_review": 142889, "last_played": 1713706542}, "language": "english", "review": "Devs ignore players and common sense when choose a solution. Players can easily break the rules of server, use bugs and will not be punished. Players who really spent a lot of time to this game loose their position in one day cause of exploit and noone cares. What is more the write down that they do not care. Definitely will not recommend this game to anyone until I see that situation changed.", "timestamp_created": 1643915225, "timestamp_updated": 1643915225, "voted_up": false, "votes_up": 18, "votes_funny": 2, "weighted_vote_score": "0.610721766948699951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "90730562": {"recommendationid": "90730562", "author": {"steamid": "76561198048580872", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 45638, "playtime_last_two_weeks": 0, "playtime_at_review": 45638, "last_played": 1617902134}, "language": "english", "review": "Wouldn't bother Good game but with to much BS and overall lack of content just ruins it. Discord mod's specifically one just delete what they don't like to read and the devs are russian so unless you speak russian your prolly not getting your voice heard. Good month worth of game play till you realize that its 3 dungeons that will soon have 3 difficulties and no they aren't exciting and fun they are just something you do. Back to the Mod on discord who legit heckles people who have put 300 into early backer packages or deletes reports of his own abuse in the support section of the discord. I wouldn't say stay away but they have alot of additions to go and some restructuring on the rules as well before this game will ever be worth the 34$ its listed as.", "timestamp_created": 1619100171, "timestamp_updated": 1619100171, "voted_up": false, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.610583901405334473", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "99249636": {"recommendationid": "99249636", "author": {"steamid": "76561198390665878", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 820, "playtime_last_two_weeks": 0, "playtime_at_review": 820, "last_played": 1631473287}, "language": "english", "review": "If you've got several years to commit to a game, then this is the one for you. /s\n\nSeriously. I don't mind a grind, but the grind in this game is something on another level I've experienced. \nThe pure frustration of grinding resources in itself as like dragging your testicles through a belt grinder.\n\nI admit, the crafting system is interesting, quite complex but I feel like it really needs a definitive solution to properly explain some of it's processes on how certain materials are crafted without needing to use the Wiki. \nI should be able to learn this all in the game, not through a third party source.\n\nIn some areas, such as fishing, simplicity would go a long way. Throw your bait out and catch a fish, and depending on your fishing level and bait, is what you catch [ Runescape ]. Not the current system of bashing a key button in hope you hit the right combo and catch, again, referring to the Wiki for my answer because the game just wouldn't detail it enough for you to grasp.\n\nAnd trying to build a crucible 5 times in a row, even with a solid percentage of chance, only for it to fail and have to gather all the resources again, and then fail is demoralising, but you need to because the quest is telling you, and you only wish to progress.\n\nAnd why is the game telling me to go to restless gorge almost right off the starting island, with weak-PVE gear, not considering the level 40 dwarves and level 35 wolves? I understand a challenge, but at least progress me to gear up for it? Why even offer me such a quest that's gonna take me 1 week in grinding to even achieve.\n\nI can't be bothered to explain anymore, I've wasted enough time on the game. All the best, I hope the devs work wonders on it, but it's not for me, or my partner. We'll be moving on.", "timestamp_created": 1631474055, "timestamp_updated": 1631474055, "voted_up": false, "votes_up": 13, "votes_funny": 1, "weighted_vote_score": "0.608015239238739014", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "96564831": {"recommendationid": "96564831", "author": {"steamid": "76561197968013718", "num_games_owned": 0, "num_reviews": 21, "playtime_forever": 36314, "playtime_last_two_weeks": 0, "playtime_at_review": 17987, "last_played": 1677258916}, "language": "english", "review": "They deliberately trying to get the game to last longer with stupid mechanics, despite the fact that its already long due to the grind and not the content.", "timestamp_created": 1627551296, "timestamp_updated": 1676135505, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.602116286754608154", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "86250711": {"recommendationid": "86250711", "author": {"steamid": "76561198076340527", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 3376, "playtime_last_two_weeks": 0, "playtime_at_review": 3046, "last_played": 1613942302}, "language": "english", "review": "Another wannabe UO completely flawed. At this point, I'm tired of Steam pushing out all these unpolished games and devs charging a ridiculous amount for unfinished games. It starts out promising enough, I even accepted there's no in-game map since you can follow a drawn one found through search. Lag issues, I can't stand. The whole map in general is just tattered with random house plots everywhere with resources becoming scarce as more people place plots down and remove those spawns. Community is toxic already with players rolling newbies even at beginner spots like the Graveyard. Basically the game is a race to get the best equipment so then you can be the biggest A-hole to everyone else just getting started. Since the game already launched and if you're reading this now, you're too late. There no real substance or context to this game other than click, gather, build, but then when you want to advance, you'd better join a guild and pray you're lucky to join a competent one, otherwise youre stuck on the small Main land with only the maze of random plots to keep your interest. Tell you what, take your $30+ and spend it anywhere else.", "timestamp_created": 1612851579, "timestamp_updated": 1612851579, "voted_up": false, "votes_up": 24, "votes_funny": 5, "weighted_vote_score": "0.597033500671386719", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "150029790": {"recommendationid": "150029790", "author": {"steamid": "76561198163675927", "num_games_owned": 267, "num_reviews": 147, "playtime_forever": 596, "playtime_last_two_weeks": 0, "playtime_at_review": 596, "last_played": 1699820201}, "language": "english", "review": "grinding is unreal", "timestamp_created": 1699826082, "timestamp_updated": 1699826082, "voted_up": false, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.597017288208007813", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "132955325": {"recommendationid": "132955325", "author": {"steamid": "76561198148043483", "num_games_owned": 0, "num_reviews": 82, "playtime_forever": 3827, "playtime_last_two_weeks": 0, "playtime_at_review": 3827, "last_played": 1676532506}, "language": "english", "review": "poeple are on alts out biding you on their own posting to raise the price of things..i want to be a healer to heal my pet after all this time im lvl 11 heal have one ability that is 16sec cooldown and only heals for 18hp over 3 secs..stuff will hit your pet for 20-30hp a sec..then you stuck with the healer staff and cant swap back to other weapons, doing almost no damage the staff misses so much you will be doing no damage for multiply swings in a row..if i could swap back to my mace and shield id win the fight and not die..sometimes if your lucky you will win with almost no health..then have to wait 5 mins to resummon your pet..so im forced into using a mace and shield..over trying to be a healer/tamer..id be fine with this if i could swap the weapons out in combat..i have to lvl up gathering masonry blacksmithing to make a pottery wheel then have to level pottery to then start making healing items that lvl up my healing better. then ill have to level up healing far to get expensive healing oniments because i have no way to heal except to get out of combat regen stam then wait for 1hp/s health regen to kick in..can get 2hp standing next to camp fire, but you cant use them in dungeons. this can take 10secs to 5mins of sitting there if your pets on cooldown.. say you get into a fight the guy gets you to 80/100 hp you now have to regen stam and then health..waiting 20+secs to move onto the next enemy...making the game slow fight one enemy at a time, not healing it like i want because itll die instantly when i pull out the staff since i miss and do less damage then the pet the enemey will just hit the pet and ignore you..i had to be a melee/range class and only use the healing staff after combat to speed up the wait time..but you pull out that staff on accident in combat say good bye to your pet and maybe even you..spent my first 1g on a better pet that had more health and damage and the dung still felt the same.. one enemy at a time with the pet dying if you dont pull aggro first..then you got someone with 100's of real money buying a pack getting a knight and his knight can tank a bear that i couldnt. i i spent 60hours getting 1 gold to buy a bear that is just ok, since the one i wanted was 6gold..i only made it this far because some people helped me advance quick and hooked me up with gear..other wise i would have had to spend that money on gear first and wouldnt have had as good as stuff..since it would take me even more time to get to a point where i could craft a master craft item getting the better stats. had fun and didnt mind the grind..but the healer staff and ability is garbage not a play style you can really use untill you have leveled a bunch. im no where near this point and see having to play for 100's more hours to maybe be ok. your time will take longer since i had rings and necklaces that increased heal xp gain..which i couldnt afford even with my 1 g i made. maybe but then if your not lucky and didnt get the jewlery and gear from people your doubling your time to get to my point. somestuff after certain levels will no longer give xp when crafting or 1 or 2 xp out of thousand needed to level next. taking more xp with each level..will play again if they let me  switch weapons from staff in combat, and the first heal skill on the pet can actually be cast every few secs as long as you have the stam to cast..and i want to not miss 4 hits in a row with a staff then only hit for 6 when a mace can hit for 40. but if you nerf mace and change ill not play either no nerfs just buff the healer.", "timestamp_created": 1676536078, "timestamp_updated": 1676536078, "voted_up": false, "votes_up": 13, "votes_funny": 2, "weighted_vote_score": "0.596522986888885498", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "108990485": {"recommendationid": "108990485", "author": {"steamid": "76561198012894979", "num_games_owned": 6377, "num_reviews": 7, "playtime_forever": 9, "playtime_last_two_weeks": 0, "playtime_at_review": 9, "last_played": 1643425469}, "language": "english", "review": "Can't complete the 2nd tutorial quest.  Right after it tells you to rotate the camera.  \"Complete\" the quest button does nothing. It also seems that my tracker still shows the previous quest i completed and my quest log shows the next...both are done...nothing happens when I click complete.  Relogging does nothing either.  Not exactly a good first impression literally 3 minutes into starting the game for the first time.\n\nI'll make a new dude and try again, but it's a thumbs down from me for the time being, for that game ending bug.", "timestamp_created": 1643425682, "timestamp_updated": 1643425947, "voted_up": false, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.595499336719512939", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1644843141, "developer_response": "Hello! Please forgive me for answering after a long period of time, the game is made by a small team of 5 people and sometimes there is not enough time for everything.\n\nI tried creating some new characters but couldn't reproduce this error. I will be glad to see you in our Discord community: https://discord.gg/NZhbfMR and we will try to study your problem in more detail and fix it.\n\nI'm sorry that you ran into problems at the very beginning. Did everything work out on the new character?"}, "99740081": {"recommendationid": "99740081", "author": {"steamid": "76561198019545543", "num_games_owned": 235, "num_reviews": 1, "playtime_forever": 260035, "playtime_last_two_weeks": 0, "playtime_at_review": 229852, "last_played": 1678752990}, "language": "english", "review": "Switching my recommendation to No ... I can no longer support the team with an abusive and childlike moderator: Kirtis. He actively trolled me in the official discord, and repeatedly deleted my comments in the support channel how to submit a ticket against the moderator team. Moderator Kirtis is friends with developers, and abuses his \"admin powers\" both in discord and in-game.\n\nDiscord mod Kirtis has in-game muted my PvP partner for 416 days. 416-day in-game mute. It happened after he said \"hello\" to Kirtis in-game global chat. No reason or justification - only because we PvP and people complain about us doing PvP. Discord mods should not have in-game admin power, and this abuse of power is sickening.\n\nI was banned from the official discord by mod Kirtis for reporting an in-game bug. I reported a bug, I was told it did not exist in the game, I replicated and showed video proof,  and I was then banned from the official discord by mod Kirtis because \"[he] couldn't replicate it so it doesn't exist\" ... video proof was ignored, and was followed-up by child-like and immature remarks from mod Kirtis.\n\nI provided video proof of many players botting in game, and I was told to stop griefing them by the moderation team. No negative actions were taken against them even though it is against ToS. Mod Kirtis told me to stop \"spamming\" the bug report channels with videos of people botting... even though I was told to report botting in that channel.\n\nI can no longer support a game that bans users for reporting bugs in an early access game, has abusive admins with no way to submit tickets. My view of the game is heavily impacted by mod Kirtis having any power and unjust actions taken against me and my PvP team in this PvP game. The PvE players complain about us doing PvP in a PvP game ... and then we get impacted with threats of full in-game bans as well. Why would a PvP player get banned in a PvP game?", "timestamp_created": 1632237096, "timestamp_updated": 1641527975, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.595385193824768066", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "91102887": {"recommendationid": "91102887", "author": {"steamid": "76561197996525927", "num_games_owned": 0, "num_reviews": 28, "playtime_forever": 10776, "playtime_last_two_weeks": 0, "playtime_at_review": 10770, "last_played": 1620517819}, "language": "english", "review": "I played this for a good 200 hours and barely had the ability to do the very first dungeon areas.  The chapel I was just able to do with wide bandages that take hours of grinding to find.  That's 200 hours to literally be able to do the first dungeon.  This games experience levelling is purposely ridiculous as if it's a joke on you.  Here's an example.  I have mostly only been able to just mine and harvest because the monsters were too difficult to do without quality bronze, or green level bone armor.  I really only did that for 160 hours, so 160 hours of just trying to level gear, only to find that the next level, iron, will take an even greater time.  I'm an efficiency player, with 5000 hours in ARMA3, 3000 in Conan Exiles, and so on.  I'm used to rolling multiple characters, and long XP grinds.  This game not only has a XP system that will require at least 2 years of grind to do the end game, but fails you 1 out of 4 times with an 87% success rate in whichever skill you are attempting.  That means the Dev is purposely being a d bag, because that math doesn't add up.  The designer is purposely trying to make this game \"hard,\" while basically turning almost everyone in the world off to this game unless your autistic and have to drive on because of your brain damage.  I really tried to get into this game.  I spent a whole month just picking things up off the ground, not being able to do the content even if I wanted to.  Beyond that, the clans camp newbie areas where the Dev made it PVP, so you lose all your gear, controlling the market so that you have to buy from them to move on since they were here since day one.  All in all, DO NOT BUT THIS GAME.  The designer is purposely making this take years to complete even if you put 10 hours a day into the game, and the map is so small you can cross it in 2 minutes literally.  That means you'll spend 1000's of hours in the same areas in a never ending failure struggle to even be able to do any of the dungeons.  Even with 200 hours, working together with 2 other people who were focusing different skills so we could cut down on time needed, we could only do Chapel, and the \"new,\" hideouts on easy.  You will not like this game, I know you think you will, but it is deceiving because the algorithms they use for skill are purposely wrong, keeping you in a never ending crafting cycle.  STAY AWAY FROM THIS DECEIVING GAME.  They've had more than a year to make tweaks, so this is an intended game mechanic.  Unless you suffer from severe autism stay away.  Everything is better than this game.", "timestamp_created": 1619698902, "timestamp_updated": 1619698902, "voted_up": false, "votes_up": 34, "votes_funny": 3, "weighted_vote_score": "0.593080818653106689", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "85550100": {"recommendationid": "85550100", "author": {"steamid": "76561197987405546", "num_games_owned": 746, "num_reviews": 35, "playtime_forever": 52, "playtime_last_two_weeks": 0, "playtime_at_review": 52, "last_played": 1611861181}, "language": "english", "review": "Really bad game at its current state. \nSorry, but, overpriced and looks pre-alpha, even for a EA.", "timestamp_created": 1611913762, "timestamp_updated": 1611913762, "voted_up": false, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.592930614948272705", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "85626704": {"recommendationid": "85626704", "author": {"steamid": "76561198359726639", "num_games_owned": 0, "num_reviews": 30, "playtime_forever": 390, "playtime_last_two_weeks": 0, "playtime_at_review": 241, "last_played": 1612208811}, "language": "english", "review": "Please note: this review was right after release. I have not played the game  since then, so it might not reflect the state of the game today.\n\n\nThe concept is great. \nThe gameplay is OK. \nMusic is baaaaaaaaaaaaaad and sounds are nauseating.\nConnection: Rubber-band. \n\nSummary: If you are a fan of MMO with emphesis on crafting and tabletop style, then wait for a while. Otherwise, pass.", "timestamp_created": 1612015224, "timestamp_updated": 1623266616, "voted_up": false, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.592024385929107666", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1613723993, "developer_response": "Hello. Thanks for your review!\nI'm sorry that you tried the game during those moments when we had server problems. After several updates, we have fixed major issues (although we are still working on improvements). We will be glad to see you again."}, "124769057": {"recommendationid": "124769057", "author": {"steamid": "76561199395689972", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 2144, "playtime_last_two_weeks": 16, "playtime_at_review": 1346, "last_played": 1713011760}, "language": "english", "review": "Love this game! Comparable to Ultima Online.", "timestamp_created": 1667304372, "timestamp_updated": 1667304372, "voted_up": true, "votes_up": 17, "votes_funny": 1, "weighted_vote_score": "0.590328991413116455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148422456": {"recommendationid": "148422456", "author": {"steamid": "76561198177004670", "num_games_owned": 94, "num_reviews": 13, "playtime_forever": 1151, "playtime_last_two_weeks": 0, "playtime_at_review": 266, "last_played": 1698224544}, "language": "english", "review": "Awesome base building, survival, pet, trading,pve with pvp in same map.....\nBut there are too many problems in this game that need to be fixed and rebalanced\n\n-Lag: sometimes and somewhere there is a lag problem like when i enter a dungeon, the first few minutes everything is fine but after that the game lag as fk, only thing stop that lag is to get out and can't get in again\n-Stamina and food: don't really need 5 type of foods to fills your stomach lol, well different foods type is good but pls just make 1 food bar satiety and i can eat whatever to fill, like wtf early i just eat 3 veg then just 2 sec my char feel hunger again???? also for stamina too,  i just hunt 2 fox and 1 goat and my stamina runout and feel hunger again so i have to eat like 2-3 different foods type to hunt again, never play a game your spend more than eating and wait for stamina restored than doing anything, and dungeon too, every each fight with 1 monster i have to wait like a minute for stamina restored so i can fight again\n\nThis game is so dead now, not much player around and what you guys need is new player and i'm sure 90% quit after few hours playing if nothing change to support newbie\nDungeon so ez but take me nearly an hour, 40 minutes waiting for recover and 6 minutes actual fighting", "timestamp_created": 1697608015, "timestamp_updated": 1697723624, "voted_up": false, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.583828926086425781", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "130699268": {"recommendationid": "130699268", "author": {"steamid": "76561197968862883", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 10113, "playtime_last_two_weeks": 0, "playtime_at_review": 772, "last_played": 1710902091}, "language": "english", "review": "This game isn't for everyone, and in fact it's target audience is probably quite niche. But for those who enjoy the type of gameplay Wild Terra 2 caters to, they'll find a lot of enjoyment to be had here. If you're after an MMORPG that's all about dungeons, raids and BiS meta gaming, then this likely isn't for you.\n\nThis game is intentionally SLOW. It's intentionally GRINDY. It's an open-world sandbox that's entirely-player driven with a heavy emphasis on crafting, gathering and survival. It has a very old-skool feel to it, and is akin to a more modern version of older MMO's such as Ultima Online, OS Runescape, Legend of Mir, Myth of Soma etc.\n\nThe community is small, dedicated and very welcoming, and is all part of the charm that this game seems to have. Be warned, the game is very rough around the edges and there's a lot of bugs present. But I'm getting so much enjoyment from this title so far, and there's been nothing to detract from that. The combat is fairly basic, but that's all it needs to be, really. \n\nIf you're looking at this game and think it may appeal to you, then you'll probably be able to find some fun here. Looking at the negative reviews below, some are from people with hundreds and hundreds of hours spent in the game - there must be something here that's caused them to play that much! Give it a go I say.", "timestamp_created": 1673531295, "timestamp_updated": 1673531295, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.580525457859039307", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "154272828": {"recommendationid": "154272828", "author": {"steamid": "76561198079400842", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 4232, "playtime_last_two_weeks": 0, "playtime_at_review": 4232, "last_played": 1703303343}, "language": "english", "review": "The game is decent at best.  You can gather, craft, fight about 10 different mobs on a shoddy square map.  \nThere are so many missing features that were in games back in the day like UO that had auto attacking that this game doesnt. If you criticize or write feedback, you are ostracized from the playerbase, which is VERY small.  I see noone on US West, I have only spoken to one person in two weeks.  I recieved a mute from official discord mods for calling out a white knight, as i would like to expose the weaknesses of the game. This game is dying because nothing of substance is being added other than seasonal purchases.\n\nIn my opinion, this game should be removed from steam. I would ask for a refund but, I did manage to play it for 70 hours. I no longer wish to play it because of the lack of playerbase, the official discord moderation, and nothing being added to the game (other than purchasable items).", "timestamp_created": 1703399072, "timestamp_updated": 1703399072, "voted_up": false, "votes_up": 13, "votes_funny": 1, "weighted_vote_score": "0.580169498920440674", "comment_count": 16, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "85512266": {"recommendationid": "85512266", "author": {"steamid": "76561198240160306", "num_games_owned": 387, "num_reviews": 4, "playtime_forever": 9322, "playtime_last_two_weeks": 0, "playtime_at_review": 1089, "last_played": 1613735459}, "language": "english", "review": "Played pretty much all day and night since I got it. Verry addictive. It's like a fusion of Albion and Runescape.", "timestamp_created": 1611856034, "timestamp_updated": 1611856034, "voted_up": true, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.578862786293029785", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "98659448": {"recommendationid": "98659448", "author": {"steamid": "76561197965093257", "num_games_owned": 0, "num_reviews": 40, "playtime_forever": 21230, "playtime_last_two_weeks": 7, "playtime_at_review": 10390, "last_played": 1713699340}, "language": "english", "review": "Great game, some flaws but expected in a EA release. PVP system still needs a LOT of work because new players are picked on by the established players a bit too much. New players should always have safe hunting/gathering areas till they progress a bit. Crafting system is a blast and overall it is fun. Avoid the idiot Gankers and never carry anything in inven that you can't lose. Enjoy.", "timestamp_created": 1630582390, "timestamp_updated": 1630582390, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.577203452587127686", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "128246472": {"recommendationid": "128246472", "author": {"steamid": "76561197970123181", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 257261, "playtime_last_two_weeks": 3165, "playtime_at_review": 140704, "last_played": 1713765523}, "language": "english", "review": "Awful stay well clear !", "timestamp_created": 1670618237, "timestamp_updated": 1670618237, "voted_up": false, "votes_up": 10, "votes_funny": 8, "weighted_vote_score": "0.577005922794342041", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "86022082": {"recommendationid": "86022082", "author": {"steamid": "76561198018520356", "num_games_owned": 687, "num_reviews": 50, "playtime_forever": 87600, "playtime_last_two_weeks": 0, "playtime_at_review": 4099, "last_played": 1712389056}, "language": "english", "review": "This game has a lot of promise. I love the crafting system. The way it works is just amazing, and there are things that I discovered myself or found out on discord about crafting that had me shaking my head in disbelief of why I didn't think that's how it works or how it just made my crafting a lot better and faster. I'm not going to spoil it, but crafting is great. Yes, it takes a lot of time, but this is an MMO, and things are grindy in MMOs, or otherwise, you have them beat in just a few hours.\n\n90% of the negative reviews are about the server lag we had in the first couple of days; those issues have been fixed, and the devs are always improving the performance. I got to warn you that if you play in a high refresh rate monitor, you are better off capping at 60hz and turning on vsync, or otherwise it will use too many resources on your graphics card for nothing, the visuals are OK, but it's not something to write home about. \n\nThe whole world is Open PVP, but only specific zones are areas where you lose your inventory if you die, players can technically attack you anywhere, but they usually leave you alone in non-loot zones.\n\nFor us, PVE folks, it's harder because lots of higher-end resources can only be found in full loot zones and higher tier mobs or bosses are in full loot zones. I had the experience of being killed in a looting zone when I was trying to train my gear, just because some high geared person was guarding a boss.\n\nThere are no actual combat levels in the game; you train whatever you want to use. There is currently light armor and heavy armor, and you need to level each separately, with each set having its unique feel and boosts. The same goes for weapons, and you have to train the type of weapon you want to use like Bows, Spears, Swords, etc...\n\nOverall I highly recommend this game; try it and don't let the tutorial island drive you away; some people actually wished they had stayed longer there, all the progress in the tutorial island carries over because you will end up packing your base and take it with you to the main world. Oh yes, you can have your own piece of land, there are 3 different sizes you can have, and whenever you feel like you want to move to another spot, you can just hit move out. Everything gets packed, and it shows as one item in your inventory until you put it back out. You have to unpack everything manually.", "timestamp_created": 1612550640, "timestamp_updated": 1612550640, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.576124906539916992", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "97052803": {"recommendationid": "97052803", "author": {"steamid": "76561198005572605", "num_games_owned": 0, "num_reviews": 24, "playtime_forever": 34916, "playtime_last_two_weeks": 0, "playtime_at_review": 3745, "last_played": 1677520064}, "language": "english", "review": "Far from perfect with some horrible crashes and lag but I have to say I'm really enjoying it. \nThere to appears to be very little content until you realise it takes around 20 hours to reach of the 4 tiers of 'tech'. Dev's are still busy on it and the community, well on EU2 at least, are very friendly.", "timestamp_created": 1628264661, "timestamp_updated": 1628264661, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.57516777515411377", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "131973285": {"recommendationid": "131973285", "author": {"steamid": "76561198100375005", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 692, "playtime_last_two_weeks": 0, "playtime_at_review": 692, "last_played": 1670321104}, "language": "english", "review": "I would get a refund if I could, once you get a few hours in and realize there really is no game. Sigh the city was my biggest disappointment it is a road with a few npcs. And I mean a road lol looks huge on the map. Don't waste your money.\n", "timestamp_created": 1675212265, "timestamp_updated": 1675212265, "voted_up": false, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.57323145866394043", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "131363389": {"recommendationid": "131363389", "author": {"steamid": "76561198138507008", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 8487, "playtime_last_two_weeks": 0, "playtime_at_review": 3208, "last_played": 1677900868}, "language": "english", "review": "There are many skills to try out. That was the most interesting thing for me. However, the whole world is very small and gets boring after a bit. The grind is crazy. It is wayyyy to grindy. If you like this, go for it. I can't do it any more.", "timestamp_created": 1674419157, "timestamp_updated": 1674419157, "voted_up": false, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.572736501693725586", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "87643624": {"recommendationid": "87643624", "author": {"steamid": "76561197968593272", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 1222, "playtime_last_two_weeks": 0, "playtime_at_review": 1222, "last_played": 1614563999}, "language": "english", "review": "This game is hot garbage. Once you get through the starter island it's nothing but ass jammed full of player housing and only a few XP areas that you will get instantly PKed in.", "timestamp_created": 1614564185, "timestamp_updated": 1614564185, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.571503400802612305", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "110541974": {"recommendationid": "110541974", "author": {"steamid": "76561198184817698", "num_games_owned": 1375, "num_reviews": 69, "playtime_forever": 1393, "playtime_last_two_weeks": 0, "playtime_at_review": 1393, "last_played": 1645248440}, "language": "english", "review": "Interesting MMORPG game, a beautiful filled world, interesting and exciting gameplay, crafting, raids, all in accordance with the canon. BUT there is one problem - early access, there are a lot of bugs in the game, optimization problems, small online. The game is developing, updates are coming out, and we can only wait for it to come out of early access. However, the game is addictive with the beauty of the middle ages and familiar gameplay, so it's worth a try.", "timestamp_created": 1645254382, "timestamp_updated": 1645254382, "voted_up": true, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.571304142475128174", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "96160695": {"recommendationid": "96160695", "author": {"steamid": "76561198064572072", "num_games_owned": 126, "num_reviews": 5, "playtime_forever": 12742, "playtime_last_two_weeks": 0, "playtime_at_review": 3316, "last_played": 1640997728}, "language": "english", "review": "Great game. As potential. If you like grinding games, this is definitely for you. Gather resources, craft and dungeon for hours.\n\nIf you don't like working for your stuff, this game isn't for you. Go play World of Warcraft. This is for hardcore grinders that enjoy the grind.", "timestamp_created": 1626915559, "timestamp_updated": 1626922676, "voted_up": true, "votes_up": 13, "votes_funny": 1, "weighted_vote_score": "0.566961109638214111", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "97222867": {"recommendationid": "97222867", "author": {"steamid": "76561197993278561", "num_games_owned": 181, "num_reviews": 66, "playtime_forever": 19101, "playtime_last_two_weeks": 0, "playtime_at_review": 5212, "last_played": 1630009481}, "language": "english", "review": "This game is defently not for everyone.\nIt is for me thou,I love it.\nIt has major grinding,but in my eyes done in a fun way.\nIt has a small population(I live in EU1)but thats just nice for the intimate atmosphere,almost like a small village where everyone knows each other help etc\nI did get ganked one time.Lost tons of stuff,pretty sure the ganker was a happy camper.. but thats the only pvp I had while I was playing so far.\nDevs seem to be working on this,as updates are coming slowly but surely.\nGraphics are nice not manga anime.\nAs this is still not released game many stuff missing and bugs are normal encounter.\nBut all in all very addicting fun game to sink many hours into.\n\nEDIT:I changed my review to negative as you can get harrased in this game,and also in the games discord.All your stuff in inventory will be stolen except stuff you wear will youll need to repair on your own.they shoudl write this is a PVP based game and not cover at as MMORPG which is a lie baiting people.", "timestamp_created": 1628500886, "timestamp_updated": 1630009242, "voted_up": false, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.565217375755310059", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "85511361": {"recommendationid": "85511361", "author": {"steamid": "76561197997379912", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 41827, "playtime_last_two_weeks": 0, "playtime_at_review": 29271, "last_played": 1614297125}, "language": "english", "review": "Quite a good game. Ive been playing for about a month in the late beta.  I was attracted to this game because people were saying they were getting Ultima vibes from it.  It is a persistent state world, with player and guild housing, including permissions, has PvP, and has broad and deep crafting.  The core of the dev group are UO fans and worked on EQ2, Asherons Call and STO I think it was.  The game definitely has that feel and even the interface is a clear nod to UO and other elements of the aforementioned games are present, although its been a LONG time since I played Asheron's Call.  And I don't think I played the Star Wars game that these devs worked on.\n\nThere are safe zones where if you die, you dont lose anything.  In other areas, your corpse can be looted.  PvP can take place anywhere, in 'safe zones' and in 'pvp zones'.  But, if you're attacked in a safe zone, youll faint, wake up in a few seconds at half health and nothing dropped.  So, there's no incentive for people to do that  unless you run or but even if you're kill.  You can build walls around your plot.  But, no part of your plot can be attacked or damaged.\n\nIm a crafting type and I liked the fact that theres no skill cap and that my avatar can take on all skills.  Also, its a skill-based system.  Use the skill, gain xp in the skill.  Theres good agriculture, seeds, fertilizer and the chance to 'upgrade' a seed to a different fruit or vegetable.  Also, many meals to be cooked.  Of course, smithing, carpentry, masonry, jewelcrafting, pottery, item ID, animal taming (not very detailed [yet?]), fishing (challenging.  Like a mini-game.   Takes some experimentation and practice (or just read XanXia's Fishing Guide), Jrewelcrafting, Healing, Cartography (not implemented yet?),.  Leatherworking is interesting.  There are 5+ stages.  solutions to be made and soaked in vats.  Alchemy is there also, I havent done much with it because i joined the beta kinda late.  I also like that i can make and repair my own tools and machines.  Theres another category called Exotics that I have not delved into vey far.  Late game craftable exotic gear and weaps. \n\nThe guild system works well.  We got a guild up and running and partying is easy and effective showing tags along the edge of the screen to where your party members are.  Stability has been good overall and the last update that went in about 45 minutes before the Steam launch improved all of our pings.\nThe plot management is epic.  You start with a small empty plot. collect resources, and start practicing easy items to raise skill.  Then, easy to lay down and move machines or boxes.  You can even pickup your *entire plot* (taking up 1 slot in your pack), and move it someplace else.  You can upgrade right in place (as long as theres space. yes, this creates issues). \n There a simple set of necessary components to build a house, or shed, front porch, living area, etc.  I built up to a 4th floor on the test server in beta (vids on YT).  But the 4th story isnt buildable.  its only like 3.5 stories.  minor bug with stairs. but easy to work around by re-logging.\n\nAfter people started joining en masse, there were some minor issues with spawn rates.  not enough mobs for everyone.  the devs  adjusted spawn rates and made several updates over the 48 hours prior to Steam launch.  Most updates only lasting maybe 5-10 minutes and most people did not lose any time.  On one occasion today, about 12 hours before launch, the server came down and we got a  message in Discord that there was a database problem and the servers could be down a while.   but, it was back up in about 30 minutes with minimal, if any rollback time.  In some cases, *some* people experienced lost time (or a 'rollback') while others didnt.  This was just before the database error.  But we didnt hear of much talk after it came back up.  So, as with any MMORPG launch, issues are to be expected.  But, so far, and now even that Steam players are logging in, things are still smooth.  Im enjoying it and considering getting a second account for gathering.\nOh, i forgot, all the bling, tricked out plot buildings, clothing and mounts are very popular.  Im not much into that. but most everyone else is and they seem to really like it.", "timestamp_created": 1611854955, "timestamp_updated": 1611856045, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.563773632049560547", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "88734505": {"recommendationid": "88734505", "author": {"steamid": "76561198141199833", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 3098, "playtime_last_two_weeks": 0, "playtime_at_review": 1629, "last_played": 1617316591}, "language": "english", "review": "****DO NOT BUY***** Tutorial island takes 2 hrs once on main land you will be griefed by pkers abusing a new criminal system that was supposedly to help stop griefing. Yet, Pkers have found away to abuse it and take your gear in PVE SAFE AREAS.. DO NOT BUY", "timestamp_created": 1616197662, "timestamp_updated": 1616197662, "voted_up": false, "votes_up": 13, "votes_funny": 2, "weighted_vote_score": "0.563155531883239746", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "98851072": {"recommendationid": "98851072", "author": {"steamid": "76561197999172825", "num_games_owned": 74, "num_reviews": 11, "playtime_forever": 113831, "playtime_last_two_weeks": 0, "playtime_at_review": 108675, "last_played": 1702159832}, "language": "english", "review": "One of those games that requires endless play to be top tier with the 7 other top tier players on your server (lucky to have 7) of which 5 who wouldn't piss on you if you were on fire.  Attracts the creme de la creme of personalities. Avoid.", "timestamp_created": 1630875460, "timestamp_updated": 1630875460, "voted_up": false, "votes_up": 14, "votes_funny": 3, "weighted_vote_score": "0.562223076820373535", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "109854944": {"recommendationid": "109854944", "author": {"steamid": "76561198066364812", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 57592, "playtime_last_two_weeks": 0, "playtime_at_review": 26195, "last_played": 1695960501}, "language": "english", "review": "Too many negative reviews, this game does not deserve them. It is for a niche group of players,  95% of the negative reviews do not fit the niche. It is grindy. This is not New World where you get max level in anything in 2 weeks. This game takes actual years. Think Runescape, with bigger, stackable inventory. And even that is kinder than this. This game will require your blood. Your sweat. Your tears. Your sacrifices to RNGeezus. You will learn to enjoy the pain of rubbing your face against the grindstone. You will come out stronger than ever before, and you will be glad you did it. Please accept the negative reviews with a grain of salt, everyone will have their own opinion and quite often, they're just mad they sucked at it.", "timestamp_created": 1644417282, "timestamp_updated": 1644417282, "voted_up": true, "votes_up": 30, "votes_funny": 6, "weighted_vote_score": "0.562028050422668457", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "101118034": {"recommendationid": "101118034", "author": {"steamid": "76561198023636046", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 34, "playtime_last_two_weeks": 0, "playtime_at_review": 33, "last_played": 1634353643}, "language": "english", "review": "uninstalled until they changed priority from PVP to PVE", "timestamp_created": 1634353542, "timestamp_updated": 1636011961, "voted_up": false, "votes_up": 20, "votes_funny": 4, "weighted_vote_score": "0.561631202697753906", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "89424197": {"recommendationid": "89424197", "author": {"steamid": "76561197986858562", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 3671, "playtime_last_two_weeks": 0, "playtime_at_review": 3671, "last_played": 1613377663}, "language": "english", "review": "Do yourself a favor and DO NOT buy this game! Its not worth it at all.\nP2W - griefing - unbalanced PVP in general - devs who accept trades for RL cash and even appreciate them.\n\nEven a few weeks after EA release, the playerbase is already going down very fast.\n\nGG byebye", "timestamp_created": 1617187682, "timestamp_updated": 1617187682, "voted_up": false, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.561443567276000977", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "85731424": {"recommendationid": "85731424", "author": {"steamid": "76561197996700367", "num_games_owned": 442, "num_reviews": 7, "playtime_forever": 262, "playtime_last_two_weeks": 0, "playtime_at_review": 262, "last_played": 1612145608}, "language": "english", "review": "The game rubberbands and you wait a long time to get spawns like skeletons. That said, I played UO for years, so I was fine with that. What I'm not fine with is being unable to log in for 48 hours and the game saying I was away too long, so it released my plot of land to someone else. Not cool.", "timestamp_created": 1612145855, "timestamp_updated": 1612145855, "voted_up": false, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.560118734836578369", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "85523054": {"recommendationid": "85523054", "author": {"steamid": "76561198081193827", "num_games_owned": 238, "num_reviews": 12, "playtime_forever": 3096, "playtime_last_two_weeks": 0, "playtime_at_review": 242, "last_played": 1612424836}, "language": "english", "review": "I tamed a fox and named it Senko.", "timestamp_created": 1611869837, "timestamp_updated": 1611869837, "voted_up": true, "votes_up": 15, "votes_funny": 5, "weighted_vote_score": "0.55943906307220459", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "125673537": {"recommendationid": "125673537", "author": {"steamid": "76561198055300594", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 25635, "playtime_last_two_weeks": 0, "playtime_at_review": 5179, "last_played": 1705396506}, "language": "english", "review": "The most enjoyable MMORPG I've played since Ultima Online. I've tried all the MMO's I could get my hands on, none of them stick but I'm hooked on this game.  So much to do from crafting, gathering, random dungeons and custom player housing/bases. Has a small and helpful community. Lacking in the PvP department though but the small dev team (of four?) seem to be working on that. Music and ambiance is also nice.", "timestamp_created": 1668756577, "timestamp_updated": 1668756577, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.558976590633392334", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "102295205": {"recommendationid": "102295205", "author": {"steamid": "76561198082157994", "num_games_owned": 219, "num_reviews": 1, "playtime_forever": 22451, "playtime_last_two_weeks": 0, "playtime_at_review": 14703, "last_played": 1697667078}, "language": "english", "review": "This game is a total disrespect with those who paid for it. Servers restarts everyday at midnight and almost EVERYDAY a bug happens which makes the servers not turn on again. So while the game is offline for 7 hours, the devs are sleeping comfy on their bed.\n\nTo resume:\nServers goes off for 7 hours almost EVERYDAY and devs does nothing to fix it and prefers to sleep.", "timestamp_created": 1636164780, "timestamp_updated": 1636164780, "voted_up": false, "votes_up": 16, "votes_funny": 1, "weighted_vote_score": "0.558770596981048584", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "123053815": {"recommendationid": "123053815", "author": {"steamid": "76561197988024524", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 237515, "playtime_last_two_weeks": 0, "playtime_at_review": 179516, "last_played": 1711878514}, "language": "english", "review": "This game has been in development a long time and the small team of creators have been moving it in a very positive direction, the foundations are great, nice graphics and great crafting system that can be built up a lot in future. The DEA cycle has resulted in a drop off in players which has hurt the game pre-release, the lack of a complete guild system has also limited the long term enjoyment, hence why several reviews have 100s of hours but still negative, its a great game they are just frustrated. You will love the early game, especially if you find a nice group of friends to adventure with. I am very optimistic about the game being very enjoyable long term and will keep playing. \n\nSee you in game after release soon friends!\n\nAll EU players -  https://discord.gg/7r8VRBkCKA", "timestamp_created": 1664526659, "timestamp_updated": 1667306635, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.558496296405792236", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "144302090": {"recommendationid": "144302090", "author": {"steamid": "76561198051497554", "num_games_owned": 0, "num_reviews": 54, "playtime_forever": 2059, "playtime_last_two_weeks": 0, "playtime_at_review": 2059, "last_played": 1615855805}, "language": "english", "review": "Wild Terra 2: New Lands, the sequel to the original sandbox MMORPG, offers a mixed experience that falls somewhere between the realms of potential and disappointment. With its blend of survival mechanics and medieval gameplay, the game presents an average adventure that leaves players with a sense of mediocrity rather than exhilaration.\n\nA World of Potential, Held Back: 2.5/5\n\nWild Terra 2 introduces players to a vast open world ripe for exploration and adventure. The potential for engaging quests, resource gathering, and crafting systems is evident, yet it fails to reach the heights it aspires to. While the idea of building, fortifying, and surviving in a medieval landscape is intriguing, the execution falls short of fully realizing the game's grand ambitions.\n\nUnpolished Gameplay Mechanics: 2.3/5\n\nThe core gameplay mechanics in Wild Terra 2 feel unpolished and lack the depth needed to keep players engaged for extended periods. The survival elements, while present, fail to create a truly immersive experience. The combat system lacks the finesse and excitement of more refined MMORPGs, leaving battles feeling lackluster and repetitive.\n\nUninspired Progression and Exploration:\n\nThe progression and exploration aspects of the game fail to evoke a sense of wonder or accomplishment. While the prospect of discovering new lands and resources is enticing, the execution lacks the excitement and rewards that motivate players to venture further.\n\nLackluster Community Interaction: 2.4/5\n\nWild Terra 2's community interaction is hindered by the game's lukewarm gameplay mechanics. The lack of depth in activities and interactions creates a barrier to forming meaningful connections with other players. The sense of camaraderie and collaboration that often defines MMORPGs is sadly lacking, making the online experience feel isolating.\n\nTechnical Hurdles and Performance: 2.2/5\n\nThe game's technical performance leaves much to be desired. Frequent glitches, bugs, and server issues detract from the overall experience, causing frustration and hindering players' ability to fully immerse themselves in the world. These technical hurdles dampen the potential enjoyment and contribute to a sense of disappointment.\n\nConclusion: 2.3/5\n\nWild Terra 2: New Lands presents a world of potential that's sadly held back by unpolished gameplay mechanics, uninspired progression, and technical challenges. While the concept of a medieval sandbox MMORPG is intriguing, the execution falls short of delivering a truly captivating experience. If you're seeking an adventure that immerses you in a dynamic world of survival and exploration, Wild Terra 2 might offer some fleeting moments of enjoyment, but it ultimately fails to rise above the realm of mediocrity.", "timestamp_created": 1692148763, "timestamp_updated": 1692148763, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.557434380054473877", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "85636772": {"recommendationid": "85636772", "author": {"steamid": "76561197969394000", "num_games_owned": 106, "num_reviews": 4, "playtime_forever": 19740, "playtime_last_two_weeks": 0, "playtime_at_review": 1588, "last_played": 1616434811}, "language": "english", "review": "Good game so far.  Old school feel.  Server has latency issues, but is being worked on.  Devs are responsive!  excited to see if they get the server issues ironed out.\n\nGathering/Crafter dream game.  Nice crafting grind thats exciting to progress in", "timestamp_created": 1612025613, "timestamp_updated": 1612025613, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.556147456169128418", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "86579995": {"recommendationid": "86579995", "author": {"steamid": "76561198067128325", "num_games_owned": 127, "num_reviews": 8, "playtime_forever": 10788, "playtime_last_two_weeks": 0, "playtime_at_review": 7810, "last_played": 1616768166}, "language": "english", "review": "This game has a very specific group of players in mind, it is by no means for everyone.  There is a heavy emphasis on PvP, gathering, and crafting.  The only real economy is player based and most content for the game is in areas that present problems for people who aren't equipped (physically and emotionally) to deal with pkers.  It has a very in depth crafting system, and a good amount of skills to learn.  It's difficult for a solo player, so it's best to join a good guild or play with friends.  However you look at it this game is a grind to get any sort of progression, and it is not easy for new players due to all the high geared pvpers around.  So to sum up; If you like grindy games that are difficult with a heavy emphasis on PvP then you'll love this game, but if you don't like the grind or the pvp, or the lack of any sort of story line then I don't think this game is for you at this time", "timestamp_created": 1613256060, "timestamp_updated": 1613256060, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.555438518524169922", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "85773057": {"recommendationid": "85773057", "author": {"steamid": "76561198204254552", "num_games_owned": 199, "num_reviews": 16, "playtime_forever": 2577, "playtime_last_two_weeks": 0, "playtime_at_review": 2318, "last_played": 1612724522}, "language": "english", "review": "Wait.\n\nBut Follow.\n\nThey have NAILED the Crafting system in this game. The back-end needs a lot of work, and they are working on it.\n\nWait.\n\nBut Follow.", "timestamp_created": 1612203045, "timestamp_updated": 1612203045, "voted_up": true, "votes_up": 12, "votes_funny": 2, "weighted_vote_score": "0.554572820663452148", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "131492344": {"recommendationid": "131492344", "author": {"steamid": "76561198104956144", "num_games_owned": 307, "num_reviews": 73, "playtime_forever": 11745, "playtime_last_two_weeks": 0, "playtime_at_review": 3658, "last_played": 1707206662}, "language": "english", "review": "I really like this game. It’s a great substitute for Legends of Aria I used to play. This is a sandbox MMO so it is grindy, but that’s expected. If you want to strictly PvE then join NA new West server or legacy servers. I tried both and they are a bit underpopulated for my liking. Just joined new NA East server and it seems like more fun for me since I am looking for a mixture of PvE and PvP content. Who doesn’t want to grind and then lose everything to another player in a PvP zone?", "timestamp_created": 1674604313, "timestamp_updated": 1674604313, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.554073452949523926", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "85661140": {"recommendationid": "85661140", "author": {"steamid": "76561198043466447", "num_games_owned": 113, "num_reviews": 3, "playtime_forever": 1075, "playtime_last_two_weeks": 0, "playtime_at_review": 672, "last_played": 1674419819}, "language": "english", "review": "The game is great! It's very relaxing to go around and gather, similar to RuneScape. Building your land (dominium) is really satisfying. Taming animals is an interesting mechanic too. I think my favorite thing about WT2 is the aesthetic of it. I love the contrast between the \"chosen one\" MMOs and this MMO where you are a survivalist just looking to, well, survive. I'm extremely interested in where this game goes once people have the best gear and can start PvPing regularly.\n\nMy only problems with the game are the RNG and the lag. There's a chance that the nodes you gather can just break, due to pure luck. Crafting an item? Hope it doesn't break or you have to go and farm again. I really hope this feature is removed entirely, or changed to a skill-based system. Failing due to luck is extremely irritating.\nThe lag is self-explanatory. I can only assume the devs didn't expect so many people to be playing. Rubberbanding is a common issue, and the animals in the game are very glitchy.\n\nOverall, 6/10. Easily a 7/10 when they fix the lag. Without the RNG systems? 8/10.", "timestamp_created": 1612055689, "timestamp_updated": 1612055689, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.553120255470275879", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "85733852": {"recommendationid": "85733852", "author": {"steamid": "76561197970607902", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 124, "playtime_last_two_weeks": 0, "playtime_at_review": 124, "last_played": 1612125686}, "language": "english", "review": "Servers are too unstable at this time, making it almost impossible to play.", "timestamp_created": 1612149445, "timestamp_updated": 1612149445, "voted_up": false, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.551864564418792725", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "87637422": {"recommendationid": "87637422", "author": {"steamid": "76561198330317936", "num_games_owned": 0, "num_reviews": 60, "playtime_forever": 501, "playtime_last_two_weeks": 0, "playtime_at_review": 490, "last_played": 1632124927}, "language": "english", "review": "The developer team is childish, immature and toxic just as much as the community in the game. \nBut before I get to that, I will say that this games mechanics and crafting system is awesome, in depth, and has so much potential to become something really refreshing. \nCombat is iffy, but has room for improvement. Open PvP is nice and the areas are pretty, but again, has a lot of room for improvement. \nNow to the reason im not giving you a positive review.\nIn global chat (Im in NA west, idk about other servers)\nIs filled with Racism, Sexism, toxicity, and everything in between. There are players blocking gates and entrances and essentially creating a monopoly, by bribing others with guild invites and payment to be let through. If not you just get near and get killed by a group, just for fun. They dont get anything out of it besides the materials you spent and hour or more farming. \nI go and report it to the developers, and put it in the public chat about the issues I was seeing, and others were seeing. I get some cheesy reply from the devs \"Moderators cant be on 24/7\", and then a bombardment of rude, toxic comments from their discord community, completely berating me, and everyone who is complaining, hiding behind the facade of \"Its the internet you shouldnt have thin skin\", and the developer (WHO MIND YOU JUST REPLIED TO ME IN THE SAME THREAD) Completely disregards it. \nDevelopers dont care about you. Look at their past games, and their reviews. Its the same thing over, and over again. \nThey dont care about how the community is, or works. They only care about the money you are giving them. \nIf you pay for backer packages, you get \"special rewards\", like where you dont drop anything when you die (that $129.99). \nIts even PAY TO WIN. \nOnly reason I purchased it, was because of what i mentioned in the first place. Its an awesome game, it can be a really good mmo, but with the community and developers mind set, there is no way this game is gonna go anywhere. \nSucks I wasted $35 bucks on this, but I hope mine and everyone elses review can at least save others from wasting their money.", "timestamp_created": 1614553523, "timestamp_updated": 1614553523, "voted_up": false, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.55093681812286377", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "85644745": {"recommendationid": "85644745", "author": {"steamid": "76561198026593930", "num_games_owned": 119, "num_reviews": 33, "playtime_forever": 18613, "playtime_last_two_weeks": 0, "playtime_at_review": 569, "last_played": 1614229438}, "language": "english", "review": "Negative reviews with +60 hours are the ones who duped items, got banned and lost their +100 $ pack.\nNegative reviews with -10 hours are the ones who jumped into the game when there were server issues.\nOf course there will be problems but it's not nearly as bad as some of the reviews claim to be.", "timestamp_created": 1612034590, "timestamp_updated": 1612034590, "voted_up": true, "votes_up": 22, "votes_funny": 1, "weighted_vote_score": "0.549404442310333252", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "92328119": {"recommendationid": "92328119", "author": {"steamid": "76561198385603802", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 82223, "playtime_last_two_weeks": 0, "playtime_at_review": 48400, "last_played": 1657028330}, "language": "english", "review": "this game is amazing, its a nice relaxed game with awesome people playing it, its an early game so lots more fun to come. 10/10 would recomend it! got over 800 hours stil loving every second of it!", "timestamp_created": 1621548803, "timestamp_updated": 1621548803, "voted_up": true, "votes_up": 5, "votes_funny": 2, "weighted_vote_score": "0.549180328845977783", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "136914185": {"recommendationid": "136914185", "author": {"steamid": "76561198044373276", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 84005, "playtime_last_two_weeks": 0, "playtime_at_review": 83997, "last_played": 1698196995}, "language": "english", "review": "The kind of devs that do not appreciate their backers and I would consider scammers.", "timestamp_created": 1681836750, "timestamp_updated": 1681836750, "voted_up": false, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.548159539699554443", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "85836879": {"recommendationid": "85836879", "author": {"steamid": "76561198044822070", "num_games_owned": 46, "num_reviews": 17, "playtime_forever": 14134, "playtime_last_two_weeks": 0, "playtime_at_review": 2359, "last_played": 1659093399}, "language": "english", "review": "There were lag problems in the first days but it's a lot better after the last patch. I've been playing a lot every day, the crafting/gathering is really well done and a ton of stuff to craft/build/gather.\n\nThe game is still on training wheels but constant updates make it better by the day.", "timestamp_created": 1612290562, "timestamp_updated": 1612290562, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.547983288764953613", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "89731749": {"recommendationid": "89731749", "author": {"steamid": "76561197997482320", "num_games_owned": 0, "num_reviews": 32, "playtime_forever": 548, "playtime_last_two_weeks": 0, "playtime_at_review": 548, "last_played": 1612613663}, "language": "english", "review": "Its a mix between a scam since the DEVs ban people who speak up about the mod's behaviour, and boring since there is no more content after the tutorial.  Literally!", "timestamp_created": 1617574455, "timestamp_updated": 1617574455, "voted_up": false, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.546958625316619873", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "94804107": {"recommendationid": "94804107", "author": {"steamid": "76561198125795303", "num_games_owned": 228, "num_reviews": 23, "playtime_forever": 4409, "playtime_last_two_weeks": 0, "playtime_at_review": 4229, "last_played": 1702779583}, "language": "english", "review": "It's most definitely not am instant gratification game, but when you build something it feels like an accomplishment. USEast has a vibrant community of snarky trolls and the chats there are priceless. It might take you hours to craft that garbage bronze pickaxe, but its your garbage pickaxe, until you wander into the wrong zone... then it might be my garbage pickaxe.", "timestamp_created": 1625140692, "timestamp_updated": 1625140692, "voted_up": true, "votes_up": 3, "votes_funny": 6, "weighted_vote_score": "0.546073973178863525", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "85881980": {"recommendationid": "85881980", "author": {"steamid": "76561198016112762", "num_games_owned": 221, "num_reviews": 5, "playtime_forever": 47727, "playtime_last_two_weeks": 0, "playtime_at_review": 6788, "last_played": 1697967582}, "language": "english", "review": "Great start to this sandbox mmo ...\n\nLikes:\nYou can do any profession, use any weapons,armor, each has there own levels, the more you do, the higher said levels go\n\n\nDislike:\nMain Map is currently to small, but I am pretty sure it will grow in size as time passes on.", "timestamp_created": 1612357800, "timestamp_updated": 1613005849, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.544512927532196045", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}}, "query_summary": {"num_reviews": 4, "review_score": 5, "review_score_desc": "Mixed", "total_positive": 347, "total_negative": 233, "total_reviews": 580}, "cursors": {"AoIIPwXqzXbqyOkE": "Mon Apr 22 23:49:37 2024"}}
