{"reviews": {"158207094": {"recommendationid": "158207094", "author": {"steamid": "76561198060035913", "num_games_owned": 0, "num_reviews": 58, "playtime_forever": 25, "playtime_last_two_weeks": 0, "playtime_at_review": 25, "last_played": 1707800347}, "language": "english", "review": "A \"game\" that has been completely abandoned by the devs and the community long, long ago.  \nCan ONLY play by joining a server.  Good luck finding a server that has anything more that skeletons and tumble weeds.\n\nStill having this game listed on steam is nothing short of a scam.", "timestamp_created": 1707800515, "timestamp_updated": 1707800515, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.572039365768432617", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158138182": {"recommendationid": "158138182", "author": {"steamid": "76561198140601382", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 11570, "playtime_last_two_weeks": 0, "playtime_at_review": 11107, "last_played": 1711001840}, "language": "english", "review": "Game was fun up until the devs abandoned the game and released an update that just faked everyone out 3 years after they abandoned it.", "timestamp_created": 1707719740, "timestamp_updated": 1707719805, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.541984736919403076", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "162967617": {"recommendationid": "162967617", "author": {"steamid": "76561197978351003", "num_games_owned": 0, "num_reviews": 111, "playtime_forever": 260, "playtime_last_two_weeks": 260, "playtime_at_review": 260, "last_played": 1713242585}, "language": "english", "review": "Save your money.  Took me awhile, but the game's not worth it.  Not only are the servers completely empty, including no NPCs, but the grinding is pretty bland too.  Building wasn't great either.  Vehicles aren't made from parts you craft, you have to find them, and they pretty much pop up in the same places, except they don't have any parts, so you would grind like hell, all by yourself on a server, just to finally get a vehicle to go grind faster.  Nope.  nope...just nope on out of there.", "timestamp_created": 1713242704, "timestamp_updated": 1713242704, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "157400442": {"recommendationid": "157400442", "author": {"steamid": "76561198253589310", "num_games_owned": 110, "num_reviews": 4, "playtime_forever": 583, "playtime_last_two_weeks": 0, "playtime_at_review": 583, "last_played": 1577066387}, "language": "english", "review": "Dead game", "timestamp_created": 1706872022, "timestamp_updated": 1706872022, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.517045438289642334", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160117816": {"recommendationid": "160117816", "author": {"steamid": "76561198826644073", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 5907, "playtime_last_two_weeks": 0, "playtime_at_review": 5907, "last_played": 1595820286}, "language": "english", "review": "i find it funny how people will write a review saying \"its dead, dont play it\". when..thats the reason its \"dead\". because people are listening to those reviews and ending up not playing it. if you have played it, or starting to, youll see its actually a really great game. sure its maybe in some ways not as good as rust, but thats probably because the devs dont have enough players playing it to keep updating it as much as they would want to.. SO STOP BEING THE REASON GOOD GAMES DIE. cuz it cant be because its a good game... if you want a game to succeed, then play it more. \nSO FOR MY REVIEW- i love the game, its really great,. If your getting bored of rust, its a really great refreshing feel. takes a lil getting used to but all in all i think if more players played it, then it be up there with the games like rust. give it a try, give it a lil time, enjoy the game rather then complaining about there not being enough players. because if everyone that has the game already just redownloads it or people that dont have it end up buying it, and plays it , the game wouldnt feel dead now would it..", "timestamp_created": 1709918591, "timestamp_updated": 1709918591, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "22765698": {"recommendationid": "22765698", "author": {"steamid": "76561198131706475", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 26996, "playtime_last_two_weeks": 0, "playtime_at_review": 20381, "last_played": 1462211269}, "language": "english", "review": "First things first, Do Not Buy and/or Play this game.\n\nNow, my reasons:\n\n1. No Humans left playing. This game has died, anyone you see in game now is a truely dispicable level of forest troll. With so few people on ANY server, (other than 3 Chinese servers that are suspicously always showing 255/65 people online) it is completely shocking once you realize what they are doing on said servers. These cellar dwellars spend 10+ hours per day camping the ONLY 4-5 relevant places on the LARGE map, instantly killing anyone who may wander anywhere near them... paying no mind to the fact you just spent 10+ minutes of your life holding W and Shift just to get there.\n\n2.  Mind Numbingly boring gathering/ hunting food. I dont need to explain much more... its terrible.\n\n3. Nothing interesing or amusing to build once you have spent hours numbing your mind gathering, as described in point \"2\". When this game came out I suppose one may have found the first couple days playing decent, as there were still some things they had yet to experience. I had 400+ hours before I quit in december. I downloaded this game today thinking ... \"It's been 4+ months, there must be a few new things I can experience \" ...LOL was I wrong. Not only is there not 1 new thing, they somehow took it a step further and made the old things I found fun .. NOT fun.  \n\n4. We must, as a community, Make a stand against these \"Alpha realease\" game developers that show ZERO intention of ever releasing a REAL GAME. They continue to fill their bank accounts with our money being spent under false pretenses. This hoax is becoming an alarming trend on Steam, folks are buying these \"games\" that were made by 3 dudes over a weekend. Steam did a great thing in making such an amazing engine, unfortunately many of these scammers are abusing the ease of the engine Steam has built to make VERY small games easily and charge $20 for them. All that's left now for these bastards to do now is hire some whiz-kid graphic artist to make a few amazing trailers for \" Things to Come \" with the few dollars that start to trickle in.... BADDABING BADDABANG   \"WE ARE MILLIONAIRS JIMMY!!\".\n\n\nIn conclusion... I know point 4 may have gone over some of your heads, but for those of you who know what im talking about I say FUCK THIS SHIT. ENOUGH. NO MORE. \n\nMy Advise: Do not buy this \"GAME\" or any other \"EARLY ACCESS\" or \"EARLY RELEASE\" game before you do extensive research into the dirty sweatpants wearing fellows who made it.  \n\n\nLONG LIVE REAL GAMES!!!", "timestamp_created": 1462212790, "timestamp_updated": 1556860930, "voted_up": false, "votes_up": 4053, "votes_funny": 325, "weighted_vote_score": "0.936232924461364746", "comment_count": 156, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "41407630": {"recommendationid": "41407630", "author": {"steamid": "76561198091870287", "num_games_owned": 105, "num_reviews": 20, "playtime_forever": 22874, "playtime_last_two_weeks": 0, "playtime_at_review": 18165, "last_played": 1686537793}, "language": "english", "review": "This game is one of the best survival experiences ive ever had, but u guys need to drop the price, otherwise you gonna lose it all, i've been out of the game for almost a year, always checking servers to see if theres a chance to get back into it, and no is the answer, drop the price, make an epic update and give some stuff to people, otherwise this game will die and we'all gonna lose some amazing gameplay and fun potential, for you guys and us, do the right thing, would really love to see this game back alive.\n\nEdit: Its been a few years since the original analisys, and i keep my view, the game now oficially launched on v2 seems a lot better with a lot more content, but new players as being the oficial playerbase creators for this game are just rarer and rarer, given that devs wont hype the game enough nor there are any campaings to spread the word of the launch of the game, plus the fact that nakeds often spawn clueless and easily killed on spawn now since the lost of the \"infamy\" mechanic. overall i think the game is better, but now nearly 2 weeks after release, the playerbase has already dropped by 2 thirds, i'd say dont buy this game even tho my review is positive, i've had great fun with it in legacy days and a okay time on v2 mostly due to not having many player to player interactions outside some clans vs my own, the playerbase is currently dead, and unless that changes the game isnt worth even the half price.", "timestamp_created": 1523404846, "timestamp_updated": 1576625620, "voted_up": true, "votes_up": 197, "votes_funny": 8, "weighted_vote_score": "0.926658987998962402", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "22560955": {"recommendationid": "22560955", "author": {"steamid": "76561198090663124", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 5714, "playtime_last_two_weeks": 0, "playtime_at_review": 5479, "last_played": 1485554133}, "language": "english", "review": "This game was fun at first, but it turned into something I dont want to play anymore. Now everyone basically kills you on sight. There are people with cars/guns that camp outside fresh spawns and keeps killing you when you spawn. On top of that If you dont feed amber to your totem You lose your entire base no matter how much time you put into it. Im done with this game.", "timestamp_created": 1461296150, "timestamp_updated": 1461296150, "voted_up": false, "votes_up": 398, "votes_funny": 35, "weighted_vote_score": "0.887003660202026367", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "20598748": {"recommendationid": "20598748", "author": {"steamid": "76561198027138724", "num_games_owned": 438, "num_reviews": 27, "playtime_forever": 818, "playtime_last_two_weeks": 0, "playtime_at_review": 818, "last_played": 1466929757}, "language": "english", "review": "[h1]├ Digitals Review 👌🏻 ┤[/h1]\n[h1]Overall Score[/h1]\n[b]65/100[/b]\n\n[b]Game Pros[/b]\n• Very clean menu\n• Spawn protection \n• Forever growing crafting/cooking system\n• Wierdly satisfying graphics\n• Base Building\n• Melee Weapons & Guns \n• Very smooth and easy to run (Never get frame drops unless it's server side. Constant 45-60fps+) \n• Various biomes all containing different animals/materials (Some biomes have more of one thing than others)\n• Weather system (Rain/Sun/Dust Storms etc..) All of which effects characters stability \n• Driveable cars (Find the car chasis on the map and apply wheels/motor accesories) Remember to make some gas! \n• Consistent updates\n• Moddable custom servers\n• Online livemap to see your character and any friends (Those familiar with Rust already know what this is) \n\n[b]Game Cons[/b]\n• High pop servers tend to have minor rubberbanding/lag. Not enough to actually leave the server, but it's there\n• The voice that plays to indicate you're hungry, or full, can get annoying. Sounds like it was recorded on a cheap mic. I don't get it.\n• (Please leave any further cons in the comments. More will be added [i](hopefully not)[/i] as players call them out)\n\n[b]Controversial[/b]\n• You keep your clothing and hotbar items upon death (Might be different on some servers, I honestly havent checked)\n\n[b]Relateable Games[/b]\n• Rust Legacy\n\n[h1]Conclusion[/h1]\nIf you enjoyed Rust Legacy, or are just looking for a new survival game to get into, Hurtworld is where it's at. At first I didn't thing i'd enjoy it as much I did. But once you really get into it, things get intense pretty quick. I would reccomend this game to anyone who likes the survival type genre. Check out my stream highlights/gameplay from Hurtworld by clicking the link below!\n\n[i](If you found this review helpful, consider giving it a thumbs up!)[/i]", "timestamp_created": 1453089754, "timestamp_updated": 1593223545, "voted_up": true, "votes_up": 315, "votes_funny": 16, "weighted_vote_score": "0.885900497436523438", "comment_count": 23, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "24634805": {"recommendationid": "24634805", "author": {"steamid": "76561198319877907", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 3742, "playtime_last_two_weeks": 0, "playtime_at_review": 3696, "last_played": 1473110088}, "language": "english", "review": "I Love this game. Iv never played computer games or xbox etc, and i'v been watching my husband play HurtWorld for a month or so {he has over 800 hours logged}. I became so interested in it that he bought me the game and set up my steam account. Its only been a week now, im addicted. I have 54 hours logged, multiple bases, and rocking this game. My husband and I are like a team on the game and work together to achieve all that we have. It has been A serious bonding moment for us. He is working on building me a better gaming computer now, and it has me looking at other games like I might actually try them out to. Thank you Hurtworld.", "timestamp_created": 1469975360, "timestamp_updated": 1469975360, "voted_up": true, "votes_up": 158, "votes_funny": 18, "weighted_vote_score": "0.885125577449798584", "comment_count": 16, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "37992821": {"recommendationid": "37992821", "author": {"steamid": "76561198276222991", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 161597, "playtime_last_two_weeks": 0, "playtime_at_review": 127586, "last_played": 1659909628}, "language": "english", "review": "I started playing HurtWorld December of 2015 and had a blast playing with my friends. Early on there was a lot of bugs. Too many vehicles in the same proximity used to make servers lag and the \"fix\" for that was to make it so each player has to \"claim\" a vehicle. This didn't fix the lag issue as players still accumulated tons of vehicles. A few years have passed and the game has taken a turn for the worse. Rock/wall glitching was a huge issue for a while as I had many of my bases raided by foreigners exploiting those methods. Raiding would sometimes be pointless as a player would log out with their good items on their character(s) would disappear with their character as they logged out. To kill two birds with one stone the devs decided that the \"fix\" was to create a \"player box\"(sleeping character) when you log out instead of your body vanishing with all of the items like before. You're unable to climb through windows in the game which doesn't make much sense, originally when implamented you were able to crawl through windows. Instead of making a few changes to the original game the devs decided to scrap the original game and create a new version of the game (V2) which is a Rust mock and ruins the foundations of the game that worked. Content was promised and never delivered. Still waiting for the SMG, saber tooth tiger, and flying bugs.\n(*Personal opinion* Things that could have saved Hurtworld) The devs should have tweaked and created more content for version 1. Simple things like random creature spawn locations, clothing coloring (to differentiate players since everyone looks like Ronald McDonald), adding new weapons and food resources.\nI really miss what this game USED to be. Fingers are crossed that the devs get their heads on straight and listen to the community instead of assuming what the players want. We don't want Rust, if we wanted Rust then we would play Rust.\nMake HurtWorld great again!\nIn its current state I would not recommend purchasing this game. Wait for some positive changes to happen with the development of the game before getting disappointed.", "timestamp_created": 1512186911, "timestamp_updated": 1512186911, "voted_up": false, "votes_up": 154, "votes_funny": 12, "weighted_vote_score": "0.883701205253601074", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19665394": {"recommendationid": "19665394", "author": {"steamid": "76561198211504728", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 3749, "playtime_last_two_weeks": 0, "playtime_at_review": 2128, "last_played": 1463812002}, "language": "english", "review": "Hands down dopest dope ive ever smoked. I hope the devs dont change the core gameplay.\nRight now as early access its amazing wich is a huge shock. I hope they just add more content fix bugs and make a larger map cause everything else is superb. great job guys. I recommend this to anyone, even casual gamers that dont have the time that games like rust REQUIRE.\nPlus theres no bugs or glitches that i know of that someone can exploit to steal your stuff and destroy your base.\n\nDay 1\nI spawn and the first guy i run into claims friendly so i let him know this is my very first server. He shows me around and teaches me the core basics of the game. Surviving the elements and the animals is a task so we decide to work together. Sharing resources and all. I unfortunately strayed away from him and another man killed me with a rifle, kinda my fault i got too close to his base unkowingly. So once again i spawn in the baron desert. After only 2 seconds i run into 2 guys hanging at a fire they claim friendly so i get closer. So i start talking to them and one decides to spear me in the face while im talking. Little did he know he just dug his own grave. I spawn in the desert again and one of them approaches me saying hey sorry buddy as he tries to sweet talk me i give him a taste of his own medicine and kill him with my hatchet as his friend comes running up. I grab the dead dudes spear and start fighting his friend. At this point i am low on health and know i am going to lose the fight so i book it into the mountains. Dude keeps telling me surrender and youll live. I just laughed and kept running. As i come around a corner and lose him i run into another guy on a rock i shout out to him \"help i got this guy chasing me, him and his friend are trying to continuously spawn kill me\" not knowing he jumps off the rock and says \"omg mrhash ive been looking for you, wait someones chasing you?\" it was the guy i had first met. I was so releived to see my old friend. As the guy chasing me finally came around the corner we both jumped him. Unforntunately i died but my buddy killed him and took everything he had. Then he picked up all my stuff as well and returned it to me. At that point we were blood brothers. So i went on a search to find him again. Once we had met back up we travelled far from the chaos and decided it was time to build. (giving us a place to spawn) We traveled on many journeys that night in search of materials and food. The elements were vicious but our teamwork kept each other alive. Timing everything perfectly. We finally had established a safe place sufficient to start a farm seeing as food was scarce for us in our biome. I decided to take a little break at this point, but upon my return he comes running up to me all excited \"I found a car i found a car!!!\"  so she takes me to the edge of our mountain base and points down at the nearby shipping yard. Right there in front of us was this beautiful dune buggy. I quickly responded does it have an engine? Unsure of what parts this car had we decided to investigate. But this area had been off limits due to the high amount of yetis that lived there. We decided it was time to take one on in sacrifice of getting that car. So we gather all our fruits and make as much gasoline as we can, equipped ourselves with food and weapons and went for it. Here we are finally infront of this amazing vehicle we quickly check it for parts and noticed this bad boy is ready to go. We pop the gasoline in the tank and take off for home. Little did we know the engine was damaged and didnt have enough power to make it up the steep mountain pass into our base. We make the decision to strip all the parts and store them til we figure out another option. As the sun comes back up we headed back to the car to make sure it was still there. Realizing we could push the car with our spears we begin jabbing the car up the hill. Using teamwork to force that sucker up there we were successful. We finally had our base with a garage, and a car. That first day had brought me and this fella together as one. Feeling so accomplished we decided it was time to clock out and get some sleep.\n\nDay 2\nShaking from what i might find when i log back on i click the join server button. To my suprise my new found friend is in our base farming and excited to see me. He says \"your not going to believe this\" i worry a little but he seems too calm for it to be a bad thing. He begins to tell me how he met a man who helped him out with some much needed supplies, then he tells me the man has givin us an engine. Not a broken one, not a weak one, but one of the best engines around.\nSoo excited i tell him lets go for a spin, i would very much like to meet this nice mechanic.We approach this new allies base and he greets me with arms wide open. He gives us access to all his supplies and even gives us a room of our own. We gathered with this mans allies and roommates to hunt down more vehicles and supplies. Bringing back plenty for everyone we ourselves decide to help out some unfortunate players that were experiencing some troubles with trolls. Pulling up in a new buggy with nice clothes and full set of guns i approach and share what i can. Turns out one of the guys harrassing these fine folks was none other than the man who killed me the day before. I couldnt help but laugh thinking about how karma was gonna be a real bitch this time around. We were fully equipped and had an army behind us. These guys stood no chance.", "timestamp_created": 1449972680, "timestamp_updated": 1449972680, "voted_up": true, "votes_up": 257, "votes_funny": 187, "weighted_vote_score": "0.879659116268157959", "comment_count": 16, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19571225": {"recommendationid": "19571225", "author": {"steamid": "76561198018665928", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 12266, "playtime_last_two_weeks": 0, "playtime_at_review": 5512, "last_played": 1652570610}, "language": "english", "review": "I've played tons of survival games and have hundreds of hours across most of them so I think I have some legitimate grounds on my opinion on the release of this game and what they've created thus far.\n\nThe release was smooth as butter. No huge traffic or server crashes. Every once and a while a server goes down but it quickly comes back up. This is your basic survival game. If you were a fan of Rust Legacy than you will more than enjoy this game. Start at nothing, then end up with everything. They made C4 EXTREMELY hard to get so you have to truly hate someone in order to raid their base.\n\nThe best part about the game is the Infamy System. Let me explain what that is. You have your basic tools, gear (cloths) and items including resources and ammo and such.  When you're starting out and get killed by another player you will lose all of your ammo and resources BUT NOT lose your tools and clothing, basically the essentials. If you've killed another player you get infamy which means for 15 minutes if you die, you have a chance of dropping your tools such as guns, pickaxes and other things. This will stack higher and higher if the player does not let his infamy disappear first.\n\nThis makes the game so much better due to the fact that not EVERYONE will KOS. You will need to be cautious.\n\nGame is 10/10", "timestamp_created": 1449604336, "timestamp_updated": 1449604336, "voted_up": true, "votes_up": 644, "votes_funny": 52, "weighted_vote_score": "0.875737190246582031", "comment_count": 34, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19923854": {"recommendationid": "19923854", "author": {"steamid": "76561198012829699", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 1035, "playtime_last_two_weeks": 0, "playtime_at_review": 437, "last_played": 1464400263}, "language": "english", "review": "I have a problem: I am compelled to buy half-complete early access titles in the Survival-Crafting Open World PVP genre. It's like a curse, in which my wallet and my happiness must suffer. So naturally, I wanted to give Hurtworld a try. I was [i]compelled[/i] to. \n\nI logged into a server and immediately encountered a neutral player trying to shoo me from his gathering area. He threw his spear at me, missing, all the while communicating to me with voice chat to go away. Point taken, I high tailed it out of there half-naked and with nothing to my name. A couple nights later I had established some basic tools but died of hypothermia. I have not died since. You learn to prioritize resource gathering and craftables, to keep a campfire at the ready for the harsh cold nights. I encountered friendly players, who offered some spare leather or had a kind word in passing. But I also encountered my first hostile player, who tried to coerce me into dropping all my logs. I refused and he chased me with his bow. I turned on him, spear in hand, and wacked him over the head. He didn't like that. I chased him off with my stick and very suddenly a blinding dust storm kicked up. He complained about not being able to see and I used that opportunity to get away -- even though I was the one chasing him. It felt great, as a new player, to be able to defend myself against others. And even better to see how the environment had protected me and given me cover. Cool. \n\nA few hours of gameplay later and I have claimed a plot of land, clothed myself, crafted a back pack, built a small home, stocked up my storage container, created tier 2 tools, and am ready to explore. I feel I have met small milestones and there is a sense of accomplishment and survival. I have hunted and gathered my way to basic comfort and survived the few hostile players. \n\nWhat the future holds, I am uncertain. I'd like to believe I cannot progress through the game so quickly. I'd like to believe great dangers lurk where great rewards lie, but I have not explored far enough yet.\n\nHere's what I do know: The game is fun, it is a solid title for Early Access, the community isn't totally filled with jerks (at least not on the server I joined), and I can only hope the developers expand on this game as I want more of it. \n\n[b]-Pros-[/b]\n+While it is an EA title, it feels like a solid game with a full feature list. Highly playable.\n+Runs smoothly, no crashes, high frame rates\n+Combat is adequate\n+Survival takes some effort and thought during the first couple hours\n+Basic resources continue to be useful\n+Player community\n+I not YET encountered a cheater\n+The server I play on is not full when I want to play\n+Its fun\n+You keep your tools when you die, but drop your resources\n+HUD is clutter free\n\n\n[b]-Cons/Other Thoughts-[/b]\n-Hypothermia is a bit harsh\n\n-Overheating mechanic is ridiculous. I'd understand if you overheat from the desert sun. But instead you overheat from being near your campfire or firepit, which is required for cooking food and smelting ores. It is ridiculous that I can't be anywhere inside my house while the firepit is going or I will start to overheat. Overheating can very well kill you. This could turn into an interesting mechanic if water is required to cool down from the hot desert or player must find shade or equip special gear. Tedius, but could be interesting. As it is right now its downright annoying. \n\n-Some resources will appear at a certain distance away, but will not be there when you approach, and may reapper after wandering around a bit. Similarly, the LOD on creatures is questionable. Bors can look a bit like logs at a distance because they are boxy until you get close enough for their details to be clear. And sometimes they won't appear at all until right up next them. Minor bugs. \n\n-Building a home is nice, but needs some work. There are no stairs or ladders. And you do not get any of your resources returned when you destroy something you've built. Certain resource requirements make no sense.\n\n-Crafting menus could be improved on, but not really a con. They work as intended.\n\n\nOverall, for 20$ I am enjoying the game and look forward to playing more of it.", "timestamp_created": 1451006592, "timestamp_updated": 1451006592, "voted_up": true, "votes_up": 91, "votes_funny": 22, "weighted_vote_score": "0.862254559993743896", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19844165": {"recommendationid": "19844165", "author": {"steamid": "76561198073130205", "num_games_owned": 68, "num_reviews": 1, "playtime_forever": 10018, "playtime_last_two_weeks": 0, "playtime_at_review": 7000, "last_played": 1640446886}, "language": "english", "review": "How to play Hurtworld: \n\nStep 1. Pretend to trust everyone\nStep 2. Trust no one\n\nSeriously, if your own mother joins the game and asks to trade some green ore for some yeti pelts, bring your auto with you and mow her down, she was going to betray you anyways. You meet some guy who gives you some stuff early-game? Chuck your spear at 'im, can't be trusted. You see a nice innocent little bunny? NOPE! you have no idea what that bunny's motives are, gotta blow him away with your shotgun. Basically all I'm trying to say is, don't be nice or the world will hurt you.", "timestamp_created": 1450796648, "timestamp_updated": 1450848003, "voted_up": true, "votes_up": 243, "votes_funny": 719, "weighted_vote_score": "0.849536597728729248", "comment_count": 20, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19762342": {"recommendationid": "19762342", "author": {"steamid": "76561198077781473", "num_games_owned": 393, "num_reviews": 8, "playtime_forever": 4902, "playtime_last_two_weeks": 0, "playtime_at_review": 1405, "last_played": 1452640522}, "language": "english", "review": "Yes.", "timestamp_created": 1450445631, "timestamp_updated": 1676002162, "voted_up": true, "votes_up": 76, "votes_funny": 14, "weighted_vote_score": "0.849271655082702637", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "38209964": {"recommendationid": "38209964", "author": {"steamid": "76561198060764472", "num_games_owned": 214, "num_reviews": 29, "playtime_forever": 344, "playtime_last_two_weeks": 0, "playtime_at_review": 344, "last_played": 1509627004}, "language": "english", "review": "Basically Rust for people with potato based computers.", "timestamp_created": 1512912021, "timestamp_updated": 1512912021, "voted_up": true, "votes_up": 106, "votes_funny": 100, "weighted_vote_score": "0.849147379398345947", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "48195155": {"recommendationid": "48195155", "author": {"steamid": "76561198079014684", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 2907, "playtime_last_two_weeks": 0, "playtime_at_review": 1498, "last_played": 1547498267}, "language": "english", "review": "Awsome game the only problem is the community is dead, hopefully with the launch of v2 they will advertise and try to get a bigger playerbase\n\nEdit:\nGame has been abandoned, cheaters reign free and the admins do nothing. \nIt can be very fun if you have enough friends and your own private server", "timestamp_created": 1546982199, "timestamp_updated": 1599589258, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.844757318496704102", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "60008080": {"recommendationid": "60008080", "author": {"steamid": "76561198109639651", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 34715, "playtime_last_two_weeks": 0, "playtime_at_review": 6101, "last_played": 1670683683}, "language": "english", "review": "Game was fun until cheaters came in and walked into our base through walls , took off our doors  without explosives or anything at all,  walked into our base and went into our Metal walled base into our Stake room  and then claimed our base as there's not even using a single c4 or bullet.      Kicked us out of our own base cheating.     Game is fun but not worth playing due towards everyone ESPing, Wall hacking, and AimBoting....   100 hours of grinding out mats and having fun just to lose it all in 1 minute.   Not worth the money.", "timestamp_created": 1576569974, "timestamp_updated": 1576569974, "voted_up": false, "votes_up": 146, "votes_funny": 40, "weighted_vote_score": "0.842630982398986816", "comment_count": 19, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "19800654": {"recommendationid": "19800654", "author": {"steamid": "76561198069968180", "num_games_owned": 225, "num_reviews": 14, "playtime_forever": 314, "playtime_last_two_weeks": 0, "playtime_at_review": 314, "last_played": 1450735030}, "language": "english", "review": "This is a good game. There are quite a few cons, but in the long run, it's worth a purchase. Here's a sad story. \n-----------------\nAfter  multiple failed attempts at survival, I find myself teaming up with this guy. His name was Cat, and he was pretty cool. We hit it off, and end up helping eachother survive, and provide eachother with a number of usefull materials. We survived together for about two days, and I found myself getting pretty good (by good, I mean I had pants, and a shirt). One evening, at our little makeshift camp, a straggler wandered in. We told him to leave, and with some resistance, he retreated. He seemed semi aggresive, and he swung at us with a spear a few times before high-tailing it right the hell out of there. I found myself aiming at him with a bow. I ended up not shooting, just because I felt remorse, and decided that he should have another chance. We set up for the night. All of a sudden, we hear an arrow wizzing past our heads. The man had returned, this time with a bow. He obviously had much more time in the game, because his shots were pretty good. After an admirable bow fight on our part, he ended up killing us both, and looting our corpses. I could have prevented this if I had taken the shot. God forgive me. laik if u cri everytiem", "timestamp_created": 1450608048, "timestamp_updated": 1450608048, "voted_up": true, "votes_up": 1256, "votes_funny": 1442, "weighted_vote_score": "0.841351509094238281", "comment_count": 60, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "22298115": {"recommendationid": "22298115", "author": {"steamid": "76561197961853988", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 3407, "playtime_last_two_weeks": 0, "playtime_at_review": 3015, "last_played": 1460110718}, "language": "english", "review": "Just under 60 hours played...\n\nThe community is as toxic as they come; literaly, the worst bottom feeders of the internet reside here. Be warned.\n\nThe game offers such joys as freezing to death while standing atop a camp fire, or dying within the freezing  areas of the snow biome from a heatstroke you picked up in the desert.\n\nInsta death by headshot from a naked noob with a rickety bow scrapped together in 3 minutes of gameplay.\n\nuninspired building construction. If you can piece together legos, you're already a master.  The depth of play is so shallow it's well,... let's just say that if it were a pond you could wade in its deepest parts and not get your feet wet.\n\nThis is not a truly developed gameplay product. It's akin to a  technical proof of concept piece for a Bach. of Comp. Sci. senior project.\n\nIf you ARE playing, and enjoying yourself, by all means carry on. Just know that richer, more rewarding experiences are available in the market right now, while you settle for less.\nIf you haven't played but are considering it, see above.\n\nDespite my harsh criticism, I do wish the Devs the best in developing *something* to call a game environment. It just feels like they got sidetracked figuring out how to make it work, without a matured vision of an end state for their creation.\n\n*grammar edit + a slight reword of the first bit.  The tone was more offensive toward the devs than intended, when the product was my target.", "timestamp_created": 1460111557, "timestamp_updated": 1460162310, "voted_up": false, "votes_up": 272, "votes_funny": 29, "weighted_vote_score": "0.835241794586181641", "comment_count": 15, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19474409": {"recommendationid": "19474409", "author": {"steamid": "76561197981583885", "num_games_owned": 293, "num_reviews": 44, "playtime_forever": 8900, "playtime_last_two_weeks": 0, "playtime_at_review": 856, "last_played": 1468826286}, "language": "english", "review": "This game lives up to its name. I am enjoying this game so far! I ran into a dev by the name of Daz or close to that and he was very polite and nice. He explained a few things and wished me luck on my exploring. If this game keeps going in the right direction Rust and other survival will sadly fall down the list. This game reminds me of Legacy Rust with just the right graphics to give the amazing performance. I highly suggest this game! Plus, it has cars already!", "timestamp_created": 1449223929, "timestamp_updated": 1449223929, "voted_up": true, "votes_up": 146, "votes_funny": 14, "weighted_vote_score": "0.830149412155151367", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "20012694": {"recommendationid": "20012694", "author": {"steamid": "76561198064829398", "num_games_owned": 548, "num_reviews": 57, "playtime_forever": 4227, "playtime_last_two_weeks": 0, "playtime_at_review": 2961, "last_played": 1490041160}, "language": "english", "review": "[h1] Alpha Review - 55h\t[/h1]\n\nPurchased it five days ago, and have played non-stop since. I know this is a fact everyone knows, but it is a Rust clone, and to be honest, I'm fine with that. The game does some things better than Rust, some things worse. It's cartoonish appearance makes it interesting. Vivid colors and clear contrast is half it's charm. The hardcore factor is not really true though. There is nothing in this game that is hardcore. Within an hour of playing, you will know the game mechanics and how most necessities work.\n\n[h1] PROS \t[/h1]\n\n-Beautiful graphics\nAs I said earlier, the graphics are amazing. They need more polishing, but they are pretty nonetheless. Gun textures are pretty dull though. I would choose this game over Rust when it comes to graphics.\n\n-A sense of achievement\nThis is something the game nailed. When it's so easy to lose your resources, building a huge fortress feels amazing. The fact that the whole world is working against you makes every little upgrade worthwhile, and pretty satisfying. The simple upgrade from an Iron Hatchet to a Gold one is pure bliss.\n\n-Nice building model\nThe building in this game is actually pretty stellar. You shape your house as you please, and that's something we didn't have in Rust. (More in Cons)\n\n-Cars\nAmazing for transportation, really cool models aswell. (More on this in the cons)\n\n-Great open map\nThey really did a good job on the map. The hill areas need polishing, but the overall map is epic. Making a base in each biome is a must-do task. \n\n[h1] CONS \t[/h1]\n\n-The Servers\nOh my God. I realize that we are currently in the Alpha Stage, but the servers are garbage. With the rumor of new servers, I hope that I can one day edit this part out. You'll often find yourself shooting at a boar, just to find out it has teleporting abilities with will literally be a pain in the ass. \n\n-Cars\nI know I put ''Cars'' in the Pros aswell, and this is why; The chances of you ever getting a car in this game are so slim you would have more luck getting a car in Minecraft. The drop rates for car parts are garbage, and after 55hours of play with a whole clan of people, we have managed to get three wheels. Not to mention the sheer amount of bugs with vehicles. Sounds glitching, clipping through the map, randomly getting thrown out... If you are buying this game for the cars, don't bother.\n\n-''Infamous'' System\nI realize that this is here to make the game a bit more unique, but in my opinion it is one of this game's worst features. A rich individual can go to spawn and go bananas on some fresh-spawns without much consequence. This game's whole thing is it's hardcore factor, and this is where the hardcore factor goes away. Tools are harder to make, but you will always keep them as long as you don't kill anyone.\n\n-Community\nThis doesn't really go under the CONS area, because the Devs can't change this; but it is worth mentioning nonetheless. If you have never played games like DayZ, Rust, and like like, be prepared to be KOS'd. There doesn't need to be a reason behind your death, as long as the Russian behind the scope is trigger happy. The Infamous system counteracts this to a certain degree. \n\n-Bugs and Glitches\nI know this is completely normal in an Early-Access game, but nonetheless worth mentioning. The game is plagued with game-breaking glitches and annoyances. The whole Survive-bar is annoying as all hell. The Wetness factor and Temperature need so much fixing it shouldn't be in the game yet. \n\n[h1] SUGGESTIONS\t[/h1]\n\n-Party System / Friends\nEven though you can share your house with your teammates, there is no way to identify them. No way of adding them on a friendlist, or mark them some way. Forget playing together if you don't use TS3 or the like. (You should do this anyway) This should be implied as soon as possible. \n\n-Drop Rates\nSome fixing needs to be done with this. At the moment, they are completely horrendeous and need fixing. \n\n-Map\nThis game is in desperate need of some type of map. We currently have a ''compass'' which shows the user it's homes/bases, but no real way of knowing the area. Combining the Beacon and a map function would make this game a lot easier and more enjoyable to play.\n\n\nAll in all, this is a game worth trying. If you are a fan of Rust or DayZ, it's a truly refreshing. Even though there are a lot of Cons, I still love this game for what it is, and I hope they will fix some of these.\n[h1] Rating: 8/10\t[/h1]\n\nEdit; 2. Jan 2015: Suggestions, Maps", "timestamp_created": 1451254877, "timestamp_updated": 1451703163, "voted_up": true, "votes_up": 79, "votes_funny": 5, "weighted_vote_score": "0.82888716459274292", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "32259838": {"recommendationid": "32259838", "author": {"steamid": "76561198088765397", "num_games_owned": 51, "num_reviews": 2, "playtime_forever": 1834, "playtime_last_two_weeks": 0, "playtime_at_review": 1472, "last_played": 1496888467}, "language": "english", "review": "the game is dead no one plays the game anymore worst the highest number was 20 out of 65 player the game is not worth 10 $ if you ask me", "timestamp_created": 1496888804, "timestamp_updated": 1496888804, "voted_up": false, "votes_up": 124, "votes_funny": 3, "weighted_vote_score": "0.823061764240264893", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "25526653": {"recommendationid": "25526653", "author": {"steamid": "76561198084388183", "num_games_owned": 73, "num_reviews": 10, "playtime_forever": 2722, "playtime_last_two_weeks": 0, "playtime_at_review": 2673, "last_played": 1579864550}, "language": "english", "review": "As I am from Australia I can confirm this is how we live.", "timestamp_created": 1474030601, "timestamp_updated": 1474030601, "voted_up": true, "votes_up": 60, "votes_funny": 129, "weighted_vote_score": "0.821812331676483154", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "48549468": {"recommendationid": "48549468", "author": {"steamid": "76561198022463267", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 133385, "playtime_last_two_weeks": 0, "playtime_at_review": 131614, "last_played": 1548047152}, "language": "english", "review": "TL;DR: played for 10 months straight on a permanent, official server. Server taken down by devs with no warning. 2,200 hours of progress taken away without warning or heads up. Aweful devs.\n\nDo not play this game. I'll never play a game made by Bankroll Studios again. I play HW on a permanent official server for 10 months. I took part is a couple of clan wars, built many huge castles. The time investment and the amount of progression was immense. I took no breaks in which I mained other games. I was a seriously dedicated HW player. The Devs (Bankroll Studios) deleted my server one day without so much a moment's notice. \nTo contrast with this I also dabble in Orcs Must Die, Unchained. They've decided to take the game down, but they've given us several months warning, as well as a huge in-game currency gift. I don't expect any free currencies or gifts from Bankroll Studios for taking my server of choice down. But to have 2.2k hours of uninterrupted progress in the form of farming, bulding, and raiding taken away without so much as a \"sorry, ty for playing\" is terrible. Not something that can be forgiven.\n\nOne last cherry on the top that puts this shit-bag story into perspective: Bankroll Studios, shortly before the full launch of V2, stated that they would be leaving the legacy servers alone. Turned out to be a bold-faced lie.", "timestamp_created": 1548444278, "timestamp_updated": 1548444852, "voted_up": false, "votes_up": 119, "votes_funny": 13, "weighted_vote_score": "0.81851959228515625", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "71169727": {"recommendationid": "71169727", "author": {"steamid": "76561198079091580", "num_games_owned": 69, "num_reviews": 4, "playtime_forever": 95231, "playtime_last_two_weeks": 0, "playtime_at_review": 86236, "last_played": 1705698627}, "language": "english", "review": "For some of us this game is like a drug - we cant stop playing. \n\nDont make the same mistake.\n\nDevs dont care. They are non exist. They keep the servers running as a passive income for them. \n\nNo updates, anti virus sucks. Filled with cheats and exploids.", "timestamp_created": 1592821921, "timestamp_updated": 1592821921, "voted_up": false, "votes_up": 48, "votes_funny": 8, "weighted_vote_score": "0.815066277980804443", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "19908771": {"recommendationid": "19908771", "author": {"steamid": "76561198010382668", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 1012, "playtime_last_two_weeks": 0, "playtime_at_review": 581, "last_played": 1630269115}, "language": "english", "review": "If you liked what Rust was back in 2013, get this game. \nIf you hate what Rust has become, get this game.\n\nOverall the game is amazingly optimized, here and there a few glitches. Plays good, feels good. It takes a while till you gather some decent stuff & craft some cool things however it worths every single minute, and its addicting as hell. \n\nHopefully this title wont be one of the many EA failures, and the devs will keep pushing out the updates, adding new contents, I'm looking forward to it as we need more weaps, more resources etc. etc. but surely time will tell.", "timestamp_created": 1450967477, "timestamp_updated": 1450967572, "voted_up": true, "votes_up": 106, "votes_funny": 14, "weighted_vote_score": "0.81362152099609375", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "81487882": {"recommendationid": "81487882", "author": {"steamid": "76561198046360585", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 5253, "playtime_last_two_weeks": 0, "playtime_at_review": 5253, "last_played": 1578162847}, "language": "english", "review": "DO NOT BUY, GAME IS ABANDONED BY DEVS", "timestamp_created": 1606944050, "timestamp_updated": 1606944050, "voted_up": false, "votes_up": 50, "votes_funny": 0, "weighted_vote_score": "0.812359213829040527", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "22789514": {"recommendationid": "22789514", "author": {"steamid": "76561197964087928", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 385, "playtime_last_two_weeks": 0, "playtime_at_review": 385, "last_played": 1460872460}, "language": "english", "review": "There are couple of problems I encoutered with this game and to me, they are egregious enough to me that I feel the need to warn other potential consumers.\n\nHarvesting:\n\nYou start with literally nothing. Your avatar may have some boxer shorts on, but they are part of the character model and you truly have nothing. So you start your journey picking up whatever tidbits are on the floor in order to build some basic tools, which would be fine if the harvesting wasn't partially RNG based. Often times, completely identical looking stones on the ground will give you different resources, so you can never be sure that you are ever getting closer towards your goal.\n\nOnce you have some Tools, perhaps the Axe, a persons first thought would be to hack at trees right? Trees must give wood, that's logical. \n\nWrong.\n\nYou can only harvest fallen logs in the world and dried up dead trees that exist in certain places in the world. Healthy trees cause your Axe to bounce off harmlessly.\n\nThe other resource node you can harvest look like sculptures of colored rocks, which require that you have a pick on you. Different colored nodes yield different quantities of resources, but you will never be certain of exactly what you will harvest due to the inane RNG harvesting thing I mentioned before.\n\nThis is further made frustrating in the way harvesting takes place. You left click on the resource node with the appropriate tool until the node breaks apart and only at the end of the break do you gain resources. If someone comes running by and has a higher level harvesting tool, they end up dealing more damage to the node and will manage to harvest your node before you could ever do.\n\nCombine this with absurd costs of various items and the rarity of certain resources, this creates a scenario where a player is likely never to know exactly what they need in order to get the goals they desire.\n\nWhich leads me to the second bit I despise.\n\nPlayer Killing:\n\nThis game handles player vs player interactions with a sort of karma system. When a player with no bad karma kills another player with no bad karma, they get a visible timer on them that shows how long they are marked. I forget the in game name of this mechanic, but suffice to say, this is something that is often abused.\n\nLet me explain.\n\nA player with no karma timer on them, when killed, retains all their gear and clothes upon death and spawns with it in their inventory. A player who dies while their karma timer is still active loses all their items.\n\nThis sounds like a nice way for non-violent players to play the game, but any player who dies still loses all their resources. Often times, groups of players will harass other players into killing them just so that their buddies can come and kill the now karma marked player and loot all his items. \n\nThis system manages to not solve the horrid KOS problem prevalent with these survival games at all and even makes the experience worse for those players who successfullly defend themselves only to then be killed and lose EVERYTHING as opposed to just their resources.\n\nIt's dispicable.\n\nThe last problem I had with this had to the frequent server restarts.\n\nEvery 20 minutes, it seemed, servers have to restart, which requires that every player on the server get disconnected, wait a few moments and then manually reconnect.\n\nPlayers only get a 5 minute warning of when this will happen, which is never enough time for players to find a safe area to be in before the restart.\n\nWhen a player finally logs back in, they may find that other players are there already and have killed the player while they were spawning into the world.\n\nIt's awfully annoying for a server to have to restart so frequently to start with, but then logging back into the game just to find yourself dead is just unacceptable to me.\n\nI do not recommend this game. 24 dollars is just not a sensible price when there are games in the survival genre that are much MUCH more developed and thought out than this game and also cost less.\n\nYOU GUYS COULD BE PLAYING SOMETHING THAT IS SLIGHTLY MORE FUN THAN THIS FOR SLIGHTLY LESS THAN THIS GAME COSTS!!\n\nAnyway, I didn't realy have fun with this game at all, I didn't find it's crafting intuitive in the least nor did I enjoy the combat or survival systems. The community was meh, but that's to be expected in these games.\n\nAll in all, I'd say look elsewhere for your survival gaming. This game is just not fun.\n\nEDIT 5/4/2016..\n\nAs someone was so kind to point out, this is an Early Access title and potential purchasers should expect problems with the product. So while I understand that an Early Access title is not finished, I am reviewing this game based on what is currently available and what I have played, not on what the game might be when it's finished.\n\nAs always, do your research on EA titles and wary. My \"NO\" on recomending this game still stands.", "timestamp_created": 1462342742, "timestamp_updated": 1462393722, "voted_up": false, "votes_up": 190, "votes_funny": 15, "weighted_vote_score": "0.80888068675994873", "comment_count": 10, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "28874484": {"recommendationid": "28874484", "author": {"steamid": "76561197989816249", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 31539, "playtime_last_two_weeks": 0, "playtime_at_review": 10529, "last_played": 1702552345}, "language": "english", "review": "I've been playing Hurtworld for close to 200 hours now and I would like to give you guys an idea of what you get into.\n\nHurtworld is a survival game - and by definition, survival is (and should be) hard! There are a lot of people who are complaining about players who kill beginners at the starting-area. While I believe this is by far not as common as it was ... it is not a big of a deal if you do what the game is all about: sneak around, know that (in the beginning) you are weak and an easy target, be smart and make smart decision; in short: Survive!\n\nOnce you get the basics going, the game is a grind. You will be constantly grinding for ressources in order to get better gear, tools and build bases in various different areas. You can be in PVP-situations every time you play, but most times you have a choice not to seek a fight by sneaking around. \nOnce you have the ressources to build a base, the desire will hit you to create a big one. The building-system is awesome and for the first time since World of Warcraft, I did not get bored grinding because building is so much fun. \n\nHowever, just as you can get killed in a classic pvp-weapon-fight: Your base can be raided and destroyed as well. And it will. \nThe game is basically (!) a great experience if you'd like to team up with friends, it has lovely graphics and just all around a great feeling.\n\nThe reason why I would like to disadvise and warn you to buy this game is simple: Hacking. It's a HUGE problem in Hurtworld, it has ever been and the dev's don't take it too seriously. \nIf you build a game in which the core value is grinding and securing your stuff in your base - the least you want is Hackers who compromise the game by using scripts that enable them to see what you have grinded. There are numerous hacks out there and they are frequently used. Search for \"Hurtworld hack\" on youtube and you will find ones from even October 2016. \n\nHurtworld integrated EasyAntiCheat recently but EAC does not detect all scripts. In fact, cheating in Hurtworld is common. \n\nAs much as I like the mechanics and the potential of this game ... you have to know that from mid-stage in the game on, you will not be grinding for yourself, but for the hackers who will raid your base(s) soon.\n\nAs a developer, you can build the best survival-building-pvp-experience but hacking, especially frequent hacking, makes it all worthless. And unfortunately Hurtworld is a victim of such. :(", "timestamp_created": 1483202070, "timestamp_updated": 1483202154, "voted_up": false, "votes_up": 150, "votes_funny": 4, "weighted_vote_score": "0.806806862354278564", "comment_count": 8, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "32307733": {"recommendationid": "32307733", "author": {"steamid": "76561198076602158", "num_games_owned": 114, "num_reviews": 6, "playtime_forever": 26322, "playtime_last_two_weeks": 0, "playtime_at_review": 11259, "last_played": 1695707036}, "language": "english", "review": "Asians and cheaters have broken this already dead game. To fix the current situation the server would need administrating banning cheaters and then see the developers come back to fix bugs and to update the game so that cheats wont work. Currently the community consists of trolls, cheaters and toxicity. The leaders of the servers possess all three of these traits. If you like being killed on one side of the map and then spawning on other side only to find that your stalker has the ability to see where you are and is flying over with their op guns to camp your door and then calls a dozen players with chinese text as names to come along with unlimited amounts of c4 to destroy in an instant what took you 3 straight days to build then this is the game for you, they're not friendly, the only time they talk to you is to call you a noob and criticize you for enjoying the game. But let's get one thing straight, the game IS enjoyable even with its absent devs, bugs and various flaws but the current culture and player base (with some exceptions) and the absence of devs makes this game a dud. It's a 0/10 from me.", "timestamp_created": 1497065648, "timestamp_updated": 1613307937, "voted_up": false, "votes_up": 92, "votes_funny": 1, "weighted_vote_score": "0.806268155574798584", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "104679545": {"recommendationid": "104679545", "author": {"steamid": "76561198393323506", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 370, "playtime_last_two_weeks": 0, "playtime_at_review": 347, "last_played": 1678923741}, "language": "english", "review": "It's such a shame the developers aren't here anymore. it would be a really good game, it's really unique and really fun to play. Few updates so there is less to do. they need to make a comeback with a big and good update and shake everyone up. developers please come back.", "timestamp_created": 1638182149, "timestamp_updated": 1638182149, "voted_up": true, "votes_up": 43, "votes_funny": 1, "weighted_vote_score": "0.80533677339553833", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "21704444": {"recommendationid": "21704444", "author": {"steamid": "76561198285102370", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 2408, "playtime_last_two_weeks": 0, "playtime_at_review": 1475, "last_played": 1490678804}, "language": "english", "review": "i just met  the nicest guy. so i slowly dying of coldness and this guy walks up to me and says, \"hey man! you look cold do you want some clothes?\" and i was shocked by the fact that he didnt kill me like everyone else dose so i say yes he says, \" cool. come with me.\" and he takes me to his base and he makes my some clothes and i ask if he has a campfire (to warm me up) he say yes come with me and we go outside and he puts down a fire pit and lets me warm up after 30sec he pickes it up and give it to me and say, \"here have this, its MUCH better then a campfire.\" he then sends me on my way and says, 'bye good luck out there :).\" one of the best people ive ever met in a video game. his name was \"kind monkey\" or somthing like that\n10/10 would recommended", "timestamp_created": 1457433430, "timestamp_updated": 1459659358, "voted_up": true, "votes_up": 99, "votes_funny": 31, "weighted_vote_score": "0.800852596759796143", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19665887": {"recommendationid": "19665887", "author": {"steamid": "76561198082721343", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 65, "playtime_last_two_weeks": 0, "playtime_at_review": 65, "last_played": 1449974866}, "language": "english", "review": "So i bought this game thinking there would be lots of bambi's hitting each other and groups of guys with guns.... well to my surprise i loaded in to find a man who asked me if i needed anything, i told him i was new and he gave me a pickaxe and hatchet. Soon after this i went exploring and must have ran past 10+ guys with out a single one trying to kill me. I finally ended up dying to a deer... yes a deer. \n\n10/10 Survival game where deer are more deadly then players", "timestamp_created": 1449974999, "timestamp_updated": 1449974999, "voted_up": true, "votes_up": 110, "votes_funny": 177, "weighted_vote_score": "0.800072252750396729", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "51002164": {"recommendationid": "51002164", "author": {"steamid": "76561198277845080", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 6259, "playtime_last_two_weeks": 0, "playtime_at_review": 410, "last_played": 1577481231}, "language": "english", "review": "Full of hackers shit game not worth your time.", "timestamp_created": 1559428799, "timestamp_updated": 1559428799, "voted_up": false, "votes_up": 224, "votes_funny": 45, "weighted_vote_score": "0.7967643141746521", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "56972032": {"recommendationid": "56972032", "author": {"steamid": "76561198094142348", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 17155, "playtime_last_two_weeks": 0, "playtime_at_review": 13360, "last_played": 1692578515}, "language": "english", "review": "This game is totally misunderstood in my opinion. First ill start with cons just to get them out of the way, But I DO RECOMMEND THIS GAME! \nCons: \n1. Some people might not like the graphics (My opinion is graphics don't matter it's all about the gameplay) \n2. I feel American/English speaking people shy away from this game because there are a billion chinese servers\nPros: \n1. This game is the essence of the time where survival pvp games gave that warm but still hostile feelings. If you want to pvp you can pvp if you want to go build a shack somewhere safe and never fight anybody, you can do that too! \n2. Base building is a blast! You can build 1000's of different base designs and they oppertunities are limitless\n3. Gun/Bow play is really fun/easy! You can bow like a god with 10+ hours on this game!\n4. Modular vehicles is a pretty cool/staple point of this game!\n5. Community so far has been really nice! (Go check out a server call Hurt Fun if your new, they have a 3x server to get you learning the ropes in no time!)\n6. Adding new contents pretty often. I downloaded this game the winter it came out and I've been playing off and on since then and let me tell you the game has changed so much for the better! Now there a mods/plugins/custom maps/Way better ig features!\n\nFinal Statement:\nI would 9/10 recommend this game to anyone who likes survival games and is looking for a game you can milk 100s maybe 1000s of hours from!", "timestamp_created": 1573454687, "timestamp_updated": 1573454687, "voted_up": true, "votes_up": 70, "votes_funny": 2, "weighted_vote_score": "0.795406162738800049", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19864464": {"recommendationid": "19864464", "author": {"steamid": "76561198084887692", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 10840, "playtime_last_two_weeks": 0, "playtime_at_review": 2756, "last_played": 1547366282}, "language": "english", "review": "So, where do I start? This game is still functionally pretty basic, but for some reason it is as addicting as meth. Well, as addicting as my friends tell me meth is, since I'd never ingest illicit drugs. Oh, Christ....insects crawling under my skin!!\n\nSo, anyway. Where were we?\n\nThat's right: Hurtworld. So it's early access survival and yup, I just saw you cringe and I felt your pain. When I saw this one pop up, I also somewhat sarcastically rolled my eyes at the thought of yet another survival sim, once again let loose in early frickin' access. The fat Irish policeman in my brain was instantly twirling a baton and snarling, \"Move along, folks. Nothing to see here.\"\n\nThen I heard that this is an Australian game. I, Sir, was coloured intrigued.\n\nSo at the time of writing this review I have about 50 hours up, most of that lone wolf, and I've had it less than a week. And I'm enjoying every bloomin' minute of it. But, if it is still so basic, why?\n\nHere's some pros:\n\n[*] Graphic design is a little unique, kind of cartoony, but not annoyingly so;\n[*] Light and shade is spot on - seeing a campfire from a distance at night for the first time was a treat;\n[*] Runs well and has surprisingly few problems and glitches - thereby putting AAA titles like H1Z1 and DAYZ to shame;\n[*] The biomes are each quite different - from sandy deserts and chilly snow, to what looks remarkably just like the Aussie outback; \n[*] The crafting tree is intuitive, and all the weapons, gear and machines can be crafted;\n[*] The infamy system ties to the amount of player kills, which means the killer then gains a higher loot loss rate on death - this seems so far to have acted as a \"consequence\" to discourage the kind of rampant KOSing that seems ever-present in games like DAYZ and Rust - meaning that I've met a ton of players in Hurtworld who don't just automatically want to rape my corpse as soon as they see me;\n[*] The survival aspect is interesting, as you can die from freezing at night, heatstroke in the desert and/or during duststorms, poison, radiation, and from an array of animals...not to mention other players;\n[*] Base building is a treat, with tons of scope for some quite sophisticated structures;\n[*] Bases and stored loot are permanent (until wipe, of course) and bases can only be breached using very difficult to craft C4 - meaning that most people will only go after a base if the perceived rewards outweight the hefty cost of the C4;\n[*] Guns are extremely hard to craft, and I mean extremely;\n[*] If you die, you keep all your basic tools in your hotbar as well as your clothes - unless you're infamous, at which time you can lose any of these;\n[*] This game sells itself as hard-core, and in many ways it is;\n[*] Good friendly devs; and\n[*] Air-humping with friends...yeah, baby. You know what I mean.\n\nHere's some cons:\n\n[*] Missing some way to identify KOSers and waste them without suffering infamy - this could be addressed by perhaps adding a bandit type skin system similar to old school DAYZ and also tweaking infamy;\n[*] No free look;\n[*] Still feels like it could contain a lot more content (the devs have said there's plenty more to come), as it seems once end game is reached (guns), there may not be much to do (but I could be talking crapola, having not yet reached endgame content);\n[*] Still has sociopathic KOSers (which is also kind of a positive) including one little annoying bast*rd who called out in a reedy ten year old's voice that he was friendly, and then promptly speared me in the face when I felt sorry for him and stopped to help...Oh, I'm coming for you sonny, and when I find you I'm going to hit you harder than puberty will; and\n[*] Missing unique character creation and no female characters. I really want female characters so that my air-humping exploits aren't always so Brokeback Mountainey.\n\nSo, in summary, although this game is in very early release and there's more filling in of content to be done, it already runs great and is just so fun to play. The devs are obviously very invested in it, and already are talking about some great content they want to introduce. \n\nFrom the minute you spawn and start hurriedly picking up driftwood and stones to build a fire and avoid freezing to death, to the point where build a base and fill it with high end machinery, you'll have a blast.\n\nYou should buy it. I dare you. \n\nNah, I double-dare you.", "timestamp_created": 1450853967, "timestamp_updated": 1450853967, "voted_up": true, "votes_up": 133, "votes_funny": 132, "weighted_vote_score": "0.795171976089477539", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "143747452": {"recommendationid": "143747452", "author": {"steamid": "76561197996942360", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 52, "playtime_last_two_weeks": 0, "playtime_at_review": 52, "last_played": 1691622839}, "language": "english", "review": "There are like seven people in the world still playing this game. It seems to be a relic from another age: a different time, one of mystery and sepia soaked adventure. I took small risk, secured a copy from some random steam key site, waited patiently for the game to download. I carefully selected a server: there were more than I expected, and I chose one with friendly sounding name. After a reasonable load time, my character awoke on the shore of some distant sea. I was eager to explore this new world! I cried out my joy on the chat, \"Hello! What is this game? I'm new.\" A significant pause, a pregnant one. And then, charmingly, came my reply, \"Shut up n****.\"", "timestamp_created": 1691623268, "timestamp_updated": 1691623268, "voted_up": true, "votes_up": 37, "votes_funny": 31, "weighted_vote_score": "0.794981539249420166", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "29938186": {"recommendationid": "29938186", "author": {"steamid": "76561198219603255", "num_games_owned": 116, "num_reviews": 25, "playtime_forever": 409, "playtime_last_two_weeks": 0, "playtime_at_review": 124, "last_played": 1563111126}, "language": "english", "review": "I'm Australian and this game just feels like a regular Wednesday afternoon for me", "timestamp_created": 1487150916, "timestamp_updated": 1487150916, "voted_up": true, "votes_up": 78, "votes_funny": 183, "weighted_vote_score": "0.791496872901916504", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "78362121": {"recommendationid": "78362121", "author": {"steamid": "76561198101370719", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 132627, "playtime_last_two_weeks": 0, "playtime_at_review": 132607, "last_played": 1613808082}, "language": "english", "review": "I will keep this short and simple.\nAfter 2200 hours played time and significantly more spent on 100+ custom map updates and improvements, not counting time played as Admin for Aztec. Hurtworld has finally been abandoned, I cannot in good faith recommend this game to anyone, any longer. What once had great potential has been abandoned and left to die. Spencer the lead owner and developer with bankroll has not responded to, or made any progress for the game since Jan 2020. Via multiple attempts to contact, assist, and improve game content all have failed and been left on ignore. Do not spend your money, content is dead, broken, glitchy, and for $24 you could actually get something worth a damn.", "timestamp_created": 1604006386, "timestamp_updated": 1604006386, "voted_up": false, "votes_up": 43, "votes_funny": 2, "weighted_vote_score": "0.784201860427856445", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "21597542": {"recommendationid": "21597542", "author": {"steamid": "76561198068803596", "num_games_owned": 0, "num_reviews": 24, "playtime_forever": 1932, "playtime_last_two_weeks": 0, "playtime_at_review": 1839, "last_played": 1456472054}, "language": "english", "review": "Spawned on community server. Friendly stranger asked me to TP to him to play together, i did. Ran out for 20 mins, talked about his life and mine. Talked about his family. Told him i have to pick up the phone for a bit. Watched him slowly aimed his rifle at my head and shot me, looting all my /kit items. \"Sorry i dropped my mouse\" came the respond. 10/10 would lose faith in people again.", "timestamp_created": 1456985653, "timestamp_updated": 1456985653, "voted_up": true, "votes_up": 91, "votes_funny": 138, "weighted_vote_score": "0.783562242984771729", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "61215878": {"recommendationid": "61215878", "author": {"steamid": "76561198141046546", "num_games_owned": 82, "num_reviews": 4, "playtime_forever": 6803, "playtime_last_two_weeks": 0, "playtime_at_review": 2531, "last_played": 1604064890}, "language": "english", "review": "Awesome game to low-end PC's, if u can't run Rust this is your game ;)", "timestamp_created": 1578062109, "timestamp_updated": 1578062109, "voted_up": true, "votes_up": 33, "votes_funny": 8, "weighted_vote_score": "0.78345876932144165", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "19537320": {"recommendationid": "19537320", "author": {"steamid": "76561198008921131", "num_games_owned": 702, "num_reviews": 2, "playtime_forever": 356, "playtime_last_two_weeks": 0, "playtime_at_review": 334, "last_played": 1449459013}, "language": "english", "review": "Hurtworld is a title that looks to compete in a genre that is completely oversaturating the market, especially in regards to Early Access games. Many of its gameplay elements are similar to its more popular predecessors, namely games such as Rust, DayZ, and Ark. However, while Hurtworld does not introduce many new concepts to the genre, it takes these preexisting gameplay elements and polishes them up to a shine not often found in Early Access titles.\n\nMost of the work done in both the closed Alpha and Beta was to create a stable and optimized foundation for new content to be added to when the game reached Early Access; compared to other games, FPS is relatively stable even at higher settings on lower end machines, and because the server handles a significant amount of the game calculations,  are more reliable, albeit more slow. This means far fewer instances of players hacking, and more accurate hitboxes for PvP, though it also means ping will be the determinate factor for how long it takes for that rock you picked up to show up in your inventory.\n\nThere seems to be a great deal of planning that went into the overall progression and balance of Hurtworld. Although lacking in content and variety, the existing model and flow is generally more enjoyable. Rather than giving tools durability and punishing the player with the annoyance of repairing and recrafting the same basic item every 50+ uses, many items and tools do not degrade in health and remain in the player's inventory even after death. This means more of the player's time is spent collecting resources, building bases, and interacting with other players, rather than mass-crafting a number of tools to ensure they are able to cut down a few trees by the end of the day.\n\nOn the topic of PvP, because the focus of the title is survival from the standpoint of environmental and player interaction rather than from the standpoint of mass collection of raw materials, the infamy system does a relatively fine job of keeping high tier players from picking on low tier new players. Because tools, clothing, and weapons stay in your inventory unless your infamy is above 1, and because infamy is only generated by killing other players, most players refrain from wasting their infamy on kills that are not profitable from an objective standpoint. Instead, high tier players tend to focus their PvP, if they do decide they need to kill, on other individuals that actually pose a threat to them; those with guns, cars, and bases.\n\nThe art style is reminscent of TF2, with highly saturated colors, beautifully hand drawn art, and clean, low poly models. This makes the environment rather ironically comfortable to play in, and provides a warm setting to relax in when not in immediate danger, but nicely juxtaposes to the actual risk and threat of death. Similarly, the colors and shapes make distinguishing players and fauna a much easier task on lower resolution monitors, where noisy models and textures create messy scenes over the vast open world of most survival games.\n\nOverall, Hurtworld is a rare gem of polish and potential, and while it lacks in content, the promise of modding opportunities, and beautiful code framework that has been put in place for these new additions, and the general developer transparency, put this game at a relatively good starting place if compared to titles of the same genre. If you already own Rust, Ark, DayZ, etc. and feel burned out on this type of gameplay, I do not recommend this game, as you won't find much new here.\n\nHowever, if you're relatively new to the genre, or found the poor performance and clunkiness of these other titles did not suite your gameplay requirements, Hurtworld provides oddly satisfying gunplay and a reliable network free from many of the meta issues that plague other games on the market. I would recommend supporting these developers in the hope that the interest in the game spurns their updates to be released timely and regularly, with the same polish as the rest of the title.", "timestamp_created": 1449442913, "timestamp_updated": 1449442913, "voted_up": true, "votes_up": 48, "votes_funny": 3, "weighted_vote_score": "0.782351434230804443", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "22789454": {"recommendationid": "22789454", "author": {"steamid": "76561197991352270", "num_games_owned": 161, "num_reviews": 5, "playtime_forever": 3775, "playtime_last_two_weeks": 0, "playtime_at_review": 3197, "last_played": 1547882300}, "language": "english", "review": "This game was given up on by the community, I think the devs just lacked too much in sense of anti-hacker security & so everyone decided to stop playing, including myself.", "timestamp_created": 1462342337, "timestamp_updated": 1462342354, "voted_up": false, "votes_up": 192, "votes_funny": 12, "weighted_vote_score": "0.78228682279586792", "comment_count": 15, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "23371424": {"recommendationid": "23371424", "author": {"steamid": "76561198044097354", "num_games_owned": 358, "num_reviews": 15, "playtime_forever": 3863, "playtime_last_two_weeks": 0, "playtime_at_review": 3567, "last_played": 1547412409}, "language": "english", "review": "I used to recommend this game, but after the incredible lack of updates in the last 6 months and the absolute terrible community I cannot recommend this anymore. I tried to get back into this game, but the only people on now are Russians and Koreans. It's to bad this game went down hill. It had a great concept, but the developers got lazy and didn't help create a diversive community. I would recommend to all of you to look into more complete survival games that have a good community.", "timestamp_created": 1465003420, "timestamp_updated": 1465087086, "voted_up": false, "votes_up": 300, "votes_funny": 17, "weighted_vote_score": "0.780679404735565186", "comment_count": 33, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19530448": {"recommendationid": "19530448", "author": {"steamid": "76561198064657129", "num_games_owned": 880, "num_reviews": 32, "playtime_forever": 593, "playtime_last_two_weeks": 0, "playtime_at_review": 498, "last_played": 1475767524}, "language": "english", "review": "[b] Please understand that my english is not perfect . [/b]\n[b] The game in the current stage is in Early Access but still plays better than most Early Access Titles :) [/b]\n\n[b] Why is it well Pre-Planned? [/b]\nThe game in the current state is really well pre-planned you are not able to attack the PVE monsters at early game. You need to hunt for your food on easy mobs such as Dears or Rabbits . if You try to fight a Boar on a early stage of the game without a bow you are most likely going to die but that's not the case of it beging pre-planned but the really well balanced loot and difficulty.  Making anything that's based on late game is a real challenge recipes for crafting are really well planned so it's not easy or either very very hard for the basic items but items such as Riffles are not that easy to make and would require a lot of time grinding items.Building in this game is really good planned you can't grief somoene's house with just an axe you need to grind really really hard to get C4.C4 is not really that common as you may think and it requires a lot of time trying to get the correct materials to craft 1 piece of it.Last but not least the cars and temperature system , cars are really easy to find around rad zones (radiation zones)/ Towns. The trick to that is that you will need to find a lot of parts before you can drive this beauty and that's really based on your luck in towns cause the only way to get parts is from looting towns.Temperature System is really balanced you can't get rid of the cold with crafting some clothes, you are only going to get Cold Resistance so each night you are going to need to stay close to a fire otherwise you are going to freeze to death.\n\n[b] Death In This Game [/b]\nDeath in this game is based on how much Infamous you are.(You get more Infamous by killing people . I'am not 100% sure about this part but from what i red and learned myself. When you are not Infamous you drop only your items but the items in your Hotbar are still there after death that means if you had tools in your Hotbar you are going to keep them and also your clothes, backpack etc. When you get Infamous you are going to lose all your items on death.\n\n[b] Diffuculty of learning the game. [/b]\nThe game itself is really easy to learn you don't need to dive into tutorials on how to do certain things crafting is the most simple thing you could think off.You can get into the game and get experienced really quickly without spending hours.\n\n[b] About Hurtworld [/b]\nHurtworld is a hardcore survival game and the developers did a really good job on making it really a hardcore game.First 10 minutes when I got into the game it was really hard to survive at all i barely made it alive from the first night the cold was really hard to get through while running for supplies to make a basic camp fire my i was getting colder every single second.Every night you need to stay close to a source of heat otherwise you are going to die.Ofcourse there is a way to increase cold resistance but it's still challenging to survive the night.\n\n[b] Game Pros and Cons [/b]\n\n[b] Game Pros [/b]\n+ Really Really good survival it's rough to survive the first days and still challenging in the later stage of the game.\n+ It's really hard to get guns,So basicly pvp is bows and spears\n+ Cars are really balanced they are there but they are element of the end-game.\n+ The entire game is very well pre-planned.\n+ You can't get griefed easily and it's really hard to make c4 to grief somoene.\n+ There is a lot of PVE elements such as hard creatures to kill such as (Yeti and a bird with 8x times bigger head than normal birds)\n\n[b] Game Cons [/b]\n- Map is not the biggest but it's good for the current state.\n- There is couple of glitches such as your head can glitch through the wall of your own house and you can die from somoene outside.\n-Wipes,Wipes,Wipes...The game is in EA so there will be a lot of wipes while updating so get ready for it before buying :)\n \n[b] Do i recommend the game in the current state? : Yes. [/b]", "timestamp_created": 1449422448, "timestamp_updated": 1449958482, "voted_up": true, "votes_up": 197, "votes_funny": 24, "weighted_vote_score": "0.779612600803375244", "comment_count": 20, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "40912467": {"recommendationid": "40912467", "author": {"steamid": "76561198115445323", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 1396, "playtime_last_two_weeks": 0, "playtime_at_review": 1395, "last_played": 1522275980}, "language": "english", "review": "Coming from many hours sunk into Rust, I really tried to like this game. It offers so much opportunity to improve on other games in this genre, but in the end, you are much better off giving it more time to see if it will develop.   As it stands right now, it is not worth your time or money. \n\nPROS:\n+ The graphic style, while a little cartoonish at first, does work.  It looks nice and objects stand out in gameplay.\n\n+ Emphasis on survival.  You really can die of hunger and the elements if you do not take care of yourself.\n\n+ It is satisfying to build up your equipment.  No blueprint BS, just build and buff your stuff.\n\nCONS:\n- It is DEAD online.  You need to enjoy working by yourself and getting your hat handed to you by the one or two quasi clans on the few servers that sport more than 3 people online at any time.  This is a major problem that causes the other cons to spiral down even quicker.\n\n- It lacks direction.  The devs have abandoned V1 and now work on V2, which they call Experimental.  Makes you think it is a beta version, right?  Well, it sure is, but it is the only one with anything new, too.  The Devs change course seemingly update to update on the game direction, making major shifts.  This has made the game have a continuous learning curve, and rendered most online guides useless.   More than anything, this game really does not know what it wants to be when it grows up.  It has begun borrowing from other games like Rust, but sometimes without offering any new twist on the ideas.\n\n- It lacks a community.  Remember when I said it was dead?  Most players have left until things settle down.  No one is bothering to write guides, etc. when everything changes in short order.  Long time players are split between one group that wants it to be more and another that tells them to shut up and let the Devs work.  The Devs have apparently said they have made the decision not to try to rebuild the player base at this time and work on the game mechanics instead.  This is a terrible mistake, and might really mean they do not know how to bring them back.  It has meant that the two remaining camps are now just an echo chamber, and it is hard for new ideas to emerge from the community, which to me is one of the major benefits of early access.\n\n- It is buggy.  Expect things that worked yesterday to be broken today.  Expect a lot of hot fixes and server restarts.  Expect long reported problems to remain an issue.  Expect your **** to suddenly disappear from your inventory, your furnace and your storage containers.  Base building, which at first seems such an upgrade to other games, will become a nightmare over time when you try to lay a foundation that will just not ********** snap into the correct position for no known reason.\n\n- And the worse for last, it is tedious.  There is no end game, no real goal during play.  You will farm and grind, build up your equipment, gaining that previously mentioned satisfaction and then... nothing.  The same six mobs will do the same damn thing, run in the same damn patterns and give you the same damn loot regardless of how hard they are to kill.  There is not a great variety to equipment, or different things to do with it.  How you use it really doesn't matter.  Perhaps the worst examples are the landmarks, some of which are radioactive (sound familiar?).  The first time you find one, you will be excited.  Then you will notice the textures are missing; the buildings look very bland.  Still you will race around looking for that sweet loot.  Nope!  Most have nothing more than a rock to crush or a log to chop.  You cannot enter the buildings.  You can climb a few ladders, but this just wastes a few minutes and leads literally no where.\n\nIn the end, you will feel like Tom Hanks in Castway.  Alone, bored, day after day the same, nothing to do besides talking to Wilson, except Wilson isn't even a vollyball.  He's just a moldy orange with a weird name.   There are thousands of games on steam for $25 or less that will be far more satisfying.  Vote yourself off the island and buy one of those instead.", "timestamp_created": 1521429184, "timestamp_updated": 1521429480, "voted_up": false, "votes_up": 46, "votes_funny": 5, "weighted_vote_score": "0.77670663595199585", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "143528683": {"recommendationid": "143528683", "author": {"steamid": "76561198085800232", "num_games_owned": 239, "num_reviews": 7, "playtime_forever": 13389, "playtime_last_two_weeks": 0, "playtime_at_review": 13389, "last_played": 1577126864}, "language": "english", "review": "I loved this game before it was abandoned. \nEverything was great. \nPvP/PvE? Fun\nBase Building? Fun\nRaiding? Fun\nIt was a really great game.\nBut sadly it´s abandoned. \nNowadays it´s just full of cheaters.\nSo pls don´t buy this anymore.", "timestamp_created": 1691335487, "timestamp_updated": 1691335487, "voted_up": false, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.776326179504394531", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "45042507": {"recommendationid": "45042507", "author": {"steamid": "76561198167576951", "num_games_owned": 60, "num_reviews": 3, "playtime_forever": 13540, "playtime_last_two_weeks": 0, "playtime_at_review": 8926, "last_played": 1599639377}, "language": "english", "review": "BRING IT BACK", "timestamp_created": 1538408681, "timestamp_updated": 1538408681, "voted_up": true, "votes_up": 40, "votes_funny": 1, "weighted_vote_score": "0.775649666786193848", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "28393131": {"recommendationid": "28393131", "author": {"steamid": "76561198070107969", "num_games_owned": 184, "num_reviews": 17, "playtime_forever": 2829, "playtime_last_two_weeks": 0, "playtime_at_review": 2591, "last_played": 1504968362}, "language": "english", "review": "Naked natives with spears trying raid my three-storey stone castle to steal my oranges! \n\n\n\n\n\n\n\nSlav squats and campfire are included", "timestamp_created": 1481832131, "timestamp_updated": 1482569879, "voted_up": true, "votes_up": 65, "votes_funny": 76, "weighted_vote_score": "0.769939005374908447", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "63545102": {"recommendationid": "63545102", "author": {"steamid": "76561198259126652", "num_games_owned": 155, "num_reviews": 7, "playtime_forever": 676, "playtime_last_two_weeks": 0, "playtime_at_review": 669, "last_played": 1581772952}, "language": "english", "review": "h", "timestamp_created": 1581771775, "timestamp_updated": 1581771775, "voted_up": true, "votes_up": 44, "votes_funny": 11, "weighted_vote_score": "0.769609153270721436", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "21689527": {"recommendationid": "21689527", "author": {"steamid": "76561198052094113", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 3245, "playtime_last_two_weeks": 0, "playtime_at_review": 2236, "last_played": 1552842090}, "language": "english", "review": "I have played 5.3 hours of this game so far and must say: I LOVE it!\nI am a fan of survival games and fps.\nThis game combines both aspects, however I would not call it a fps per say, as pvp can be avoided.\nThe first couple of days, to be more specific nights, will be very harsh, especially for beginners. \nThe chances that you starve or freeze to death are high, but if you keep an eye out for them oranges it should all be good 😋\nOnce you have managed to set up a base, gathered resources and upgraded your essential tools, the drive to push further into the map and explore news areas will come forth.\nIt ain't easy though, trust me! \nHurtworld has surprised me by how much fun I am having. I really enjoy the graphics and sound effects too!\nAll 4 thumbs up!!", "timestamp_created": 1457372243, "timestamp_updated": 1457372384, "voted_up": true, "votes_up": 43, "votes_funny": 6, "weighted_vote_score": "0.768052160739898682", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "32437651": {"recommendationid": "32437651", "author": {"steamid": "76561197986529486", "num_games_owned": 724, "num_reviews": 590, "playtime_forever": 230, "playtime_last_two_weeks": 0, "playtime_at_review": 230, "last_played": 1476065589}, "language": "english", "review": "2020 still applies: Hurtworld: If Rust had a mentally handicapped little brother who wanted to be 'just like him'.", "timestamp_created": 1497535832, "timestamp_updated": 1580043071, "voted_up": false, "votes_up": 105, "votes_funny": 92, "weighted_vote_score": "0.76790541410446167", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "32832336": {"recommendationid": "32832336", "author": {"steamid": "76561197978399630", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 29929, "playtime_last_two_weeks": 0, "playtime_at_review": 26997, "last_played": 1670292404}, "language": "english", "review": "The game started out hot when it first released, but then if fell into the early access wormhole. STEAM needs to figure out a way to offer refunds to Early Access purchasers when there is no considerable attempt made by the game developer to add to, fix, or complete the game. I know this an impossible request but something needs to be done about the EA trend and how it operates. \n\nEverything stated by Sieme on June 11th is 100% accurate and true as I also have 400+ hours into the game. I used to wonder \"what clown puts that much time into a game that they don't like?\" Well I now understand, when the game first released it was fun and fresh for the first few months with HOPES of new add ons and massive updates. That never happened and the game became stale and lost player interest. Now the only players that are left playing are BOTs or that guy you see in the WoW episode of South Park.", "timestamp_created": 1498514233, "timestamp_updated": 1498514233, "voted_up": false, "votes_up": 57, "votes_funny": 4, "weighted_vote_score": "0.767397761344909668", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "81572443": {"recommendationid": "81572443", "author": {"steamid": "76561198874213399", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1482, "playtime_last_two_weeks": 0, "playtime_at_review": 1348, "last_played": 1607643100}, "language": "english", "review": "pretty good game until you have a hacker teleport onto you and spawn kill you over and over again and then c4 everything you once knew", "timestamp_created": 1607064959, "timestamp_updated": 1607064959, "voted_up": true, "votes_up": 38, "votes_funny": 15, "weighted_vote_score": "0.763317763805389404", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "41658299": {"recommendationid": "41658299", "author": {"steamid": "76561198011040260", "num_games_owned": 104, "num_reviews": 10, "playtime_forever": 34730, "playtime_last_two_weeks": 0, "playtime_at_review": 29071, "last_played": 1605369415}, "language": "english", "review": "by the time you update to v2 all the playerbase will be gone. Returning back to this game to check the news, just to find empty servers :(.... too bad. Had so much potential", "timestamp_created": 1524566924, "timestamp_updated": 1524566924, "voted_up": true, "votes_up": 42, "votes_funny": 4, "weighted_vote_score": "0.755859613418579102", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "48302901": {"recommendationid": "48302901", "author": {"steamid": "76561198056462061", "num_games_owned": 953, "num_reviews": 26, "playtime_forever": 5500, "playtime_last_two_weeks": 0, "playtime_at_review": 5495, "last_played": 1623490926}, "language": "english", "review": "Great game overall but the community is 90% kos russians. Would play it again if the community had more english speaking players.", "timestamp_created": 1547379708, "timestamp_updated": 1547379708, "voted_up": true, "votes_up": 46, "votes_funny": 14, "weighted_vote_score": "0.755094766616821289", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "51164379": {"recommendationid": "51164379", "author": {"steamid": "76561198241748128", "num_games_owned": 0, "num_reviews": 37, "playtime_forever": 523, "playtime_last_two_weeks": 0, "playtime_at_review": 193, "last_played": 1560226592}, "language": "english", "review": "its a cartoonish version of rust, which i like. right now it needs alot more finish and polish. and is a bit buggy. i dont think i will play much until finished. just a lot left to be done. but GREAT potential here for an amazing game. Hope they see it through!", "timestamp_created": 1560207689, "timestamp_updated": 1560207689, "voted_up": true, "votes_up": 61, "votes_funny": 3, "weighted_vote_score": "0.75138324499130249", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "42959345": {"recommendationid": "42959345", "author": {"steamid": "76561198059048749", "num_games_owned": 0, "num_reviews": 23, "playtime_forever": 3636, "playtime_last_two_weeks": 0, "playtime_at_review": 2658, "last_played": 1473641930}, "language": "english", "review": "In the current state of hurtworld it is an awful game. Servers are dead and the development of the game is dead as well. (A 3/10)\n\nWhen this game first came out it was wonderful, full of updates, and an active community. (A solid 7/10)\n\nI feel as if the devs really dropped the ball on this game. It could've been a great commppettitor to bigger games in this genre such as Rust.", "timestamp_created": 1529743285, "timestamp_updated": 1529743285, "voted_up": false, "votes_up": 40, "votes_funny": 1, "weighted_vote_score": "0.74982684850692749", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "38147618": {"recommendationid": "38147618", "author": {"steamid": "76561198084871312", "num_games_owned": 0, "num_reviews": 63, "playtime_forever": 766, "playtime_last_two_weeks": 0, "playtime_at_review": 415, "last_played": 1643677167}, "language": "english", "review": "For all the things you can do in this game, $30.99 is just daylight robbery considering little has changed in two years of it being around.\n\n19/01/19 - Looks like they've added some more stuff!", "timestamp_created": 1512719807, "timestamp_updated": 1547815123, "voted_up": false, "votes_up": 54, "votes_funny": 2, "weighted_vote_score": "0.745056271553039551", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19588391": {"recommendationid": "19588391", "author": {"steamid": "76561198087380949", "num_games_owned": 129, "num_reviews": 59, "playtime_forever": 5990, "playtime_last_two_weeks": 0, "playtime_at_review": 4052, "last_played": 1589229585}, "language": "english", "review": "Listen people, this game has been out 5 days and there is over 6000 people online. There is a reason why!\nI have played practically all the well known survival games on the market. DayZ, Arma2, Arma 3, Rust, Miscreated, H1z1 Reign of Kings.. the list goes on. And year after year a new survival game comes out which is IDENTICAL to the last. \n\nBe warned, this game is considered a Hardcore Survival. This isn't your average \"Get everything in 4 hours of gameplay\" game. It's hardcore, the biggest initial challenges is keeping your hunger bar under control and staying warm. The players aren't the only enemies in question here. The terrign, the animals, the players are all out there to kill you, and it's your job to stay alive. Having said that, when you have aquired your clothes as you may know you keep it (unless you're infamous). I love the infamous system as it makes people think twice before shooting noobs. \n\nThis game is absolutely amazing, I have played 6 hours of it currently and will be playing many many more. Those that are saying \"Oh right, yeah another survival sandbox big deal\" think again my academically challenged friend, this has all of the best parts of Rust, Arma 3, ARK all mixed into one orgggggggasmic game. The developers work hard, the game has frequent updates to what has been shown and it's phenominal.\n\nTwo words word. Rust Legacy. I'm not going to go ahead and say the game is identical to legacy because it is far from it, but I don't know what it is about it, but it's so so good. Looking at gameplay, it has the ability to make the game not look good, but when you get in, and you're doing it believe you me it's awesome.\n\n\"Do I buy this game?\" Well, do you need oxygen to breath? \n\nGraphics: 9/10 = Quirky and you soon get used to it\nFPS: 10/10 = Highly Optimised for such an early access title\nGameplay = 9/10\nDevelopers so far: = 9/10\n\nVerdict: 9.2/10     = Kiss goodbye your life and get it on the DL\n\nPS: If you're looking for a great server to get set up on search in the community bar \"Noob friendly\" and you will see \"=UNITY= Noob Friendly ‐ Kits ‐ Extra Loot ‐ DDOS Pro ‐\" or type in the f1 console \"connect 185.38.149.27:12881\"  it's great and the admins are really helpful for teaching newbies the game:D", "timestamp_created": 1449690367, "timestamp_updated": 1450008951, "voted_up": true, "votes_up": 329, "votes_funny": 68, "weighted_vote_score": "0.744440317153930664", "comment_count": 27, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "114209802": {"recommendationid": "114209802", "author": {"steamid": "76561198045717508", "num_games_owned": 264, "num_reviews": 36, "playtime_forever": 22063, "playtime_last_two_weeks": 0, "playtime_at_review": 22063, "last_played": 1566197275}, "language": "english", "review": "Abandonded game AVOID AT ALL COSTS!", "timestamp_created": 1650518709, "timestamp_updated": 1650518709, "voted_up": false, "votes_up": 25, "votes_funny": 2, "weighted_vote_score": "0.744128584861755371", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "78989264": {"recommendationid": "78989264", "author": {"steamid": "76561198040665960", "num_games_owned": 146, "num_reviews": 61, "playtime_forever": 1080, "playtime_last_two_weeks": 0, "playtime_at_review": 1080, "last_played": 1548771663}, "language": "english", "review": "The Developers abandoned their game. DO NOT BUY", "timestamp_created": 1604917665, "timestamp_updated": 1604917665, "voted_up": false, "votes_up": 30, "votes_funny": 0, "weighted_vote_score": "0.740797042846679688", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "21112868": {"recommendationid": "21112868", "author": {"steamid": "76561198157620987", "num_games_owned": 227, "num_reviews": 31, "playtime_forever": 1717, "playtime_last_two_weeks": 0, "playtime_at_review": 728, "last_played": 1475580455}, "language": "english", "review": "The devs of this game have made more progress in 3 months for this game than the devs of DayZ who toke 3 years and then some \n\n\n8/10 Very good game for its value", "timestamp_created": 1455140052, "timestamp_updated": 1455140052, "voted_up": true, "votes_up": 101, "votes_funny": 41, "weighted_vote_score": "0.738509953022003174", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "70925514": {"recommendationid": "70925514", "author": {"steamid": "76561198972023933", "num_games_owned": 59, "num_reviews": 11, "playtime_forever": 2638, "playtime_last_two_weeks": 0, "playtime_at_review": 2241, "last_played": 1592571100}, "language": "english", "review": "trash servers,few players(and some bugs including animals go through objects like Rams can atack u through the wood logs)\n", "timestamp_created": 1592386587, "timestamp_updated": 1592386587, "voted_up": false, "votes_up": 21, "votes_funny": 2, "weighted_vote_score": "0.736648261547088623", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "29045212": {"recommendationid": "29045212", "author": {"steamid": "76561198152145595", "num_games_owned": 95, "num_reviews": 10, "playtime_forever": 14226, "playtime_last_two_weeks": 0, "playtime_at_review": 2369, "last_played": 1610919972}, "language": "english", "review": "I like the game but i dont understand why the game is more expensive than \"rust\" this game is way under developed for the price", "timestamp_created": 1483652237, "timestamp_updated": 1483652237, "voted_up": true, "votes_up": 42, "votes_funny": 1, "weighted_vote_score": "0.735954463481903076", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "50846990": {"recommendationid": "50846990", "author": {"steamid": "76561198013234388", "num_games_owned": 165, "num_reviews": 8, "playtime_forever": 2700, "playtime_last_two_weeks": 0, "playtime_at_review": 2620, "last_played": 1576098399}, "language": "english", "review": "I love Ark.\n\nI love Rust.\n\nBut I prefer Hurt World.\n\nSimply because it has objectives / territories so therefore gives you a purpose for playing. Depending on server, and whether there is good competition, this could drive your game time / longevity up.\n\nPlayer base for HurtWorld is unfortunately a bit low atm which means you're options are limited to only a few viable servers but the potential for a really fun PvP Survival game is there!", "timestamp_created": 1558825996, "timestamp_updated": 1558825996, "voted_up": true, "votes_up": 75, "votes_funny": 6, "weighted_vote_score": "0.734286189079284668", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "40467705": {"recommendationid": "40467705", "author": {"steamid": "76561198017749376", "num_games_owned": 470, "num_reviews": 83, "playtime_forever": 1962, "playtime_last_two_weeks": 0, "playtime_at_review": 1962, "last_played": 1521072126}, "language": "english", "review": "[h1] Update: I attempted to play V2 and it crashes to desktop. I searched on the forums for a fix, but got tired of sifting through the extensive variety of bug report threads. My non-recommendation still stands for now. [/h1]\n\n[h1] Why did I buy it: [/h1]\n\nI was bored and looking for new games in the genre.\n\n[h1] Were early expectations met: [/h1]\n\nIt satisfied my boredom initially. The trailer makes it seem much more fun than it is. Good old editing.\n\n[h1] Did I find it fun: [/h1]\n\nOnly for a short time. The server qualities are questionable. Starting out seems extra annoying as environmental penalties start to weigh in quickly. The game’s ambient noise makes it feel hollow and vacant, as opposed to rich with life like it’s PvE monsters and animals suggest.\n\n[h1] DLC: [/h1]\n☐ yes\n☑ no \n\n[h1] What sets it apart: [/h1]\n\nIt has some likeable models and PvE elements.\n\n[h1] What sets it back: [/h1]\n\nWhat doesn’t? There’s not much reason to pick this up unless your hardware can’t pull off the better games in the genre.\n\n[h1] How playable/complete does it feel: [/h1]\n\n☐ 1:\n☑ 2: Game seems not to have changed much since my last time with it. It works, you can play it, check out its biomes, creatures, crafting tiers etc, but I really feel you needs friends for this\n☐ 3\n☐ 4: \n☐ 5:\n\n[h1] How fulfilled was I for what I got for the price: [/h1]\n\n☐ 1:\n☑ 2: It solved some temporary boredom\n☐ 3: \n☐ 4: \n☐ 5: \n\n[h1] Who would I recommend this to: [/h1]\n\n☐ fans of the game/series\n☐ fans of the genre \n☐ looking for something new\n☑ other: fans of the genre who have difficulty running more renowned games on their hardware \n\n[h1] Development: [/h1]\nActive\n\n[h1] ❤ Audience: [/h1]\n☐ Kids\n☐ Everyone\n☑ Casual players\n☐ Pro players\n\n[h1] ☼ Graphics: [/h1]\n☐ Bad\n☑ OK: For the amount of visual options sliders in the menu.. Nothing special here at all \n☐ Good: \n☐ Beautiful\n☐ Masterpiece\n\n[h1] ♫ Audio: [/h1]\n☑ Bad: the SFX are very peculiar. The deer walking sounds like a guy making kissy noises or something. Ambient noise is hollow and empty feeling, which provides the world with that tone.\n☐ OK \n☐ Good \n☐ Beautiful\n☐ Masterpiece\n\n[h1] $ Price/quality: [/h1]\n☐ Full price worth it\n☑ Wait for sale\n☐ Average price/quality\n☐ Refund it if you can\n☑ Don't do it: I really don’t like checking this box, but I need reasons to suggest this title over others in the genre, and it’s not giving me any\n☐ Free\n\n[h1] ☼ Difficulty: [/h1]\n☐ Easy \n☐ Large learning curve\n☑ Easy to learn / Hard to master\n☑ Hard for the first few hours\n\n[h1] ۞ Game time/length [/h1]\n☐ Quick Matches ( less than 1 hour)\n☐ Short (1-2 hours)\n☐ Few hours (2-4 hours)\n☐ Long (4+)\n☑ Endless\n\n[h1] ⌬ Story [/h1]\n☑ It doesn't have:\n☐ Average: \n☐ Good\n☐ Fantastic\n\n[h1] § Bugs [/h1]\n☐ bugs destroying the game\n☐ lot of bugs \n☑ not too many bugs\n☐ nothing\n\n[h1] ✦ Others: [/h1]\n☑ multiplayer: \n☑ single player: \n☐ achievements:\n\n[h1] As always, check a game’s store page for basic info on the product. [/h1]\n\nIf you found this review helpful, come follow my curator page: \nhttps://store.steampowered.com/curator/32194517/\n\n\nFeel free to check out the attached group as well:\nhttps://steamcommunity.com/groups/ratherbegaming", "timestamp_created": 1519842145, "timestamp_updated": 1525450557, "voted_up": false, "votes_up": 42, "votes_funny": 4, "weighted_vote_score": "0.7336883544921875", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "21299177": {"recommendationid": "21299177", "author": {"steamid": "76561198011118474", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 4163, "playtime_last_two_weeks": 0, "playtime_at_review": 911, "last_played": 1617577610}, "language": "english", "review": "I am a 23 year old male, and this game made me come close to tears. I'll explain....\n\nThis game is hard as shit. It took my friend and I 10+ hours to build a base worthy of standing up to a raid.  For three days we logged on to add more to our base always afraid of making a mistake that would leave us vulnerable. On the third day, after we finally began to gain enough courage to venture our to far reaches of the map, we opened our door to find 4 naked men standing outside, and they rushed in. We had somehow left our outside airlock open, and the moment I saw them, I knew it was over. Their 8 year old voices screeched through my headphones as they ransacked our base, taking everything and destroying our walls. I sat their shocked, letting myself get killed over and over by these nude characters that had inflicted so much pain on my soul. It was in that moment I found a tear creeping into the corner of my eye as all of our hardwork was ruined. Our base was obliterated, and so too our hopes and dreams. \n\n10/10 would almost cry again.", "timestamp_created": 1455813425, "timestamp_updated": 1455813425, "voted_up": true, "votes_up": 79, "votes_funny": 150, "weighted_vote_score": "0.733116209506988525", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19783311": {"recommendationid": "19783311", "author": {"steamid": "76561198101295783", "num_games_owned": 413, "num_reviews": 7, "playtime_forever": 4093, "playtime_last_two_weeks": 0, "playtime_at_review": 183, "last_played": 1561424393}, "language": "english", "review": "First day, spawn in a dessert walked around for a bit, guy runs up to me and asks for my pants, told him its a default skin.\nShoots me.\nDied from pants robbery 11/10", "timestamp_created": 1450537401, "timestamp_updated": 1450537401, "voted_up": true, "votes_up": 305, "votes_funny": 925, "weighted_vote_score": "0.728910326957702637", "comment_count": 11, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "50264677": {"recommendationid": "50264677", "author": {"steamid": "76561198342273127", "num_games_owned": 130, "num_reviews": 24, "playtime_forever": 49, "playtime_last_two_weeks": 0, "playtime_at_review": 49, "last_played": 1548547508}, "language": "english", "review": "This was once a good game, honestly spend the extra money and buy Rust", "timestamp_created": 1555926133, "timestamp_updated": 1555926133, "voted_up": false, "votes_up": 32, "votes_funny": 3, "weighted_vote_score": "0.728265881538391113", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "62115656": {"recommendationid": "62115656", "author": {"steamid": "76561198116558079", "num_games_owned": 115, "num_reviews": 3, "playtime_forever": 2418, "playtime_last_two_weeks": 0, "playtime_at_review": 1810, "last_played": 1580341064}, "language": "english", "review": "its a poor mans Rust. There is even a potato mode for people with bad computers. this is why i bought it over Rust. It will do the trick if thats the type of gameplay youre looking for. other than that dont expect to much, but it is still a fun game. all in all its worth it especially on sale.", "timestamp_created": 1579485178, "timestamp_updated": 1579485178, "voted_up": true, "votes_up": 29, "votes_funny": 5, "weighted_vote_score": "0.727699458599090576", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "48289268": {"recommendationid": "48289268", "author": {"steamid": "76561198021362408", "num_games_owned": 254, "num_reviews": 48, "playtime_forever": 535, "playtime_last_two_weeks": 0, "playtime_at_review": 463, "last_played": 1578413287}, "language": "english", "review": "People in this game are more toxic than in RUST. And that is saying something. While the game itself is pretty good, players are making it frustrating because some of the older (longer playing) people (especially the russian, polish and chinese) are just door camping a new players sh*tshack when he or she finally manages to figure out how to make one. Or just plainly kill new players on sight regardless of what they have on them, you literally can run around with your d*ck hanging. freezing to death and crap and other players will just kos for no reason.", "timestamp_created": 1547329237, "timestamp_updated": 1547329237, "voted_up": true, "votes_up": 66, "votes_funny": 39, "weighted_vote_score": "0.721294879913330078", "comment_count": 18, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "78916599": {"recommendationid": "78916599", "author": {"steamid": "76561198009813968", "num_games_owned": 39, "num_reviews": 1, "playtime_forever": 91500, "playtime_last_two_weeks": 0, "playtime_at_review": 85701, "last_played": 1693713350}, "language": "english", "review": "1400 hours into this game. It was the most fun I've ever had on a survival game tbh. Had a ton of potential, but the Devs abandoned it after the last update in January =/", "timestamp_created": 1604801190, "timestamp_updated": 1604801190, "voted_up": true, "votes_up": 22, "votes_funny": 2, "weighted_vote_score": "0.720788359642028809", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "20534188": {"recommendationid": "20534188", "author": {"steamid": "76561198109989686", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 9038, "playtime_last_two_weeks": 0, "playtime_at_review": 899, "last_played": 1641078331}, "language": "english", "review": "This game. . . MAN does it have potential to be the next best \"Early Access Survival Simulator.\" I have made many a friend playing this, and it has to be the most punishing survival game this world has ever seen. The fall damage is realistic, you can break your legs and such, and there are many elements such as sun, hunger, health, cold, poison, heatstroke, bleeding, and many more. Each one will kill you if it gets bad enough. The gunplay is fantastic and realistic. One shot kills most of the time, so people who have survived long enough to get a gun basically rule the region. Cars are EXTREMELY hard to come by and build, making them just that much more satisfying to finally finish. You must deal with raids and raid-proofing your base, and you must make friends or enemies to survive. Conclusion: I HIGHLY recommend this game to anyone who loves a good survival game, and is interested in watching it grow over time.", "timestamp_created": 1452831460, "timestamp_updated": 1452831460, "voted_up": true, "votes_up": 39, "votes_funny": 5, "weighted_vote_score": "0.720482289791107178", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "48467298": {"recommendationid": "48467298", "author": {"steamid": "76561198083229859", "num_games_owned": 143, "num_reviews": 16, "playtime_forever": 2459, "playtime_last_two_weeks": 0, "playtime_at_review": 2377, "last_played": 1548105100}, "language": "english", "review": "Just buy rust", "timestamp_created": 1548102206, "timestamp_updated": 1548102206, "voted_up": false, "votes_up": 25, "votes_funny": 2, "weighted_vote_score": "0.719719231128692627", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "62166319": {"recommendationid": "62166319", "author": {"steamid": "76561198440106465", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 6341, "playtime_last_two_weeks": 0, "playtime_at_review": 6341, "last_played": 1579577851}, "language": "english", "review": "Game is just bad, not sure how it has good reviews... I don't usually leave reviews but this game drove me to...\n\npros- simple mechanics, gun Play, fun with friends, time killer, fun concept, and that's where that ends.\n\ncons- glitches, VERY Toxic community, countless areas to get stuck on map and have to die and respawn to get out, no new content ever, devs pretty much have given up or make progress about as fast as molasses runs down a wall, hacks, hacks, hacks, hacks, hacks, hacks, hacks, and hacks.\n\nso hacks are apart of gaming(especially on PC) i get it, but when i dump over 50 hours into a base and then here comes ol' johnny two cheat and he gets in my base like he owns the place, and then takes all my hard earned stuff in a matter of 30 secs and there is absolutely no way to report cheating, that's where I have a problem. I started over because hey maybe its a one off situation... nope if it not hacks to see where your totem is then its hacks to just get in the base like they own, if its not that then its aim hacks or speeds hacks... you name it this game has it and the devs don't give one lick about it. So save your money here and buy a game with REAL devs that care about the integrity of their game. Btw I purchased this game for like $9 and that was like $9 too much, would not play this dumpster fire of a game if it was free. STEER CLEAR - Just play rust", "timestamp_created": 1579579729, "timestamp_updated": 1580277804, "voted_up": false, "votes_up": 58, "votes_funny": 12, "weighted_vote_score": "0.714428186416625977", "comment_count": 9, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "25500390": {"recommendationid": "25500390", "author": {"steamid": "76561198015987692", "num_games_owned": 0, "num_reviews": 28, "playtime_forever": 2658, "playtime_last_two_weeks": 0, "playtime_at_review": 2517, "last_played": 1604530670}, "language": "english", "review": "If you like Rust and miss Battlefield heroes,\n\nthis is something for you.\n\nNever forget you BFH. <3", "timestamp_created": 1473801769, "timestamp_updated": 1505151315, "voted_up": true, "votes_up": 30, "votes_funny": 8, "weighted_vote_score": "0.714206337928771973", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "42374477": {"recommendationid": "42374477", "author": {"steamid": "76561198203074633", "num_games_owned": 0, "num_reviews": 34, "playtime_forever": 3358, "playtime_last_two_weeks": 0, "playtime_at_review": 3358, "last_played": 1527647472}, "language": "english", "review": "The game is almost dead. I redownloaded it a few days ago to boot it up and see and most servers didn't have over 20 players in them the highest was 11. Maybe it was the time when I hopped on but I have heard the game is just dead or on a decline. If you like small population servers then the game might be for you. The devs I feel have almost abandoned the game. The game looks like it made a little progression since I last played which was probably early to mid 2016. All in all a great game but its just rotting unless they do something.", "timestamp_created": 1527647707, "timestamp_updated": 1527647707, "voted_up": false, "votes_up": 39, "votes_funny": 1, "weighted_vote_score": "0.711563646793365479", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "75871213": {"recommendationid": "75871213", "author": {"steamid": "76561197993510286", "num_games_owned": 1081, "num_reviews": 16, "playtime_forever": 258854, "playtime_last_two_weeks": 0, "playtime_at_review": 258854, "last_played": 1589976220}, "language": "english", "review": "Before considering buying this game, read the community forums.\n\n* The game is overrun with cheaters.\n* Community admins are more concerned with retaining server population than banning them.\n* The developer appears to have abandoned the game.\n\nThe expected experience for a new player should be to get killed a lot and raided a lot and never actually work out why until they realise the extent of cheating. The reviews currently average to \"mostly positive\", but beware that this is heavily skewed by times when the community was much more optimistic about the prospects for this game.", "timestamp_created": 1599944262, "timestamp_updated": 1599944499, "voted_up": false, "votes_up": 18, "votes_funny": 2, "weighted_vote_score": "0.708989143371582031", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "34384100": {"recommendationid": "34384100", "author": {"steamid": "76561198009039007", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 16726, "playtime_last_two_weeks": 0, "playtime_at_review": 15654, "last_played": 1520497895}, "language": "english", "review": "The game was fun for the first two months after release into EA.\nThen people started using glitches and bugs to their advantage, and forcing newer players out of the game... Which is why servers are mostly dead nowadays beside EU.\n\nOver a year there were no updates beside blogposts, excluding  some really minor changes.\nRecently there is released experimental v2 version, which shows alot diffrent aproach and basically is a diffrent game comletly - and for the most part is even more of a mess than v1.\n\n- The glitches are still present.\n- AI still is acting like a rubber ball on aids.\n- New map layout is was too confusing and shitty, without distinct orientation points unlike previous one.\n- Radiation in later bomes is a nice touch, too bad that when you die and respawn you die again in your base since you have no clothes to protect you\n- Animals doesn't drop food, beside rabbits and deers - which seem to be absent from future biome.\n- Some major graphic glitches are happening.\n\nI would not recomend buying this game unless it's on a sale, it's not worth the money in a current state.", "timestamp_created": 1503270398, "timestamp_updated": 1503270398, "voted_up": false, "votes_up": 36, "votes_funny": 2, "weighted_vote_score": "0.708648264408111572", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19558347": {"recommendationid": "19558347", "author": {"steamid": "76561197964015217", "num_games_owned": 775, "num_reviews": 13, "playtime_forever": 3347, "playtime_last_two_weeks": 0, "playtime_at_review": 2947, "last_played": 1450632527}, "language": "english", "review": "Solid (and very fun) little game at this time, Please note however that content is still constantly under construction. \n\nPositives:\n+ Generally smooth performance\n+ Decent voip and nameplates only appear when very close \n+ Variety of PVE encounters that can actually be challenging \n+ Excellent base building mechanics\n+ Large number of gfx options\n+ Huge and varied map\n+ FOV slider (why do more games not have this?)\n+ Bandit/Karma/Infamy system (needs work however foundation is there)\n+ Base raiding is possible but very expensive\n+ Dev team listen to and liase with the community.\n\nNegatives:\n- Tiering needs looking at\n- Resource spawning can take a long time \n- Few weapon options\n- Some rubber banding. \n- Possibly a memory leak/gfx glitch, perfomance seems to decrease over time (using Nvidia(maxwell) gpu) \n- Not much in the way of resource variety\n- Over reliance on certain resoures\n- Food doesn't stack which is more an irritance than a challenge \n- Few bugs like clipping through walls, mobs spawning on players etc.\n- Rumors of hacking already surfacing. \n- No Server que system\n\nThe overall sucesss of this game will depend on how often the devs fix bugs and add new content.", "timestamp_created": 1449541339, "timestamp_updated": 1449978275, "voted_up": true, "votes_up": 32, "votes_funny": 2, "weighted_vote_score": "0.706906616687774658", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "89883870": {"recommendationid": "89883870", "author": {"steamid": "76561198206220415", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 15088, "playtime_last_two_weeks": 0, "playtime_at_review": 15088, "last_played": 1550879700}, "language": "english", "review": "Take the money and RUN. Devs are long gone. Do not pay for a dead game.", "timestamp_created": 1617800122, "timestamp_updated": 1617800122, "voted_up": false, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.706832587718963623", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "57982641": {"recommendationid": "57982641", "author": {"steamid": "76561198217124399", "num_games_owned": 93, "num_reviews": 6, "playtime_forever": 17421, "playtime_last_two_weeks": 0, "playtime_at_review": 15412, "last_played": 1611598481}, "language": "english", "review": "Fun with friend boring solo", "timestamp_created": 1574805194, "timestamp_updated": 1574805194, "voted_up": true, "votes_up": 47, "votes_funny": 8, "weighted_vote_score": "0.705627918243408203", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "60188605": {"recommendationid": "60188605", "author": {"steamid": "76561198059024147", "num_games_owned": 82, "num_reviews": 5, "playtime_forever": 83873, "playtime_last_two_weeks": 0, "playtime_at_review": 76743, "last_played": 1679762008}, "language": "english", "review": "This game is differend ive played many survial games like: Rust, Dayz, Miscreated, h1z1 and by this far i've liked hurtworld the most. It has a nice look like a comic i guess (idk how it called) but anyway its not the most hard game and its fun with friends and if you dont have friend make them! But becarefull there are some basterds right there.\nSo lets make it clear\n- Cartoon look (got um)\n- Not hard to learn 6/10 difficult\n- i've got 1200+ hours that was the point i started getting boired cause there was no new content (there updating and got big plans lets hope they do it for real this time)\n- Not a heavy game for your computer (you even got potato mode Lmao)\n- PvP, cars, choppers, airdrops, Raiding, Motors and ATV's i mean guys and girls what you want more? (minigun plz?)\n- You can do kinda easter egg missions for skins, armored car parts, chopper armored parts\n- Ore Drills for you fat chubbys so you dont have to get it by yourself jk jk <3\nTown events for high quality loot (like a detonator cap needed and only way to make C4)\n- Hyped? buy it and lets grow this game back up!", "timestamp_created": 1576866691, "timestamp_updated": 1576866691, "voted_up": true, "votes_up": 36, "votes_funny": 11, "weighted_vote_score": "0.70516514778137207", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "19703554": {"recommendationid": "19703554", "author": {"steamid": "76561198089660574", "num_games_owned": 77, "num_reviews": 3, "playtime_forever": 1305, "playtime_last_two_weeks": 0, "playtime_at_review": 1198, "last_played": 1500537797}, "language": "english", "review": "Very fun! I can say for being a week old still in Alpha, it's by FAR the best game i've ever spent $20 on. Better than some of the more comparable games like Rust, H1Z1, and Salt. I [b]HIGHLY[/b] recomend this game, and enjoy every time i get to play it. I feel the [b]Developers are VERY positive, and willing to listen to the community[/b]! So, what are you waiting for? Buy the game! Be yourself wether you are building a huge castle, or cooking your own food! I hope everyone get's to enjoy this game as much as I do, have a GOOD one! :)", "timestamp_created": 1450139893, "timestamp_updated": 1450139893, "voted_up": true, "votes_up": 39, "votes_funny": 5, "weighted_vote_score": "0.704244494438171387", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19479129": {"recommendationid": "19479129", "author": {"steamid": "76561198009978959", "num_games_owned": 3029, "num_reviews": 105, "playtime_forever": 425, "playtime_last_two_weeks": 0, "playtime_at_review": 125, "last_played": 1547352662}, "language": "english", "review": "Twitch skill based PvP survival with a lot of potential and a bunch of progress to work towards despite the game being early access, well worth a buy even in its early stages!", "timestamp_created": 1449243050, "timestamp_updated": 1449243050, "voted_up": true, "votes_up": 46, "votes_funny": 4, "weighted_vote_score": "0.70401996374130249", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "133141130": {"recommendationid": "133141130", "author": {"steamid": "76561198110866193", "num_games_owned": 180, "num_reviews": 27, "playtime_forever": 1259, "playtime_last_two_weeks": 0, "playtime_at_review": 1259, "last_played": 1457202964}, "language": "english", "review": "Abandoned by devs :(", "timestamp_created": 1676771048, "timestamp_updated": 1676771048, "voted_up": false, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.702012300491333008", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "71714440": {"recommendationid": "71714440", "author": {"steamid": "76561197996273719", "num_games_owned": 0, "num_reviews": 802, "playtime_forever": 3812, "playtime_last_two_weeks": 0, "playtime_at_review": 3812, "last_played": 1507129224}, "language": "english", "review": "[h1] --{Graphics}--- [/h1]\n\n☐ Beautiful\n☑ Good\n☐Decent\n☐ Bad\n\n[h1] ---{Gameplay}--- [/h1]\n\n☐ Very good\n☑  Good\n☐ It‘s just gameplay\n☐ so lala\n☐ Starring at walls is better\n\n[h1] ---{Audio}--- [/h1]\n\n☐ Very good\n☑  Good\n☐ Not too bad\n☐ Bad\n\n[h1] ---{Difficulity}--- [/h1]\n\n☐ Easy\n☐ Significant brain usage\n☑  Easy to learn / Hard to master\n☐ Difficult\n☐ Dark Souls\n\n[h1] ---{Story}--- [/h1]\n\n☑ no Story\n☐ Text or Audio floating around\n☐ Average\n☐Good\n☐Lovely\n\n[h1] ---{Game Time}--- [/h1]\n\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n[h1] ---{Price}--- [/h1]\n\n☐ It’s free!\n☑  Worth the price\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n[h1] ---{Bugs}--- [/h1]\n\n☐  Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ see Rust\n\n[h1] ---{Achievements}--- [/h1]\n\n☑ no Achievements\n☐ Nothing to grind\n☐ Only if u care about achievements\n☐ Isnt necessary to progress\n☐Average grind level\n☐ Too much grind\n☐ You‘ll need a second live for grinding\n\n[h1] Trading Cards  [/h1]\n\n☐ Yes\n☑ No\n\n☑  Its only my Opinion ☑", "timestamp_created": 1593505707, "timestamp_updated": 1593505707, "voted_up": true, "votes_up": 57, "votes_funny": 7, "weighted_vote_score": "0.70082324743270874", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43201602": {"recommendationid": "43201602", "author": {"steamid": "76561198056546335", "num_games_owned": 276, "num_reviews": 128, "playtime_forever": 27, "playtime_last_two_weeks": 0, "playtime_at_review": 27, "last_played": 1461881681}, "language": "english", "review": "Dead Game. Do not buy.", "timestamp_created": 1530404762, "timestamp_updated": 1530404762, "voted_up": false, "votes_up": 30, "votes_funny": 10, "weighted_vote_score": "0.700341939926147461", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "130769927": {"recommendationid": "130769927", "author": {"steamid": "76561198303033669", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 102452, "playtime_last_two_weeks": 0, "playtime_at_review": 100232, "last_played": 1685822799}, "language": "english", "review": "i like the OLD hurtworld! that was the best survival game ever. they never had to make a new hurtworld, they have to bring back the old one.", "timestamp_created": 1673627285, "timestamp_updated": 1673627285, "voted_up": true, "votes_up": 20, "votes_funny": 2, "weighted_vote_score": "0.698477029800415039", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "49901947": {"recommendationid": "49901947", "author": {"steamid": "76561198360918722", "num_games_owned": 153, "num_reviews": 14, "playtime_forever": 3944, "playtime_last_two_weeks": 0, "playtime_at_review": 3936, "last_played": 1577325882}, "language": "english", "review": "Was a very popular game back in 2015, but now it’s dead and nothing but foreign servers of people you can’t even understand. I would recommend it 4 years ago but sadly I can’t say the same for today.", "timestamp_created": 1554162520, "timestamp_updated": 1554162520, "voted_up": false, "votes_up": 21, "votes_funny": 0, "weighted_vote_score": "0.698369741439819336", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "39952430": {"recommendationid": "39952430", "author": {"steamid": "76561198085440206", "num_games_owned": 62, "num_reviews": 3, "playtime_forever": 4097, "playtime_last_two_weeks": 0, "playtime_at_review": 3541, "last_played": 1678833309}, "language": "english", "review": "A really good game, too bad it's dead and full of tryhard russians.\nApart from sometimes getting stuck in your base or a rock, you can't really tell it's early access.", "timestamp_created": 1518181439, "timestamp_updated": 1518181439, "voted_up": true, "votes_up": 27, "votes_funny": 3, "weighted_vote_score": "0.69756704568862915", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "103501422": {"recommendationid": "103501422", "author": {"steamid": "76561199183796281", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 24042, "playtime_last_two_weeks": 0, "playtime_at_review": 711, "last_played": 1704854097}, "language": "english", "review": "this game could've blown up like rust but it died... shame its actually so fun with some buddies #bringthisgameback!", "timestamp_created": 1637785568, "timestamp_updated": 1637785568, "voted_up": true, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.696649789810180664", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23369298": {"recommendationid": "23369298", "author": {"steamid": "76561198027057860", "num_games_owned": 631, "num_reviews": 72, "playtime_forever": 11722, "playtime_last_two_weeks": 0, "playtime_at_review": 10716, "last_played": 1602080770}, "language": "english", "review": "I can no longer recomend this game. What makes a game like this either thrive or die is the community around it and the community around this game for the english speaking folk like myself is just god awful. \n\nI tried giving the game another go just the other day was greeted by many russians chinese and a few italians none of which could speak english. Bare in mind i was in a featured community server i did try a couple other servers but closest to a US base server i could find was split [EU/US] any thing else either had no players or had insane rates. \n\nTrying to have a conversation was like speaking to a brick wall and trying to find people to play with was even more impossible. The game it's self doesn't seem to have changed much since when i bought it except now theres a build limit which is kind of lame. \n\nAnyway stay away there are other survival games out there with more content and better communities. \n\nThey have added steamworkshop to this game but it only seems to have low-quality maps on it as of right now maybe check back in a year see how the game is then but as of right now i cant recomend it.", "timestamp_created": 1464992545, "timestamp_updated": 1464992545, "voted_up": false, "votes_up": 147, "votes_funny": 7, "weighted_vote_score": "0.696578621864318848", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "117761368": {"recommendationid": "117761368", "author": {"steamid": "76561198248290908", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 74901, "playtime_last_two_weeks": 0, "playtime_at_review": 71756, "last_played": 1681009782}, "language": "english", "review": "this game was amazing with a good playerbase. the devs did everything they said they were going to do, but it wasnt fast enough to keep up with the huge playerbase they had early on. and when they made their big map change to V2 it just didnt have the amount of changes and content everyone was expecting yet. i recommend grabbing some friends and joining in and encouraging others. would love if this game could make a comeback.", "timestamp_created": 1656379449, "timestamp_updated": 1656379449, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.696317076683044434", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "19503036": {"recommendationid": "19503036", "author": {"steamid": "76561197977417754", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 7789, "playtime_last_two_weeks": 0, "playtime_at_review": 3532, "last_played": 1572094212}, "language": "english", "review": "This game is so well thought out and capitalizes on many things that make survival games either an open world call of duty fest or micromangment fest regarding hunger thrist etc....\n\n1.You keep clothes/tools when you die and drop raw materials only\n2.KoS system where you practically become a criminal for a certain amount of time resulting in dropping items like tools/clothes upon death.\n3.Resource/Mob spawning really well done, further from spawn harder the enemies/better ores.\n4.Cars of course!\n5.Stats on gear is capped on how overpower you can become in PvP and actually benefit you surviving against the game for example, some of the more endgame gear has poison resist which don't nessicarily help you in PvP it helps you from mobs far from spawn that spit poison at you.\n6.You will die not just to players!!!!!!!!\n\nWhatever you're thinking, just know to buy this game AS SOON AS POSSIBLE. YOU. WILL. NOT. REGRET. IT.", "timestamp_created": 1449329370, "timestamp_updated": 1449329370, "voted_up": true, "votes_up": 93, "votes_funny": 10, "weighted_vote_score": "0.696081876754760742", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "63752625": {"recommendationid": "63752625", "author": {"steamid": "76561198102936169", "num_games_owned": 116, "num_reviews": 25, "playtime_forever": 2870, "playtime_last_two_weeks": 0, "playtime_at_review": 2870, "last_played": 1550274029}, "language": "english", "review": "If you computer cant run Rust, this is a great alternative.", "timestamp_created": 1582080585, "timestamp_updated": 1582080585, "voted_up": true, "votes_up": 22, "votes_funny": 6, "weighted_vote_score": "0.694596171379089355", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "41964662": {"recommendationid": "41964662", "author": {"steamid": "76561198080286165", "num_games_owned": 115, "num_reviews": 2, "playtime_forever": 15524, "playtime_last_two_weeks": 0, "playtime_at_review": 14479, "last_played": 1577464327}, "language": "english", "review": "I have a signifigant amount of hours into this game and I caution anyone looking to purchase this game. I would not , the devs are not fixing what needs to be done and refure to update the actual main game but focus on expirmental where the majority of the players are not. Do not buy this game", "timestamp_created": 1525967584, "timestamp_updated": 1525967584, "voted_up": false, "votes_up": 33, "votes_funny": 4, "weighted_vote_score": "0.690519154071807861", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "34664263": {"recommendationid": "34664263", "author": {"steamid": "76561198078072072", "num_games_owned": 0, "num_reviews": 73, "playtime_forever": 271, "playtime_last_two_weeks": 0, "playtime_at_review": 271, "last_played": 1450932798}, "language": "english", "review": "Literally just Rust with a cute art style. God I'm starting to hate all these early access crafting survival clones.", "timestamp_created": 1504284885, "timestamp_updated": 1504284885, "voted_up": false, "votes_up": 73, "votes_funny": 3, "weighted_vote_score": "0.69007033109664917", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "46670848": {"recommendationid": "46670848", "author": {"steamid": "76561198278193485", "num_games_owned": 155, "num_reviews": 6, "playtime_forever": 15874, "playtime_last_two_weeks": 0, "playtime_at_review": 12906, "last_played": 1689794870}, "language": "english", "review": "About that game:\n-Hey wait! I need help!\n-Po rusky!?\n-What? Sorry I...\n-Po rusky!\n-What you mea...\n-PO RUSKY!\n-Maybe...\n-Idi na houy! Suka blyat! Pizdec tvoy mat gandon!\n-Wait! I don't understa...\n-FUCK YOU na houy! FUCK YOU blyat! Peendos! Suka! Pizdec!", "timestamp_created": 1543008931, "timestamp_updated": 1543008931, "voted_up": true, "votes_up": 23, "votes_funny": 57, "weighted_vote_score": "0.689245343208312988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "38816613": {"recommendationid": "38816613", "author": {"steamid": "76561198073273728", "num_games_owned": 201, "num_reviews": 4, "playtime_forever": 3101, "playtime_last_two_weeks": 0, "playtime_at_review": 2952, "last_played": 1522951080}, "language": "english", "review": "Does it have a potential? - yes. Is it good and stable in it's current release? - no. It says I have ~50 h on it. I have actually played much more on the pirated version, before deciding to support the devs. \n\nPros:\n\n+ There are two different gamemodes. Vanilla (base game, doesn't get updates often) and V2 (is more similar to Rust). The second one is more up to date, seems to be more balanced and overall seems to run better.\n+ There are cars, motorcycles and four-wheelers. Some servers have kits to make it easy for you to get them. Usually you will have to farm pieces to make your vehicle functional. \n+ Game is not as harsh as Rust. If you are not into PvP, on death you will only loose resources that you have in your inventory. You will keep all your equiped gear and weapons if you are not infamous. If you are into PvP, you will notice that there is a unique \"infamous\" system which I mentioned earlier. If you have it, you are basically marked as a bandit and you will drop random equiped gear after death.  \n+ Colorful and good looking graphics.\n+ Nice base building system. (Similar to Rust).\n+ Different biomes, with different resource nodes and more or less, different aggresive animals. (Only skin changes, not the model.)\n\nCons:\n\n- Guns are NOT balanced at all. People will bunny-jump near you and shoot you with a shotgun using only one round. (Because when you jump, its accuracy becomes better? What? Yes.) Assault rifles have the same accuracy as bolt action rifles. You just need to get used to it. (Balanced? Nope), same goes for the pistol, but for a lower damage output. Bolt action seems to be in overall, most balanced. \n- Optimization. Oh boy, you will lag a lot. (More frequent in \"community servers\") This will be especially noticable in close, face to face fights. :) (Most people try to abuse it, they will jump around and with added server/game lag you will most likely be on the other side of the stick). Prepare your nerves and attidude that this is just an unfinished game and shit does happen.  \n- Animals, I have been playing this game for two years and they still seem to be some what bugged. It is not as bad as it used to be, but they will try to make your day miserable. (In V2 most animals will run from you, in vanila they will attack you and if you are into PvP, get prepared to be overhelmed.) \n- Raiding. There are no secure doors in hurtworld. Doesn't matter how though your base is, doors only require one C4 to be destroyed. My suggestion: if there is /sethome command in the server, use it and just teleport back to your home when you leave (have an exit on the 3rd floor or something). Do NOT build wooden houses. Please. Unless you aren't planning to keep your precious resources there and just want to rp. (Which I would not recommend).\n- Cheaters, exploiters, hackers. you name it. You will encounter them. Wallhacks and aimbots (usually aimbots accure in PvP based servers) are there and people using them are not punished. (additional note, usually russians do it. Damn commies.)\n", "timestamp_created": 1514550007, "timestamp_updated": 1514550007, "voted_up": false, "votes_up": 34, "votes_funny": 6, "weighted_vote_score": "0.688948452472686768", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19542148": {"recommendationid": "19542148", "author": {"steamid": "76561198069117292", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 5500, "playtime_last_two_weeks": 0, "playtime_at_review": 3851, "last_played": 1450593699}, "language": "english", "review": "There's still a lot of work to be done on this game, for example no time limit for spawning back at your totem so if you're attacking enemies at their base and you kill them, they can just respawn over and over and bombard you with the weapons they still keep at death. Overall it's a great deal of fun and I can't wait to see what the devs have in store!\n\nEDIT: Ok, as of today they added a timer for how long you can spawn at your bed after death.", "timestamp_created": 1449466929, "timestamp_updated": 1449777913, "voted_up": true, "votes_up": 40, "votes_funny": 10, "weighted_vote_score": "0.688095808029174805", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43848900": {"recommendationid": "43848900", "author": {"steamid": "76561198070502994", "num_games_owned": 152, "num_reviews": 107, "playtime_forever": 931, "playtime_last_two_weeks": 0, "playtime_at_review": 931, "last_played": 1517843504}, "language": "english", "review": "Get Rust", "timestamp_created": 1533019857, "timestamp_updated": 1533019857, "voted_up": true, "votes_up": 83, "votes_funny": 69, "weighted_vote_score": "0.687998950481414795", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}}, "query_summary": {"num_reviews": 5, "review_score": 5, "review_score_desc": "Mixed", "total_positive": 3955, "total_negative": 2367, "total_reviews": 6322}, "cursors": {"AoIIPwAAAHjD5uIE": "Mon Apr 22 23:41:38 2024"}}
