{"reviews": {"161104043": {"recommendationid": "161104043", "author": {"steamid": "76561197997917921", "num_games_owned": 1168, "num_reviews": 78, "playtime_forever": 675, "playtime_last_two_weeks": 0, "playtime_at_review": 675, "last_played": 1603569304}, "language": "english", "review": "Amazing game that hasn't seen any updates in almost 7 years. It was left uncompleted and broken by its masters", "timestamp_created": 1711065607, "timestamp_updated": 1711065607, "voted_up": false, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.740947902202606201", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159029622": {"recommendationid": "159029622", "author": {"steamid": "76561198821029139", "num_games_owned": 0, "num_reviews": 24, "playtime_forever": 2308, "playtime_last_two_weeks": 0, "playtime_at_review": 2308, "last_played": 1671580111}, "language": "english", "review": "Amazing game that hasn't seen any updates in almost 4 years. It was left uncompleted and broken by its masters", "timestamp_created": 1708664828, "timestamp_updated": 1708664828, "voted_up": false, "votes_up": 15, "votes_funny": 1, "weighted_vote_score": "0.669602453708648682", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161088924": {"recommendationid": "161088924", "author": {"steamid": "76561199510306869", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 26, "playtime_last_two_weeks": 0, "playtime_at_review": 26, "last_played": 1711049329}, "language": "english", "review": "the game's studio closed down a few years ago and thus multi doesnt work. Sad.", "timestamp_created": 1711049457, "timestamp_updated": 1711049457, "voted_up": false, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.662559449672698975", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "162285334": {"recommendationid": "162285334", "author": {"steamid": "76561198111075761", "num_games_owned": 182, "num_reviews": 1, "playtime_forever": 786, "playtime_last_two_weeks": 0, "playtime_at_review": 786, "last_played": 1653015285}, "language": "english", "review": "Abandoned game.", "timestamp_created": 1712348289, "timestamp_updated": 1712348289, "voted_up": false, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.652293026447296143", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "157207657": {"recommendationid": "157207657", "author": {"steamid": "76561197997169148", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 8479, "playtime_last_two_weeks": 0, "playtime_at_review": 6736, "last_played": 1707090363}, "language": "english", "review": "2024 - I love it so much! First important thing to know is that you have to first cut a tree, then go to the menu structures, make a CUTTING BLOCK on the ground. \nAfter this will be done, you will be able to create alot of wooden pallets, because this is need a plank. \n\nThis game offering three kind of game. \n- Free play for a relax building (no mobs, always day time)\n- Defend your crystal and castle with mobs around the maps, you have to get energy from others crystals on the map before them.\n- Defend your crystal and castle through successive waves of mobs, the waves have an  increasing difficulty. \n\nAlso, there is a tutorial in the game to be ok for the rest and start to build your castle. You will need at least 2 stage of blocks to prevent mobs from jump on it. To arm a minion, you must first create a rack to place the equipment that you will craft with the weapons workbench. Later you will get access to explosive stuff. Good Game!", "timestamp_created": 1706640977, "timestamp_updated": 1706640977, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.627019107341766357", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158321876": {"recommendationid": "158321876", "author": {"steamid": "76561198015743977", "num_games_owned": 408, "num_reviews": 3, "playtime_forever": 640, "playtime_last_two_weeks": 0, "playtime_at_review": 640, "last_played": 1479029407}, "language": "english", "review": "Game was looking really good, until the devs abandoned it.", "timestamp_created": 1707935594, "timestamp_updated": 1707935594, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.599540591239929199", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "162450084": {"recommendationid": "162450084", "author": {"steamid": "76561197982658491", "num_games_owned": 0, "num_reviews": 176, "playtime_forever": 2670, "playtime_last_two_weeks": 0, "playtime_at_review": 2670, "last_played": 1520564779}, "language": "english", "review": "Abandoned, but still a really inventive castle builder that helped forged the path for newer castle-builder games.\nI really enjoyed my time building up and defending from sieges, it scratches a primal itch to claim territory and fortify against the unknown threat in the night.", "timestamp_created": 1712534744, "timestamp_updated": 1712534744, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.566003620624542236", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "157940115": {"recommendationid": "157940115", "author": {"steamid": "76561197993818789", "num_games_owned": 0, "num_reviews": 84, "playtime_forever": 1353, "playtime_last_two_weeks": 0, "playtime_at_review": 1353, "last_played": 1579639586}, "language": "english", "review": "Unfinished buggy abandonware.", "timestamp_created": 1707502579, "timestamp_updated": 1707502602, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.555196523666381836", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161061467": {"recommendationid": "161061467", "author": {"steamid": "76561198332226709", "num_games_owned": 628, "num_reviews": 37, "playtime_forever": 2353, "playtime_last_two_weeks": 0, "playtime_at_review": 2353, "last_played": 1692671914}, "language": "english", "review": "The idea is great, the execution is a 6/10.\nSandbox works good enough and it's satisfying to get all your colony to build the best base, but why not choose another game with more variety? The gamemode I'm sure everyone is here for is conquest/invasion. Invasion works fine enough, but due to the limited ways enemies can approach you once you outsmart it out it gets very bland fast.\nconquest is where most of my time was personally spent. It's really good and I like having to build a base and try to attack different areas seamlessly. That being said; I have noticed a game breaking bug with conquest. After around 5 - 10 hours the CPU kind of just gives up. They don't work at all anymore. This makes conquest essentially sandbox again.\n\nThe game has a lot of great ideas and I would've loved to see this concept get expanded or fixed but it's abandoned for now. Recommend picking up a different game in the same genre", "timestamp_created": 1711022395, "timestamp_updated": 1711022395, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.548872172832489014", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161295177": {"recommendationid": "161295177", "author": {"steamid": "76561197968156993", "num_games_owned": 97, "num_reviews": 14, "playtime_forever": 4708, "playtime_last_two_weeks": 0, "playtime_at_review": 4708, "last_played": 1708054972}, "language": "english", "review": "[h1]Castle Crashes[/h1]\n\n-\tDo you like building Castles?\n-\tDo you like hearing Stories?\n-\tDo you like optimized games?\n\nNo? Then this game is for you (sarcasm).\n\nSee, this game can have castles, just not in any combat oriented game mode. As for stories, you can make one up. Optimization, “What’s that?”\n\nHope you have a good imagination as you’ll need it to create any excuse for playing this game.\n\n1) [u]The Story[/u]\n\nWhat story? There is no story. Did you really expect a game titled “Castle [b]Story[/b]” to actually have a story? The so called “story” is that you, as the omniscient overlord of a bunch of Minion-colored Doctor Who Adipose creatures, called “bricktrons” must command these beings to defend their tiny floating island from the ~[i]eevviill[/i]~ (or perhaps misunderstood) rock monsters called “corruptrons”. These monsters have, as their name implies, corrupted one of the crystals on this floating island and now they want to claim the island for themselves. There are multiple islands to choose from but no story linking the defense of one island to another. You get to play in one of three game modes, Invasion, Conquest, or Sandbox.\n\n2) [u]The Gameplay[/u]\n\nThe gameplay is similar to that of most RTS games where you order around various units to do tasks such as harvest resources, build structures, craft weapons, scout areas, and fight enemies. You begin with around five basic worker units (more or less depending on difficulty) and create assignments for them such as gathering materials to constructing your base defenses.\n\nThe first flaw of this game is that you can only ever have a maximum of fifteen (15) units, [spoiler]unless you manually change it.[/spoiler] That is the total of units altogether including combat units. The good thing is that you can change units between fighters and workers by simply having them equip or unequip their weapons (at a weapon rack). The bad thing is that for every unit lost, you lose not only a fighter but a worker as well.\n \nThe next flaw is that building anything takes time, real-time, and I don’t mean waiting for a progress bar to complete. I mean that if you want a castle to be built, they build it [b]brick by brick[/b], literally. They pick up one brick (admittedly the size of a character) and walk it from where it was found to where it gets placed. Castles are built using way more than a handful of bricks. But that’s not all. [b]Everything[/b] is done piece by piece.\n \nWant a sword for your fighter? You need to mine enough rocks to build four bricks, then lay each brick to build a forge, then mine enough iron to make two ingots, place the iron in the forge, mine enough brimstone to melt the iron, cut down a tree to get logs, cut a log to get three planks, take each plank individually to make a workbench, then take each ingot to the bench to start making the sword. But wait, you can’t actually have the sword unless you have a weapon rack to place it on, so you need more planks to build that as well.\n\nDidn’t like how long that took for one sword? Well, imagine that for [b]EVERYTHING[/b]. Now, you’d think more units means faster work but you only get up to 15 and only one can work on the bench while another works on the forge, and others work at gathering. Gathering and building tasks limit themselves to 8 workers each unless you create multiple work orders.\n\nAs for modes, Sandbox is the only mode in which you [b]even have a chance to build a castle[/b], as there are no enemies. Invasion mode is basically tower defense. You build some basic walls to slow the enemy down while your units, or more likely automated defenses, take them out before the enemy takes out your home crystal. Oh, and the enemies never need a castle. Conquest is the same except you can actually take out the enemy’s crystal as well.\n \nSpeaking of crystals, this is where your units spawn from, but only the home crystal. All of the crystals you capture only increase the spawn rate of your main crystal. Once you reach capacity, nothing else is gained from the crystals. If you lose a unit, a new unit will spawn in time or, if your unit’s “spirit” makes it back to the crystal, it will respawn on its own.\n\nThere is one more thing. The units have a fairly basic AI routine. They will occasionally auto assign themselves to any tasks you have created without you actually needing to tell them to. If a task needs to be completed, an idle unit will go do it, eventually. They will not fight unless they are already assigned as a fighter and likewise the same with doing work.\n\n3) [u]Goofs and Glitches[/u]\n\nMore like Bugs and BS really. Where to begin on this one?\n\nFirst, the more you do and the longer you play the more likely your game will start to experience stuttering. Frame rates will drop due to slowly increasing RAM usage and bad AI path finding and unit management. The more you “manipulate the land” the lower your frames will become because the game has to keep track of all the changes. This is likely due to the fact that all objects have physics and, when destroyed, will bounce around when they fall apart.\n\nThe game can support more units. There is a way to add more. The problem lies with how the units are handled by the AI. Unit path finding is marginal at best. Units will take the long way around if it is the first path calculated to reach the destination. Units gather items based on where they started when the task was assigned, not by where the nearest item is to the task. This becomes apparent when a unit crosses the entire map to pick up a brick when there is one just around the corner from them.\n\nMultiple units assigned to the same task may become idle when they all target the same item and only one can pick it up. There have been many occasions where units simply stop what they are doing because “their destination no longer exists” (whatever they were targeting got occupied by another unit). This is most frequent when building larger objects.\n\nThere is also limited sound in the game. While sound effects play regularly, the actual music will play for a short time and then stop. There may be several minutes of silence between the short songs that play.\n \n[u]Conclusion[/u]\n\nI had this game on my wish list for years but never really felt the urge to get it. Just before I decided to remove it, someone got it for me. Now I know why I never got it.\n\nI always felt like the building castles part was missing something, and now I know what it is, [b]THE CASTLES[/b]. Only when playing sandbox did I even get to build one and that took over six hours to build a small one. I created a level where it already had the bricks mined out so I could just build and not gather. The level almost wouldn’t load due to poor optimization.\n\nAs for other modes, this does not work as an RTS. When [b]EVERYTHING[/b] needs to be done in real-time, it becomes tedious and boring.\n\nIf you’re looking for anything more than a bad experience, save your money or get a different game.", "timestamp_created": 1711229707, "timestamp_updated": 1711230919, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.535211265087127686", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160509941": {"recommendationid": "160509941", "author": {"steamid": "76561198246775826", "num_games_owned": 42, "num_reviews": 7, "playtime_forever": 2111, "playtime_last_two_weeks": 0, "playtime_at_review": 2109, "last_played": 1710421792}, "language": "english", "review": "The best game in its genre. Beautiful styling, physics, interesting and exciting gameplay. I have been playing since 2017. Not so long ago, I decided to buy it again on a new account. And got stuck again for a couple of dozens of hours. Many thanks to the developers for this masterpiece!", "timestamp_created": 1710421486, "timestamp_updated": 1710421486, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.527331233024597168", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159829848": {"recommendationid": "159829848", "author": {"steamid": "76561198340131820", "num_games_owned": 316, "num_reviews": 35, "playtime_forever": 9, "playtime_last_two_weeks": 0, "playtime_at_review": 9, "last_played": 1504625677}, "language": "english", "review": "could have been an amazing game that you could sink countless hours into, but the game was abandoned and its still a buggy mess that's frustrating to play", "timestamp_created": 1709540748, "timestamp_updated": 1709540748, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.522828936576843262", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "50224761": {"recommendationid": "50224761", "author": {"steamid": "76561197985758551", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 8235, "playtime_last_two_weeks": 0, "playtime_at_review": 4093, "last_played": 1687396649}, "language": "english", "review": "I had high hopes for this game... \nI bought it a few years back in early access and had a lot of fun with it. No really, i loved this game.\n\nBut you can only love a game this long if it is unfinished and the devs are slower with updates than a handicaped turtle.\n\nThis game may say it's finished, but believe me, it's not. Sure, they added some new features as smithing and crafting over the years, but it still feels like an early access title. It's bugged, slow and sometimes very unresponsive.\nAnd that is after they hardcapped your units to 15, because they could not get their performance problems in check.\n\nIn short: polishing is a foreign word for them and they don't seem capable of fixing existing problems.\n\nSo what now? Are they promising to fix their game into a better state? Are they gonna implement the features they promised on Kickstarter?\n\n\nNope...\nThey have moved on to work on a new game silently. (They stated that in their forum in a clause)\nSo probably no fixes for this one.\n\nI really like this game, but the devs are pathetic. \nThey punched all their backers and buyers in the face with the silent abandonment and restrictions of gameplay rather than fixing their core engine. Not that the problems were something new... (Except if your new is since the beginning)\n\nNeedless to say that this game is dead. The devs killed it without remorse.\n\nThe conclusion at this point is: \nDon't buy the game. It hurts me to say that, it really does. I just hope, that they can develop their new game better this time. We don't want dev hell again. (A prime example of a semi failed kickstarter/ea game)", "timestamp_created": 1555724824, "timestamp_updated": 1569280295, "voted_up": false, "votes_up": 281, "votes_funny": 5, "weighted_vote_score": "0.935413181781768799", "comment_count": 12, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "8650112": {"recommendationid": "8650112", "author": {"steamid": "76561198024014284", "num_games_owned": 528, "num_reviews": 22, "playtime_forever": 1193, "playtime_last_two_weeks": 0, "playtime_at_review": 935, "last_played": 1512932066}, "language": "english", "review": "2017 Review: (Final Verdict: 5/10 - If you like building games and watching them get demolished then don't read any further just buy it)\n\nWell I never thought the day would come but this game is finally out of Early Access.  I personally have been waiting for it for 4 years, others about 5.  The main gripe stemmed from the period of 2 - 3 years where pretty much nothing happened with the game and the dev's heavy handed tactics of dealing with the criticism.  Nonetheless all that is history now and I shouldn't be dwelling on that alone.\n\nThe game now is OK.  There is a variety of modes and maps, performance has greatly increased as has some of the AI and building options.  I would agree with some of the sentiment in the comments that the game is worth something like $10-$15 dollars if you are a fan of this sort of thing.\n\nWhat the game does well:\n\nPerformance is decent.  Just about everything in the game is visible.  You don't just put resources and items into storage, the little characters will mine and craft things right before your eyes and place it into appropriate storage where you can see it.  Even when you craft the weapons kits every piece is always visible wherever it goes.  Say you want to craft an arbalast, the crossbow, hat and bolts will be carried one by one from the crafting table to the weapons rack where you can see it hanging there.  This might not mean much to some people but to me it's a great touch.\n\n  It's the same when you are building your castles.  Each section can be destroyed individually and if some parts don't have enough support they will fall where they will lie until your bricktrons pick them up and rebuild or place them in stockpiles.  It makes it cool to watch the resources how they are collected and stored, transformed, and become parts of the construction.\n\n  The mechanics of the game are pretty solid and in my experience unique.  The enemies are a little bland but they serve their purpose of creating danger and tension in the game modes that include them.\n\nThe tutorials and explanations are great and acceptable for those new to the game.\n\nAlso the community leader (Shato) I have to mention here.  He is a much better people person than the previous one.  I feel bad for Box because he copped a lot of flak but he also deserved it with what he was doing.  Whether he was doing that under orders from the devs or not I have no idea but for a while there was a really really bad environment for the game community.  So the guy that replaced Box is a big improvement, he seemed to have the will and patience to connect the devs with the public again and that is an understated accomplishment.\n\nThings that are not so great:\n\n  Well this is a difficult one as I am slightly biased but i will get into that briefly at the end.  The main issues I see with the game is a lack of content.  The concepts in the game are great, it could have possibly been a genre leader with a little more building options and a little more creativity when it comes the enemies and gameplay.  I really think a decent story (Castle Story???) and even a campaign could have been worked into this game.  Working with the awesome concepts this could have really shined.\n\n  I would have been willing to bury the issues of the past completely and give this game a thumbs up.  But alas even though there is a decent variety of maps there isnt much to do after a while unless you want to mess around with some friends in the limited multiplayer.  Now this is just me, I am sure that there are plenty of people around that would be quite happy to play the game just to create different buildings so if that sounds like your thing then disregard my opinion on content.\n\nSo just to briefly sum up my reasoning for still not recommending this game, it is a personal taste and morality of early access issue on my part.  This is THE game for me that made me very wary of early access, the years I spent waiting for content and arguing for more transparency left me coming away from the game wondering why I was stupid enough to buy it.  Without the Early Access issues or with some decent utilization of the concept of the game I would have given it a 6 or a 7 out of 10.  But in the end I am going to have to give it a 5/10, it's not bad but its definitely not good.  For me if given the choice I wouldn't have bought it.  But for you if you like building stuff and a little bit of resource management then go out and buy it.  You won't regret it.\n\nPre-2017 Review:\n\nFraud and Lies\nOK I know that the mods are keeping a tight leash on the forums here and they are shutting down everything that is pointing out the truth so I am going lash out and hope that a few people see this before it gets locked or myself banned like many others have before. \n\nThere are a lot of Early Access games on steam. Most of them have a capable and dedicated development team behind them. We all know this, we are all playing their games. We know what to expect from Alphas, Betas, Early Access etc etc. And this isn't it. This game has changed very very little for more than a year now. And they are still taking peoples money for it.\n\nThe people that originally backed this game are for the most part gone - they check in every few months hoping that something has changed but it hasn't. At this stage the only people that are happy with this game are those that have recently bought it in the last couple of months and don't know that a patch isn't 'just around the corner', and those that are friends with the devs who jump on every negative review and defend it with the usual \"Alpha\", \"Early Access\", or \"refactoring\" excuses.\n\nWe aren't stupid. We have played plenty of Early Access games before. They all need to be refactored a couple of times during their development as the scope of the interest in the game increases. All the early access games we are playing are doing the same. Castle Story is NOT unique in this.\n\nThe devs just use refactoring as an excuse for having not produced anything notable for more than a year. This is rubbish. They have accumulated near enough to a million dollars to work on this project and all they do is stall.\n\nI know there are a lot of others out there that are just as fed up with this rubbish, and I hope it serves as a lesson to everyone to be very careful as to what they back with Early Access games. There a plenty of good ones out the with dedicated developers, but there are also a few rotten eggs.\n\nI'd like to hear from everyone that has been through the same ♥♥♥♥♥♥♥♥e and all those that were banned for speaking out about this, but I know they probably have given up on this game plus anyway it won't be long before this thread is locked down and removed anyway. I feel sorry for everyone that wasted their money - I had hoped for something special too.", "timestamp_created": 1389379400, "timestamp_updated": 1512711058, "voted_up": false, "votes_up": 1856, "votes_funny": 3, "weighted_vote_score": "0.930139839649200439", "comment_count": 108, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "11978417": {"recommendationid": "11978417", "author": {"steamid": "76561197969424623", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 4501, "playtime_last_two_weeks": 0, "playtime_at_review": 857, "last_played": 1547040662}, "language": "english", "review": "I foolishly paid money for this game when it first came out on steam, in the two years since then they have done nothing of note to the actual game. They've been to PAX east, they've ordered in Castle Story T-shirts and Castle Story plushies, they've hired bearded men to make videos of people looking busy, they've deleted my posts on their youtube videos and they've deleted my posts on the community hub and banned me from posting there again, they've got new gaming rigs, they've painted the walls of their office with a cool Castle Story mural, they've been out in the woods making noises, they've played Magicite, once again what they HAVEN'T done is anything of note to the game itself. \n\nThe game in its current state is \"OK\" for a buggy unfinished alpha, not much content to speak of, certainly not worth £14.99. These developers sold everyone a pack of lies and hired people to censor out anyone that calls them out on their unethical, thieving and unprofessional behaviour. I can think of many games that have far more content and regular updates and better developers (in terms of listening to and communicating with the community) that cost far less. An example of their lying can be found in the trailer, you are led to believe that there are two types of enemies, it shows a larger corruptron throwing rocks at the castle. This is an outright lie, there is no such thing in the game. The only other game I can think of recently with this kind of unethical misrepresentation of the product is War Z with its crawling zombies in the trailer.\n\nThe future for Castle Story is bleak, most people who were going to buy it have already bought it long ago when it first came to steam, since then the developers have completely failed to deliver. Any criticism of their unprofessional behaviour by the community is ignored or censored. They have all the money they're going to get so there is simply no more reason to work on the game any further. Instead they are hiring more and more staff to sell it to people on the internet and make promises that will never be kept to create the illusion that they are still working on the game.\n\nI expect that in time they will change the name of the game as War Z did to squeeze out those last few sales before it is consigned to the dustbin of history as yet another kickstarter project that made the devs very rich but utterly failed to deliver on its promises.\n\nDo not give these unethical, thieving and unprofessional developers any of your money, to do so would encourage others to follow their lead.", "timestamp_created": 1409845883, "timestamp_updated": 1409845883, "voted_up": false, "votes_up": 288, "votes_funny": 2, "weighted_vote_score": "0.920298218727111816", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "153028866": {"recommendationid": "153028866", "author": {"steamid": "76561197978334575", "num_games_owned": 1166, "num_reviews": 23, "playtime_forever": 1405, "playtime_last_two_weeks": 0, "playtime_at_review": 1405, "last_played": 1469328293}, "language": "english", "review": "Abandoned, but not forgotten, I still think this game was a banger of a idea, and I think a lot of fans would still be playing it if they had been able to fix the path finding and performance.  I can understand some people giving it positive reviews out of love but please don't mislead people after all these years, game is fundamentally broken, it should not be on the first page of tower defence top sellers list in 2023", "timestamp_created": 1701927301, "timestamp_updated": 1701927301, "voted_up": false, "votes_up": 117, "votes_funny": 0, "weighted_vote_score": "0.915070652961730957", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "111470857": {"recommendationid": "111470857", "author": {"steamid": "76561198128452101", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1528, "playtime_last_two_weeks": 0, "playtime_at_review": 1528, "last_played": 1646338081}, "language": "english", "review": "I've been playing this game for the past couple of weeks and I just can't seem to find out why the original strategy game click/do feature ISN'T the method used to control your Bricktrons. I will have too many tasks and too few Bricktrons to get anything done. Here is a list of things that just make me not want to play this game ever again.\n\n1. When assigning multiple bricktrons to complete a task, they will all pick up the same material, walk all the way over to the blueprint of the thing that needs to be built, and if it is already built, they will walk all the way back to the stockpile and pick up another object. (basically there is no multitasking when it comes to these little yellow dummies) They also will just deposit random things into any stockpile even if there is space in a stockpile that already has the thing they are carrying.\n\n2. Bricktrons with bows do not re-adjust themselves to shoot a target if they are on top of a wall. They will just sit there and continue to shoot the edge of your wall while your armored Bricktrons get absolutely destroyed.\n\n3. Bricktrons will take the most inefficient paths to get to where they want to be. I've had them walk around mountains and attract enemies when i have multiple doors for them to use. This applies to tasks as well.\n\n4. When you make about 5 tasks, your Bricktrons will sometimes just stand there and do nothing at all for some reason until it decides it wants to go and do something productive. This is how it works even if you tell them to work on that specific task.\n\n5. When using any kind of workstation, you have to select a Bricktron and tell it to not do anything and hope that it just starts working on refueling furnaces or building kits. If i have to make a task for every single thing I want them to \"hopefully\" do, then why can't I tell them to start making armor or iron?\n\nI really do like the features of this game and it's overall concept. I love to build and collect resources for my overall economy, but all the little nit-picky things that I have to manage just don't flow well with the games task-oriented gameplay. I think the concept of making each of them have their own mind is cool, but it just doesn't work fast or efficient enough for me to spend most of my time making sure they are doing what I told them to do. It just makes me more frustrated that I can't just click on a Bricktron and tell it exactly what to do.", "timestamp_created": 1646339724, "timestamp_updated": 1646339724, "voted_up": false, "votes_up": 148, "votes_funny": 1, "weighted_vote_score": "0.913923144340515137", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "106999614": {"recommendationid": "106999614", "author": {"steamid": "76561197978181252", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 15442, "playtime_last_two_weeks": 3872, "playtime_at_review": 5728, "last_played": 1713584942}, "language": "english", "review": "I love this game, but it was never finished, regardless of what Sauropod Studio claims.\n\nCan you play it? Yes, and you can sink hours into it. That doesn't make it polished or content rich. It just means they managed to get a decent play state for the existing game, and then abandoned it for another project.\n\nThe studio has now failed for two obvious reasons; betraying the trust of their fans and failing to see their project through to the end. They blame Epic, E3, Covid, but fail to blame themselves. Who would back a new project when they never finished the first? Not their community. That's for sure.", "timestamp_created": 1640974096, "timestamp_updated": 1642130221, "voted_up": false, "votes_up": 150, "votes_funny": 1, "weighted_vote_score": "0.912887334823608398", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "12631252": {"recommendationid": "12631252", "author": {"steamid": "76561198021919326", "num_games_owned": 0, "num_reviews": 34, "playtime_forever": 1322, "playtime_last_two_weeks": 0, "playtime_at_review": 422, "last_played": 1625434442}, "language": "english", "review": "Update 22JUN17:\n\nHey, it's the first day of the Steam Summer sale, you know what that means?  Yup, it means Castle Story has a flurry of update posts after months of no-content updates!  Gotta look like we're making progress and grab that cash for the sales.  For shame.\n\n\nUpdate 20NOV16:\n\nJust keeping this review fresh, it now has more content and updates than this game.  Still no meaningful changes to the game, still barely playable, still missing features, still full of bugs.  Feels like it has actually regressed, the early alpha from 4+ years ago felt more finished than this game does now.  Really think about that.  What were you doing in your life 4 years ago?  How much has changed for you since then, professionally, personally?  Have you finished any life goals, at all?  The devs for this game haven't!\n\nWinter sale season is coming up soon, don't be fooled by their 'updates' it's all a gimick to look busy and net sales.\n\n\nUpdate 10FEB16:\n\nJust wanted to update again to keep this review current with development.  Yup, nothing has changed since last time.  Update done.\n\nOk, there are many patch notes, none of them actual content, all of them coincide with the winter sales event.  Dev's are still trying to grab cash while clumsily and incompetantly releasing trivial updates in time for a sale.  Game has actually regressed, which I didn't think was possible.  UI continues to get worse with every iteration, less intuitive, more complex, less functional, and bugs with AI grow ever more intrusive.  Avoid this \"game*\" at all costs.\n\n* A game is technically any sort of interactive entertainment where choices by a player lead to and change a possible outcome.  None of that happens here, there is no outcome other than you wasting time and money in anticipation of a crash or game breaking bug.\n\nUpdate 30AUG15:\n\nWell, summer is over.  Another round of shotgun blast Sauropod updates has passed.  Nothing of actual significance has been added to the game yet again.  Just making this update to point out that every sale season (WInter/Summer) Sauropod blasts out a ton of updates right before the sale, so potential new customers will walk in, say \"Wow, those guys really turned it around and get making progress!\".  When the reality is, they're using the update ticker as a daily news feed for stuff they've thought about, and haven't actually done.  They will also roll a minor trivial change in something out as 3 or 4 updates.  [b]Don't be fooled, there has not been an update[/b]. It's a shameful and deceptive practice and really shows the developers for the dishonest incompetents they are.  If there was any doubt in your mind about whether to label them as \"Just bad developers\" or \"Actual thieves\", this is all you need to know to decide.\n\n\n\nUpdate 21DEC14:\n\nI figured I would update the review considering how much activity the dev's have had lately.  But it seems it was all just lip service.  Over the last few weeks they've been shotgunning loads of update announcements, but the reality of the situation is those were all just announcements for one single update.  That update itself was absolutely trivial, and seems to have added nothing of substance to the game.  The devs constantly give the excuse of \"reworking\" and \"redeveloping\" engine components of the game, but these changes never seem to result in any sort of actual impact to the game.  For all their bluster, a disapointingly little amount has changed, and all assumptions about them have been confirmed.  This is just shameless PR propaganda.\n\nThe sad fact is, if you're the lunk head that invented a square wheel, taking a year off to invent an octagonal wheel leaves you as still a lunk head.  I don't think I'll be revisiting this game until it's final release, whenever that may be.\n\nFinal thoughts for now:  Stay away.  With luck they'll go bankrupt and sell all IP to a competant developer.\n\n\n\n*Original*\n\nOverall, I do enjoy this game, and probably had more anticipation for this than any other early access I've followed.  So why do I not recommend this?  Bullets:\n\nCons:\n- No updates!  Years have passed and the game is still in a less functional state than their fictional tech demo.\n- Current state is playable, but quickly reveals how broken it is.  Terrible AI, limited functoinality of game mechanics, limited... game.\n- Devs hate the community.  Well probably not hate, but this is the crux of it.  There appears to be absolutely no effort being made to update the game in an actual and meaningful way.  When pressed for answers from the community as to when we can expect something new, the same canned response of 'we don't give deadlines' is the answer.  That's fine after a few months, but not after a few years.  The first major red light for me when nearly a years worth of dev updates were about how they spent a month and a half working on a new sound effect for an object that isn't even in the game, or here's a new soundtrack I've been listening to, or \"Hey, we're going on vacation!\".  While glaring issues remain untouched and unaddressed.  PR people are hired to quell criticism and silence community dissent.\n-Devs are in over their heads.  A lot of people will call them theives, or scammers, I don't see it as that.  They are still around.  They are still 'working'.  But it really seems like they've all retreated to their little comfort zones, and feverishly work on silly little things like a sound effect to the exclusion of actual game problems.  Why would they do this?  Well, it seems pretty clear that they have realized they cannot handle those bigger problems, and just seem to be hoping they'll fix themselves tomorrow.  Their production efforts are terribly misguided, and no one seems able to get the train back on the tracks.  This is the main reason I think the community has given up on them.  There are gracious ways out of this connundrum for them, but they seem completely unwilling to compromise, admit their shortcomings, and work with the community.  For that they have failed utterly at making a game.  A community college degree does not a game dev make.\n\nPros:\n- Build a big castle block by block, watch a nearly good physics engine crush it.\n- If you give them enough money to keep the lights on, you get a t-shirt or something, someday.", "timestamp_created": 1414270105, "timestamp_updated": 1498201709, "voted_up": false, "votes_up": 304, "votes_funny": 5, "weighted_vote_score": "0.90941542387008667", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "13813475": {"recommendationid": "13813475", "author": {"steamid": "76561197965177069", "num_games_owned": 668, "num_reviews": 2, "playtime_forever": 26674, "playtime_last_two_weeks": 0, "playtime_at_review": 19150, "last_played": 1696530922}, "language": "english", "review": "I bought this game about 18 months ago.\nIt was a great concept, and a really fun game to play with knowing that much more content was promised and on the way.\nI was dissapointed to find out shortly after obtaining the game that they were essentially suspending any new features pending a 'refactoring' in the Unity game engine.  The good news was that once this was done, they were to start pumping out feature and content updates much more quickly, since they were including an improved asset pipeline.\nThat took much more time than their community liason had let on.  The community (other investors in the game) were getting pretty restless.  \nFinally that refactoring was completed.  A patch was released!  Unfortunately, it had little to no impact on the gameplay.  There were some minor stability improvements but no real new features or content.  We were okay with that because of the promise of much more coming more quickly...  \nWe were then informed that we were being too impatient, and that no new features or content could be done until they finished working on their internal tools (factories).\nWe were then informed that there would continue to be a suspension of any new features or content while they rewrite the AI engine and the Pathfinding.   No new content could be provided since \"Why would we give you new content if the AI cant figure out what to do with that content\"...   \nOf course most users abandoned hope that this would ever be completed.   It had been month after month after month of broken promises.   They eventually ended their relationship with the community liason, citing that he never really spoke for the company, and his promises were unfounded.\nNow, FINALLY.. version 0.3 has been released!!  (coincidentally timed with a Steam promotion) With the new AI, the new Pathfinding, new lighting effects, a bigger island to work with.\nUnfortunately, there is still no new content, no new features.   Leading up to a sale on Steam, they put together a nice little video of the new features ..   New AI (Which is worse than the original).. New Lighting (Which is of zero impact on the gameplay).. a bigger island (which is probably among the bottom 2% of necessary changes)..\nThey then 'cleaned' out the user forums of most negative feedback..   \nUnfortunately even after these years of waiting, the new 'version' was even more buggy and had less (YES LESS) features than the original.  The great new AI that was promised could only be 'tested' in a seperate environment, where the feature set was limited, and even that was far worse than the original, very buggy, AI.\nThey started releasing (Very minor) bug fixes almost daily, appeasing many, even though they really only addressed things like difficulty in loading the game, or glitchy graphic artifacts, etc ..  These fixes and patches (0.3.1,  0.3.2,  0.3.3,  0.3.4)  started giving some of us the impression that this past couple of years of unfulfilled and broken promises was at an end and the momentum would finally change.   Unfortunately, although those changes were welcome if only to see that there was actually some level of activity going on..   They were short lived.  4 patches in 5 days.  Then nothing.. again.   \nThis game has great potential as a concept.  But if you are considering it.. You would be very well advised to wait until you can read the reviews of the finished game.   \n", "timestamp_created": 1420311985, "timestamp_updated": 1420311985, "voted_up": false, "votes_up": 239, "votes_funny": 7, "weighted_vote_score": "0.908549606800079346", "comment_count": 20, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "112607973": {"recommendationid": "112607973", "author": {"steamid": "76561198063386696", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 2577, "playtime_last_two_weeks": 0, "playtime_at_review": 2577, "last_played": 1539182954}, "language": "english", "review": "This is the perfect example of a studio that has so many great ideas, but goes full spaghetti code.\nWhatever they say, this game is not finished and sadly never will be finished..", "timestamp_created": 1647889357, "timestamp_updated": 1647889357, "voted_up": false, "votes_up": 190, "votes_funny": 2, "weighted_vote_score": "0.900947511196136475", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "54083278": {"recommendationid": "54083278", "author": {"steamid": "76561198956711113", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 263, "playtime_last_two_weeks": 0, "playtime_at_review": 92, "last_played": 1563166591}, "language": "english", "review": "This came is good, but I can see how people can get upset. The unit cap IS 15, but it is easily changeable to one's liking. If you right click the game in your library, > Info > Lua > Gamemodes > [The game mode of your choice to change] > config.lua, right click, then edit with Notepad++ (Download it if you don't have it) then change bricktronCap = 15, and startingWorkersCount = 5, to your liking. However, it does greatly downgrade the performance of the game so 50+ units recommended for good computers. Unit cap increased allowed units in a world, starting workers count is the number of workers you start with. After that, there should be a tab called \"File\". Click on that and press \"Save\", and exit out then start the game. Have fun! This is a cool game with many opportunities to do anything you want. Just try it, its cool.", "timestamp_created": 1563065030, "timestamp_updated": 1563065030, "voted_up": true, "votes_up": 132, "votes_funny": 2, "weighted_vote_score": "0.898868918418884277", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "12419259": {"recommendationid": "12419259", "author": {"steamid": "76561197973497258", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 2286, "playtime_last_two_weeks": 0, "playtime_at_review": 2266, "last_played": 1409206924}, "language": "english", "review": "DO NOT BUY! Sauropod studios are run by a very small group of inexperienced, unapologetic jerks. If you bought in to this game through kickstarter or early access, they will treat you like crap on the forums.\n\nThe only thing Castle Story had going for it was the amazing work the Community Manager: Box, was doing. Box would try to give information to you straight, without breaking any of the company rules, which was very difficult to do. Box would always try to break information down to the community and calm people down who were angry about any of the situations. In the end, the company would give Box misleading information and then blame him for giving out any information to the community.\n\nOne of the primary developers for Castle Story is a dev named Thierry. Thierry has a tendency to berate the community for asking questions. On multiple occasions I've read post by him calling out individuals and virtually yelling at them, or the community in general and blaming them for being impatient. The game has been in development for years now, and there has literally been no visual improvement in over a year.\n\nOriginally there were weekly updates on what was going on, with an occasional skipping of a week or two. Now there are monthly updates on what is going on. I take that back. There are monthly video blogs about things nobody cares about. These \"monthly\" video blogs have only made it up to the 3rd blog before they seem to have stopped posting them. It has been six weeks since the last video blog, which is probably a good thing, because they're useless information anyway.\n\nTL;DR, STAY AWAY FROM THIS GAME. The devs will treat you like crap, and blame the community for asking too many questions, the game has been stagnant for over a year. The forums have started seeing posts deleted, and users are getting banned for giving out useful information, and asking real questions respectfully.", "timestamp_created": 1412829461, "timestamp_updated": 1412829461, "voted_up": false, "votes_up": 245, "votes_funny": 2, "weighted_vote_score": "0.89072883129119873", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "129292712": {"recommendationid": "129292712", "author": {"steamid": "76561197994811859", "num_games_owned": 597, "num_reviews": 9, "playtime_forever": 430, "playtime_last_two_weeks": 0, "playtime_at_review": 430, "last_played": 1672023109}, "language": "english", "review": "Warning: abandoned by developers. Great game and unique concept. Shame there hasn't been an update for years.", "timestamp_created": 1672014587, "timestamp_updated": 1672014587, "voted_up": true, "votes_up": 99, "votes_funny": 3, "weighted_vote_score": "0.877682864665985107", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "9639273": {"recommendationid": "9639273", "author": {"steamid": "76561197995934240", "num_games_owned": 1566, "num_reviews": 13, "playtime_forever": 8398, "playtime_last_two_weeks": 0, "playtime_at_review": 2242, "last_played": 1508706529}, "language": "english", "review": "Edit: 01/11/2015\nA year after my last update on the game, with the release of 0.5, I tried this once again. \n\nSome new blocks added; beams, supports, stone pillar, curved blocks.\n\nUI - radial menu- is counter intuitive; too slow and complicated. Designed to be used with a gamepad, not keyboard+mouse.\n\nAI is still braindead; pathfinding is as broken as it can be. You still can't build a structure even as small as this without constantly micro maniging.\n\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=546014381\nNotice that he is standing right on top the blueprint he should be building. So he can reach it with the block but too dumb to do it.\n\nStarted new map, didn't build anything, didn't create any tasks, didn't give any orders, just selected all 5 bricktons and moved them in front of the pre-built castle; 3 of them made it, 2 got stuck on the way. Heh, so much for improved pathfinding.\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=546079762\n\nBig Island doesn't even load for me; stuck at \"Loading %0\".\n\nMultiplayer is still as broken as it can be.\n\nSome Halloween stuff again; lanterns and stuff.\n\nAnd to think they will release this in a few months. I really can't believe Sauropod.\n\nStill no real update, no real content, still the same old broken game.\n\nStay away!\n\n------------------\n\nEdit: 29/10/2014\nSo after 2 years, a new patch downloaded just now; it contains 2 new hats, one for archer and one for knight. And the floating soul thingies are now ghosts. No other visible additions so far. Will see if there will be patch notes or not.\nEdit: No patch notes; just some Halloween themed visual changes. Unbelievable.\n\nAfter 2 years we had a refactoring, a few bug fixes and a pause button. \nMap editor is gone.\nMultiplayer is as broken as it can be.\nStill no new content.\n\n----------\n\nOriginal review:\nI am a Kickstarter backer so I have been following the development of the game for about 1,5 years. \n\nThis ride started great, these guys had an awasome concept, gameplay movies to show and so I backed their project. They were supposed to deliver the beta in October 2012; now we are in Early Access and still in early prototype. But the real problem is the lack of information about the development process; dev. dairies are void of any solid info; they are just about bugfixes and trivial stuff; t-shirts, save/load game functions, technical mumbo jumbo.. We don't know where this game is going; no real direction or roadmap presented by devs. There is talk of a roadmap though; for many, many months if I remember correctly. I suspect they have not known what to do with their game since the beginning. I just can't explain the lack of any solid info about the game/roadmap/direction in any other way.\n\nSince the first prototype of the game, over a year ago, devs have added a really, really broken survival mode to the game, a multiplayer mode which doesn't work, a few bugfixes here and there; nothing else. \n\nGame has a lot of potential, a great concept but the execution is just plain bad; UI is horrible, there are no real updates, no content added in over a year since first release. \n\nI do not recommend the game at this point. At this rate devs working on the game; come back in a year or two and maybe, maybe you might be looking at a good game. Otherwise just stay away for now.\n\nAbout the game itself:\nIt's sandbox building game. You have minions doing various tasks like mining, cutting down trees and providing you with building materials on the map you choose; well you have just one map at the moment so no choosing. You issue orders to your minions to gather materials and then you go ahead and lay down blueprints for your minions and they build them. \n\nIn Survival mode; you have baddies on top of normal sandbox mode. But they have no AI so they just rush at you. Get an archer or two at a high place and you win. Baddies won't be able to climb more than 2 blocks high and it takes too much time to destroy the blocks; your archers will kill everyone while baddies are hacking away at the blocks.\n\nProblems;\nUI is horrible. unimaginative and clunky.\n\nCamera controls are plain bad.\n\nThere are still problems with laying down blueprints for constructions. Pathfinding is broken, AI is broken; blueprints for big buildings are very problematic; your minions just can't build them due to pathfinding errors. \nEspecially big blueprints will give you a headache; you will have to zoom in, out, rotate the camera this way and that just to be able to lay down a blueprint. Misclick? Tough luck; some blueprints blocks just don't wanna be removed so you will end up dropping that building and start another blueprint.\n\nMany times you will have to start a map over and over again to get minions to spawn at all; you will just start with no minions.\n\nThere is a catapult in the game with which you can hurl barrels filled with stones or explosive stones to baddies. Very clunky to use; you will end up not using it at all. You don't want to use explosive barrels too; you will just destroy your buildings with it.\n\nNo content added as of now. You just build aimlessly in the map. There aren't enough building blocks. \n\nThere aren't enough info about the game mechanics; how do you build that bridge for example? You will have to find some YouTube video by a fellow player to show you that.\nWhy can't you just put that block over there? Because you can't. And no one tells you why not.", "timestamp_created": 1395881970, "timestamp_updated": 1446387780, "voted_up": false, "votes_up": 248, "votes_funny": 1, "weighted_vote_score": "0.877592325210571289", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "71904813": {"recommendationid": "71904813", "author": {"steamid": "76561198087898789", "num_games_owned": 507, "num_reviews": 87, "playtime_forever": 286, "playtime_last_two_weeks": 0, "playtime_at_review": 286, "last_played": 1593706034}, "language": "english", "review": "Castle Story is a game that makes me smile, and then immediately sad. \n\nIt's brilliantly simple, and that's the double edged sword. Here's why:\n\n1, This game is almost 10 years old (no, seriously). I was almost one of the original founders when the game was on kickstarter.\n2, There is very little to do; sandbox, invasion, and conquest. \n3, There are also very little maps to do this on; less than 20 maps of varying sizes. (there is workshop maps though)\n4, The game is very slow paced.\n5, There are limited and lacking build stations.\n6, Combat feels very odd; it looks okay but feels very clunky.\n7, The supply system is brittle; if you are missing an object or material you will have no idea about it until you figure it out.\n8, The game still feels like an alpha despite it being 10 years. They've made improvements but for the time versus what's in the game it seems like a scam. \n\nTL;DR -> You'll have fun for a little bit, and then once you do everything once you will get bored and never play it again. Multiplayer/Co-Op looks enticing, but it will end the same way. It's a very cautious yes because it's actually a good game, but I've been here since day one.", "timestamp_created": 1593723120, "timestamp_updated": 1593723120, "voted_up": true, "votes_up": 112, "votes_funny": 1, "weighted_vote_score": "0.867087781429290771", "comment_count": 8, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "117172562": {"recommendationid": "117172562", "author": {"steamid": "76561198108398145", "num_games_owned": 152, "num_reviews": 42, "playtime_forever": 2913, "playtime_last_two_weeks": 0, "playtime_at_review": 2913, "last_played": 1573528057}, "language": "english", "review": "It truly breaks my heart to drop this review. But hopefully I'll save some young kid 25 bucks. When I first saw the trailers for this in 2012 I loved how it looked. It wasn't until years later that I finally bought it. Unfortunately, even when I did it seems it had been dead. This game is abandoned, and as much as I love it, I can't in good consciousness recommend it.", "timestamp_created": 1655546230, "timestamp_updated": 1655546230, "voted_up": false, "votes_up": 100, "votes_funny": 0, "weighted_vote_score": "0.866237878799438477", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "38715157": {"recommendationid": "38715157", "author": {"steamid": "76561198055383238", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 3896, "playtime_last_two_weeks": 0, "playtime_at_review": 3845, "last_played": 1514327331}, "language": "english", "review": "It pains me to give this one a bad review, because I think the core idea (sandbox + RTS) is great...\nBut in my opinion, the game balancing is so poor that neither of the game modes really expresses both the sandbox & the RTS sides of the game :\n\n - In sandbox mode, you can build anything but there's nothing to do with it, no enemy, no goals, nothing, so it becomes boring really quickly.\n - In Invasion & Conquest modes, there's so many enemies that you don't have enough time to seriously build anything (even in easy) , and there's no point in building a castle since a plain boring wall is as efficient as the most fancy of castles.\n\nSee the problem ? You can have a castle, you can have a story, but you can't have a castle story.\nToo bad it's the title of the game.", "timestamp_created": 1514328381, "timestamp_updated": 1514328381, "voted_up": false, "votes_up": 119, "votes_funny": 7, "weighted_vote_score": "0.862495958805084229", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "63419088": {"recommendationid": "63419088", "author": {"steamid": "76561198014654946", "num_games_owned": 689, "num_reviews": 51, "playtime_forever": 5133, "playtime_last_two_weeks": 0, "playtime_at_review": 1660, "last_played": 1585614829}, "language": "english", "review": "I try to avoid starting reviews with \"I really wanted to like this game,\" but I was very much excited for this game back when it launched on Kickstarter. I bought it way back then, but never actually got around to playing it until recently. I've since put a fair amount of time into it, but unfortunately, getting enjoyment out of this game is like squeezing water from a stone. In a lot of ways, the game feels like an early backer build, not a finished product.\n\nThe first thing you'll start to notice, and grow even more frustrated with over time, is the awful AI of the Bricktrons (your units). AI isn't easy, but the Bricktron AI is exceptionally bad. You can give an instruction to place a single block, and watch three or four Bricktrons all carry a block to the location, one of them places the block, and the others have to carry their cargo all the way back. If you build a wall (a core gameplay mechanic), you'll likely see your Bricktrons building it up in jagged spikes rather than level by level, wasting plenty of time as Bricktrons climb up and down and up and down blocks to place them instead of just walking along a flat level. But the most astonishing failure of the AI is that they will explicitly ignore your commands. The gameplay of controlling your minions involves giving them an order to pick something up, watch them walk almost all the way to it, then suddenly turn around and run somewhere else. Why the AI is trying to find something to do [i]after you've given them an instruction[/i] is a question that boggles the imagination.\n\nAs for gameplay mechanics, I'm hard-pressed to deduce what the main game mode was intended to be. Sandbox is the first one the game wants you to play, but the vast majority of things you can craft and build relate to combat, so it doesn't serve much purpose except as a tutorial. Invasion is the next game mode on the menu, but it's completely unbalanced. And I don't say that lightly - the enemies spawn in waves faster than you can hope to revive any dead Bricktrons, and past the early waves there are so many enemies, and their health and damage increases to absurd levels. Melee equipment for your Bricktrons is functionally useless early on because they simply can't tank enough damage, and you are severely punished for letting your Bricktrons die. The last game mode is Conquest, which is the most robust by far - there are a series of crystals across the map both you and the enemy are trying to capture, and the enemy will regularly send units to attack you, so you need to be consistently improving your defences. It's definitely the most satisfying game mode, but that only serves to highlight the fundamental holes in the game's design.\n\nThe very premise of the game just doesn't work (and pardon me while I spend the rest of the review trying to explain). Others have pointed out the difficulty of building multi-story structures, which actually isn't terribly difficult to do - the game just doesn't tell you how to do that, because it's not designed around building structures. It's designed around building walls, to block off chokepoints and slow down enemies. Building an actual structure is pointless; the only purpose of building anything is to defend yourself from the enemy attacks. But then you run into the problems with combat: enemies can tear down your defenses incredibly quickly, and you have no good way of stopping them. All of the walls you see in screenshots don't work; your units generally can't shoot straight down, and enemies generally don't stand back to battle you at range. The enemies rush right up to your wall and tear it apart, and the bigger enemies (which spawn very regularly) can do so extremely quickly. You can try to set up a U-shaped barricade, with ranged units along the sides shooting across towards the walls, but the harder you try, the more frustrated you'll be with how little damage your units deal compared to how quickly the enemies can break things - and you'll also notice just how much damaged the big ranged enemy deals.\n\nThe result of all this is: rather than building a wall, you should actually want to build a moat. The enemies have absolutely no way of crossing a pit - if possible, all they can do is try to dig straight down, cross the pit, and dig their way upwards. Of course, then you just dig out the ground beneath your base, and leave it floating in the air. And you're suddenly completely secure from all of the enemies in the game. (If you want to get the achievement for reaching wave 60 (which requires you to actually [i]defeat[/i] wave 60, not just reach it), create a custom map with the enemy spawn on a tiny, separate platform in range of your ranged units). Of course, digging isn't easy, but not at all for the reason that would make sense. Your Bricktrons can actually dig quite quickly, but digging produces a [i]lot[/i] of extra resources (stone, iron, brimstone), and the Bricktrons won't mine any of it unless there's storage space for it. You won't be able to dig your moat, specifically because you won't have enough storage space for any of it. Of course, you could try to manually guide a Bricktron to dig it out, but you'll have to micromanage them block by block, and even if you decided it was worth the trouble, you'd never suggest that it was fun.\n\nThe point is, it's very telling that the core gameplay mechanic expected by the game is for you to build things, but the actual most effective strategy is just to destroy the world. I really do get the impression that the game's aesthetic (floating islands, voxel castles, Bricktrons) was the actual vision for the game, and the gameplay loop was added on as an afterthought. This game could have polished the combat mechanics a bit to make combat more functional - having higher-tier equipment (especially for melee) would go a long way in that regard - or the game could have gone in a different direction entirely, perhaps adding mechanics that actually related to the construction aspects (i.e. needing to build every Bricktron a room), and aspiring more towards a management game.\n\nAs it stands, Castle Story is little more than a novelty. Its mechanics are unrelated to each other and universally shallow; the game's main strength is just in its aesthetic (and don't get me wrong, it does look very good!). Tasks that feel like they should complete in five minutes always take hours - I didn't mention it, but completing the wave 60 achievement, without skipping ahead of waves, will take you 10 hours(!). Even at a low sale price, I would recommend you spare yourself the disappointment/frustration.", "timestamp_created": 1581571665, "timestamp_updated": 1581571665, "voted_up": false, "votes_up": 86, "votes_funny": 2, "weighted_vote_score": "0.861841201782226563", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "144169694": {"recommendationid": "144169694", "author": {"steamid": "76561198097549250", "num_games_owned": 1078, "num_reviews": 11, "playtime_forever": 2379, "playtime_last_two_weeks": 0, "playtime_at_review": 2379, "last_played": 1691237073}, "language": "english", "review": "Such great potential, but completely abandoned by the devs", "timestamp_created": 1692014310, "timestamp_updated": 1692014310, "voted_up": false, "votes_up": 65, "votes_funny": 0, "weighted_vote_score": "0.854657769203186035", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "112611534": {"recommendationid": "112611534", "author": {"steamid": "76561198062699215", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 48, "playtime_last_two_weeks": 0, "playtime_at_review": 48, "last_played": 1386040945}, "language": "english", "review": "I bought This in early access years ago because It seemed like the core for a fun game. It was never finished and wont ever be. Do not buy. Much better games like this out there.", "timestamp_created": 1647894321, "timestamp_updated": 1647894321, "voted_up": false, "votes_up": 104, "votes_funny": 0, "weighted_vote_score": "0.854533731937408447", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "15784962": {"recommendationid": "15784962", "author": {"steamid": "76561198050080670", "num_games_owned": 825, "num_reviews": 29, "playtime_forever": 424, "playtime_last_two_weeks": 0, "playtime_at_review": 424, "last_played": 1422380606}, "language": "english", "review": "Brief:\nCastle Story is my second biggest regrettable pruchase (looking at you, Starforge). This is supposed to be a fun castle builder in the essence of a tower defense game. I feel for the devs, but I can't help but dislike this game.\n\nPros:\n+Has basic castle building mechanics\n+Has basic resource mechanics\n+Has very basic combat mechanics\n\nCons:\n-Has the dev progress speed of a tortoise.. that doesn't have any legs..\n-Has a wave game mode with no fast forward.. so slow..\n-Each 'update' brings very little to the game, they seem to be more 'patches'\n-Maps (think there are two now) are incredibly boring and feel empty\n-Enemies are boring, with AI feeling very basic\n-Friendly AI seem incredibly stupid and struggle with simple tasks\n-I personally see literally no longevity to the game. It just goes on with no sense\nof achievement whatsoever", "timestamp_created": 1431337266, "timestamp_updated": 1431337983, "voted_up": false, "votes_up": 110, "votes_funny": 10, "weighted_vote_score": "0.85110163688659668", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "148308792": {"recommendationid": "148308792", "author": {"steamid": "76561198143152220", "num_games_owned": 0, "num_reviews": 58, "playtime_forever": 2861, "playtime_last_two_weeks": 0, "playtime_at_review": 2861, "last_played": 1609629409}, "language": "english", "review": "This game had incredible potential and I absolutely loved it but it was completely abandoned by the devs", "timestamp_created": 1697411649, "timestamp_updated": 1697411649, "voted_up": false, "votes_up": 64, "votes_funny": 0, "weighted_vote_score": "0.848077654838562012", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "34389287": {"recommendationid": "34389287", "author": {"steamid": "76561197970359498", "num_games_owned": 1697, "num_reviews": 242, "playtime_forever": 391, "playtime_last_two_weeks": 0, "playtime_at_review": 391, "last_played": 1503224717}, "language": "english", "review": "When an indie game gets five years in development, you expect the final product to exceed what was initially laid out in the kickstarter pitch that started it.  Yet, after putting in some time with the initial  full release of the Castle Story, it's clear that a good game does not always come from a good idea, even when it's given plenty of time and money for the process.\n\n[h1]What happened here...[/h1]\n\nBack when Kickstarter first started taking off, Castle Story hit the ground running like many of those early adopters of the platform and generated nearly seven times its funding goal.  Like many people, I got caught up in the fanfare of being on the ground floor of cool game ideas and backed this game along with plenty of others.  Some games I backed turned out well, but Castle Story seems to have had some real problems given that it was in development for so many years and delivered something that feels so clunky and lacks any real depth.  Looking at the KS trailer compared to the finished product, it's strange to see how little it has changed in all of that time and how the initial concepts of the interface seem to be even better than end result.  Whatever went down between August of 2012 and August of 2017 to give us the game that we got a few days ago must be an epic story that I'd love to hear.\n\n[h1]So what's so bad about it?[/h1]\n\nLike any game, the first things I do after tweaking settings and checking out the main menus is look for a tutorial.  Some games have it separate while others integrate it into the new game setup.  Castle Story just simply doesn't have one.  At least not anywhere in the game.  The tutorial that does exists is on youtube and it's not even linked in game.  This is something than can be forgiven in a lot of circumstances, especially if the game is intuitive or extremely simple, but Castle Story is neither of those.  The menu system, crafting, building, and virtually any aspect of the game features so little basic instruction that it's easy to spend your first ten minutes not progressing in any way.  I had the advantage of streaming these bits and having a helpful person guide me along in chat, but it was still overwhelmingly frustrating and straight away gave me a bad omen for what was to come.  When a game has such unappealing initial steps, it rarely redeems itself going forward.  Castle Story as not an exception.\n\nThe most egregious offense in this game is the gameplay UI.  It's hard to explain just how clunky it is, but it seems like when most developers try to limit the amount of clicks and submenus, Castle Story's developers seemingly do the opposite.  Actions will often have several paths to get to them, not even considering keyboard shortcuts.  Performing actions will have you going in to menus, doing long clicks and awkward combinations of right and left clicks, and resizing selection areas clicking arrows and dragging it around.  Even after many hours of using this, I still found myself making mistakes and not remembering what all I needed to do to get something crafted or built.  Yet, as I moved forward in the game, it was easy to see that cumbersome UI is a product of  poorly designed gameplay.\n\nNearly every aspect of the game involves a convoluted process to achieve.  It shares so much with other detailed 'city' building games like Settlers and Banished, it seems odd that more of those games' logical designs weren't implemented.  The real issue starts where most everything in the game starts the stockpile.  Rather than having a single building that workers will store resources in for retrieval, you're required to build a sea of these individual square stockpiles that eventually take up the vast majority of the space you're working in.  Each will hold an arbitrary amount of a single substance, however the problematic AI will often block in stockpiles so that empty ones can't be filled, and then if you're not micromanaging a task, they'll fill all of you stockpiles with a resource, preventing other resources from being stored.  If you want to use these resources to craft something, you may end up missing a component.  Yet rather than telling you this, or what things are missing in the UI, you have to click on the area something is being made and hover over it to find out what is missing, then fumble your way around trying to find out why it doesn't exists, or hasn't been harvested, or wasn't being stored, or wasn't being accessed from it's storage area.  Something that is normally handled in games like this with a simple menu system featuring clear concise information turns into a hassle that bogs the game down even more.\n\nI had originally believed this game would feature a linear mission progression system that would have you going from map to map trying to succeed in taking it over and building an effective castle and community.  However, you're relegated to three choices, a conflict-free sandbox mode, an Invasion mode that has timed waves of enemies (called Corruptrons) that you must keep from destroying your home-base crystal, and Conquest where you also have random waves of enemies coming for your crystal, but your objective is to capture other crystals around the map.  These are all free form, so there's no real progression or anything.  A progressive mission design would help in allowing the player to at least learn how to play in lieu of a tutorial by slowly ramping up the requirements of each map.  \n\n[h1]The heart of the issue[/h1]\n\nWhen it all comes down to it, even if you stick with it long enough to get the hang of the game, playing Castle Story just feels like you're pulling a dozen anchors with glue on your knees and a stomach full of greasy fast food.  When you're not fighting the interface or the mechanics, you're trying to accomplish something that just takes too long.  I slogged through two and a half hours of a Conquest map trying to get the hang of the systems and inching forward.  By the time I searched the internet a couple dozen times and got my pitiful army wiped out a third time from the ever-spawning menace, I just didn't want to play anymore.  Building anything more than the bare minimum castle for protection was just a waste of time, and even doing that felt too slow.  Now, I think I should make it clear that I don't have problems with slow games.  I play games like this all the time and enjoy them.  The older I get, the more I find value and pleasure in games that are fun without making me test my reflexes at every turn.  Yet with Castle Story, no matter what I accomplish, it still feels like I'm trying to run through waist deep water in the process.\n\n[h1]Any chance of recommendation?[/h1]\n\nI wouldn't recommend Castle Story to probably 99% of the PC gamers out there.  There are many design flaws throughout and even if you manage to figure it out, it doesn't get much more appealing.  That 1% out there that would like it are people that really enjoy the aesthetic (which is nice) and want a game that takes some effort to learn.  But even then they're going to have to learn to appreciate the fairly shallow game that it actually is.  If you think you're the 1% here, give it a shot, but I can only say to do it when it's really really cheap.  \n\nIf you'd like to see more of my reviews, check out my curator page here: http://steamcommunity.com/groups/EndyoGaming#curation", "timestamp_created": 1503297894, "timestamp_updated": 1503297949, "voted_up": false, "votes_up": 121, "votes_funny": 2, "weighted_vote_score": "0.842690110206604004", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "16411789": {"recommendationid": "16411789", "author": {"steamid": "76561198027138724", "num_games_owned": 438, "num_reviews": 27, "playtime_forever": 145, "playtime_last_two_weeks": 0, "playtime_at_review": 145, "last_played": 1404088298}, "language": "english", "review": "[h1]├Honest Review┤[/h1]\n[i]Review is based on current state of game.[/i]\n\n[b]Game Pros[/b]\n• Base Building\n• Resource Gathering\n• Day/night Cycle\n \n[b]Game Cons[/b]\n • AI Path finding is horrible\n • Very slow updates (Hasn't gone far in a years time)\n • Basic map\n • Controls are confusing to get used to and are not explained well\n • Mind numbing\n • Devs give false promises\n • Game freezes/Lags/Crashes often\n\n\n[b]Relateable Games[/b]\n • N/A \n\n[h1]Conclusion[/h1]\nCastle Story has a great concept that has been executed poorly by the developers. It looks almost exactly the same from where it was on Kickstarter before it even came out, and the updates are more like patches. I would not reccomend this game to anyone.\n\n[i](If you found this review helpful, consider giving it a thumbs up!)[/i]", "timestamp_created": 1434358027, "timestamp_updated": 1434358027, "voted_up": false, "votes_up": 206, "votes_funny": 7, "weighted_vote_score": "0.840875029563903809", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "118742615": {"recommendationid": "118742615", "author": {"steamid": "76561198432634284", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 549, "playtime_last_two_weeks": 0, "playtime_at_review": 356, "last_played": 1657727139}, "language": "english", "review": "Sadly \"abandoned\" game wish it was open source but kinda good. Only buy if it's on sale.", "timestamp_created": 1657712040, "timestamp_updated": 1657712040, "voted_up": true, "votes_up": 66, "votes_funny": 0, "weighted_vote_score": "0.835815489292144775", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "105010408": {"recommendationid": "105010408", "author": {"steamid": "76561198038726442", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 1575, "playtime_last_two_weeks": 0, "playtime_at_review": 1575, "last_played": 1556421286}, "language": "english", "review": "After supporting this product in it's early Kickstarter days in 2011, I can wholeheartedly say the developers took the ~800,000 they collected from backers and consciously neglected the product. It took 7 years to deliver an almost playable game, they hired 1 or 2 extra developers, and would post semi regular updates of the game, usually with 1 or 2 small bug updates. The developers have had zero interest in finishing this game. I think I paid $20 for this game in the Kickstarter phase, but I still want my money back. Do not buy this game. Do not support these thieves.", "timestamp_created": 1638377418, "timestamp_updated": 1638377418, "voted_up": false, "votes_up": 64, "votes_funny": 0, "weighted_vote_score": "0.834532380104064941", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "9770207": {"recommendationid": "9770207", "author": {"steamid": "76561197968649157", "num_games_owned": 0, "num_reviews": 32, "playtime_forever": 416, "playtime_last_two_weeks": 0, "playtime_at_review": 389, "last_played": 1434937365}, "language": "english", "review": "Might be worth buying in 4 years when they release a content update.", "timestamp_created": 1397046274, "timestamp_updated": 1397046274, "voted_up": false, "votes_up": 704, "votes_funny": 2, "weighted_vote_score": "0.83351975679397583", "comment_count": 10, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "10839090": {"recommendationid": "10839090", "author": {"steamid": "76561198014191901", "num_games_owned": 371, "num_reviews": 14, "playtime_forever": 137, "playtime_last_two_weeks": 0, "playtime_at_review": 82, "last_played": 1611631753}, "language": "english", "review": "They haven't added a single substantial thing to the game since it was originally released in alpha.  Every post on the dev blog is either a behind the scenes change that adds nothing for the player, a minor gui update, or another random person they hired to help with doing those things.  This game has negatively impacted my opinion of both Early Access and Kickstarter as a whole.  Would not reccomend.\n\n0.3.x UPDATE:\nCastle Story has recieved a-  well hold on a damn minute, what even has it recieved?  Bigger islands, okay, that's good.  New AI is good as we-  Oh, no the new AI is only on one map/gametype and isn't even near done, not to mention a buggy mess.  All six textures have been updated, but whether or not it's for the better is a point of argument.  The music/sound engine has been redone, but I can't listen a bricktron into getting unstuck from a doorway, so that doesn't affect much.\nGuess I'll check back next year after they've redone everything a fourth time and hired three more people.", "timestamp_created": 1403802578, "timestamp_updated": 1420062916, "voted_up": false, "votes_up": 219, "votes_funny": 0, "weighted_vote_score": "0.829618155956268311", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "31963505": {"recommendationid": "31963505", "author": {"steamid": "76561197993797203", "num_games_owned": 0, "num_reviews": 88, "playtime_forever": 3488, "playtime_last_two_weeks": 0, "playtime_at_review": 1686, "last_played": 1689497820}, "language": "english", "review": "I played this game 4 years ago.\n\nIt was a beautiful, fun, addictive game.  It had really strong potential! \nIt was buggy, had terrible lag, leaked memory like crazy and after more than 20 minutes became totally unplayable.  The AI was buggy and acted irrationally.\n\nIt is a beautiful, fun, addictive game. It has some really strong potential!\nIt is a little laggy, leaks a little memory. The AI is somewhat better, unless you build a wall, in which case it becomes irrational.\nIf it had been developed more it would be great.  If you can find a few people who don't mind a few hours of setting up and tweaking to get it to work, this is a great multiplayer game, but is not good for single player for more than people who just like to make Castles.\n\nGet it on an extreme sale, not worth full price.\n\nI played this game 2 years ago.\n\nIt was a beautiful, fun, addictive game.  It had really strong potential! \nIt was buggy, had terrible lag, leaked memory like crazy and after more than 20 minutes became totally unplayable.  The AI was buggy and acted irrationally.\n\nI played this game this week.\n\nIt was a beautiful, fun, addictive game.  It had really strong potential! \nIt was buggy, had terrible lag, leaked memory like crazy and after more than 20 minutes became totally unplayable.  The AI was buggy and acted irrationally.", "timestamp_created": 1495764720, "timestamp_updated": 1689491712, "voted_up": false, "votes_up": 298, "votes_funny": 112, "weighted_vote_score": "0.823155522346496582", "comment_count": 10, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "50728134": {"recommendationid": "50728134", "author": {"steamid": "76561198030706547", "num_games_owned": 0, "num_reviews": 33, "playtime_forever": 61, "playtime_last_two_weeks": 0, "playtime_at_review": 61, "last_played": 1503556234}, "language": "english", "review": "I think I kickstarted this game back in 2011 and it still isn't a finished product.\n\nDo with that information what you will.", "timestamp_created": 1558302495, "timestamp_updated": 1558302495, "voted_up": false, "votes_up": 131, "votes_funny": 10, "weighted_vote_score": "0.822006106376647949", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "107423322": {"recommendationid": "107423322", "author": {"steamid": "76561198035871317", "num_games_owned": 96, "num_reviews": 9, "playtime_forever": 556, "playtime_last_two_weeks": 0, "playtime_at_review": 556, "last_played": 1573597617}, "language": "english", "review": "Interesting idea for a game. Unfortunately, it has been abandoned in early access after being early access for a very long time. Initially the game was fun but very clunky and literally pointless. Eventually some game modes with objectives were added and supposedly controls were ironed out. As it is, the game is completely unfinished and abandoned. The dev has said there will be no further updates and has moved to other projects or disbanded. Do not buy this game.", "timestamp_created": 1641440060, "timestamp_updated": 1641440060, "voted_up": false, "votes_up": 55, "votes_funny": 0, "weighted_vote_score": "0.821619749069213867", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "21333425": {"recommendationid": "21333425", "author": {"steamid": "76561198011332988", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 7379, "playtime_last_two_weeks": 0, "playtime_at_review": 6410, "last_played": 1621134062}, "language": "english", "review": "(Patch 0.6) Since the first beta, i try every new patch, and i've always been disapointed by the way everything was slow and unsteady. I think that this patch is a turning point. It was the first time that the game got hard, and it was fun like that. The Bricktrons now move with no hesitation, they build fast and the most impressive part :  the combats are now epic! The Minitrons are flying everywhere, most of the action is fluid, the pathfinding is fast and the AI look like it understand what is going on (they don't exaggerate when they say the pathfinding is 100X faster or more). Still, beware, this game is far from finish, but i have a good feeling about the upcoming releases. Bravo à toute l'équipe de Sauropod!", "timestamp_created": 1455949980, "timestamp_updated": 1456008167, "voted_up": true, "votes_up": 99, "votes_funny": 3, "weighted_vote_score": "0.820712566375732422", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "8494566": {"recommendationid": "8494566", "author": {"steamid": "76561197994013929", "num_games_owned": 2100, "num_reviews": 47, "playtime_forever": 256, "playtime_last_two_weeks": 0, "playtime_at_review": 94, "last_played": 1388620272}, "language": "english", "review": "Not finished enough to cost this much.\n\nCome back later!\n\nEDIT: It's been nearly 2 years since my first review - it hasn't changed.\nWhat a shame!", "timestamp_created": 1388619577, "timestamp_updated": 1445872378, "voted_up": false, "votes_up": 352, "votes_funny": 0, "weighted_vote_score": "0.818525373935699463", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "58471698": {"recommendationid": "58471698", "author": {"steamid": "76561198023806965", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 729, "playtime_last_two_weeks": 0, "playtime_at_review": 721, "last_played": 1677465029}, "language": "english", "review": "To those of you on the fence about purchasing this game: I bought this game at its earliest release and it was extremely terrible and these bad reviews are justified. However, the game has come a long way since then. All of the bugs and building issues have been addressed, and the finished product is a beautiful looking game that is a lot of fun! I'm glad I waited to write this review, because this is an entirely different game than the one released years ago. Please give this game a chance and I promise you wont be disappointed!", "timestamp_created": 1574971221, "timestamp_updated": 1574971221, "voted_up": true, "votes_up": 58, "votes_funny": 3, "weighted_vote_score": "0.817297399044036865", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "17193895": {"recommendationid": "17193895", "author": {"steamid": "76561198007299273", "num_games_owned": 0, "num_reviews": 41, "playtime_forever": 403, "playtime_last_two_weeks": 0, "playtime_at_review": 403, "last_played": 1396790255}, "language": "english", "review": "Now i dont mean to be a downer. I completely understand that there are only a small development team, ect, ect. but i bought this game over a year ago and i havent noticed any changes since i last saw it. \n\nI honestly like the concept of this game and i dont mind the early access thing at al. However this game still has to reach the point where it is playable. \n\nI wish the developpers all the luck in the world in their quest to finish this game but if one of my friends would ask me if he or she should buy this game then i would say: not yet. which is the same advice i give the reader of this review. \n\nAt the moment i cannot in good faith recommend this game to anyone. It is not playable at the moment and i fear that this will not change any time soon. If the developpers actually begin to make some notable progress on this game then i will be more then happy to adjust this review. But at the moment i have to say no... \n\nI did notice that much of the progress on this game appears to be focussed on the engine. which is an understandable way of development. But at the same time there are ofcourse a lot of people who spend money on this game and dont know as much about programming and game design as proffesionals would. (completely understandable ofcourse) and those people are going to end up feeling cheated. hence my advice.\n\nsummary: Dont buy it. Keep it in your whishlist until it is finished and then buy it. Because the concept of the game is great and you are going to have a great time once it is playble. Castle story is scheduled for release in 2016 (as far as i know at least) so guys please keep this game in mind when that day comes", "timestamp_created": 1437685238, "timestamp_updated": 1437686083, "voted_up": false, "votes_up": 85, "votes_funny": 2, "weighted_vote_score": "0.815340876579284668", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "15180214": {"recommendationid": "15180214", "author": {"steamid": "76561198021001438", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 250, "playtime_last_two_weeks": 0, "playtime_at_review": 196, "last_played": 1392848352}, "language": "english", "review": "I backed this shit in 2012\n\ntwo thousand and twelve.\n\n\nthe game has not changed at all since and all the devs do is post passive agressive youtube videos about how they can update it when they want.\n\n\nplease dont buy this", "timestamp_created": 1428037550, "timestamp_updated": 1428037550, "voted_up": false, "votes_up": 92, "votes_funny": 7, "weighted_vote_score": "0.815258443355560303", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "15292188": {"recommendationid": "15292188", "author": {"steamid": "76561198019038274", "num_games_owned": 120, "num_reviews": 33, "playtime_forever": 12643, "playtime_last_two_weeks": 0, "playtime_at_review": 2764, "last_played": 1698887163}, "language": "english", "review": "Game is worth 10USD. If that is what you're paying I think it's worth it. Unfortunately it isn't 10USD.\nThe game lacks content and barely works, but it is quite fun for what there is. The devs have left it alone rather than milking it for DLC so they have my respect for that, but they fall short in most other categories.\n\nMy gripes:\n1. Instead of optimising the AI, pathfinding, job finding etc. they made a limit of 15 units. There are videos of people playing with 130+ units and having no issues. \n2. The AI still fails regularly. A common one this. A unit walks for five minutes to place a block. It gets there and finds that actually, if it had just go the block from the stockpile that's right next to the building site it would have saved more than half of that time walking there. Not only that but damn, can't place the block anyway because someone else has already placed it. In fact, 6 of its comrades tried to place that same block. Now, there's a space right next to it that it could put its block into and complete the building, but instead it puts the block back in the stockpile, then goes to do another job. \n3. The balancing is terrible due to the nature of the game. If you start to lose units or have buildings be destroyed, give up. Recovery is almost impossible due to the waves getting increasingly difficult. \n4. There used to be 'exploits' where you could make long bridges and most people used it because it made for fun gameplay to work around the limitations of the rules. Instead of adding this as a feature and making it less powerful, they just removed a good, fun feature. \n5. You cannot have a large or complicated base. Units WILL DEFINITELY walk from one side to the other unnecessarily and for no good reason, wasting absolute tons of time and getting you killed.\n6. Castle designs which would work in any other scenario do NOT work here. Crenelations are a good example. A sloping, terraced wall with lots of places to put archers and orbs is the only effective defense.\n7. \"Corrugations\" or placing blocks that enemies have to climb over is a stupid tactic that should not be rewarded, but it's absolutely necessary, since if the enemy gets to your wall, you will probably lose, so you have to slow them down instead.\n8. If you are using melee units midgame, you are losing. If you are using archers endgame you are about to lose. \n9. Conquest is nothing to do with strategy and everything to do with micro. \n10. Conquest is only playable as base vs base, you can't take territory because getting bricks there takes too long. You are much better off spending that time making more weapons. \n\n\nOLD REVIEW: \nAlthough in its current state it is a pretty interesting game, it will likely not change in the next few years. In two years, there has been two mentionable updates, both of which brought either tiny features, (such as pillars) game breaking bugs (such as the assumed memory leak in the unstable build which forces you to reload the level every ten minutes) or both. \nI understand creating games is not easy, even through easy methods, such as game making or scripting programs, but this seriously makes me wonder if they are actually doing any development, or just making YouTube videos to say they are. I doubted Starbound, and they barely pulled through once, but this is far more problematic than slow development; this is avoidance. \n\nMy suggestion is to put it on your wishlist, wait about five years, and check again. By that time you will maybe know its fate. \n\nI apologise for my straightforwardness.\n\nEdit 09 08 (Aug) 15\nThe game in its current state is unplayably difficult. Using several different tactics I haven't been able to get past wave 4. The enemy is more powerful, spawns faster and has less chance of friendly-fire, and outnumbers you significantly. Time to go edit the map again, this is an interesting game if you can get past the lack of updates, the bugs (most of which are fixed more recently) and the now outrageous difficulty.", "timestamp_created": 1428678307, "timestamp_updated": 1603539728, "voted_up": false, "votes_up": 56, "votes_funny": 0, "weighted_vote_score": "0.812189042568206787", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "85071415": {"recommendationid": "85071415", "author": {"steamid": "76561198073722409", "num_games_owned": 582, "num_reviews": 72, "playtime_forever": 705, "playtime_last_two_weeks": 0, "playtime_at_review": 705, "last_played": 1503302898}, "language": "english", "review": "The developers have for all intents and purposes abandoned this game, which is really unfortunate as it shows so much potential. It is still too unfinished to recommend.", "timestamp_created": 1611208544, "timestamp_updated": 1625551852, "voted_up": false, "votes_up": 67, "votes_funny": 4, "weighted_vote_score": "0.812156438827514648", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "71666865": {"recommendationid": "71666865", "author": {"steamid": "76561198000691445", "num_games_owned": 469, "num_reviews": 5, "playtime_forever": 450, "playtime_last_two_weeks": 0, "playtime_at_review": 401, "last_played": 1593452397}, "language": "english", "review": "Great idea, extremely horrible execution.\nAI lacks a proper code to manage tasks for each minion.\n\nDo you need to deploy a single brick to the other side of the map?\nGreat, all of your minions will pick up one stone, carry it all the way to the other side of the map.\nThen do the surprised pikachu face, when they find that it's already have been built.\nIf you played any management games, this should make you immediately realise that this game, is not properly playable at it's core.", "timestamp_created": 1593449492, "timestamp_updated": 1593449492, "voted_up": false, "votes_up": 98, "votes_funny": 10, "weighted_vote_score": "0.81070631742477417", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "10820056": {"recommendationid": "10820056", "author": {"steamid": "76561197968511614", "num_games_owned": 0, "num_reviews": 52, "playtime_forever": 187, "playtime_last_two_weeks": 0, "playtime_at_review": 187, "last_played": 1403753020}, "language": "english", "review": "This game looks amazing. The video really made me rush to purchase it. Unfortunately it is a frustrating mess to play. The characters stand around like goons, refuse to follow paths or instructions, and after about 20 minutes of attempting to play they just stop following commands for no reason. I bought it ages ago and it hasn't got any better. The video appears to be a complete fabrication as you can't even mine for long before the Bricktrons glitch and stop responding, never mind build a castle. I couldn't get to any other floating islands, and even navigating the current island wasn't easy. Don't waste your money. This game doesn't appear to be improving at all.\n\nNote: I called this an unfinished, unplayable mess 3-4 years ago. It still is. This POS should not be for sale. Buyer beware.", "timestamp_created": 1403753170, "timestamp_updated": 1511813114, "voted_up": false, "votes_up": 141, "votes_funny": 0, "weighted_vote_score": "0.810317337512969971", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "32291532": {"recommendationid": "32291532", "author": {"steamid": "76561198054399280", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 5418, "playtime_last_two_weeks": 0, "playtime_at_review": 2428, "last_played": 1557251744}, "language": "english", "review": "So most people are saying that the devs abandoned this game. However I've been following this game since it was posted on Kickstarter and I for one say that the wait was worth it. Good work takes time, and the devs stream on twitch every friday about their work. Honestly the update that just came out fixes so many bugs and makes the game so much more enjoyable. The updates take a decent amount of time but these devs are very nice and always answer questions and take critisism from their consumers. If you like real-time strategy with base building, I'd say definitely give this game a try, don't let the mixed reviews tell a different story.", "timestamp_created": 1497014212, "timestamp_updated": 1497014212, "voted_up": true, "votes_up": 167, "votes_funny": 3, "weighted_vote_score": "0.810165345668792725", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "152302135": {"recommendationid": "152302135", "author": {"steamid": "76561198295299478", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 482, "playtime_last_two_weeks": 0, "playtime_at_review": 482, "last_played": 1615913300}, "language": "english", "review": "Dev left their game", "timestamp_created": 1701122406, "timestamp_updated": 1701122406, "voted_up": false, "votes_up": 53, "votes_funny": 3, "weighted_vote_score": "0.809379696846008301", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "17614443": {"recommendationid": "17614443", "author": {"steamid": "76561197970680672", "num_games_owned": 0, "num_reviews": 73, "playtime_forever": 1122, "playtime_last_two_weeks": 0, "playtime_at_review": 1122, "last_played": 1503673992}, "language": "english", "review": "This game has always been a glorified tech demo. Dig a hole, build a castle, uninstall, you're done. There's nothing more to it.\n\nAlthough the game has been updated, it has taken far too long to be 'completed' (years and years and years and years) and the end result is still empty and dull. It doesn't remind me of Dwarf Fortress, Minecraft, etc. because the world is dead and the mechanics are about as exciting as playing with duplo. The game modes are tacked on and give the impression that the developers realised too late that there actually needs to be something for you to play.\n\nOn a side note, I'm a kickstarter backer. They promised all 'premium' backers to be included on 'credit island' in large yellow letters. There should be 152 names, but from what I can tell, my name was just left out. That's not exactly delivering on the promise of: \"Your name will also be featured prominently in the game\". I do, however, get to wear my signed Castle Story T-shirts ironically, so there's that.", "timestamp_created": 1439990462, "timestamp_updated": 1503448808, "voted_up": false, "votes_up": 126, "votes_funny": 38, "weighted_vote_score": "0.807791769504547119", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "17751005": {"recommendationid": "17751005", "author": {"steamid": "76561197964373272", "num_games_owned": 0, "num_reviews": 71, "playtime_forever": 798, "playtime_last_two_weeks": 0, "playtime_at_review": 685, "last_played": 1499866768}, "language": "english", "review": "Castle Story is a castle building strategy game with delightful cartoonish graphics and a fun premise.\nYou order around a group of little yellow warriors, gathering resources and supplies to build a castle, to protect a large crystal that serves as a spawner for your units. All of this on the fairly simple-though-attractive backdrop of some flying islands in the sky.\n\nSadly, that's about where the charm of the game ends and the problems start to show up.\n\nCharming though it may be, the game has multiple issues ranging from save-games not loading properly, to certain game modes not functioning. There are major slow-downs in the game, and often your AI will become stuck doing nothing, for seemingly no reason.\n\nThe beautiful structures you see in the screenshots are nearly impossible to build in the game's current state. (No, seriously, how in the heck did they make those?)\n\nDevelopment is also insanely slow, if it's even progressing at all.\nMake no mistake, there is nothing even nearly complete about the game as it is now. \n\nI want to like the game, it shows a lot of promise, and it LOOKS fun; but with issues that haven't been fixed in literally years, and no sign of forward movement, you're much better off saving your money for a different game.\n\nIF things change in the future, I will happily update my review.", "timestamp_created": 1440753464, "timestamp_updated": 1440753612, "voted_up": false, "votes_up": 81, "votes_funny": 3, "weighted_vote_score": "0.807717740535736084", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "50478475": {"recommendationid": "50478475", "author": {"steamid": "76561198041947072", "num_games_owned": 351, "num_reviews": 24, "playtime_forever": 330, "playtime_last_two_weeks": 0, "playtime_at_review": 330, "last_played": 1530045370}, "language": "english", "review": "I'm really not sure how this is out of early access other than the excuse to more or less abandon a far unfinished game. I had high hopes for this when I saw it on kickstarter and decided to buy it on steam. It's nowhere near what it was meant to be.", "timestamp_created": 1556994826, "timestamp_updated": 1556994826, "voted_up": false, "votes_up": 72, "votes_funny": 0, "weighted_vote_score": "0.805046260356903076", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "9756175": {"recommendationid": "9756175", "author": {"steamid": "76561198057869539", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 5336, "playtime_last_two_weeks": 0, "playtime_at_review": 1680, "last_played": 1470005654}, "language": "english", "review": "The game is currently not worth buying but the devs are trying to fix all the problems. Keep an eye on this game but don't buy it yet. \n\nEdit:\nUpdates are slow and bare minimum. This game is probably never going to be playable. Even trying to leave the game on overnight to gather resources feels like a waste of electricity.\n\nEdit 2:\nAs of December 7th 2015 this game is now playable. The AI is improved enough that Castles can be completed; however not the most efficient pathing. Survival was fun but lagged past playable when I reached the 6th wave on easy. My computer can run Fallout 4 (on High) so If yours can't then dont buy this. The game is at a stage where I feel it should have started for early access. I wouldn't recomend anyone looking for a serious strategy game to buy this but, if you want to support a very new development team who seems to be trying to complete this game despite multiple set backs Buy it. I think the average person could get 2 hours of fun. While I have played far more most of those hours I wish I could get back. Hopefully in the near Future I can finally, after years, switch to my review to a thumbs Up.", "timestamp_created": 1396895587, "timestamp_updated": 1449531946, "voted_up": false, "votes_up": 219, "votes_funny": 0, "weighted_vote_score": "0.803854942321777344", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "145686236": {"recommendationid": "145686236", "author": {"steamid": "76561198018799970", "num_games_owned": 699, "num_reviews": 31, "playtime_forever": 3267, "playtime_last_two_weeks": 45, "playtime_at_review": 2852, "last_played": 1713319620}, "language": "english", "review": "Sadly, it's abandonware.", "timestamp_created": 1693878132, "timestamp_updated": 1693878132, "voted_up": false, "votes_up": 46, "votes_funny": 0, "weighted_vote_score": "0.803017258644104004", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "117534515": {"recommendationid": "117534515", "author": {"steamid": "76561198018769637", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 12, "playtime_last_two_weeks": 0, "playtime_at_review": 12, "last_played": 1419877670}, "language": "english", "review": "I stopped funding kickstarter/early access games because of this game.", "timestamp_created": 1656100142, "timestamp_updated": 1656100142, "voted_up": false, "votes_up": 90, "votes_funny": 1, "weighted_vote_score": "0.802524149417877197", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "14338840": {"recommendationid": "14338840", "author": {"steamid": "76561197998031858", "num_games_owned": 0, "num_reviews": 67, "playtime_forever": 620, "playtime_last_two_weeks": 0, "playtime_at_review": 620, "last_played": 1409418941}, "language": "english", "review": "Great game, great concept.\n\nBut I've had the game nearly 2 years and there's nothing different.  It feels like someone's hobby project.\n\nI will give them credit, recently the patches have been cranking out.   I will continue to play and test it out and hopefully change my review, but right now I can't recommend it.", "timestamp_created": 1423148197, "timestamp_updated": 1423148197, "voted_up": false, "votes_up": 91, "votes_funny": 3, "weighted_vote_score": "0.800826489925384521", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "21350853": {"recommendationid": "21350853", "author": {"steamid": "76561198220628112", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 13343, "playtime_last_two_weeks": 0, "playtime_at_review": 2468, "last_played": 1680994882}, "language": "english", "review": "After the 0.6 update, Castle Story is now the game that it was always meant to be. You can take your time building a fortress and you are not constantly under threat of an ever increasing number of enemies. Attacks are random so you must be prepared at al times. You can capture more crystals to have your population cap grow. ALSO!!!! I looked at a ton of the negative reviews and most of what they complain about has been fixed by this point.", "timestamp_created": 1456007283, "timestamp_updated": 1456007583, "voted_up": true, "votes_up": 58, "votes_funny": 0, "weighted_vote_score": "0.799892306327819824", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "13586974": {"recommendationid": "13586974", "author": {"steamid": "76561198032390236", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 14042, "playtime_last_two_weeks": 0, "playtime_at_review": 7362, "last_played": 1501751520}, "language": "english", "review": "Buy Castle Story? No, but why not? A 2 year summary\n\nI'm watching the development since almost two years and played over 160 hours. Only survival mode because there are no other challanges. Sandbox mode didn't really interested me after all, you know minecraft?\n\nFollowing Bugs and missing game options bother me since the first time i played. There has been changes and improvments but nothing got really fixed to a point im happy with. I guess a lot of other people feel the same after reading reddit and other sources, pointing out there's no progress would be wrong, but the prioritisation is amiss. I understand the process of prototyping, alphas and early access. But there shut be a noticable progress in all directions after two years of development.\n\n- building menu - Castle Story uses some kind of nice circular menu, it has a nice appeal in the first place. But really nerves after using it, because its inconvenient. You need to do the following steps to choose one of your main building materials; 1x1 stone bricks: hold down the right mousebutton, the main menu appears, move the mouse to submenu button, release the right mouse button, the main menu disapperas. Press the right mouse button again, the submenu apperas, move to the 1x1 stone, release right the mouse button, now you can place your bricks. You know what!? Let me use the left mouse button to select the submenu and the 1x1 brick, this would make the following steps redundant and the selection would be; hold right mouse button, left click submenu, left click desired option, DONE!?\n\n- blue Crystals - the Ore you need to gather for spawning new npcs is now stuck on stockpiles by default (version 0.3.3). This would be one of the very few added game mechanics in two years that made me happy, if turned off by default OMG. Now you have to manually order your broken Worker AI to carry the blue crystals to the main crystal or deaktivate the option on every stockpile you build... really?\n\n- demolishing - you can't demolish stockpiles, lamps, barrels,... If it does work and i didn't realise how, why doesn't it work the same way it does with stones and wood. By the way, if it works with stones and wood, does it take why more than 2 years to implement this feature?\n\n- zooming - nice to be able to zoom with the mousewheel, but only to a certain and low point. If users complain about that, they are told to use the old method, the caps key and mousewheel, now the can zoom infinite. What every sence restricting the \"mousewheel only zoom\" and having two ways to zoom after all may have. Only one way to zoom, problem fixed.\n\n- Workers - still get stuck in many different tasks. I know theres a new AI and it's not implemented in survival mode yet. Currently (version 0.3.3) the AI is a killjoy.\n\n- Swordsmen - useless as long as not standing in front of a gate. Because Enemys are past over before the realize there existence. Currently (version 0.3.3) the AI is a killjoy.\n\n- Archers - commit suicide by shoting there bows and killed other player npcs, this didn't happen anymore since version 0.3.0 and i played to wave 25. Thats a plus!\n\ni'm ♥♥♥♥ed, somebody else complete the list... Don't buy the game until it's released! Die Entwickler bewegen sich seit zwei Jahren im Kreis, mit einer Effizienz, die sich schön in ihrem Menü wiederspiegelt.", "timestamp_created": 1419509657, "timestamp_updated": 1419509657, "voted_up": false, "votes_up": 159, "votes_funny": 10, "weighted_vote_score": "0.79578012228012085", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "13913343": {"recommendationid": "13913343", "author": {"steamid": "76561198034423880", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 3876, "playtime_last_two_weeks": 0, "playtime_at_review": 3758, "last_played": 1705368493}, "language": "english", "review": "Update: This is one of those games that had a creative premise but due to poor management decisions by the Dev team, never seemed to make it out of an \"early access feel\". For years the game wasn't even playable and finally, when Sauropod had milked all they could from their supporters, they brought the game up to a quasi-playable state and released it as finished. This game is buggy, completely lacks depth, and is not worth your money.\n\nI'm immensely disappointed with this title after being a patiently hopeful early supporter. The marginal progress made by the Devs over the years and the subsequent treatment of their supporters was unacceptable. This project was clearly mis-managed and the Dev team was not skilled enough to salvage a game that could be played without cringing.", "timestamp_created": 1420833937, "timestamp_updated": 1549233087, "voted_up": false, "votes_up": 113, "votes_funny": 3, "weighted_vote_score": "0.79101186990737915", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19502190": {"recommendationid": "19502190", "author": {"steamid": "76561197964081213", "num_games_owned": 186, "num_reviews": 1, "playtime_forever": 35, "playtime_last_two_weeks": 0, "playtime_at_review": 35, "last_played": 1380228138}, "language": "english", "review": "Lost all hope for this a year ago.  Just had another look and all they seem to do is update their marketing, probably to try and sucker more people, especially when it's slightly discounted during the steam sales.\n\nDO NOT GET THIS.\n\nIt is not in a playable state, and won't be for a long time, if ever (most likely never).", "timestamp_created": 1449327104, "timestamp_updated": 1449327104, "voted_up": false, "votes_up": 105, "votes_funny": 2, "weighted_vote_score": "0.790338456630706787", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "132474993": {"recommendationid": "132474993", "author": {"steamid": "76561198019459890", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 3757, "playtime_last_two_weeks": 0, "playtime_at_review": 3618, "last_played": 1704562992}, "language": "english", "review": "Good game but the devs slipped on it. \n\nNo real idea why they were literally on the cusp of something great. They just needed to get rid of the bugs, optimise and add in enemy types or something to shake up game play more. They were so close to finishing it.", "timestamp_created": 1675956341, "timestamp_updated": 1675956341, "voted_up": false, "votes_up": 35, "votes_funny": 0, "weighted_vote_score": "0.789489090442657471", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "111947396": {"recommendationid": "111947396", "author": {"steamid": "76561197996306846", "num_games_owned": 378, "num_reviews": 12, "playtime_forever": 263, "playtime_last_two_weeks": 0, "playtime_at_review": 263, "last_played": 1460000610}, "language": "english", "review": "over promised, under delivered.", "timestamp_created": 1646958550, "timestamp_updated": 1646958550, "voted_up": false, "votes_up": 65, "votes_funny": 2, "weighted_vote_score": "0.787299156188964844", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "14679731": {"recommendationid": "14679731", "author": {"steamid": "76561198011325887", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 788, "playtime_last_two_weeks": 0, "playtime_at_review": 701, "last_played": 1465444919}, "language": "english", "review": "**** DO NOT BUY, DEVELOPMENT IS SO SLOW THAT IS GOING BACKWARDS ****\n\nI've bought this game beginning of 2014, since then i was already seeing of a lot of people saying the development was extremely slow, i waited for one entire year, and here is what  i've got:\n\nNew Textures = New textures, oh my god, now the game is more beautiful but still buggy.\nNew Shaders = Another huge gigantic interstellar bullshit to make game look more 'cute'.\nNew Animations = Makes a couple of animations, games is almost the same shit.\nNew AI System = True, new AI System with new bugs and not polished, fantastic job!\nNew Skybox = Sauropod receives complaints about game being buggy, makes a new skybox, LOL.\nHDR Lighting = Another visual bullshit\nBigger Islands Up to one square KM = Game has issues with saving and bugs over the mechanics. makes the islands bigger! \n\nOverall:\n\nIn one entire year, i saw 10% gameplay development and 90% visual, 1 year ago visuals and animations was pretty good, nobody would complain about the graphics, and instead of working on the mechanics and focusing on what is really important, throws new graphics in a new update, Sauropod, you are a joke.\n\n0/10.", "timestamp_created": 1425065213, "timestamp_updated": 1425065213, "voted_up": false, "votes_up": 131, "votes_funny": 18, "weighted_vote_score": "0.786981582641601563", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "42408802": {"recommendationid": "42408802", "author": {"steamid": "76561198091966927", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 2759, "playtime_last_two_weeks": 0, "playtime_at_review": 4095, "last_played": 1527785476}, "language": "english", "review": "No castle, no story. \n\nThe game shows tons of cool castles that you can build, but the fundamentals of the game discourage it- your best bet for survival is a wall 3-4 blocks this and 3-4 blocks tall. You can't put down blue prints while paused, so if you want to play around with design, you have to work against the clock and waves of enemies. Unit management is clunky. I bought it in 2013, and yet the game still has performance issues in 2018. The updates to the game in that amount of time are good, but something more along the lines of what I would expect in 1-2 years time, not 5. \n\nIt's an excellent idea for a game, but it seems like it skipped planning out the game and just jumped into coding, resulting in them having to rework things over and over.", "timestamp_created": 1527786527, "timestamp_updated": 1527786527, "voted_up": false, "votes_up": 62, "votes_funny": 1, "weighted_vote_score": "0.786171615123748779", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "93684474": {"recommendationid": "93684474", "author": {"steamid": "76561198080710707", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 1440, "playtime_last_two_weeks": 0, "playtime_at_review": 1334, "last_played": 1689787965}, "language": "english", "review": "It was good, and it was going good. Note this was a kickstarter back in 2012, a passion project. However updates dried up last year and that passion is gone. The game functions, its got a sandbox and a pretty basic wave defense mode along with multiplayer, mind you that you'll have to find a friend to play with given player numbers/community.\n\nAll i hope for is that the source code leaks and someone with the same passion as they did before finishes what they started.", "timestamp_created": 1623594091, "timestamp_updated": 1623594091, "voted_up": false, "votes_up": 58, "votes_funny": 0, "weighted_vote_score": "0.784280955791473389", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "19169928": {"recommendationid": "19169928", "author": {"steamid": "76561198031622864", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 1687, "playtime_last_two_weeks": 0, "playtime_at_review": 1586, "last_played": 1544864625}, "language": "english", "review": "Serioulsy bought this like 2 years ago, still the same game.", "timestamp_created": 1448000649, "timestamp_updated": 1448000649, "voted_up": false, "votes_up": 78, "votes_funny": 14, "weighted_vote_score": "0.783571302890777588", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "117557953": {"recommendationid": "117557953", "author": {"steamid": "76561198990265735", "num_games_owned": 72, "num_reviews": 5, "playtime_forever": 4189, "playtime_last_two_weeks": 0, "playtime_at_review": 4139, "last_played": 1656197130}, "language": "english", "review": "Hope this saves someone their money, I was too late to be saved. It hurts to say this as this had to be such an amazing game idea, and in practice it wasn't bad. However, Sauropod died due to focusing so hard on Mirador, causing themselves to go bankrupt prior to it's release. They never fully finished Castle story either, which hurts to say as while it's in 1.0 some game killers exist. For example, if a bricktron decides he wants to pick up a log just before it falls into the void and gets close enough to pick it up, the game will freeze at it tries deleting an object that no longer exists. IF Sauropod manage to come back they could make it fun, but that dosent change just how bugged and not worth $25.00 it is.", "timestamp_created": 1656132897, "timestamp_updated": 1656132897, "voted_up": false, "votes_up": 37, "votes_funny": 0, "weighted_vote_score": "0.78324812650680542", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "8640202": {"recommendationid": "8640202", "author": {"steamid": "76561198058329656", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 252, "playtime_last_two_weeks": 0, "playtime_at_review": 240, "last_played": 1403829668}, "language": "english", "review": "When it was Pre-Alpha, there were bugs, when it became alpha, they didnt fix them, when it became beta, they added content like they kept doing and doing, without fixing the bugs. What are the bugs? A pack of workers will eventually stop working and saturate at the point it can only walk around and stare... Basically sumtimes you can't play, or it just stops working all of a sudden or you end up with eiter 1 or two workers that didnt glitch, whom are still working while the other 3 or 4 are idle forever. That makes it hard as hell, impossible long to build things and pretty boring.\n\nIf only the producers wouldve fix the bugs instead of adding content...", "timestamp_created": 1389316989, "timestamp_updated": 1389316989, "voted_up": false, "votes_up": 255, "votes_funny": 0, "weighted_vote_score": "0.783206820487976074", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "18826520": {"recommendationid": "18826520", "author": {"steamid": "76561197992569334", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 2409, "playtime_last_two_weeks": 0, "playtime_at_review": 891, "last_played": 1505602225}, "language": "english", "review": "I was an original Kickstarter backer from about 3-years ago.  I was very disappointed in the development of new content prior to steam and for the past year I hadn't paid much attention to Castle Story until I happen to notice that 0.5 was released and appears to incorporate some new content.  I figured it had probably been a year or more since I last checked in so I'd give it another go.\n\nUpon booting up the game, I noticed there were some new maps which made me think perhaps maybe they had finally gotten their act together and started producing content.\n\nI started off chopping down some trees so I had a place to stockpile resources.  I had remembered from a year ago when I last played that they came up with a horrible horrible user interface.  News flash, it's still there and it's my opinion that they somehow managed to make it even more complicated.  I simply, without a doubt, absolutely hate the interface they've come up with.\n\nAfter creating a few dozen zones to allow my minions to place resources, I decided to start doing some mining to collect rock/stone as well.  I sent off four of the five minion to work on the side of a hill while my remaining unit cleaned up the rest of the trees and made some barrels for later.\n\nAbout 10 minutes later, all my miners went stupid and were just standing there.  I moved them away from the hill, then assigned them to mining the hill again, which they happily did until 5 minutes later when they went stupid and forgot what they were supposed to be doing again.\n\nI instructed the minion away from the hill again, lets them regroup and sent them back to mining the hill again.  After 5 minutes, brain dead again.  Apparently the game still has some very serious pathing issues that have yet to be resolved.\n\nRight click, delete local content.\n\nI guess I’ll check back in a few years when 0.6 comes out.", "timestamp_created": 1446417074, "timestamp_updated": 1446417304, "voted_up": false, "votes_up": 89, "votes_funny": 9, "weighted_vote_score": "0.783071935176849365", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "50461467": {"recommendationid": "50461467", "author": {"steamid": "76561198072147518", "num_games_owned": 401, "num_reviews": 6, "playtime_forever": 65036, "playtime_last_two_weeks": 0, "playtime_at_review": 60857, "last_played": 1711050540}, "language": "english", "review": "I have been playing this game since it came to Early Access on Steam (Sep. 2013) and been involved into the community since then as well. I mainly play Singleplayer Invasion, Sandbox and Conquest from time to time. (no Multiplayer due to Internet trouble)\n\nI do recommend this game but only if you:\nmeet at least the recommended requirements. (in this case the more RAM the better)\nplay in 1080p (no UI scaling, there is a workaround)\nYou speak English, French or German (my own translation)(don't know how complete/good other translations are)\nget it on sale (seems to be on every steam sale for 40% to 50% off)(the full price was worth it for me though)\n\nBuilding structures in Sandbox is fun you have different shaped bricks and wood but it's a bit challenging at the same time due to the basic physics. You can spend a few hours or hundred of hours on a single Build depending on size and complexity.\n\nInvasion is all about boxing yourself in and trying to survive as long as possible against the waves of enemies. You have to build a castle or walls, get your military kits ready and gather resources all at the same time\n\nConquest is a bit like Invasion but your end goal is to defeat all the Corruptrons (Enemies) and neutralize all Crystals before they overwhelm you\n\nYour goal in Grab the Gems (Multiplayer only) is to bring Gems that spawn in waves on random predefined spots back to your Homecrystal before the others. You will fight against each other to get to the Gems first and escort it back or trying to stop your enemy to bring it home. Whoever has X amount of Gems first wins\n\n\nPros:\nThere is not other game like this, there are sure aspects like this in other games but none that has all combined.\nThe graphics are cute.\nThere is a world editor.\nWorkshop support for Maps, translations and Blueprints\nBasic tutorial (only in Sandbox)\nmodding is possible to a certain degree (mainly lua editing) this includes increasing population cap, editing difficulties, and more.\nThe community and devs are nice and helpful if you have questions or problems\nWeekly dev stream (might change since moved to new game)\n\n\nCons:\nThe development has stopped\nThe game still has some small performance issues\nThe Multiplayer Player base is really small (better play with friends or start looking for someone a few hours ahead)\ngame has no official UI scaling. (affects you if you play above or below 1080p, there is a workaround though)\nThe loading times can be quite long (i have 1 - 2 minutes with a 4 core @ 2,9 GHz)\nlow fps (don't expect 60+ fps but you still can play the game with 20 fps nicely)\nPopulation limit of 15 (can simply be increased by editing a file)\nA lot of people seem to have issues with Multiplayer but from my experience it's not the games fault (firewall blocking game, or Windows being funky if you have Hamachi or something like that enabled, playing with unstable internet, not meeting the minimum requirements.)\nhave to use virtuell network, VPN or connect directly with ip adress if your are from Russia (this isn't the devs fault but if you are from Russia and want to play Multiplayer you should know that before you buy)\n\nIf you have questions feel free to ask in the comments i will update the review accordingly", "timestamp_created": 1556920886, "timestamp_updated": 1561916691, "voted_up": true, "votes_up": 50, "votes_funny": 1, "weighted_vote_score": "0.782688319683074951", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "14370244": {"recommendationid": "14370244", "author": {"steamid": "76561198041434337", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 2564, "playtime_last_two_weeks": 0, "playtime_at_review": 1959, "last_played": 1612559024}, "language": "english", "review": "I really wanted to believe in this game because of its cool concept, but let me tell you what has been going on in other indie games during the year that i owned this:\n\nKerbal Space Program went through enough updates to go into Beta.\nPrison Architect (smaller development team than Sauropod) had 10 major additions and 2 bug hunts.\nDay Z (and in not a big fan of it) added cars along with a plethora of survival features and bugs.\nSubnautica was released and has added two different vehicles and is ready to add two more zones.\nand those are just the ones i own.\n\nIn a 12 month period Castle story has basically had one A.I. update and released their new \"big map\". Even with these updates the game is still bugged to the point of being unenjoyable I hope something happens but as it stands, this game is dead in the water and your money is better spent on another title.", "timestamp_created": 1423322349, "timestamp_updated": 1425439686, "voted_up": false, "votes_up": 81, "votes_funny": 2, "weighted_vote_score": "0.782195985317230225", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "34429940": {"recommendationid": "34429940", "author": {"steamid": "76561198013516866", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1452, "playtime_last_two_weeks": 0, "playtime_at_review": 1111, "last_played": 1537747865}, "language": "english", "review": "Thanks for scrolling this far down, as I'm sure this review will be pretty far down. \n\nSo, why do I like this game? Well, maybe its beucase I backed it on kickstarter 4-5 years ago, and have worn the shirts I've gotten from that ever since. Maybe its because I'm dumb, or just want to justify this game's cost to myself. Or finally, maybe its because my standards for games is so low I played Jimmy Neutron Boy Genius (2002) for hours on end this week and had a blast.     \n\nI can't tell you, why. It has no tutorial, (other than online), no campaign to ramp up difficulty, and no story. \n\nWhat it does have is an idea. And a set of gameplay mechanics that work.\n\nI am constantly worrying about preping for the next attack. And wondering how I can prep and build for it. After a while I learned that I needed to learn to invest in my castle, not my soldiers, as I didnt get enough of them fast enough, and failed becuase I didnt know how to do that.\n\nAnd how I could better build it occupied my whole day. \n\nJust saying, if you like Stronghold, Dwarf Fortress, Tower Defense, Prison Architect, or Space Colony, (but maybe are sick of those games) I bet you'd like this. Then again, im just a random kid", "timestamp_created": 1503463138, "timestamp_updated": 1503463138, "voted_up": true, "votes_up": 46, "votes_funny": 6, "weighted_vote_score": "0.781378984451293945", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "38213267": {"recommendationid": "38213267", "author": {"steamid": "76561198126455902", "num_games_owned": 377, "num_reviews": 10, "playtime_forever": 2724, "playtime_last_two_weeks": 0, "playtime_at_review": 1447, "last_played": 1593995732}, "language": "english", "review": "I first noticed the game back in 2012. Back then it had very few functions. After coming back to look up news in 2016 I was very dissapointed, the lack of any big updates through that big amount of time was just saddening.\n\nNot so long ago I reminded myself about this games existance, looked up new tab and oh my god... so many updates being rolled out one after another it's just amazing, the game I loved just for its looks now grows in complexity making it slightly harder (comparing to what we had before) but better experience for sure.\n\nI suggest anyone who's reading it to buy the game, up to you if you want to wait for a discount or not for me it's worth the money I once spent for it. Plenty of fun to have in singleplayer and even more if you manage to get friends to play with!", "timestamp_created": 1512920144, "timestamp_updated": 1512920144, "voted_up": true, "votes_up": 61, "votes_funny": 3, "weighted_vote_score": "0.780250430107116699", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "69072636": {"recommendationid": "69072636", "author": {"steamid": "76561197993994127", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 1819, "playtime_last_two_weeks": 0, "playtime_at_review": 1819, "last_played": 1589385792}, "language": "english", "review": "I have been following this game since before it was released. I think it is an amazing idea and I love the thought of building castles brick by brick. Unfortunately, the execution is just not there.\n\nI find myself playing the game for about 10 hours and getting really frustrated by the character AI – rage quitting and uninstalling the game. A few months later I install it again with the hope that some improvements have been made, simply to end up uninstalling the game again in frustration.\n\nIt really is a shame as I think this game could be great – but I simply cannot recommend it in good conscience.", "timestamp_created": 1589386347, "timestamp_updated": 1589386347, "voted_up": false, "votes_up": 61, "votes_funny": 4, "weighted_vote_score": "0.776876270771026611", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "144035809": {"recommendationid": "144035809", "author": {"steamid": "76561198085860229", "num_games_owned": 78, "num_reviews": 14, "playtime_forever": 3255, "playtime_last_two_weeks": 0, "playtime_at_review": 3222, "last_played": 1697898358}, "language": "english", "review": "Fun little game, sadly abandened. It's got slight optimisation issues, but the building can be fun, however if you want to buy the game watch a video or two about it to see if it's good for you.", "timestamp_created": 1691877088, "timestamp_updated": 1691877088, "voted_up": true, "votes_up": 37, "votes_funny": 0, "weighted_vote_score": "0.776192605495452881", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "46119281": {"recommendationid": "46119281", "author": {"steamid": "76561198008231823", "num_games_owned": 883, "num_reviews": 3, "playtime_forever": 582, "playtime_last_two_weeks": 0, "playtime_at_review": 508, "last_played": 1602328843}, "language": "english", "review": "I bought this game back during it's early Alpha stage and it was god awful, was a total waste of money then. However, the developers have been really working hard to improve this game. In my opinion the game now is leagues better than what it was when i purchased it. The gameplay of the game has improved and has become a sandbox game where you build your own castle mixed with a base defense game and I've come to find it pretty fun now. The best thing about this game though isn't the gameplay but how dedicated the developers are to improve this game and make is actually playable like this. However, while I would recommend this game I would definitely get it on a sale for now until the improve this game even more.\n\nEdit: it looks like this game is still continuing to improve and the devs keep working on making this a much better game.", "timestamp_created": 1542851985, "timestamp_updated": 1574876456, "voted_up": true, "votes_up": 36, "votes_funny": 0, "weighted_vote_score": "0.77614206075668335", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "93191602": {"recommendationid": "93191602", "author": {"steamid": "76561198308942971", "num_games_owned": 126, "num_reviews": 7, "playtime_forever": 12324, "playtime_last_two_weeks": 0, "playtime_at_review": 12312, "last_played": 1674589018}, "language": "english", "review": "this game was supposed to be the best game out there.\nbut after many unfinished promises and the recent state of the game (no updates)\ni have to say it is really disappointing, i had a dream that this could be my favorite game,\nand it was for 2 months and with time passing and no updates coming out i really think this was a waste of money.\nand the promises they made at kickstarter never came to the game, that's pretty disappointing for a game that got alot and i mean ALOT on kickstarter\n", "timestamp_created": 1622840592, "timestamp_updated": 1622840592, "voted_up": false, "votes_up": 80, "votes_funny": 3, "weighted_vote_score": "0.775877475738525391", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "119241011": {"recommendationid": "119241011", "author": {"steamid": "76561198045307258", "num_games_owned": 162, "num_reviews": 51, "playtime_forever": 187, "playtime_last_two_weeks": 0, "playtime_at_review": 187, "last_played": 1677817550}, "language": "english", "review": "Its such a shame this game didnt get more updated and was never able to get the love and attention it deserved. It was immensely fun and creative. I would even invest $$ in this if they ever came back to it. I want it to succeed", "timestamp_created": 1658467085, "timestamp_updated": 1658467085, "voted_up": true, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.773582160472869873", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "131126453": {"recommendationid": "131126453", "author": {"steamid": "76561198798897616", "num_games_owned": 46, "num_reviews": 18, "playtime_forever": 2180, "playtime_last_two_weeks": 0, "playtime_at_review": 2180, "last_played": 1619490060}, "language": "english", "review": "very promising game that i could see go big with tons of potential...\nit got abandoned 3 years ago and is filled with terrible bugs and issues do not recommend", "timestamp_created": 1674104221, "timestamp_updated": 1674104231, "voted_up": false, "votes_up": 54, "votes_funny": 0, "weighted_vote_score": "0.772632837295532227", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "34561249": {"recommendationid": "34561249", "author": {"steamid": "76561197977166940", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 5864, "playtime_last_two_weeks": 0, "playtime_at_review": 4931, "last_played": 1540847450}, "language": "english", "review": "I must say, i REALLY want to click that thumbs up button, but my conscience just wont allow me to do it. I find the direction this game took to be absolutely fantastic, with the ability to just setup a conquest game and potentially play it for hours on end by just holding out in my little corner, and ending the fight with a big push when i got bored of defending.\n\nThe ability to just create my own \"warehouses\" and other crafting related buildings, by building the way i want to is just a delight to me. In a way i think its what made minecraft once appeal to me. Of course its a bit different in this, it being an RTS and all.\n\nThe problems i have stems from the fact that the AI is utterly broken at times, this gets even worse when playing multiplayer, assuming you find a way trough the obstacles (Of which there are a few) for playing coop with your friends. This is especially true for loading coop savegames, which is not only un-intuitive, but requires extra effort to make sure it stays coop instead of turning into a versus match on load.\n\nWhen it comes to the AI: These problems can be minor, with some minions not finding a stockpile right next to them, causing them to drop their cargo around your crystal (Spawning area/HQ) which is easily worked around by placing a cleanup task in a radius around it. To the bigger problems where the AI just outright gives up and freezes, making your minions ignore any and all orders you give them, and just sit there doing nothing.\n\nQuite frankly, while i can understand the devs getting anxious to finally put this title out of early access after 5 years of development, it was a crucial mistake. One i hope they can recover from by providing immediate and effective hotfixes to the game (Apart from the hotfixes deployed thus far). It's a game that both is something refreshingly new, yet simplistic and relaxing to play.\n\nI will be monitoring this game closely in the near future, and hope i can turn this thumbs down into a recommendation. Because if im being quite honest, despite all its bugs which will no doubt frustrate me into alt-f4'ing the game in a few hours, just writing about this game makes me want to play it again right now.\n\nPlease Sauropod Studios, strap in properly and bring this game across the proper finishline. The game deserves it.", "timestamp_created": 1503951346, "timestamp_updated": 1503951401, "voted_up": false, "votes_up": 48, "votes_funny": 0, "weighted_vote_score": "0.771349966526031494", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "20062565": {"recommendationid": "20062565", "author": {"steamid": "76561198013653048", "num_games_owned": 3793, "num_reviews": 89, "playtime_forever": 350, "playtime_last_two_weeks": 0, "playtime_at_review": 229, "last_played": 1513371477}, "language": "english", "review": "I backed this game on Kickstarter in 2012, and now at the cusp of 2016 it's still in a state of not being a playable game. They haven't stopped working on it, which is amazing, but they also have not made any progress. I see this game on my friends' wishlists and all I can think is: please do not buy this game. If it ever leaves Early Access, I will install it and try it and change this review, but it is not finished or close to finished or even any closer to finished than it was 2 years ago (or 4).\n\nDO NOT BUY", "timestamp_created": 1451383093, "timestamp_updated": 1451383093, "voted_up": false, "votes_up": 115, "votes_funny": 4, "weighted_vote_score": "0.770351409912109375", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "18195491": {"recommendationid": "18195491", "author": {"steamid": "76561198073236550", "num_games_owned": 0, "num_reviews": 70, "playtime_forever": 91, "playtime_last_two_weeks": 0, "playtime_at_review": 45, "last_played": 1577598805}, "language": "english", "review": "This game has been out for 2 years. The tutorial isn't even finished.", "timestamp_created": 1443236634, "timestamp_updated": 1443236634, "voted_up": false, "votes_up": 149, "votes_funny": 29, "weighted_vote_score": "0.764913737773895264", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "99119284": {"recommendationid": "99119284", "author": {"steamid": "76561198066982642", "num_games_owned": 336, "num_reviews": 25, "playtime_forever": 5859, "playtime_last_two_weeks": 0, "playtime_at_review": 5807, "last_played": 1687294562}, "language": "english", "review": "Abandoned game", "timestamp_created": 1631301948, "timestamp_updated": 1631301948, "voted_up": false, "votes_up": 53, "votes_funny": 2, "weighted_vote_score": "0.764842569828033447", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "34821208": {"recommendationid": "34821208", "author": {"steamid": "76561197995944474", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 48729, "playtime_last_two_weeks": 0, "playtime_at_review": 3457, "last_played": 1656790308}, "language": "english", "review": "So after sinking over 60 hours into this game and enjoying the hell out of it, I'm forced to give it a thumbs down. Honestly, this game could be amazing- but AI optimization issues are bogging down all long-term games. This game is apparently not designed to be able to function past a few hours of building, which is an absolute tragedy. One of the things that's made games like Minecraft so amazing is the ability to keep building for hours and hours and hours- huge maps and custom designs that take days, weeks, even months to complete. Unfortunately, because of how Castle Story is coded, any map with NPCs is destined to begin experiencing massive lag spikes after only a few hours and an absolutely abysmal framerate a few hours after that. It doesn't matter what hardware you're using either- my rig is near top-of-the-line and I cannot escape these issues. \n\nSauropod needs to address this core issue before anything else if this game is going to remain playable. New units, new play modes, improved graphics- none of it means anything if the game will not run properly. I want to play this game and I would pay again to be able to play a fixed version of it, but I won't play a minute more until these problems are fixed.", "timestamp_created": 1504897883, "timestamp_updated": 1504897883, "voted_up": false, "votes_up": 56, "votes_funny": 2, "weighted_vote_score": "0.764299213886260986", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "12417487": {"recommendationid": "12417487", "author": {"steamid": "76561198009006590", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 122, "playtime_last_two_weeks": 0, "playtime_at_review": 122, "last_played": 1394236930}, "language": "english", "review": "No real progress has been made on this game since I purchased it over a year ago.", "timestamp_created": 1412813380, "timestamp_updated": 1412813380, "voted_up": false, "votes_up": 110, "votes_funny": 0, "weighted_vote_score": "0.764226377010345459", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "128761130": {"recommendationid": "128761130", "author": {"steamid": "76561197964262021", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 676, "playtime_last_two_weeks": 0, "playtime_at_review": 676, "last_played": 1605328030}, "language": "english", "review": "this game suffers from lag death very soon after you start a scenario. \nThis game is no longer updated, \nSad  outcome for a good idea", "timestamp_created": 1671323057, "timestamp_updated": 1671323057, "voted_up": false, "votes_up": 30, "votes_funny": 2, "weighted_vote_score": "0.763819873332977295", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "16160882": {"recommendationid": "16160882", "author": {"steamid": "76561198049687875", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 35, "playtime_last_two_weeks": 0, "playtime_at_review": 4, "last_played": 1600275532}, "language": "english", "review": "[h1]Waste of Money at this Time\nI have purchased this game nearly one year ago with great hopes of this being a fun sandbox style game. I watched the preview and thought WOW! This is going to be a fun old style collect and build fashioned games. I was quickly hit by the lack of development over the year. There are texture bugs, the AI seems basic, building glitches, and many more. Reporting a bug in this game does nothing because the \"updates\" the developers release are more like patches. There has been no progression of the games development over the year I have owned the game and I am feeling a bit scammed at this point. [b][u]DO NOT PURCHASE. Please save yourselves from this waste.[b][u] The game has potential but the devs don't produce. If you are even considering getting this game WAIT; add it to your wish-list and see if it [b][u] ever leaves early access. [b][u] At this point this has been such a waste of money as well as a disappointment.", "timestamp_created": 1433353593, "timestamp_updated": 1433353668, "voted_up": false, "votes_up": 108, "votes_funny": 5, "weighted_vote_score": "0.763802468776702881", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "38385963": {"recommendationid": "38385963", "author": {"steamid": "76561197972358399", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 230, "playtime_last_two_weeks": 0, "playtime_at_review": 230, "last_played": 1513542124}, "language": "english", "review": "I backed the Kickstarter years ago, and for a long time considered that to be a mistake.  The developers released the game way too early, in my opinion.  It was more of a tech demo for a long time.  Recent updates, however, have made it into an interesting actual game.\n\nYou have to mine multiple resources and build a castle.  There are multiple combat roles (knight, halberdier, archer, arbolist, alchemist/bomber, and wizardy healer thing), so there can actually be a bit of depth to unit placement and such.  There are also pylons that you need to use to heal your units, light the map at night, and capture additional \"crystals\" that are used to generate units, both friendly and not.  Like many other games, there are occasional enemies during the day, and lots at night.\n\nThere are multiple modes:\nCreative - a peaceful building mode (you still have to mine resources and manage your Bricktrons, so it's not the same as the Minecraft mode)\nInvasion - a wave-based horde-like mode\nConquest - spread across the map by capturing crystals.\n\nThere are still definitely places to improve.  Some of the pathfinding and AI for your Bricktrons can be a bit wonky or slow.  Multiple Bricktrons occasionally try to do the same thing, and after it's done, the other units just kind of stand there for a bit while they try to figure out what to do.  Sometimes the rules can be a bit unclear when it comes to what building blocks can be placed where (especially with the wooden platforms).  The developers seem to be quite active and communicate clearly, though, so I'm fairly optimistic.\n\nI would recommend watching some recent gameplay to make sure you know what you're getting into, but it's definitely a game on the up-and-up.", "timestamp_created": 1513543203, "timestamp_updated": 1513543203, "voted_up": true, "votes_up": 32, "votes_funny": 2, "weighted_vote_score": "0.762042343616485596", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "15184679": {"recommendationid": "15184679", "author": {"steamid": "76561198044728844", "num_games_owned": 0, "num_reviews": 129, "playtime_forever": 1210, "playtime_last_two_weeks": 0, "playtime_at_review": 1210, "last_played": 1421533133}, "language": "english", "review": "Don't do it! If you want to waste $20 on something worthwhile go buy banished or heck even get stonehearth or Don't Starve. It's been almost 3 years since this game came out! They surpass the time it took dota 2 to come out of beta. There is no hope that they plan on finishing this and can be reassuringly be declared a dead game. Like by time they finish it half-life 3 will have came out already. That's really slow if valve time is faster than an indie game development... And when i say valve time is faster I mean the developers are extremely slow ,incompetent and aren't willing to communicate with the community go on and read the other reviews it's the same thing over and over but if you want to know about the game besides the opinion review up there go to the next paragraph. \n\nSo what they have done in the past 3 years: the AI can barely function correctly, they let out an update once in a blue moon and usually it is the most unhelpful thing, They rarely actually fix anything besides make the problem worse, it has so much potential but with staff like this the game will probably never finish and it probably won't go the correct direction. If you want more reasons:\n-multiplayer doesn't work\n-the maps themselves suck and only 1 type of map is a survival map\n-the other maps are buggy\n-the AI stop for long periods of time or just stop completely\n-the staff don't really solve any problems in the game\n-literally it has been 2 years and nothing has really changed besides adding a pillar...\n-the maps you can play and build are floating islands and your resources drop down there 50% of the time \n-after xx waves the energy you are supposed to get randomly goes off into the bottom of the map and you never get the energy from them \n-the developers probably stopped working on this game to pursue something else so it seems to give off the signal of an abandoned game. \n\nI can go on and on about it so buy this game at your own risk, I am not saying it won't ever get better but if they keep on going this way then it will be safe to say the developers just want your money for half-ass work and will probably drag it out as long as they can. You have been warned", "timestamp_created": 1428065646, "timestamp_updated": 1428066260, "voted_up": false, "votes_up": 49, "votes_funny": 0, "weighted_vote_score": "0.758596837520599365", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "14450018": {"recommendationid": "14450018", "author": {"steamid": "76561198097732811", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 756, "playtime_last_two_weeks": 0, "playtime_at_review": 744, "last_played": 1430006002}, "language": "english", "review": "IF YOU ARE READING THIS, DO NOT BUY CASTLE STORY!!!\n\nYou guys (the devs) got $700,000 from a kickstarter in August of 2012 and mentioned twice in its description that you quit your jobs to work full time on Castle Story. What have you all been doing the past two and a half years? Not only should you not be charging $20 for an incomplete game that is more than fully funded, but you should be actually working on improving the game that you're charging $20 for. Maybe if it was one of those $2 or $3 games, I might recommend it. Your kickstarter says that FOUR PEOPLE paid over $2,000 to see this game leave the ground. Where has it gone? It's great that you've come out with 2 updates last month, but let's see some real bug fixes and some new content. I just wish I had that great of an idea to steal a million dollars and get away with it.\n\nHere's their kickstarter page if you don't believe that they made over $700,000 on this \"project\":\nhttps://www.kickstarter.com/projects/902505202/castle-story", "timestamp_created": 1423849998, "timestamp_updated": 1423849998, "voted_up": false, "votes_up": 93, "votes_funny": 2, "weighted_vote_score": "0.758562326431274414", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "112621689": {"recommendationid": "112621689", "author": {"steamid": "76561198016831571", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 109, "playtime_last_two_weeks": 0, "playtime_at_review": 109, "last_played": 1491374070}, "language": "english", "review": "Don't believe my 1.8 hours, because that's for steam only. I picked Castle Story up on Desura almost 10 years ago, back when it was early-early-early access. Back then, the devs were active and the game had potential. Ten years later, this game has hardly changed and definitely hasn't lived up to the lofty promises of the developers. \n\nI never thought I'd see this game again but it's on sale now. I am writing this review to tell you that it is a shallow, unfinished prototype of a game and you should not buy it. Not even for 1/4 of the price.", "timestamp_created": 1647911461, "timestamp_updated": 1647911461, "voted_up": false, "votes_up": 34, "votes_funny": 0, "weighted_vote_score": "0.758514285087585449", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "41048254": {"recommendationid": "41048254", "author": {"steamid": "76561198201996639", "num_games_owned": 216, "num_reviews": 14, "playtime_forever": 479, "playtime_last_two_weeks": 0, "playtime_at_review": 479, "last_played": 1509461083}, "language": "english", "review": "===[Audience]===\n\n[ ] Kids\n[x] Everyone\n[x] Casual players\n[ ] Pro players\n\n===[Graphics]===\n\n[ ] Potato\n[ ] Really bad\n[ ] Bad \n[ ] Ok \n[ ] Good \n[x] Beautiful\n[ ] Masterpiece\n\n===[Price/quality]===\n\n[x] Full price\n[x] Wait for sale\n[ ] Average\n[ ] Refund it if you can\n[ ] Don't do it\n\n===[Requirments]===\n\n[ ] 90' PC\n[ ] Minimum\n[x] Medium \n[x] Fast\n[ ] High end \n[ ] NASA computer\n\n===[Difficult]===\n[ ] You just need 2 arms \n[ ] Ez\n[ ] Normal\n[x] Easy to learn / Hard to master \n[ ] Hard (first few hours)\n[ ] Dark Souls\n\n===[Game time/length]===\n\n[ ] Really short ( 0 - 2 hours)\n[ ] Short ( 2 - 8 hours)\n[ ] Few hours ( 8 - 12 hours)\n[ ] Long ( 12+ hours)\n[x] Endless\n\n===[Story] ===\n\n[x] It doesn't have\n[x] Still better than Minecraft\n[ ] Average\n[ ] Good\n[ ] Fantastic\n\n===[Bugs]===\n\n[ ] Game itself is one big BUG\n[ ] Bugs destroying the game\n[ ] Lot of bugs\n[x] Few Bugs\n[ ] You can use them for speedrun\n[ ] Nothing\n\n===[Others]===\nMultiplayer: Yes\nSingleplayer: Yes", "timestamp_created": 1522000337, "timestamp_updated": 1522000337, "voted_up": true, "votes_up": 129, "votes_funny": 21, "weighted_vote_score": "0.757128894329071045", "comment_count": 10, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "29391997": {"recommendationid": "29391997", "author": {"steamid": "76561197967321139", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 236, "playtime_last_two_weeks": 0, "playtime_at_review": 219, "last_played": 1484984113}, "language": "english", "review": "Pledged money to this game about 5 years ago and it still has yet to be released. It's barely playable now after all this time.", "timestamp_created": 1484984167, "timestamp_updated": 1484984167, "voted_up": false, "votes_up": 44, "votes_funny": 0, "weighted_vote_score": "0.755565941333770752", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "9779422": {"recommendationid": "9779422", "author": {"steamid": "76561198075441370", "num_games_owned": 0, "num_reviews": 76, "playtime_forever": 693, "playtime_last_two_weeks": 0, "playtime_at_review": 617, "last_played": 1438120823}, "language": "english", "review": "Months, Years...without an update. May be worth the wait, but so far it was a big disapointment. Developers don't care much about anyone's opinion, don't reply to e-mails on their website, I recommend keeping away. I was banned from the community forums for saying my opinion about their game in a polite manner. In years of steam, talking and meeting many developers over time, this is the first time I was treated this way. To me, its a game being developed by teenagers or adults on drugs. I regret so much for supporting this dead game. I don't recommend anyone to buy it. They report personal problems, financial problems, staff problems, all sort of excuses. And nothing is done. But they do go on vacation and are always working...\nSteam should remove this game as its more of a scam than a product.", "timestamp_created": 1397144585, "timestamp_updated": 1417605015, "voted_up": false, "votes_up": 194, "votes_funny": 0, "weighted_vote_score": "0.754997909069061279", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44472605": {"recommendationid": "44472605", "author": {"steamid": "76561198009326596", "num_games_owned": 542, "num_reviews": 7, "playtime_forever": 5502, "playtime_last_two_weeks": 0, "playtime_at_review": 3271, "last_played": 1574520376}, "language": "english", "review": "This game went the same way that many early access went after they sold too well. I followed it since the beginning and I've tried again and again to play it, but it's just broken and they pushed for release in this broken state. The AI is useless, the camera control is atrocious, just like the stockpiling.\nDon't get me wrong, I absolutely love the concept, I'm always on the look for games like this, the style is cute and the optics are really pleasing, especially the lighting at night, but nice graphics don't make up for broken mechanics.\nAnd there's already such a huge amount of shovelware in this particular genre, it's just sad. It's a thing that people want to make, but they always get in over their heads and end up with way too much money way too early, because everyone and their mother wants games like these and buys them too early and too expensive\n\nDev Cycle of this game: \"The controls and camera are clunky and unintuitive, let's make a new interface!\" \"The AI is broken and useless, let's make a new interface!\" \"The players get lag spikes every few seconds even on fast computers, let's make a new interface!\" \"Look, I know all these things are still broken, but at least the interface looks nice now\" (spoiler alert, it doesn't)\n\nSeriously, Bricktrons overproduce and leave stuff on the ground when there's not enough storage. Three bricktrons take out three wood each for a job that only needs one, then drop the surplus on the ground and fill up the storage with new wood instead of putting it back. Also Stockpiles start off accepting everything and you have to immediately set them to empty or the bricktrons will fill them up with shit and destroy all of your stockpiling systems\nThe camera can't move freely, it's bound to a vertical rotation axis, a height and a distance parameter and the controls are completely unintuitive and annoying.\nThe enemies are neither thoughtfull nor original, just a pain in the ass (especially if they decide to tunnel up to your elevated base, instead of taking the walk around the map like they're supposed to)\nBuilding works pretty well with the exception that you can't build architecturally soundly, because there's basically only 1x1 and 1x2 building blocks.\nThe fact that your initial spawn is randomized and you can't chose it, breaks the defense and conquest modes even more\n\nThis game started out with promise and a huge budget and ended up as an overprized, broken and unforgiving tower defense game", "timestamp_created": 1535659128, "timestamp_updated": 1535659128, "voted_up": false, "votes_up": 40, "votes_funny": 0, "weighted_vote_score": "0.751588642597198486", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "106371375": {"recommendationid": "106371375", "author": {"steamid": "76561198012243861", "num_games_owned": 211, "num_reviews": 3, "playtime_forever": 2705, "playtime_last_two_weeks": 0, "playtime_at_review": 2705, "last_played": 1640281526}, "language": "english", "review": "Followed the kickstarter and development for quite some time and was excited for the game. Never purchased in early access because I've been burned before and reviews were never that great. Been really itching for a decent castle builder lately so I checked back on this title. Reviews seemed to have improved and it was on sale so I went ahead and picked it up. \n\nThere is a lot here to like, but there are just too many gameplay affecting issues for me to recommend it. AI pathing and task selection are the worst of it; good enough to be passable most of the time, but ultimately quite obviously unpolished. Often performance isn't great and it appears to be poorly optimized. There are some missing quality of life features in my opinion such as being able to issue build orders and tasks while paused or the ability to enable autosaves. The final straw for me was the crashes; in about 40 hours of play I've crashed to desktop probably 3 separate times, which doesn't necessarily make it unplayable, but is pretty inexcusable for a fully released title. In fact my most recent crash, combined with the lack of an autosave, caused me to lose 3 or 4 hours of gameplay, and is the main reason why I decided to write this review and am uninstalling.\n\nI have seen the developers responses to issues since release, and their general attitude seems to be that they've released a feature complete game and no further work will be done on it, any issues are the users' to deal with. In my opinion the game in its current \"released\" state is akin to a beta release candidate that they shipped without final bug fixing and polishing. At 40+ hours in the game already I would really love to keep playing as I do enjoy the core gameplay, but it just isn't worth the frustration from the issues and lost play time. If you can get it at a steep discount it might be worth checking out, but honestly I can't recommend it otherwise.", "timestamp_created": 1640284028, "timestamp_updated": 1640284028, "voted_up": false, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.751389145851135254", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "145834449": {"recommendationid": "145834449", "author": {"steamid": "76561197973041950", "num_games_owned": 164, "num_reviews": 9, "playtime_forever": 4258, "playtime_last_two_weeks": 0, "playtime_at_review": 3582, "last_played": 1711545230}, "language": "english", "review": "minecraft minions-with-autism simulator\n\n[b]OVERALL: 7/10[/b]", "timestamp_created": 1694066300, "timestamp_updated": 1707364139, "voted_up": true, "votes_up": 40, "votes_funny": 19, "weighted_vote_score": "0.749898314476013184", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "84317823": {"recommendationid": "84317823", "author": {"steamid": "76561198079869991", "num_games_owned": 207, "num_reviews": 14, "playtime_forever": 1895, "playtime_last_two_weeks": 0, "playtime_at_review": 1895, "last_played": 1609897021}, "language": "english", "review": "I would only buy if you are interested in building cool looking castles in a sandbox environment.\n\nSummary: Overall is a fun game, but does have its share of problems. It is more of a sandbox building game than a strategy game, as the strategy part is mediocre. Like lego it is kind of dependent on the player using their imagination to make the game fun rather than being inherently fun itself. \n\nPros:\nYou build castles brick by brick, you can make very creative and cool looking castles.\nThe soundtrack is excellent.\nHas a unique visual style, and excellent attention to little details (bricks \"plop\" when placed in a stockpile, each weapon is visible in a weapon rack etc).\nPhysics are really cool, and watching castles crumble is very fun.\n\nCons:\nThe building part of the game and the strategy part of the game do not mix well together. Taking extra time to build a cool looking castle simply isn't possible in conquest or invasion mode, especially because you can't build while paused! This means that there is very little reason to build anything other than a 2 brick high wall and a shooting platform.\n\nFor performance reasons, there is a 15 bricktron cap (the cap can be bypassed in sandbox mode with the debug menu).\n\nAlthough the physics is cool, a collapsed tower can cause the game to start lagging pretty badly (even with the recommended system specs).\n\nSandbox tools are kind of limited. For example it would be nice to delete bricktrons or corruptrons, rebuild an exploded landscape, or cleanup a crumbled castle wall without having to wait for the bricktrons to do it.\n\nAI pathfinding is bad, and bricktrons/workers can't do tasks efficiently.\nExample: 2 bricktrons will try to build the same object, with both collecting the resources to do so, walking to the construction site, only for 1 of them to build it and the other to walk all the way back and drop off their unused resources.\nFor a strategy game, watching your AI workers waste time doing stupid things can be frustrating.\n\nConclusion:\nAlthough games can be both a building and strategy game (like Rimworld), Castle Story's building does not fit with the strategy portion of the game. As a building sandbox game, it is quite fun (however is dependent on the player to use their imagination to have fun, kind of like lego). As a strategy game, it is mediocre because you are constantly battling the bad AI of your workers, and the main theme of the game (building castles) rarely ever applies, as a 2 brick high wall is about as effective as an elaborate castle with towers and fancy battlements.\n\nI would only buy if you are interested in building cool looking castles in a sandbox environment.", "timestamp_created": 1610142979, "timestamp_updated": 1610142979, "voted_up": true, "votes_up": 22, "votes_funny": 2, "weighted_vote_score": "0.74911576509475708", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "91769826": {"recommendationid": "91769826", "author": {"steamid": "76561197995259788", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 42, "playtime_last_two_weeks": 0, "playtime_at_review": 42, "last_played": 1445628788}, "language": "english", "review": "Don't support this studio, you aren't missing out by not buying this game. Even at 99% off it isn't a good deal. This company released their initial footage and showed a game of promise and potential. All of the footage they showed was just an animation, not a game. They then took 2 years after a successful kickstarter campaign to blow all of their KS money and realize they needed to produce a game. That hobbled together last minute rushed pile of shit? Castle Story. This studio is a sham, they just took advantage of the initial hype from their KS. FRANÇOIS ALAIN, GERMAIN COUET, and BENOÎT ALAIN shouldn't be allowed back in the games industry for the bullshit they pulled. Luckily Sauropod is collapsing and Covid just expedited it. \n\nAs for the game, damn near everything you see isn't actually in the game. It's a glitchy unplayable mess.", "timestamp_created": 1620658753, "timestamp_updated": 1620658753, "voted_up": false, "votes_up": 39, "votes_funny": 1, "weighted_vote_score": "0.747841477394104004", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "139507870": {"recommendationid": "139507870", "author": {"steamid": "76561197993814641", "num_games_owned": 793, "num_reviews": 29, "playtime_forever": 10, "playtime_last_two_weeks": 0, "playtime_at_review": 10, "last_played": 1384441885}, "language": "english", "review": "Moral of the story? Don't kick start video games. Wait until they are released and out of early access. Way, way to many games now-a-days make campaign promises and delivery a steaming pile.", "timestamp_created": 1685834482, "timestamp_updated": 1685834482, "voted_up": false, "votes_up": 43, "votes_funny": 0, "weighted_vote_score": "0.74667733907699585", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "15958320": {"recommendationid": "15958320", "author": {"steamid": "76561198040491340", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1050, "playtime_last_two_weeks": 0, "playtime_at_review": 320, "last_played": 1534560870}, "language": "english", "review": "I could not be more disappointed in this game. I bought this game through the kickstarter almost 3 years ago today. I can say that what I saw then impressed me, thinking that they would eventually add amazing things, which it desparately needed. Seriously this game had sooooo much potential and unfortunately the makers are just out to make a quick buck. They haven't even changed anything, even though they keep putting up videos trying to show people that they did change things. I can say without any hesitation that their game is exactly the same as when I first bought it 3 years ago. Tons of bugs, Mindnumbingly slow gameplay, and very boring lame bad guys. their newest video shows how much has actually changed NOTHING! Not since their very first video on Kickstarter.", "timestamp_created": 1432342527, "timestamp_updated": 1432342527, "voted_up": false, "votes_up": 66, "votes_funny": 2, "weighted_vote_score": "0.746243059635162354", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "50532333": {"recommendationid": "50532333", "author": {"steamid": "76561197997707471", "num_games_owned": 0, "num_reviews": 54, "playtime_forever": 348, "playtime_last_two_weeks": 0, "playtime_at_review": 348, "last_played": 1557259548}, "language": "english", "review": "bought it on early access. it is a pretty fun game. Thing is...is it 25 bucks of fun? Not really. As some of the other reviews have stated your unit count is capped at 15. This makes for a very tedious game as you try to take on a whole map with only 15 dudes. With that said if you already own it give it a try. If not Don't buy it.", "timestamp_created": 1557259981, "timestamp_updated": 1557259981, "voted_up": false, "votes_up": 43, "votes_funny": 0, "weighted_vote_score": "0.745717346668243408", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "86686881": {"recommendationid": "86686881", "author": {"steamid": "76561198026801404", "num_games_owned": 0, "num_reviews": 53, "playtime_forever": 1910, "playtime_last_two_weeks": 0, "playtime_at_review": 1910, "last_played": 1613366989}, "language": "english", "review": "Came back to this game after about 5 years and it feels a lot worse. The game is way more watered down, you can now only have 15 guys maximum, where you used to be able to get 100+. This was apparently done because the devs couldn't be asked to get the AI pathfinding to run more smoothly. If you want to play a game like this, go for Colony Survival, Rise to Ruins, Timber and Stone, Dwarf Fortress, etc.", "timestamp_created": 1613367719, "timestamp_updated": 1613367719, "voted_up": false, "votes_up": 33, "votes_funny": 0, "weighted_vote_score": "0.744355440139770508", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "34370090": {"recommendationid": "34370090", "author": {"steamid": "76561197972347068", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 3533, "playtime_last_two_weeks": 0, "playtime_at_review": 2072, "last_played": 1574335326}, "language": "english", "review": "TIPS TO ENJOY THIS GAME\n===================\nCastle Story is not perfect in its current 1.0 release, but there is a great game in there and perhaps these tips will give you a chance to enjoy the game within the two hour refund period ;)\n\n\n1 ) There is in game help explaining all the basics, click on the '?' icon in upper right corner (and press 'P' to pause game while you read it).\n\n2) Use the hotkey shortcuts (F1 - F5 keys), just using the 'F1' build key will save you several mouse clicks in the slightly fidely UI. Look in 'Options - Keybindings' for all the shortcuts and keys.\n\n3) First thing you should do is chop down some trees, build one or two chopping blocks and a bunch of stockpiles (always have a few empty stockpiles so your cute yellow guys don't stop working).\n\n4) If a task is not being worked on or completed, check you have the resources required and at least one empty stockpile if needed to store an 'item'. You can check what resources are required by holding RMB on the 'factory' (workbench, altar etc) and hovering mouse over the item to be (or is being unsuccesfully) crafted.\n\n5) Following on from point 4 above, it is possible to set stockpiles to only recieve a specific item by holding RMB on the stockpile. Although over using this does more harm than good in my opinion, I do find it helpfull to do this for certain items on stockpiles placed close to the 'factory'. This helps you easily see if you have the required resources.\n\n6) You can enable mouse edge scrolling in options, when playing fullscreen I had to enable 'allow mouse off sceeen' (or something) first.  Also, use ctrl-click to remove unwanted/misplaced block blueprints and there is a delete (trash bin) icon bottom right to remove selected task (it's easy to miss but super important sometimes).\n\n7) And now the 'biggy' - the game starts to 'lag' (pauses/freezes), which can get quite bad - a few seconds freeze every 30 seconds later in a game!. In version 1.0 I have not been able to stop this completly, but it is possible to reduce it to infrequent short pauses. The issue is caused by the AI pathfinding on an ever changing 3D voxel landscape, so if you reduce the number of things pathfinding it helps. Use more soldiers and don't have too many builders/gatherers or leave some unspawned bricktrons in your home crystal and only spawn them (hold RMB on home crystal) to replace lost bricktrons (or set a bricktron to 'Do Nothing' - select him then HOLD RMB on him). Also, saving and then reloading the game every few hours can help.\n\nSo, would I buy this game (I was an early backer). I would probably not buy it at current price or until the 'lag' issue is resolved. However, I am still giving it a thumbs up as despite the issues, am loving playing it ;)\n\nEDIT - If your bricktrons get stuck while mining, you can manualy tell said bricktron (or one of his yellow friends) to dig voxels by selcting bricktron then hold RMB on voxel to be dug and make a way out. If his bag gets full, select bricktron then hold RMB on him and select 'Drop Load'. I dont find this happens too often and the AI does a generaly good job of building stairs etc as they go, but occasionaly the rather simpleton bricktrons will be gazing up at the sky instead of concentrating on what there doing.\n\nNote that the HOLD RMB radial menu options are dependant on the currently selected object (LMB click). So for example, if you have a soldier selected and hold RMB on a factory, you will get options to attack it etc - so you may need to LMB on the factory or empty terrain first if you want to manufacture something. Once you grasp this, the UI does start to make more sense ;)", "timestamp_created": 1503224356, "timestamp_updated": 1503273069, "voted_up": true, "votes_up": 28, "votes_funny": 1, "weighted_vote_score": "0.744345605373382568", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "127777042": {"recommendationid": "127777042", "author": {"steamid": "76561198336535132", "num_games_owned": 55, "num_reviews": 29, "playtime_forever": 473, "playtime_last_two_weeks": 0, "playtime_at_review": 306, "last_played": 1670056824}, "language": "english", "review": "Nice game, the only sad thing is that the devs left this game ;-;", "timestamp_created": 1670002055, "timestamp_updated": 1670002055, "voted_up": true, "votes_up": 27, "votes_funny": 0, "weighted_vote_score": "0.743288040161132813", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "70055654": {"recommendationid": "70055654", "author": {"steamid": "76561198017869942", "num_games_owned": 466, "num_reviews": 55, "playtime_forever": 6370, "playtime_last_two_weeks": 0, "playtime_at_review": 6370, "last_played": 1589284262}, "language": "english", "review": "---{Audio}---\n( ) Eargasm\n( ) Amazing\n( ) Good\n(X) Decent\n( ) Not too bad\n( ) Bad\n( ) Earrape\n\n---{Audience}---\n(X) Everyone\n( ) Kids\n( ) Teens\n( ) Adults\n\n---{Difficulity}---\n( ) Dark souls\n( ) Hard\n(X) Easy to learn / Hard to master\n( ) Easy\n( ) Mindless head banging keyboard to win\n\n---{Grind}---\n( ) Grind is everything you do\n( ) Grindy\n( ) Every MMO ever type of grindy\n(X) Bareable\n( ) Is necessary to progress\n( ) Isnt necessary to progress\n( ) No grind\n\n---{Game Time}---\n( ) Endless\n( ) Addictive\n( ) Long\n(X) Average\n( ) Short\n( ) Long enough for a cup of tea\n\n---{Graphics}---\n( ) Masterpiece\n( ) Beautiful\n( ) Good\n(X) Decent\n( ) OK\n( ) Bad\n( ) Awful\n( ) Made on paint\n\n---{PC Requirements}---\n( ) Ask NASA if they have a spare computer\n( ) High\n(X) Medium\n( ) Low\n( ) Ultra low\n( ) Game boy advance\n\n---{Status}---\n( ) Daytime New York\n( ) Always some people around\n(X) Hard to find people\n( ) Few people still alive\n( ) You are the only person alive\n\n---{Servers}---\n(X) No issues\n( ) Minor lag every few hours\n( ) Can get laggy sometimes\n( ) 1.99$ Servers\n( ) Unplayable\n\n---{Bugs}---\n( ) Never had any\n( ) Minor bugs\n(X) Few bugs\n( ) Can get annoying\n( ) Ruining the game\n( ) The game itself is a big terrarium for bugs\n\n---{Price}---\n( ) Just buy it\n( ) Worth the price\n(X) Wait for sale\n( ) Maybe if u have some spare money left\n( ) Not recommended\n( ) You can have more fun burning that money instead\n( ) Free\n\n---{Worth playing?}---\n(X) Yes\n( ) No", "timestamp_created": 1590860828, "timestamp_updated": 1590860828, "voted_up": true, "votes_up": 93, "votes_funny": 14, "weighted_vote_score": "0.742257058620452881", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "20602459": {"recommendationid": "20602459", "author": {"steamid": "76561198020663662", "num_games_owned": 878, "num_reviews": 51, "playtime_forever": 516, "playtime_last_two_weeks": 0, "playtime_at_review": 516, "last_played": 1497103053}, "language": "english", "review": "EDIT: Update 0.9 still has the UI in a mess. I tried my best to jump back into it and I couldn't even figure out where the delete button was for tasks and I still can't work out how to undo placement. I'm going to say that my review below still stands at present.\n\n---\n\nI saw Castle Story on Kickstarter back in 2012 and wished I could have kick-started it, the concept was new and interesting, the graphics looked fresh and pretty and it looked like a fun game that would go somewhere. Well, 4 years down the line it still looks exactly like it did 4 years ago on that Kickstarter page.\n\nAs far as I see, there is no real 'gameplay' to it other than plan a castle, dig some quarry's or mines and then watch the little yellow dudes AI fail to get it them the build zone or even properly drop resources off.\n\nInstead, you'll spend your game time watching your workers swap resources around with one another rather than building anything. It almost seems like they tried to implement a bucket brigade AI... which would work great if they gave the poor little workers a little more logic so they didn't run the exact same path when on the same task - because they then spend more time swapping resources between themselves and 'finding paths to blueprint' instead of running over there.\n\nThe problems around building make it really hard to even attempt the 'wave survival' game modes - because its takes so long to get a simple wall around it and the damage enemies do (even on easy) wipes out your meagre combat units really quickly (I survived 60 kills ~8 waves before losing but still didn’t even have a simple wall up because the yellow dudes couldn't decide or work out how to get places)\n\nThe final straw for me was putting 6 workers on a large build task. They'd keep stopping at the build site, even though there were plenty of resources and lots of room for movement. They just all kept saying they were going to the same pile of resources which I can only assume meant all 6 of their poor little AI's were clashing and blocking one another... without anyone actually moving!\n\nSome bullet points of what bugged me the most (Version 0.5.1):\n\n- The UI is terrible. Every action in-game relies on a right click and hold - it's not intuitive, it’s not clear and it’s not even explained to you. I had to go find a video tutorial on basic camera movement and building because it was so annoyingly unclear. Actions should speak for themselves and not have to be searched for.\n\n- Speaking of UI, sorting what materials can be placed on a storage pad is ridiculous. If you want to make it specifically wood, it takes 5 right click, hold, and selects to set it so. You need a lot of storage, so multiply that by the number of space you want... it’s just plain silly.\n\n- For a game about building castles its surprising tedious to build anything in (let alone a castle), you need more workers to get things done faster but the more workers you have the slower the build goes because they spend time bumping into one another and sometimes they just decide to have a stop work meeting.\n\n- The game constantly lags and has miniature seizures for a few seconds every few seconds...\n\n- As outlined, the AI is just shoddy. There are a few simple things that would make it miles more efficient... the best being a complete overhaul of their path-finding algorithm and how they interact with one another (not swapping resources every damn time they bump into each other!)\n\n- The game could benefit from a 'speed up time' button... a lot.\n\nOverall: 3/10\n\nJust so much wasted potential.\n\nAvoid at all costs - don't be fooled! There are better games out there!", "timestamp_created": 1453112528, "timestamp_updated": 1497103163, "voted_up": false, "votes_up": 47, "votes_funny": 2, "weighted_vote_score": "0.740019083023071289", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}}, "query_summary": {"num_reviews": 12, "review_score": 5, "review_score_desc": "Mixed", "total_positive": 2532, "total_negative": 2262, "total_reviews": 4794}, "cursors": {"AoIIPwXYH3j12eEE": "Mon Apr 22 23:49:35 2024"}}
