{"reviews": {"159328361": {"recommendationid": "159328361", "author": {"steamid": "76561198016487261", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 407, "playtime_last_two_weeks": 0, "playtime_at_review": 407, "last_played": 1708958947}, "language": "english", "review": "The world-building mechanic is awesome. It's novel and a lot of fun. And locked behind such a ridiculous grind that you never really get to enjoy it.", "timestamp_created": 1708959078, "timestamp_updated": 1708959078, "voted_up": false, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.723083913326263428", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160724053": {"recommendationid": "160724053", "author": {"steamid": "76561197983343793", "num_games_owned": 2035, "num_reviews": 14, "playtime_forever": 253, "playtime_last_two_weeks": 0, "playtime_at_review": 253, "last_played": 1710644857}, "language": "english", "review": "I wanted to love this game...I really did, and I did for the first hour.  After that though it has one of the worst gameplay loops imagineable.  It's basically \"find the hidden quest, slowly grind out needed resources over slow days, turn in the quest, rinse and repeat\".  And quests are insanely easy to miss.  In 3-4 hours of gameplay, I had to lookup 5 different quests.  Some were locked behind unlockable tiles I hadn't noticed (new tiles aren't always at the end of the list).  At least 3 were quest markers that were hidden behind things in the semi-static camera.  I got this in a Humble Bundle...and for the equivalent cost I can say that's ok...but seriously, $25 for this headache is insane.", "timestamp_created": 1710644740, "timestamp_updated": 1710644740, "voted_up": false, "votes_up": 26, "votes_funny": 2, "weighted_vote_score": "0.71949690580368042", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159290874": {"recommendationid": "159290874", "author": {"steamid": "76561198008479711", "num_games_owned": 600, "num_reviews": 29, "playtime_forever": 2162, "playtime_last_two_weeks": 0, "playtime_at_review": 2162, "last_played": 1708907526}, "language": "english", "review": "In a genre filled with games that have almost punishing difficulty and complexity, Above Snakes stands apart as a game you can just chill and relax while playing.   It's short, it is simplistic, but I found it engaging and entertaining as a break from the various other survival and basebuilding games that I have been playing recently.\n\nGiven it's relatively low price, I'd recommend it for anyone who likes the genre and wouldn't mind a relaxing game to play for a few afternoons.", "timestamp_created": 1708907766, "timestamp_updated": 1708907766, "voted_up": true, "votes_up": 13, "votes_funny": 1, "weighted_vote_score": "0.69081568717956543", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161788496": {"recommendationid": "161788496", "author": {"steamid": "76561197978415198", "num_games_owned": 784, "num_reviews": 43, "playtime_forever": 162, "playtime_last_two_weeks": 0, "playtime_at_review": 162, "last_played": 1711787044}, "language": "english", "review": "It is almost good. I felt the parts were there and with further play testing it could have gotten there, but it wasn't there. It was fun for the 3 hours I played, but then I found myself not wanting to play any more. I won't say it was an awful game, but progress got slow already. The survival aspects got in the way of it being fun. Also, why are feather's so rare, like why make it so tedious to get something that is pretty necessary to play the game. and also the animations were slow and boring to keep doing over and over. The worst is the animation for getting berries made a sound that I didn't like, but there was no way to just turn down those types of animation sounds. The only option was muting.", "timestamp_created": 1711787383, "timestamp_updated": 1711787383, "voted_up": false, "votes_up": 14, "votes_funny": 2, "weighted_vote_score": "0.684162735939025879", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161207272": {"recommendationid": "161207272", "author": {"steamid": "76561198068418831", "num_games_owned": 0, "num_reviews": 45, "playtime_forever": 1333, "playtime_last_two_weeks": 0, "playtime_at_review": 1333, "last_played": 1711153132}, "language": "english", "review": "Overall an ok game and I understand only 7.7 % of all players finished the main story. At first it's exciting to get new tiles and unlock new recipes before it becomes a tedious grind with very little progress that feels worth it.\r\n\r\n[b] Bad [/b]: Inventory space is horrible, upgrading your house is uninteresting, special chest rewards are a bad joke, music is repetitive, bounties are boring. \r\n[b] Neutral [/b]: Crafting is ok, farming and fishing is meh, dialogues and the story are ok. [spoiler] The pet wolf is cute but digging up treasure takes way too long to be useful. [/spoiler]\r\n[b] Good [/b]: The concept of setting up your own world is cool, cooking is fun, art style is good, different ways to die that even give achievements. \r\n\r\nStaying sane is overrated anyway.", "timestamp_created": 1711154433, "timestamp_updated": 1711154433, "voted_up": true, "votes_up": 8, "votes_funny": 2, "weighted_vote_score": "0.620626091957092285", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159533641": {"recommendationid": "159533641", "author": {"steamid": "76561197972920706", "num_games_owned": 0, "num_reviews": 41, "playtime_forever": 590, "playtime_last_two_weeks": 0, "playtime_at_review": 590, "last_played": 1709183541}, "language": "english", "review": "The game concept is intriguing, and for the most part I thought the mechanics worked well and the graphics were acceptable. However, I felt that it was a bit of a grind, having to gather and cook food so frequently. At the least, I would have liked to have slowed the pace of the game so that I could have more leisurely explored the world I created, rather than constantly rushing to gather resources and food (and boil water!). \n\nWhat really convinced me to stop playing was that I ran into a hitch where I needed to gather resin in order to progress the game further. And in order to do that I had to harvest birch trees. But to do that, I had to find tin so that I could make an ax to cut them down (tier three ax wasn't good enough...). However, I could not make the terrain to find tin without glass--and that was nowhere to be found (might have accidentally sold the only source of glass early on). Also, could not make a sawmill necessary to making larger wooden beams--I'd sold off the blade for that, too (since I didn't know it was going to be essential later on). \n\nAnyway, while I love survival/open world-type games, I feel in this case that the developer went a bit overboard in making me harvest something, that in reality would not have been an issue, that prevented me from progressing further in the game. I also felt the zombie part of the story line was unnecessary; I would have been content with a simple survival game set in the American West. I mean, dealing with the disparate communities that actually existed then should have been challenge enough.", "timestamp_created": 1709209641, "timestamp_updated": 1709209641, "voted_up": false, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.619902729988098145", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160224156": {"recommendationid": "160224156", "author": {"steamid": "76561198310645381", "num_games_owned": 622, "num_reviews": 33, "playtime_forever": 1679, "playtime_last_two_weeks": 0, "playtime_at_review": 1679, "last_played": 1710030678}, "language": "english", "review": "The game has a gimmick where you build the world you can explore yourself out of tiles, ala Carcassone. You have to (well, don't really have to, but encouraged) to plan what tile you put where, since only certain tiles can border each other, each have different resources on them, and you don't want to put important resources and quest locations too far from your base, otherwise you'll spend a lot of time just hauling stuff  back and forth. And this gimmick works pretty well.\nThe problem is, everything else in the game is just extremely boring. There's not a whole lot to find or craft, and what's there is not very exciting. The combat is very basic, the resources are abundant and constantly respawning, so there's 0 chance of you ever dying. The enemy and quest varity is very poor too, and to compensate for the lack of content the game pads out the playtime with overly slow gathering animations.  \nThere's also a few idiosyncrasies in the mechanics that go against what you would expect based on genre conventions (or just common sense,) eg. scooping water from a lake is way more tiring than mining rocks, the best place to get water is the desert, bronze weapons are better than iron etc. They don't really break the game or anything, but definitely weird design choices.\n\nEdit: one more thing I forgot to mention. The store page says the game supports controllers, but it's not completely true. Most things work fine, but ranged combat doesn't, since you cannot aim with the controller, (right stick only turns the camera by 90 degreesm,) and the automatic target lock is just broken, I kept shooting at trees and rocks more often than the enemies, so I had to switch to keyboard and mouse halfway through.", "timestamp_created": 1710031787, "timestamp_updated": 1710032041, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.619631767272949219", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158134322": {"recommendationid": "158134322", "author": {"steamid": "76561199506506767", "num_games_owned": 0, "num_reviews": 23, "playtime_forever": 351, "playtime_last_two_weeks": 0, "playtime_at_review": 126, "last_played": 1708362665}, "language": "english", "review": "Really engaging survival game with a tile-based area expansion mechanic. My only issue so far is that this game is unexpectedly a performance hog (its probably my setup, but I can run Darktide on High settings with no issues, but multiple crashes on this one). That said, it's worth playing through the bugs for what's on offer here.", "timestamp_created": 1707713959, "timestamp_updated": 1707713959, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.610906422138214111", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161530446": {"recommendationid": "161530446", "author": {"steamid": "76561197962252671", "num_games_owned": 1091, "num_reviews": 12, "playtime_forever": 2484, "playtime_last_two_weeks": 0, "playtime_at_review": 2484, "last_played": 1711478120}, "language": "english", "review": "A fun little survival adventure game.\n\nMy favorite part was the cooking system. I wish more survival games used cooking systems like this. Instead of having to click a recipe and check if you have the ingredients, you just pour up to three ingredients into the pot and mix them together to make a meal. If you mix together special ingredients you get a special or better meal, and you discover cooking recipes by experimenting.\n\nCombat wasn't that interesting. Only reason to ever use melee weapons was if you ran out of ammo for your ranged weapons, which you will do all the time since there is no way to mass produce ammo without a lot of grinding.\n\nThe building system was fun enough. There wasn't much reach to expand it to any major degree once I had lumber.\n\nThere were a few times during the game where I had to lookup where to get the item I needed for quest or crafting recipe.\n\nMy main issue with the game was the grinding for resources. And most of all the final grind for the last two achievements.\n\nThe controls are clearly designed for a controller or console, which makes it annoying to use on PC. There were some bugs and minor issues too, but they didn't stop me from playing.\n\nNot sure I would say it is worth the price, but if it is on sale or in a bundle it can be a fun game for a few days.", "timestamp_created": 1711480757, "timestamp_updated": 1711480977, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.585724532604217529", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "162971765": {"recommendationid": "162971765", "author": {"steamid": "76561198047457900", "num_games_owned": 387, "num_reviews": 7, "playtime_forever": 754, "playtime_last_two_weeks": 754, "playtime_at_review": 754, "last_played": 1713251441}, "language": "english", "review": "I was enjoying this game, but then encountered a bug that requires frequent reloading of the game, which saps all the fun. After some point in the main story line, and for unknown reasons, when placing a new tile (a major mechanic of this game) you cannot access the new title without first reloading the game. \n\nThis has been reported on the developer's Discord server (their stated preferred method for reporting bugs) by at least three other people, the earliest report I saw was dated 10/19/2023 (6 months ago). I added my own example to the pile. \n\nDO NOT play this game unless you enjoy being forced to reload the game every few minutes.", "timestamp_created": 1713251973, "timestamp_updated": 1713252013, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.566314816474914551", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160627203": {"recommendationid": "160627203", "author": {"steamid": "76561198330872668", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 75, "playtime_last_two_weeks": 0, "playtime_at_review": 75, "last_played": 1710550855}, "language": "english", "review": "This game is entirely carried by it's cool premise, which is the creation of the tile based survival world. On one hand, that is a very unique mechanic that this game has that makes it stand out. Unfortunately everything surrounding that mechanic is derivative and uninteresting. Combat is boring and unrewarding, exploring is (honestly a bit hampered by the tile system) mundane, and the survival elements are more obtrusive than they are engaging. The crafting and progression is extremely standard and bare bones. If this game didn't have the tile/cartography system it would be completely banal.\n\nIt's a shame, I hope this idea gets picked up and used by a more ambitious game.", "timestamp_created": 1710551065, "timestamp_updated": 1710551065, "voted_up": false, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.563853442668914795", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161305697": {"recommendationid": "161305697", "author": {"steamid": "76561198032128103", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 1461, "playtime_last_two_weeks": 0, "playtime_at_review": 1461, "last_played": 1709870319}, "language": "english", "review": "Pretty fun for the first dozen hours, but it becomes very grindy toward the end and really needs some automation aspects to keep it from getting tedious.", "timestamp_created": 1711239720, "timestamp_updated": 1711239720, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.559475481510162354", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159278299": {"recommendationid": "159278299", "author": {"steamid": "76561198185784355", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 893, "playtime_last_two_weeks": 0, "playtime_at_review": 805, "last_played": 1708946363}, "language": "english", "review": "I'm really liking it so far, about 65% through the story. The world tile system is really interesting, though sometimes it gets annoying with the restrictions on which pieces are allowed to be next to which other pieces. There are definitely some biome transitions missing. The survival elements are fine. I don't have anything bad to say about them, though they're nothing particularly exciting, either. I enjoy that it always feels like you are progressing with gear, there are no points where it feels like I'm stuck and have to grind a ton. I can usually just forage the resources I need on my adventures and be fine, which I appreciate. The story is engaging enough that it didn't turn me off despite the fact that I really, really don't like zombie apocalypse kinds of stories. \n\nI would really like more biomes, more diverse creatures, slightly improved building, more cooking recipes. Seeing as the game seems to be actively receiving updates, there is hope that those things will happen. \n\nOne thing I'm really missing is mod support. It would allow for the community to breathe a lot of life into the game. \n\nOverall, the game is not perfect, but it's solid and worth the price tag for sure.", "timestamp_created": 1708894481, "timestamp_updated": 1708894481, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.55753481388092041", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "162196246": {"recommendationid": "162196246", "author": {"steamid": "76561198044114273", "num_games_owned": 0, "num_reviews": 69, "playtime_forever": 369, "playtime_last_two_weeks": 0, "playtime_at_review": 197, "last_played": 1712387367}, "language": "english", "review": "This relaxing western-themed take on survivalcraft grind feels a little \"lost in the woods,\" but is generally pleasant enough to play for at least a few hours. If anything, Above Snakes tries to include too many genre tropes for its own good, and buckles under the weight of it all. \"Less is more,\" as they say. \n\nThe building and crafting features on display here have been standard fare since Minecraft, so take that as you will. The standout cartography mechanic allows you to build your world map tile-by-tile, but the novelty fades quickly as even simple edits require specific harvested and crafted resources. The biome-specific tiles are also extremely picky when it comes to arranging and placing them, so an accidental click can be costly. There is no \"undo\" button.\n\nThe usual hunger, thirst, and stamina bars are joined by a sanity meter--which seems excessive for the simple premise. Player stats and abilities do improve with use and upgrades, so it's entirely possible that these tiresome aspects become less of an annoyance as you progress. However, the few hours that I have spent with this game left me with mixed feelings on continuing my journey.\n\nGiven my short time with the game, I can only recommend it if you're a dedicated survival crafting fan and you try before you buy. Considering this title was part of a recent Humble Bundle that I picked up, I can't really regret its purchase. Others should probably play the free demo before making a decision. (Above Snakes: Prologue)\n\n**The UI and control scheme are awkward at best without a gamepad. (My DS4 works fine--glyphs included.)", "timestamp_created": 1712247494, "timestamp_updated": 1712250899, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.543560326099395752", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "162764035": {"recommendationid": "162764035", "author": {"steamid": "76561198078912443", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 1015, "playtime_last_two_weeks": 1015, "playtime_at_review": 280, "last_played": 1713520954}, "language": "english", "review": "Nice progression and the map tile system is pretty great. Still wishing there were more biome connections.", "timestamp_created": 1712976473, "timestamp_updated": 1712976473, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.53271031379699707", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "162293054": {"recommendationid": "162293054", "author": {"steamid": "76561198118738555", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 1147, "playtime_last_two_weeks": 0, "playtime_at_review": 1147, "last_played": 1712354294}, "language": "english", "review": "I really liked the concept of creating the world as you progress. \r\nIt felt a bit anti-climatic at the end, but maybe that`s just me...\r\nI`d recommend this game, regardless of that", "timestamp_created": 1712356502, "timestamp_updated": 1712356502, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.531024515628814697", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "163164480": {"recommendationid": "163164480", "author": {"steamid": "76561198001536645", "num_games_owned": 0, "num_reviews": 52, "playtime_forever": 822, "playtime_last_two_weeks": 719, "playtime_at_review": 674, "last_played": 1713706575}, "language": "english", "review": "Fun game, really no regret of purchasing it.\nThere are new features adding along the story-line. Enough to keep it interesting.\nThe World Building Tiles mechanism is fun and innovating. It add a puzzle level to the game.\n\nI'm not sure about the replay value. But for a story-line run, I add my vote.", "timestamp_created": 1713532501, "timestamp_updated": 1713532501, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.529147982597351074", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158400715": {"recommendationid": "158400715", "author": {"steamid": "76561198028402213", "num_games_owned": 611, "num_reviews": 64, "playtime_forever": 4133, "playtime_last_two_weeks": 0, "playtime_at_review": 4133, "last_played": 1708095389}, "language": "english", "review": "I really enjoy the game, but am regularly frustrated by some of the issues.\n\nOften times the game starts without ever going to the title screen, and shows the character in a sitting position surrounded by water. No house. No nature. Just water. I can't move. I can't close the game normally. I can't access any of them menus. \n\nThe last update caused me major problems until I uninstalled and reinstalled. Now it still causes problems, but they're far fewer. \n\nThe game is great. I recommend it in spite of it's flaws. The flaws are annoying, but at present they seem simple enough to remedy. It's still a headache, and involved some stress to figure out how to circumvent these issues... But the game is fun when it works.", "timestamp_created": 1708031153, "timestamp_updated": 1709067505, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.526627242565155029", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1708169722, "developer_response": "Hi, I am very sorry to read that, especially since you almost invested 70 hours of your time. I would very much like to assist you in fixing your game or save file. If your save file doesn't load anymore, I would encourage you to send it to \"tobi@squareglade.games\" and I will fix it for you. A button to locate the save files on your device can be found in-game in the save game selection.\n\nIf your game doesn't start up as a whole, that sounds like something went wrong when installing it. You can try to reinstall (you probably did that already) or try to run it on another Proton version on your steam deck. You can select another version by clicking on the game and then \"Manage\"."}, "160899156": {"recommendationid": "160899156", "author": {"steamid": "76561197993892506", "num_games_owned": 0, "num_reviews": 108, "playtime_forever": 32, "playtime_last_two_weeks": 0, "playtime_at_review": 32, "last_played": 1710832090}, "language": "english", "review": "The control scheme is bad enough I requested a refund, the character movement feels chunky and slow, the writing is straight-up terrible, and the whole thing is pieced together like it came out of a 2008 Facebook game. It looks great in its preview videos but this is a big yikes from me.", "timestamp_created": 1710832727, "timestamp_updated": 1710832727, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.52621692419052124", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "163044655": {"recommendationid": "163044655", "author": {"steamid": "76561199545241781", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 515, "playtime_last_two_weeks": 515, "playtime_at_review": 515, "last_played": 1713352699}, "language": "english", "review": "Above Snakes is a Wild West inspired world builder with light survival elements. It had so much potential but sadly the more I played, the more the repetition began rearing its ugly head.\r\n\r\nThe thing that sets this apart from other games (and probably the best thing about it) is that you build the world yourself. You start off with just a couple of tiles and you slowly have to unlock and fill out the world with different world pieces, featuring many diverse biomes. It has a very slight puzzle element to it as well because only pieces of the same biome are allowed to be placed together. So for example you might have a tile that has half forest and half lake and you have to think about their placement in order to make it cohesive. It's not hard though once you get the hang of it.\r\n\r\nThe only problem is that the more tiles you add, the more tedious it is to traverse the map and even the sprinting speed is slow. Needing just a couple of items from the other end of the world every time gets old really fast.\r\n\r\n-------\r\n\r\nVisually the game looks okay, simple, but nice enough. It features a top-down isometric view. You can zoom in and out but sometimes the camera only being able to move in four directions really hinders visibility, I found this especially prevalent when hunting animals thankfully it's easy enough to do, so I couldn't get too mad at it.\r\n\r\nThe UI felt clunky at times. Instead of just having a toolbar you had to press a button whilst in it to set it as your current tool. I'm not sure why this extra step was added. Adding tiles doesn't feel great either once your world gets bigger as the game couldn't seem to keep up with my movements, leading to me closing and entering the placing menu several times. \r\n\r\nThere is a story here (meteorites fell and turned people into zombies) and it had the potential to be interesting but the characters are as dry as the desert setting and only really exist to hand out quests. It feels like the story was slapped on only to give you more things to fight other than the wildlife, and doesn't fit with the overall tone the game is going for. It could have even lost its Western theme and it would come away being the exact same game.\r\n\r\nWhen you're not filling out the map, you are gathering items to craft new things. There are several different workbenches, each capable of producing unique items. If you've played any sort of life sim or survival game before you'll know exactly what to expect; tools, a campfire, a furnace, and so on.\r\n\r\nThe flora and fauna in biomes do replenish after you've exhausted them once some time has passed, but some things are rarer than others so it can be frustrating if you are after one specific thing and you are forced to wait in real time for it to be accessible again. This wasn't really an issue until the mid-game though, and with basic things like wood, stone, and berries will come back faster than you can harvest them.\r\n\r\nYou have to juggle hunger, thirst, and fatigue but\r\nthese mechanics don't really add anything to the game, as food and water are plentiful and it's easy to recover energy by the campfire or by sleeping in bed.\r\n\r\nYou also have to craft and manage your armor since different biomes will have varying climates that will damage you over time if you aren't prepared for them.\r\n\r\nI will say The building of structures and objects feels really intuitive, even on a controller. You can easily move things once you've built them, and even quickly swap parts of your house with their higher-quality counterparts once you have access to them. \r\n\r\nMany objects can be placed inside your house that serve no purpose other than to look pretty, so the creative types might get something more out of this than I did, I just built my bed inside and was done with it.\r\n\r\nThere were a few quality-of-life things in the game that I have to give credit for.\r\n\r\nYou can craft multiple things at a time and all you have to do is hold down a button for a few moments, there is no arbitrary wait time, something that is prevalent in this sort of game so it was a refreshing change. Fishing works in the same way and I was relieved not to have to play another fishing minigame... though the lakes dry up quickly and you have to wait before you can fish again.\r\n\r\nI quite liked how generous the inventory space was and it can be bolstered with additional storage chests too, but it took a while before my backpack was full, and there are quite a few items in the game.\r\n\r\nCooking is also simple and easy to do, you can only add three ingredients at a time, and if you are about to unlock a recipe combination it notifies you, making it easy to figure out what makes a cohesive dish.\r\n\r\nThere are quests but every single one feels tedious and just feels like a means to an end that ultimately leads to you either being able to access new tiles or being able to traverse your existing ones safely. The characters that give them out lack personality and I'm honestly baffled why they made NPCs at all as they could have easily been delivered via a menu. Having to traipse back to them every time to let them know you've finished them was frustrating due to the slow-moving speed that I moaned about earlier.\r\n\r\nThe combat in the game is really poor. All animations are slow, but it's much more noticeable when fighting. You have a dodge roll and you awkwardly have to hit things until they are dead. It feels sluggish and unsatisfying. There are long-range weapons as well but I couldn't for the life of me get them to fire where I wanted them to so I ended up ungracefully hitting things with my axe, often taking unnecessary damage in the process.\r\n\r\nSpeaking of damage, if you do die the game isn't all that punishing and you will only lose a few of the items you had on you at the time. But for me, it was always my rarer stuff...Why are feathers so hard to come by in this game!? I could find loads if I just left my house for a few minutes and I live in a crappy town, not a gosh darn forest! ahem anyway.... That's not my only bugbear, some things just don't make sense in the game such as gathering water from lakes costing significantly more stamina than felling trees for example, I have no idea how they came to that conclusion.\r\n\r\nOverall the game does a great job of hooking you during the first few hours, but sadly it couldn't keep up the momentum. Once your map gets more bloated and you realize you are just going through the motions of gathering things and completing fetch quests to unlock the next tile to do it all over again ad nauseam.\r\n\r\nIt's such a shame because the game had so much potential, but as you play more the poor design choices and general clunk will begin to add up, and you will question if you are even having fun anymore or if you just want to see it through to the end for completion's sake. Transparently, I never made it to the end and threw in the towel at around 10 hours. Maybe someone a lot more forgiving and less well-versed in this sort of relaxing game genre will find more to love than I could, but I can't personally recommend it.", "timestamp_created": 1713361426, "timestamp_updated": 1713361426, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525125622749328613", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "163223828": {"recommendationid": "163223828", "author": {"steamid": "76561198201626171", "num_games_owned": 277, "num_reviews": 24, "playtime_forever": 1053, "playtime_last_two_weeks": 1053, "playtime_at_review": 1053, "last_played": 1713443117}, "language": "english", "review": "I enjoyed every moment of this game. The story, the concept of tile world expansion, the combat, bounty hunting, base building, resource gathering, I loved it all. However, I can also see why some people didn't like this game.\n\nIt's very grindy. You have to constantly grind and gather materials in order to progress in the story. They don't really tell you how to get most of the items either. I got stuck multiple times and had to look up how to get the items so I could keep progressing. Some things are just a pain to get. I spent probably a few hours shaking trees for feathers to make arrows. 80% of the time you would just get worthless branches.\n\nInventory management can be a pain too. When I first started I thought the backpack space was very generous, but items only stack up to 30 before they start taking up another slot. In the late game this began to become an issue. I would constantly have to fast travel back and forth to my base to drop off items.\n\nI also encountered a handful of bugs/glitches as well which required reloading the game. About 50% of the time the game would stop responding and crash when I attempted to go back to the main menu.\n\nMy main gripe with this game is the cost. The price of this game seems a bit high for what you are getting. Once you finish the story and upgrade your house and all your tools/weapons, there really isn't anything left to do. It took me 17.6 hours to finish everything in the game, including all achievements. I wish they would add more content to the game so there was more to do once the quests are completed.", "timestamp_created": 1713605205, "timestamp_updated": 1713605205, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "163167887": {"recommendationid": "163167887", "author": {"steamid": "76561198083672751", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 1440, "playtime_last_two_weeks": 1440, "playtime_at_review": 1440, "last_played": 1713535038}, "language": "english", "review": "Not great, not horrible. If you enjoy an easy going, vanilla, casual, survival/crafting experience, you'll have a blast. Otherwise, you'll get bored with repetitive quests and motions. \r\n\r\nThe game is sometimes clunky and crafting and farming doesn't feel very satisfying. For example, you craft an ice pick so you can fish in frozen lakes to get a new type of fish. But you still get the SAME common fish you can find in any lake, even though the NPC that gives you the recipe for the ice pick tells you otherwise.\r\n\r\nA lot of stuff just clutters your inventory without real purpose. Food is OP, it can fix any ailment, but it's boring to craft and farm. BTW why do farms that require 1 plant to sow, give 2 plants when fully grown, instead of 4-5 as the graphic depicts? \r\n\r\nArmor and weapons are scarce, you'll use an axe and perhaps a bow. And don't get me started on farming feathers for arrows. 1 tree gives you maybe 1 feather after getting your 200th branch which you don't need in the process. Why don't chickens drop feathers??? Why are there no birds to hunt for feathers?!?!?!\r\n\r\nNothing feels inpactful, the best thing is fast travel and for that you need to have carrots to bribe the horse. *facepalm*\r\n\r\nIMO Force of Nature 2 was leagues Above Snakes (pun intended).\r\n", "timestamp_created": 1713536115, "timestamp_updated": 1713536115, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "163111012": {"recommendationid": "163111012", "author": {"steamid": "76561198274967610", "num_games_owned": 0, "num_reviews": 31, "playtime_forever": 282, "playtime_last_two_weeks": 282, "playtime_at_review": 282, "last_played": 1713456775}, "language": "english", "review": "This game just gets boring fast. It's not worth buying at full price imo if you want to try it. It is very repetitive and kinda a grind fest. The pay off for the work is also not really anything to write home about. All in all it's a fairly mindless game that I guess is good if you need something to veg out to. But otherwise don't expect anything much from it.", "timestamp_created": 1713456887, "timestamp_updated": 1713456887, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "163090799": {"recommendationid": "163090799", "author": {"steamid": "76561197965284710", "num_games_owned": 811, "num_reviews": 407, "playtime_forever": 153, "playtime_last_two_weeks": 153, "playtime_at_review": 153, "last_played": 1713430439}, "language": "english", "review": "Grindy.", "timestamp_created": 1713430524, "timestamp_updated": 1713430524, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161137693": {"recommendationid": "161137693", "author": {"steamid": "76561198003452277", "num_games_owned": 0, "num_reviews": 485, "playtime_forever": 627, "playtime_last_two_weeks": 0, "playtime_at_review": 627, "last_played": 1711099434}, "language": "english", "review": "Best thing about the game is it tile based world building mechanic everything else is a bad game begins on a high note, but the longer you play the more game gets boring its never evolves or change gameplay becomes a stale craft 4 item to unlock new tile and after that craft new 4 items to unlock new tile....", "timestamp_created": 1711100372, "timestamp_updated": 1711100372, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.521276593208312988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "157360660": {"recommendationid": "157360660", "author": {"steamid": "76561198002931285", "num_games_owned": 0, "num_reviews": 55, "playtime_forever": 173, "playtime_last_two_weeks": 0, "playtime_at_review": 173, "last_played": 1689447952}, "language": "english", "review": "Fun game, how does it drain the Steam Deck battery so fast?   Needs to be able to throw snakes.", "timestamp_created": 1706821151, "timestamp_updated": 1706821151, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.501888811588287354", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139935979": {"recommendationid": "139935979", "author": {"steamid": "76561197967453611", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 1515, "playtime_last_two_weeks": 0, "playtime_at_review": 1515, "last_played": 1686562948}, "language": "english", "review": "Above Snakes starts out [i]really[/i] strong, with the exploring, crafting, and unlocking new tiles progression feeling extremely satisfying. The early quests also got me invested into the story, although I agree with another reviewer who said that locking tile progression behind the story quests clashes with the idea of it being a world-building exploration game. It's really more of an action RPG with crafting/world-building elements.\n\nOnce I got to mid-game, however, the cracks really started showing. The food system is incredibly unbalanced, with the most simple recipes in the game (meat skewers, fish skewers, and plain water) giving the most stats by an overwhelming amount. There's literally no reason to craft any other food, except for a few that can restore sanity, fatigue, and/or health. There is no reward to crafting the higher tier foods (anything that requires flour) outside of using Winterberry Tarts for auto-mining. Farming is a chore that doesn't seem worth it (you're supposed to get higher yields for using fertilizer, but I did not) and the mid/late game seems rushed and not fleshed out. The top-tier housing stuff is also locked behind the max tier workbench, which made it completely useless to me.\n\nThere were also several annoying bugs. Respawns are inconsistent and buggy, with some things respawning over time and others only respawning once you restart the game. Because there's no indication of [i]when[/i] a thing is going to respawn, I honestly don't know if some of the problems I encountered were bugs or not. You could sell/trash shoes you get that are necessary for a quest, rending that quest unable to be completed and ruining your game. There's a catacombs key that you can only get once, but when you reload the game the door it opened is locked (it's not actually necessary for anything, though, which is a problem in of itself).\n\nBut the thing that got me to write this review is the ending. The ending was underwhelming from both a gameplay perspective and a story one. I went into the final area expecting an RPG-esque dungeon with a few puzzles and a final boss with new/interesting fight patterns. What I got, however, was a dungeon consisting of a main room with two branching paths, each of one leading directly to a giant version of the easiest normal enemies. They were so pathetic that I was able to shoot them to death without them even coming close to me. \n\nAnd, honestly, the story conclusion was extremely \"meh\". It really needed more build up and coherence than it got, imo. But I guess that's a ymmv thing. I can't get too into it without being spoilery, but I feel like there was [i]way[/i] too much \"unrelated quests to unlock new biomes\" in comparison to the \"actual story information about the origins of the zombie plague\". More focus on the mystery and breadcrumbs keeping players interested in what was going on would have gone a long way to making the mid/end game feel more fun and cohesive.", "timestamp_created": 1686565906, "timestamp_updated": 1686566231, "voted_up": false, "votes_up": 93, "votes_funny": 0, "weighted_vote_score": "0.894687831401824951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139180818": {"recommendationid": "139180818", "author": {"steamid": "76561198052202988", "num_games_owned": 200, "num_reviews": 14, "playtime_forever": 619, "playtime_last_two_weeks": 0, "playtime_at_review": 476, "last_played": 1686179108}, "language": "english", "review": "Those who like survival games, won't find much here. The game is extremely linear story telling adventure. Also, VERY easy.\nThose who like relaxing farming,... games, won't enjoy it much either. You will have to follow quest to unlock a minor feature to unlock the next quest to unlock the next biome/feature,...\n\nSo, it's neither stardew valley nor don't starve.\nIs this a bad thing? IMO, no.\nIt tries to be its own thing and kind of succeeds.\n\npost release patches helped. Spawn rates are better now, you can move walls.\nI can see a lot of QOL changes in future patches but the game won't change.\nIt is what it is.\nI like it, it respects my time with average grinding and decent length.\n\nI really like the graphics and the world building mechanic.\nI find 0 interest in the house building aspect but game doesn't force me to engage.\nJust build a huge square house to advance your workshop and call it a day.\n\n\n\nIt's not a 10/10 game, more like a\n[strike]7/10 (patch 1.0.2)[/strike]\n7.5/10 (patch 1.0.3) \n\nIt does not deserve the mixed status.\nBut the negative reviews are not wrong either.", "timestamp_created": 1685311345, "timestamp_updated": 1685394133, "voted_up": true, "votes_up": 104, "votes_funny": 0, "weighted_vote_score": "0.881839334964752197", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139418580": {"recommendationid": "139418580", "author": {"steamid": "76561198001439149", "num_games_owned": 1357, "num_reviews": 86, "playtime_forever": 2713, "playtime_last_two_weeks": 0, "playtime_at_review": 2699, "last_played": 1685826065}, "language": "english", "review": "-- DO NOT BUY THIS GAME IF YOU BUILD BIG --\n\nThis game encourages you to build your own world and has a map size of at least 1600 potential tiles to fill.\nAfter placing approximately 250, your game will lag. After 350+ tiles placed, the game will be utterly unplayable for the vast majority of gamers.\n\nI run a beefy custom PC with a 3090 24gb DDR6 and for me, it runs at LESS THAN 10 FPS.\nAt time of review: 45 hours played. Day 273. 529/1600 tiles placed.\nI only have a few medium sized cabins constructed. Everything else is generic world tiles.\n\nThe game is very clearly in Early Access stages, even though there was an Alpha but it is listed on STEAM as complete.\n\nI have played numerous other titles like Project Zomboid, Raft, Conan Exiles, Factorio, Empyrion, Icarus, etc and this game broke within 6 days of playing. An open world/building game that is unplayable after 6 days is beyond unacceptable.\n\nI love so many things that could potentially be great about this game but the devs simply not playtesting their own game to see if it could run before 20% of their own world could be built is shameful.\n\nThis game needs FAR more work before being sold at this release price and honestly, they should provide refunds to people that want it.", "timestamp_created": 1685706391, "timestamp_updated": 1685706391, "voted_up": false, "votes_up": 252, "votes_funny": 9, "weighted_vote_score": "0.876450598239898682", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1688134914, "developer_response": "First of all, sorry to hear that you had performance issues with the game.\n\nBetween the build that you played right after release and now, we released various patches, many of those improved the performance of the game drastically.\n\nWe are not done patching the game and we will improve it further down the road, but we hope that our latest efforts showed effect on your particular world and setup."}, "138984995": {"recommendationid": "138984995", "author": {"steamid": "76561198032219706", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 827, "playtime_last_two_weeks": 0, "playtime_at_review": 305, "last_played": 1685119523}, "language": "english", "review": "Edit: I have updated the wording of the review, as it came off harsher than I had intended.\n\n\nThe art is solid, and the core concept of building the world yourself works very well.  But overall the game is lacking in enough content and engagement for me to recommend to survival fans.  \n\nThe game lacks challenge, and there is not enough building/exploring to make up for it.  Food is overly abundant, water is infinite, threats are completely avoidable.    There's enough berry bushes on 1 tile of plains to feed your character for the entire game.\n\nThe pacing is good, the grinds to unlock the next tier of Biome/Material are reasonable, the problem is that there's very little to do besides collect the required resources for unlocking the next tier.  The in game systems (combat, hunting, fishing, etc) are very basic. Fishing is \"hold R at a fishing hole with a fishing rod equipped\".  \nHunting is \"right click on an animal with a bow equipped\".\n\n\nThe story is directly tied to unlocking new biomes, so the game plays very linearly despite the player having the freedom to build what you want, where you want.", "timestamp_created": 1685048230, "timestamp_updated": 1685124265, "voted_up": false, "votes_up": 209, "votes_funny": 2, "weighted_vote_score": "0.87303692102432251", "comment_count": 17, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139130187": {"recommendationid": "139130187", "author": {"steamid": "76561198097871714", "num_games_owned": 0, "num_reviews": 49, "playtime_forever": 957, "playtime_last_two_weeks": 0, "playtime_at_review": 957, "last_played": 1685242607}, "language": "english", "review": "Most of the negative review already mention what i want to say about the game.\n\nThe game was absolutely amazing at start where it show you that you can basically craft and place the world tile however u want but then..... \n\nAfter a few tiles and biomes i unlock, soon that i realise and fear its going to be the same thing over and over and over and over again until end game. Gameplay loop was absolutely horrible repetitve and soon will wear one off their interest and patience to progress thru. (aka me) I stop playing after the desert biome and simply couldnt bring myself to do more of the same thing all over again. \n\nIn case you curious what the gameplay loop was...\n1. collect ingredient/materials for workbench / house deco and building / cartography table(unlock new tiles)\n2. upgrade workbench and house level and unlock new tiles\n3. go to new tiles or biome with new materials and ingredient and repeat the whole 1+2 process and thats it.\n\nMy rant below :\n- Short and simple story\n- Clunky but functioning crafting and upgrading system\n- Hellish of repetitive gameplay and grinding\n- Pointless farming system (took too much resources to grow crops and its basically faster to just go out and forage the said crops)\n- Extremely clunky control for doing almost everything\n- Very stiff animation lock and boring combat\n\nHighly recommended to try it out first on the Above Snake Prologue(demo) if your like it and can accept the whole game to be like that then only you buy the game. \n\nOtherwise, adios baby cya next game. And thank you for reading", "timestamp_created": 1685244733, "timestamp_updated": 1685244733, "voted_up": false, "votes_up": 157, "votes_funny": 1, "weighted_vote_score": "0.852599442005157471", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "138994202": {"recommendationid": "138994202", "author": {"steamid": "76561198062235558", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 101, "playtime_last_two_weeks": 0, "playtime_at_review": 101, "last_played": 1685061726}, "language": "english", "review": "Feels a bit like a proof of concept. It’s very bare bones in terms of gameplay. That being said the reason I kickstarted this game is because I liked that concept so here's my breakdown so far.\n\nFirst the good I really like the whole you build the world idea they have here. Reminds me of games like Legend of Mana in that depending on how you build the world will determine the ease of access of certain things to your base. I'm also a fan of the character art and game art in general. Crafting isn't a huge chore either, a pitfall many crafting games have where it takes ridiculous numbers of resources to make simple or basic items. I also enjoy that you unlock new tiles be interacting with the biomes encouraging you to go out and explore newly placed tiles to see what items and drops spawn in them.\n\nNow the bad, unfortunately it’s just not that deep and the quest lines and characters in the game are generic with every quest basically a fetch quest. Despite your character's mom possibly being dead and a Zombie apocalypse happening off screen she doesn't even seem to care doing random fetch quests for lazy folks who can't trust her until she gives them X item. I need you to go to X biome to get or talk to Y but you need to collect Z materials to unlock the new biome. They all feel like plastic dolls standing around doing nothing. Also, despite being the wild west the only threat to my character have been Zombies. Slow moving and not a threat at all, no bandits, or interesting western events you'd expect. The tutorial mentions nighttime being more a threat but unless a Zombie is nearby there really isn't anything dangerous that happens and even if there are they glow red so you can easily avoid them. Even if you do attempt to fight something that can fight back you hold down LMB for 5 seconds and it dies. Nothing has even come close to killing me. The sad thing is even with my low playtime my percentage is already saying I completed more than half the game.\n\nHoping there is more content to be added down the road, maybe more in-depth quest lines that utilize the mechanics better. Like instead use the tutorial as inspiration and have your character craft houses or items that appear in the world that the NPCs use or move into versus just standing around in their biome doing nothing. This would give the world more character and would be fun as the PC gets to make their western towns and what not. As now I'd only recommend a purchase if you want a brief but conceptually interesting crafting game but you're probably better off sticking with a game like V Rising.", "timestamp_created": 1685063046, "timestamp_updated": 1685111328, "voted_up": false, "votes_up": 115, "votes_funny": 0, "weighted_vote_score": "0.85064619779586792", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "156106096": {"recommendationid": "156106096", "author": {"steamid": "76561198089374518", "num_games_owned": 1055, "num_reviews": 83, "playtime_forever": 1653, "playtime_last_two_weeks": 0, "playtime_at_review": 827, "last_played": 1710009526}, "language": "english", "review": "[h1]Chill, unique but not without flaws[/h1]\nI had Above Snaked on my radar for a while but when I bought it, I only played it for an hour and almost refunded it. The intro was clunky and the buttons seemed very confusing. For some reason, I decided to keep the game, which proved to be the right decision because Above Snakes works brilliantly on Steam Deck. It offers the perfect blend between survival and exploration, and the map building is just refreshing to see.\n\nBut the map is where the game also gets frustrating. Because no matter how well you try, you will eventually reach the stage where you've kind of screwed yourself over with your map building. You don't have access to all map pieces from the start, and you don't know what you're getting next unless you watch a guide. So you can absolutely build yourself into a hole and then end up farming resources to break the pieces again.\n\nAnd when we talk about resource farming, I mean it's GRINDY. Your easiest way of making money is collecting water, boiling it and selling it, for 3 gold a piece. Collecting water makes you tired, so you constantly have to eat and drink as well. That's just unfun. I wish there were more items you could sell or create.\n\nAll in all, Above Snakes offers a unique take on the survival genre, which can easily keep your attention for several ours at the time. The pros definitely outweigh the cons for me, and if you don't care about achievements or grinding, you will have a great time playing this game.", "timestamp_created": 1705423134, "timestamp_updated": 1705423134, "voted_up": true, "votes_up": 54, "votes_funny": 0, "weighted_vote_score": "0.849138319492340088", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "142492500": {"recommendationid": "142492500", "author": {"steamid": "76561198029584875", "num_games_owned": 0, "num_reviews": 41, "playtime_forever": 3660, "playtime_last_two_weeks": 0, "playtime_at_review": 3220, "last_played": 1698603174}, "language": "english", "review": "I enjoyed [i]Above Snakes[/i]. \n\nThis is a fairly relaxing, chill game. There are enemies, but they can usually be avoided with ease and dispatched with similar ease. I played for 160 in-game days and had made it most of the way through the story before I experienced my first death. (Don't go rummaging around graves when you're low health, folks.) \n\nThe story is nothing spectacular, but is better than just serviceable. Zombies are tired, so I appreciated a zombie story where it isn't contagious. Rather, there is an environmental cause which is treated more like a unnatural poison than a disease. \n\nThe game did not give me what I normally want in a game like this. My favorite genre is Open World Survival Crafting game because I love exploration and expressing my creativity. And neither apply here. \n\nThe world of [i]Above Snakes[/i] is neither hand-crafted nor procedurally-generated. It's [b]you[/b]-generated. You earn the ability to place new world tiles as you gather resources, and you unlock new types of tiles through research and story progression. There are a limited selection of biome transition pieces, adding some challenge to world design. Combine that with extremely limited points of fast travel, and you may have to put some real thought into the layout of your next few pieces if you don't want to trap resources too far to easily acquire. \n\nThe downside, however, is that beyond discovering the resources on your first visit to a biome, there is rarely any sense of exploration. What is over that way? Whatever you put there.\n\nThe game has the OWSC basics: gathering resources, unlocking new crafting stations, and working through tiers. All of which is done in a very basic and functional way. None of it is difficult or memorable. The number of options for base building and crafting is very limited. For example, your house can only have one floor, and it is made out of square sections. No diagonal or curving walls. No interesting architectural elements. And maybe a dozen pieces of decoration/furniture. The base building was quite disappointing. Everything works perfectly, but it is bare-bones enough to feel like it is Early Access.\n\nWhat made up for that was the inventory system. You have multiple, full-size inventories (resources, equipment, consumables, etc). So you have plenty of place to store items, which additionally stack up to thirty (except for equipment). There is no carryweight, which is phenomenal. And no objects that take up multiple storage slots, so no storage Tetris. I had unlocked the ability to make storage boxes hours before I felt I might need one. \n\nThere is only one type of storage item, and the box stores as much as one of your inventories can. So even late game, I had less than ten storage boxes and never felt like my gameplay was swallowed by inventory management.\n\nAnother wonderful feature that felt like a rare gem in this genre was that ignoring your survival needs (Thirst, Hunger, Sanity, Fatigue) does not kill you. You can still operate with one or even all of them at zero. The effects of running these meters out impairs you in other ways, such as halving your max health or taking away your ability to move faster than a slow walk. (The penalty from having zero sanity is beautiful.) But if you are in a safe environment doing routine chores like cooking or smelting, you don't have to keep interrupting what you are doing to tend to survival needs.\n\nOccasionally, I would get stumped on how to progress, but in those cases it was because I hadn't talked to someone, or because I hadn't researched and placed a tile I had available to research, or similar failing. I never felt the game failed to give me what I needed to continue; I just didn't always notice. \n\nHowever, there are a number of mechanics that can be easily missed or function in a non-intuitive manner. For example: fast travel, which occurs between hitching posts, requires a carrot. The game never tells you that. Another: the game determines crop yield by checking if the crops are watered and/or fertilized at the moment you harvest them. (So watering and fertilizing when you plant just throws away those resources. You have to water and fertilize midway through the growth cycle [b]and[/b] be home to harvest as soon as your crops mature, to get good yield.) I made a thread in the Steam discussions to post a list of things like this for the sake of new players.\n\nI played through the entire story and I am still playing it a while longer just for the chill gameplay. I recommend with caveats, but I still definitely recommend [i]Above Snakes[/i].", "timestamp_created": 1689890924, "timestamp_updated": 1689890924, "voted_up": true, "votes_up": 45, "votes_funny": 0, "weighted_vote_score": "0.846113741397857666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "147383779": {"recommendationid": "147383779", "author": {"steamid": "76561197997275154", "num_games_owned": 189, "num_reviews": 16, "playtime_forever": 1227, "playtime_last_two_weeks": 0, "playtime_at_review": 1227, "last_played": 1696104363}, "language": "english", "review": "So the create your own world mechanic is solid and actually a lot of fun. That being said the game turns into a huge slog after the first 60% of the story. The unlocking map tiles get tedious having to run back to previously visited biomes to grab a little of this and a little of that to continue the story. The story is bad. There is no getting around that, dull and uneventful and I had little motivation to continue it after the first few hours. The combat was also a little on the boring side after you progressed far enough to have ranged weapons and figured out that you can just dodge everything. But again the building the world idea is solid and there is potential here, I could have seen this game being so much better than it turned out. Wait for a big sale or skip in my opinion.", "timestamp_created": 1696104669, "timestamp_updated": 1696104669, "voted_up": false, "votes_up": 87, "votes_funny": 0, "weighted_vote_score": "0.843237638473510742", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139464494": {"recommendationid": "139464494", "author": {"steamid": "76561198023766541", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 245, "playtime_last_two_weeks": 0, "playtime_at_review": 238, "last_played": 1685826157}, "language": "english", "review": "I really like what its trying to do, but its missing a sort of spark to it. Luckily I think this can be fixed with a few minor tweaks to its core formula, but until then if you're on the fence about the game, give it a pass.\n\nThe game first needs to decide what it's primary gameplay loop is, the thing it wants the players to enjoy doing the most. Right now I see two primary gameplay loops, the combat, and the \"exploration.\" Unfortunately neither of these are currently engaging enough to be interesting.\n\nThe combat feels STIFF. Combat is technically present with an attack, dodge roll, and some ranged weapons, but the way all of those work really shuts you down. When you swing your character gets rooted in place, and the dodge roll doesn't cancel your attack, so you really have to commit. I've seen some attack interruption if your weapon is strong enough, but don't count on it. The dodge also doesn't appear to have many or any i-frames. The enemies aren't all that smart or difficult but the melee combat mostly boils down to baiting an attack and trying to land your own before they recover. Ranged combat is slightly better, but your first ranged weapon, the bow, isn't very strong and feels a bit like a resource sink rather than a viable weapon. If the dodge roll was quicker, if I could move while attacking, if the enemies had better tells or felt a bit more dangerous (don't just increase their damage, change their behavior), I think the combat would feel better. Combat needs to feel like like a dance, and not a posing contest.\n\nMuch like the combat the exploration is serviceable, but there's no draw to it. The tile building is really cool, but you unlock all the tiles, and place them all deliberately, and the only challenge is matching borders? It doesn't feel like a puzzle like dorfromantik or fog of war. I'd say the biggest challenge is trekking across the map to get the resources, to unlock the next tile, to place it, then to walk across the map to get its resources. Sound familiar? the exploration is just a series of fetch quests, but you get a tile big enough for a house or two, not a whole new area. It feels like the game wants me to play as a nomad, but doesn't give me the freedom to build easily away from base, or a large enough inventory to make this worth it. If the exploration is the focus, we need to have a want to explore besides just unlocking tiles or doing what feels like fetch quests. Only the one time unique tiles are interesting, the rest of the tiles are bland and repetitive. In a way it feels like a flat minecraft world that happens to have some trees scattered about. Give the landscape variation, maybe outside my control that makes exploration a challenge. Give me more ways to traverse, climbing cliffs, taming horses, something. Let there be random ruined buildings or an infection that pops up on my new tile that slowly spreads so I have to stop it with barriers or destroy it. Don't let me choose from every tile, give me a selection from what I've unlocked and make me plan. Give me tiles that are 1x2 or 2x2, or just something to add variety. Make the world feel like its fighting me, or give me something more interesting to do.\n\nOverall there's potential, but there needs to be a bit more polish and focus on the gameplay loops. the last 10%", "timestamp_created": 1685776711, "timestamp_updated": 1686427909, "voted_up": false, "votes_up": 51, "votes_funny": 0, "weighted_vote_score": "0.832521915435791016", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139131703": {"recommendationid": "139131703", "author": {"steamid": "76561198024117421", "num_games_owned": 274, "num_reviews": 12, "playtime_forever": 799, "playtime_last_two_weeks": 0, "playtime_at_review": 799, "last_played": 1685244347}, "language": "english", "review": "I was looking forward to this game for so long. The demo was very promising, a series of quest tutorials to get you going and then it seemed to let you loose to explore and build as you choose\n\nThe explore-and-build as you choose never arrives. The game is an unending series of quests given to you to complete, and each quest exclusively unlocks the resource you need to progress to the next level. This game-loop boils down to the crafting / building being used to fulfill fetch-quests quota's that are totally at odds with the spirit of the genre and seemingly the game itself. Instead of your labors being a vehicle for creating your own cool survival hideout, where you horde your trophies and findings, it's a series of requirements to progress to the next biome. I'd rather just find the resource randomly on a new tile than completing quests. \n\nThe game doesn't take advantage of it's own unique mechanics, the tile system becomes a progression chore and does not offer opportunities for adventure or exploration, as every unlocked tile is identical no matter how many you drop. The options you have are extremely limited, you can't even fire an arrow over water, the arrow just lands abruptly in the ground. It truly feels like this game was made by someone who has not played it through and isn't interested in what makes the genre exciting.\n\nI played it long enough to unlock the farming mechanic hoping it would be a sort of industrial power-spike to break out of the monotony, but alas it was even more time consuming than hunting and gathering\n\n", "timestamp_created": 1685247134, "timestamp_updated": 1685247134, "voted_up": false, "votes_up": 49, "votes_funny": 0, "weighted_vote_score": "0.801512002944946289", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139016971": {"recommendationid": "139016971", "author": {"steamid": "76561198090130506", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 247, "playtime_last_two_weeks": 0, "playtime_at_review": 247, "last_played": 1685103381}, "language": "english", "review": "I agree with most of the negative reviews - short game, very basic story/quests/mechanics, no challenge at all. \"Build-your-world\" idea is a fresh one (at least for me) but it doesn't add much content - you only need a couple tiles from each biome to progress the story, grinding doesn't give you anything really.\n\nConsidering the quality of graphics and dialogue, the game is very overpriced, there are many games that do it better and cost half of the money that they ask for this one.", "timestamp_created": 1685104185, "timestamp_updated": 1685104185, "voted_up": false, "votes_up": 108, "votes_funny": 0, "weighted_vote_score": "0.801177144050598145", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "141577105": {"recommendationid": "141577105", "author": {"steamid": "76561198112819846", "num_games_owned": 0, "num_reviews": 440, "playtime_forever": 124, "playtime_last_two_weeks": 0, "playtime_at_review": 124, "last_played": 1688794886}, "language": "english", "review": "I made it to day 20 in this game, but I just couldn't take it anymore. I really tried to get into it, but it just wasn't happening no matter how much I kept pushing myself to keep playing. I was frankly BORED out of my mind. Gameplay just gets way too grindy and repetitive once you discover the loop of grinding for the same resources over and over to create another land tile while taking on dull quests with dull dialogue and no voice acting that send you running from one end of the map to the other. While doing this you must also constantly keep eating and boiling water to prevent yourself from passing out and losing resources. Another issue I had was that the inventory has huge annoying pop-ups that cover everything up. The camera also only spins in half turns and each turn spins the camera too far. And as already mentioned, as the game progresses, way too many resources are required to craft everything that makes the game tediously grindy. I also experienced some random frame rate drops for seemingly no reason. Overall, although it started off pretty well I ended up not enjoying my time spent with this game. I therefore cannot recommend it and would instead rather play better games.", "timestamp_created": 1688795693, "timestamp_updated": 1688836222, "voted_up": false, "votes_up": 53, "votes_funny": 1, "weighted_vote_score": "0.799466967582702637", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139264666": {"recommendationid": "139264666", "author": {"steamid": "76561197978775251", "num_games_owned": 1239, "num_reviews": 49, "playtime_forever": 837, "playtime_last_two_weeks": 0, "playtime_at_review": 532, "last_played": 1685542188}, "language": "english", "review": "I was honestly considering giving this game a \"Not recommended\" after picking it up. I was really charmed by the demo, and looked very much forward to the full release.\n\nThen it was released, and I felt rather... disappointed? The first moment of my disappointment came from when I loaded my save, and it said 58%. And I thought 'no way am I over halfway through the story, am I? I'm only a little past the demo'\n\nAnd then I got to gardening, and it felt completely worthless. And my disappointment ended up growing. I felt as though despite the fact there had been final testing, that all these little disappointments had slipped through.\n\nAnd then they patched it. And almost *every single issue* I had with the game I saw in thos patch notes, immediately addressed. I haven't had much chance to try with the new update, but I could already tell that the Dev(s?) had listened to feedback and wanted to address it.\n\nI'd honestly say the only thing I haven't seen addressed is that I feel the upgrade for the shelter system is a little off-target. The idea is that you choose one of three unique upgrades to improve your base, but you can switch at any time. And considering some of the benefits are double production on specific items, it *very much* promotes making sure you switch the perk before crafting those items. So it almost feels as though it's pointless to have the choice. You're not chosing between + damage or +armor on the same tier, you're chosing between +production or +armor, which means you can just use +production at home, and switch to +armor when you leave. And at that point, I question why there was even the choice in the first place.\n\nAnyways, temper your expectations. It might not be grand, but it is enjoyable.", "timestamp_created": 1685452981, "timestamp_updated": 1685452981, "voted_up": true, "votes_up": 60, "votes_funny": 0, "weighted_vote_score": "0.798125684261322021", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139914804": {"recommendationid": "139914804", "author": {"steamid": "76561198032121032", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1147, "playtime_last_two_weeks": 0, "playtime_at_review": 460, "last_played": 1687645357}, "language": "english", "review": "I don't often leave reviews, but I became frustrated enough by Above Snakes that I wanted to leave a warning for everyone expecting one game and actually buying another.\n\nI really want to like this game. It's beautiful and has so much going for it. But I can't recommend it, because fundamentally it isn't what it says it is on the side of the box. Above Snakes bills itself as first and foremost a world-building and exploration game. It provides a core game mechanic loop that supports that, insomuch that as you take exploration and survival actions in the world, you unlock the ability to place additional world tiles, and get more to explore. Also, like many such games there is a crafting and technology tree to unlock and climb. This is all fine, and exactly what I bought the game to enjoy. Plus wild west! Plus Zombies! What's not to love?\n\nThe issue I have is that the implicit contract of the explore & survive game mechanic loop is broken by the story mechanics. There are technologies and terrain types that can only be uncovered by completing story quests. And there's nothing forcing the story progression. For example, I spent hours trying to figure out how to follow the genre expectations of build/explore/craft and puzzling through many random crafting combinations to guess at how to make progress, only to be frustrated. My player expectations were subverted, disappointed by the reality the game expects you to follow the story as the hard gates in order to actually make progress in unlocking terrain or technologies.\n\nThere is a potential simple fix for this, which is to make the player expectations align with the core mechanics. Currently, the player-reward loop is that you gain terrain tiles to place and expand the world by doing survival actions. This means that the game is rewarding the player as though it is a typical survival game. One possible solution is that because there are hard gates based on story quests, the core mechanic could be changed so that the player only gains terrain tiles by doing story quests instead of survival actions. The gameplay reward loop then becomes \"do quest, gain more terrain to place\". That clarifies and aligns player actions with the core mechanic that's actually moving progress in the game forward. And by making that explicit in how the game works, it avoids subverting implicit genre player expectations and the associated disappointment.\n\nIf I had gone into the game knowing that it was actually a Story Game first and a Survival Game second, I don't think I'd have been disappointed as I am. Given what I know now, I'm sharing this in the hope that others going in with adjusted expectations can work around a broken mechanic to enjoy the game for what it has to offer.", "timestamp_created": 1686521086, "timestamp_updated": 1686521178, "voted_up": false, "votes_up": 39, "votes_funny": 0, "weighted_vote_score": "0.782725632190704346", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "155814950": {"recommendationid": "155814950", "author": {"steamid": "76561198069117292", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 238, "playtime_last_two_weeks": 0, "playtime_at_review": 238, "last_played": 1705066075}, "language": "english", "review": "I think this game could really benefit by having a co-op mode. The gameplay is very tedious and slow, and I belive having multiple people being able to build the land while also collecting would really help mediate the grind and constant backtracking. Also the game allows you to travel via horse, but not ride the horse? This one mechanic could help immensely with traveling around the map, while also staying true to the game.\n\nControls are clunky and not very fun, and combat is a slog imo. Many features in this game feel half baked and not entirely thought out. \n\nStory is boring but inoffensive. It won't amaze you, but it's harmless and doesn't detract from the game, although some of the writing has some translation errors and traces of broken english which does cheapen the experience and makes you feel like you're playing some off brand mobile game.\n\nGame is a 5.5/10. Nothing horrible, but just needed a little more time in the oven. Sadly I don't think they're planning on any major additions to the game as far as I know.", "timestamp_created": 1705068274, "timestamp_updated": 1705068476, "voted_up": false, "votes_up": 56, "votes_funny": 1, "weighted_vote_score": "0.770229876041412354", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139321453": {"recommendationid": "139321453", "author": {"steamid": "76561197982922531", "num_games_owned": 218, "num_reviews": 16, "playtime_forever": 641, "playtime_last_two_weeks": 0, "playtime_at_review": 400, "last_played": 1687225993}, "language": "english", "review": "Do not buy this game if you want a challenging survival experience.\n\nDo buy this game if you like a relaxing progression / building / exploring experience.\n\nIf you buy the game and there's something you don't like then tell the developers. They've been pushing out updates based on community feedback constantly since release.\n\nDon't step on snakes.", "timestamp_created": 1685544058, "timestamp_updated": 1685544058, "voted_up": true, "votes_up": 27, "votes_funny": 1, "weighted_vote_score": "0.742638587951660156", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139143352": {"recommendationid": "139143352", "author": {"steamid": "76561198202593007", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 468, "playtime_last_two_weeks": 0, "playtime_at_review": 468, "last_played": 1685265076}, "language": "english", "review": "I've followed these developers since kickstarter, even backed them, so I was very keen when they launched the game finally after waiting quite a long time for it to come out (as all good game development takes.)\nHowever, I am quite disappointed with the final product. Overall, there is a lack of \"fun\" to it, whether it be lack of things to do, lack of polished mechanics, or just generally lacking.\nThings to note:\n- Combat mechanic is slow and janky. There is a dodge roll in the game but the amount of frames it takes to initiate it rends the actual mechanic completely useless as by that time the enemy has hit you. The combat is a lot of 'run away, run back, hit once, repeat' until they die. Even though there are bows and guns, the aiming is so off, for no reason at all the character will aim in the opposite direction or just decide that they want to shoot the nearest tree instead of the enemy 2 meters away from them.\n- The quests are semi-interesting but lacks substance I feel, though that's more of a preference thing. One objective observation is the lack of direction for the player if you don't understand where to get something or how to get it.\n- The tile mechanic for placing the next land is interesting, but again, I feel that it doesn't really add anything to the game at all. Sure, you can make your surrounding tiles to be what you want, but realistically for most players that either means your biomes are on each 'face' of a square formation around your home base, or some really long line, either way it is annoying without fast travel (save for the horse, though carrots to make the horse go anywhere are relatively rare.)\n\nThe good things it has going for it though is the art style and aesthetics. One of the contributing factors to my backing the project to begin with. Animations still need work though as they too can be jank sometimes.\n\nTL;DR: Overall poor combat and relatively useless tile mechanic for land, nice art though.\n\nIf they decide to release some meaty updates later on to fix these issues I might change my review, but in its current state I can't recommend this game.", "timestamp_created": 1685265774, "timestamp_updated": 1685265774, "voted_up": false, "votes_up": 24, "votes_funny": 0, "weighted_vote_score": "0.737472474575042725", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1685387929, "developer_response": "Sorry to hear that the combat put you off. We can say that the specific point you struggled with - targeting a random tree instead of what you wanted to target - has been fixed with the recent patch. We would be happy if you would give Above Snakes another chance but of course understand if you don't want to.\n\n1.0.3 Patch notes:\nhttps://store.steampowered.com/news/app/1589120/view/3698063796880914896"}, "141664360": {"recommendationid": "141664360", "author": {"steamid": "76561197998032388", "num_games_owned": 0, "num_reviews": 39, "playtime_forever": 340, "playtime_last_two_weeks": 0, "playtime_at_review": 340, "last_played": 1688891541}, "language": "english", "review": "Becomes surprisingly tedious at midgame.\n\nExample of gameplay process:\n-Return home to unlock a scout tower\n-Spawn a scout tower somewhere\n-Reach the said tower and activate it\n-Survive boredom of an arena fight\n-Unlock a second scout tower tile, which is a separate unique from a first one for whatever reason\n-Run back home to unlock it\n-Spawn a second scout tower\n-Run to said tower and activate it\n-Survive boredom of an arena fight\n-Unlock a... third scout tower tile\n-Run back home to unlock it\n-Spawn a third scout tower\n-Run to said tower and activate it\n-Survive boredom of an arena fight\n\nAnd, looking back at that abomination of a quest, I realize - this is the entirety of a gameplay loop.\nYou gather obscene amounts of material, unlock tiles, travel to tiles and do some quests there, then you gather obscene amounts of material from new tiles, unlock newer tiles and you got the idea.\n\nBy the time you reach canyons, game wants you to spend somewhere around 30 wheat to unlock the new tiles.\nAnother my favorite is when desert tiles required iron *ore* to unlock, rather than bars. Oh yeah, of course I was not anticipating that and processed all my ore to ingots few quests before that.\n\nNow to the tiny little things:\n-Doggo is useless and implemented badly. It's only gameplay function is to stop randomly and dig for useless single resource. If you run away while it's digging, it will simply teleport to you.\nBe prepared to doggo teleporting around a lot as you travel. Why bother making doggo catch up with you by, I dont know, running faster? If you can just make it teleport to player every few seconds. Why bother implementing doggo in a first place? It does not serve any actual gameplay purpose. Useful one, at least.\n-You are forced to make a hide armour that can resist cold early game. It uses your previously made leather armour.\nThe neat thing is that you are then thrown into svannah/desert biome by main quest after than, where wearing this armour actively damages your health. So, game expects me to craft a second set of armour, I guess? Why tho?\n-Inventory management is pain. It's 2023 and for some reason crafting stations can't use nearby storage's inventory.\n-Another fun part is using crafting station only to see game say \"Outside of crafting station range\".\n-My yet another favorite part is forced delay of 5 seconds per craft of single item. Have fun crafting 20 flints.", "timestamp_created": 1688892158, "timestamp_updated": 1688892158, "voted_up": false, "votes_up": 23, "votes_funny": 1, "weighted_vote_score": "0.726037442684173584", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "150065000": {"recommendationid": "150065000", "author": {"steamid": "76561198139127613", "num_games_owned": 0, "num_reviews": 284, "playtime_forever": 1151, "playtime_last_two_weeks": 0, "playtime_at_review": 996, "last_played": 1700005297}, "language": "english", "review": "Above Snakes offers a very chill sandbox experience for those who are looking for it.\n\nThe story starts with you waking up to find yourself in a harsh situation. Something woke up that shouldn't be, and you see the world being changed and now inhabited by lost souls(zombies) that roam your homeland.\nMeanwhile, the goal is to find out about your mother's fate, who seems to be in a faraway town unclear whether she is alive or dead.\n\nYou start building and improving your gear while you explore and place new tiles to get around the world.\nThere is no pressure in how fast you progress, so can take all the time you want.\n\nBesides building and foraging there is also fishing and a little bit of combat, but it isn't complicated or stressfull to knock out the zombies or even rabbits and other wildlife.\n\nIt took me a little under 100 days to finish what the story had to offer, and that makes around 15 hours of playtime for me.\nThe story is well done and the survivors you meet are very friendly. It reminds me a bit about Undead Nightmare's storyline with how the whole plague came to be.\n\nAll in all a very relaxing game, with atmospheric music fitting the Western theme.", "timestamp_created": 1699887465, "timestamp_updated": 1699887465, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.72217792272567749", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139160741": {"recommendationid": "139160741", "author": {"steamid": "76561198054005068", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 2021, "playtime_last_two_weeks": 0, "playtime_at_review": 692, "last_played": 1705101144}, "language": "english", "review": "\n\nThe [b] good [/b] thing about this game is that the game is not a constant threat to the player.\nIt's a stress-free, relaxed, decelerated gaming experience.\nYou gather materials, unlock new items, tinker and build.\nAnd on top of that, the map is customizable throughout the game.\nThe point is, there's no reason to do any of it except have fun.\n\n\nDas Gute an diesem Spiel ist, dass das Spiel keine ständige Bedrohung für den Spieler darstellt.\nEs ist ein stressfreies, entspanntes, entschleunigtes Spielerlebnis.\nMan sammelt Materialien, schaltet neue Gegenstände frei, bastelt und baut.\nUnd obendrein ist die Karte im Laufe des Spiels anpassbar.\nDer Punkt ist, dass es keinen Grund gibt, irgendetwas davon zu tun, außer Spaß zu haben.\n\n\n", "timestamp_created": 1685287727, "timestamp_updated": 1685387746, "voted_up": true, "votes_up": 25, "votes_funny": 0, "weighted_vote_score": "0.716189861297607422", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139211142": {"recommendationid": "139211142", "author": {"steamid": "76561198025841452", "num_games_owned": 425, "num_reviews": 25, "playtime_forever": 403, "playtime_last_two_weeks": 0, "playtime_at_review": 403, "last_played": 1685365296}, "language": "english", "review": "While the game bring some interesting ideas there`s major flaws in it, with the 2 biggest being:\n1- The combat is EXTREMELY simple.\n2- The gameplay loop is unlock tile> get quest> pick materials> craft quest item> deliver> unlock tile> get quest> pick materials.....\nThats it. the entire gameplay is this loop, which is truly a shame given that a game where you can \"craft\" the world is completely on rails like that.", "timestamp_created": 1685365582, "timestamp_updated": 1685365582, "voted_up": false, "votes_up": 33, "votes_funny": 2, "weighted_vote_score": "0.702625095844268799", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139001115": {"recommendationid": "139001115", "author": {"steamid": "76561198028063430", "num_games_owned": 0, "num_reviews": 46, "playtime_forever": 423, "playtime_last_two_weeks": 0, "playtime_at_review": 396, "last_played": 1685118136}, "language": "english", "review": "A bit basic but cute craft sim with some zombie story on top of it. Survival elements are minimal:\nyou have food & drink & sleep meters but resources are never an issue.  Core idea had some potential - you build your own world by adding patches of the ground around starting area. But in the doesnt provide any kind of depth or replayability to the game. Could be a fun and chill play for progression but a lot of gameplay elements are not done well or borderline broken.\n\n1. Game gives you ability to build a house with a lot declarative elements but you cant move objects around - only place or destroy with a material loss. Clear design contradiction. Game doesnt put pressure on you in terms of resources but they still opted to ruin design your house part of the game for no particular reason\n\n2. Combat is not even alpha level. Very clunky, unresponsive and with buggy animations\n\n3. Progression is gated behind workbench upgrades and quests. You can refuse to take a quest and never progress. Dialog options and choices exist for no reason and play no role. \n\n4. Progression system is badly designed. Items unlocked at stages where you can't use them. Area which gives you access to resource X requires the same resource to unlock itslef. So you stack with slow grind of one singular patch of the ground. Resource respawn system is broken and some resources are only restored upon game restart. \n\n5. Plenty of small technical bugs but nothing serious\n\nFor me indie games can struggle with technical realization but game-design department should be super solid. This one has glaring problems with general flow. Its not bad but fails to be actually good.", "timestamp_created": 1685075730, "timestamp_updated": 1685075730, "voted_up": false, "votes_up": 24, "votes_funny": 0, "weighted_vote_score": "0.687681317329406738", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "151446752": {"recommendationid": "151446752", "author": {"steamid": "76561198199982658", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 2270, "playtime_last_two_weeks": 0, "playtime_at_review": 2270, "last_played": 1697109846}, "language": "english", "review": "Story line was good. Wish it was longer. One of the achievement was to spend 365 days. I finished the whole game in 90 days and I was taking it very slow.", "timestamp_created": 1700784362, "timestamp_updated": 1700784362, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.685746729373931885", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139100095": {"recommendationid": "139100095", "author": {"steamid": "76561198005723434", "num_games_owned": 957, "num_reviews": 11, "playtime_forever": 406, "playtime_last_two_weeks": 0, "playtime_at_review": 406, "last_played": 1685206296}, "language": "english", "review": "TLDR: 7 hours in and I simply can't be bothered to continue due to the lack of challenge and QOL-features. I love the concept of customising your own map and I hope other developers might pick up on the idea but the rest of the game just feels like a hollow shell.\n\nThe game follows a simple loop: Farm items to do quest that lets you unlock more tiles, rinse and repeat. There is no challenge presented to the player at all, except for knowledge of where to farm certain items in order to progress. Combat might as well be non-existent, you either swing X weapon with broken hitboxes or you shoot X weapon with broken hitboxes.\n\nAnd honestly, for a chill-out game, that wouldn't be an issues. The problem is that the 'chill-out' part tends to be as tedious as it could get. Crafting stations sometimes don't immediately register, making it so you'll have to stand in front of them for 3 seconds in order for it to activate. You cannot move items, crafting stations or decorations without destroying them with diminishing returns. I get that system being in place for the building parts (walls, ceilings, floors) but just let me move my friggin' bed without it being a hassle. \n\nThere are no automated crafting stations. The game actually expects you to stay at your crafting station holding a specific button for X amount of time, over and over and over again. Half of the resources your acquire, you do by holding a specific button for X amount of time, over and over again. Cooking, you do by holding a specific button for X amount of time, over and over again. Fishing.. you do by holding a specific button for X amount of time, over and over and over again. You get the gist.\n\nThe good part comes from placing down the world tiles in order to customise your map. But this also comes with its own issues. See, the only way to lay tiles is by collecting X amount of resources. At one point I found myself doing farming runs, not because I needed the resources, but because it's the only way to gain tiles. It felt counter-intuitive. \n\nThen comes the issue with unlocking new tiles. Some new tiles are unlocked by quests, others are unlocked by laying down existing tiles. At times you'll be looking for that certain tile in order to connect some parts of your map and you won't know when they are unlocked or if its even in the game at all. Need that half forest / half snow tile? Well, place these frozen lakes first. Want this half plains / half water tile, well; I don't know if there is one. The issue is that this constantly makes you want to edit your map. Removing tiles and replacing them in order to optimise your layout.\n\nBut removing tiles is as tedious as the rest; they don't get refunded, not even partially. You need ink in order to remove tiles. Ink is made from feathers and berries. Berries are collected by holding a specific button for X amount of time, over and over and over again. Feathers are collected by holding a specific button for X amount of time, and aren't even a guaranteed drop. Then when you remove your selected tiles chances are you'll have to collect some random resources in order to place the replacement tiles. \n\nIt all just feel so tedious, disrespectful of your time, and ultimately made it so I just couldn't be bothered to continue playing this game. According to the save file I'm at approximately 50% of the game, having restarted once I'm guessing this game provides about a 10/12 hours of content with hardly any replay value. I hope the developers pick it up, put in the QOL-features that are required to make a decent survival game (sorting buttons, auto stack items, not standing still holding a specific button for sometimes minutes at a time) and expand on the content because otherwise I don't see myself returning to this game.", "timestamp_created": 1685209760, "timestamp_updated": 1685209760, "voted_up": false, "votes_up": 27, "votes_funny": 2, "weighted_vote_score": "0.679376721382141113", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "138970570": {"recommendationid": "138970570", "author": {"steamid": "76561198064386376", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 1286, "playtime_last_two_weeks": 0, "playtime_at_review": 89, "last_played": 1690653821}, "language": "english", "review": "This game offers a high degree of freedom and eliminates any time pressure, creating a truly immersive experience for solo players. The open-world is vast and brimming with opportunities for exploration. Every corner holds hidden treasures and unique locations, allowing players to wander freely and discover the unknown. The game presents a diverse range of quests and objectives without imposing any time constraints. Players can progress at their own pace, enjoying a relaxed and unhurried gameplay experience.", "timestamp_created": 1685030608, "timestamp_updated": 1685030608, "voted_up": true, "votes_up": 59, "votes_funny": 3, "weighted_vote_score": "0.676295220851898193", "comment_count": 9, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "138993398": {"recommendationid": "138993398", "author": {"steamid": "76561198117541416", "num_games_owned": 0, "num_reviews": 202, "playtime_forever": 363, "playtime_last_two_weeks": 0, "playtime_at_review": 127, "last_played": 1685341660}, "language": "english", "review": "OK, very cool I am slow as I cannot read after my stroke, but it is very cool.  OK back to game now :-)", "timestamp_created": 1685061580, "timestamp_updated": 1685061580, "voted_up": true, "votes_up": 54, "votes_funny": 10, "weighted_vote_score": "0.666487455368041992", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140564102": {"recommendationid": "140564102", "author": {"steamid": "76561198047323887", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 101, "playtime_last_two_weeks": 0, "playtime_at_review": 101, "last_played": 1685802094}, "language": "english", "review": "It's relaxing, it's not a base building\nYou don't explore, the tiles are not randon, they are fixed\nRefunded", "timestamp_created": 1687539365, "timestamp_updated": 1687539365, "voted_up": false, "votes_up": 30, "votes_funny": 3, "weighted_vote_score": "0.6654396653175354", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "151329956": {"recommendationid": "151329956", "author": {"steamid": "76561197995828394", "num_games_owned": 2508, "num_reviews": 26, "playtime_forever": 1367, "playtime_last_two_weeks": 0, "playtime_at_review": 1256, "last_played": 1709823525}, "language": "english", "review": "I loved this game, different elements, different enemies. You can build and craft and you are create the world. Tere is no time-limit. Its chill and beautiful at the same time. It can be a bit grindy in the end, but still worth it :)", "timestamp_created": 1700748977, "timestamp_updated": 1700748977, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.663955628871917725", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140698838": {"recommendationid": "140698838", "author": {"steamid": "76561198005025729", "num_games_owned": 0, "num_reviews": 45, "playtime_forever": 1458, "playtime_last_two_weeks": 0, "playtime_at_review": 337, "last_played": 1708039669}, "language": "english", "review": "Finished the game in about 24 hours.  Overall, for the price the game is decent.  Craft is ok but can sometimes be tedious due to need to find particular parts in various biodomes.   World map is interesting and allows you to customize your experience.  I found the map piece requirements to match specific biodomes to each other limited which made you having to build large areas for specific biodomes.  You end up running alot.  Try to build homes around trade posts with horses so you can use those for fast travel back to your main base.  Overall, story was ok, it just felt kind of long winded by the end.", "timestamp_created": 1687729631, "timestamp_updated": 1688255524, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.659591317176818848", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139044824": {"recommendationid": "139044824", "author": {"steamid": "76561198216537667", "num_games_owned": 1997, "num_reviews": 305, "playtime_forever": 4326, "playtime_last_two_weeks": 0, "playtime_at_review": 550, "last_played": 1686098147}, "language": "english", "review": "If you are looking for a \"hardcore\" survival game- this isn't it.\nThis is more of an RPG, with survival elements, and lots of crafting and a customizable open-world that you build yourself.\n\nYou build your own world- as you gain XP from hunting, gathering, fishing, completing tasks and quest, you can add new tiles to the the map, and lay them out how you like - biome types must border up with the same biome type, and there are a variety of tiles with various layouts to help you fit the puzzle together. And if you don't like how your world looks or is laid out, you can craft ink, which allows you to remove a tile and replace it.\n\nThe game is slow moving- the beginning goes pretty quickly, but it has to, IMHO. Get yourself up and going- surviving. As you progress through quests and the storyline, things will slow down and the grind will begin to take you from surviving to thriving. If you don't enjoy grinding- this game may not be for you. \nLots of gathering and crafting, hunting and fishing, collecting resources to build your home and upgrade it. The building and customization of your \"Wild West\" home  and world- while dealing with annoying zombies, angry bees, and really angry snakes, all of which will hurt you or kill you- is good. You can avoid most enemies, but you'll miss out on collecting some of the crafting materials they can provide. As you upgrade your workbench and skills with weapons and tools, you will start crafting better quality ones, and better quality clothing and armor. The further you go into the story, the more resources that become available for you to hunt or gather- you will have to manage your inventory to not become overwhelmed with *everything*. \n\nI enjoyed the Demo from way back when it was released during one of the Next Fests, but I did not play the Prologue until I bought the full game. Play the free Prologue- it will be a good tutorial to teach you the basic mechanics and how to deal with your needs meters and sanity level. Play it first- the progression you make in the Prologue does carry over into the full game when you start playing it. \n\nAgain- if you are hoping for something like The Long Dark Survival Mode or Green Hell- this isn't it. More like The Long Dark Story Mode with the crafting and building of Survival Mode Subnautica (minus the huge toothy beasites that want to eat your submarine with you in it). That level of grind to progress through the story. \n\nInventory in your backpack is limited- you'll need to build storage boxes to hold overflow so you don't head out with an almost full backpack and have to destroy things to make room for what you just picked up.\nYou can build multiple shelters, campfires, workbenches and other workstations to place in the world so you don't get caught out after dark when the zombies start spawning more heavily while making a long trek back home. Fast travel does become available after a bit- but it isn't a \"go anywhere\" fast travel- there are specific points you can travel to and from. You can't just decide to portal out from the middle of a frozen forest if you forgot to equip warm clothing.\n\nA few bugs have popped up, ans expected right after the launch of a small indie game- but the devs are fixing them pretty quickly, with the most potentially gamebreaking ones seeming to get priority. As it should be.\n\nAnd to help you out- here's a link to About Snakes: Prologue, so you can try the game out to see if it's a good fit for you before you buy the full game: https://store.steampowered.com/app/2209150/Above_Snakes_Prologue/\n\n(Quick update- I just completed the game to 100%- 64.0 hours. But I played slow- you can run through it faster, but why? Now I can add on hours remodeling my bases into mega-mansions in a reenactment of how we destroyed the land we now squat on. \nOkay- this re-enactment has actual zombies in it- but I know enough people who act like zombies to call it \"similar enough\".)", "timestamp_created": 1685136232, "timestamp_updated": 1685949102, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.655441880226135254", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139008727": {"recommendationid": "139008727", "author": {"steamid": "76561198006243109", "num_games_owned": 0, "num_reviews": 79, "playtime_forever": 403, "playtime_last_two_weeks": 0, "playtime_at_review": 403, "last_played": 1685052597}, "language": "english", "review": "Again Valve, it would be great to have a \"Mixed\" feeling choice. Its not a thumbs down, but its also not a full thumbs up. \nAbove Snakes is fun for a little bit, but gets repetitive and stale after a while, as the game loop is constantly repeating itself. \nAfter 6 hrs I have seen most of the game and unfortunately the random tile system to create your own world is not necessarily helping for replay value, since the game loop within those tiles is not changing and the story is short and fixed to unique tiles, which you want to place as close as possible to your main base. So in essence all you do is to optimize the tile layout in a way, so that all resources and unique tiles are as close as possible to you, otherwise you are having a bad grinding experience and long walks. The tiles do not really add any special gameplay experience compared to a randomly generated world. If the tiles would also mean a change in the gameplay loop or the layout truely had an impact on how you progress other than getting your resources and making the walks longer and unfun, than that would have been a new gaming experience. But not in its current design form. The resource tiles are not adding any value other than to grind and make distances longer. \n\nThe art and design style is appealing and the game is easy enough to get into for a more casual experience. Combat is also quite simple and might turn some players off, as there is nothing but button smashing to do. Unfortuantely the controls are a bit poorely chosen. You cant rotate via mouse as in other isomometric games. No idea why they went with this unintuitive layout.\n\nThe story is short but interesting, but nothing I would call great. \n\nSo all in all you can have some fun for a few hours, but not a long term keeper.", "timestamp_created": 1685091155, "timestamp_updated": 1685091155, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.651732444763183594", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139573897": {"recommendationid": "139573897", "author": {"steamid": "76561198868168907", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 732, "playtime_last_two_weeks": 0, "playtime_at_review": 346, "last_played": 1686773751}, "language": "english", "review": "This game is a perfect example of the ones that you start playing, and next thing you know its 2AM and you just want to do one more thing. I am really pleased by how well the mechanics work at this point and the visual presentation is fantastic. As the developers continue to optimize the game I am sure it will run smoother on my older generation PC but I am happy right now with how pretty it looks. \nDefinitely digging the casual difficulty level so far and this makes it a much more relaxing experience than many of the other survival crating (plus zombies) games that I have tried.", "timestamp_created": 1685936534, "timestamp_updated": 1685936534, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.642527103424072266", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "141304484": {"recommendationid": "141304484", "author": {"steamid": "76561198331599612", "num_games_owned": 1253, "num_reviews": 12, "playtime_forever": 3076, "playtime_last_two_weeks": 0, "playtime_at_review": 2525, "last_played": 1690927872}, "language": "english", "review": "\n\n\n\n\n\n\nThis game gives you the option to go slowly, It's all your own pace and if you don't want to kill the 'lost souls' then just run around them. Of course for some advancements you have to kill. I've got 40 hours in and have done only half where others are doing ten hours and are done.\nFor me it's a great YES", "timestamp_created": 1688488226, "timestamp_updated": 1688488226, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.634210288524627686", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "146267388": {"recommendationid": "146267388", "author": {"steamid": "76561198072535461", "num_games_owned": 306, "num_reviews": 40, "playtime_forever": 735, "playtime_last_two_weeks": 0, "playtime_at_review": 735, "last_played": 1692178844}, "language": "english", "review": "It's a pretty good game with a great and innovative core mechanic. Sadly it turns into a walking simulator in the late game when all you do is run from point A to B to C to finish quests and gather crafting materials.", "timestamp_created": 1694677165, "timestamp_updated": 1694677165, "voted_up": false, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.630968630313873291", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139480820": {"recommendationid": "139480820", "author": {"steamid": "76561197972156817", "num_games_owned": 0, "num_reviews": 31, "playtime_forever": 2616, "playtime_last_two_weeks": 0, "playtime_at_review": 2615, "last_played": 1685885430}, "language": "english", "review": "I did enjoy this game, but it really left me wanting more. I just really wish we could see what this game could have been with a larger team. The story felt like there should be a lot more to it, the prologue talks about indigenous people in conflict with settlers moving into the area and your character being a product of that, but it doesn't really come up in the story at all. I thought you were going to be playing some kind of peacemaker between both sides, but there aren't really sides, just a few scattered individuals around. The artwork for the maps looks good, but the artwork for the animals and especially the characters has lower resolution. Music and sound effects are good. And honestly just more variety in the tiles would be amazing. I think there are enough environments, in fact the canyons and deserts could really be one environment just like the birch and pine forests are one environment. They could just be sandy or rocky variants of desert. So more tiles in terms of the unique tiles or just tiles with different resources. This is getting into the weeds, just in general I had fun, but felt like this could have been so much more if there had been more people working on it.", "timestamp_created": 1685800131, "timestamp_updated": 1685800131, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.62614142894744873", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "138968529": {"recommendationid": "138968529", "author": {"steamid": "76561199226673872", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 600, "playtime_last_two_weeks": 0, "playtime_at_review": 30, "last_played": 1696608012}, "language": "english", "review": "Wish list this since 21st Feb 2022; been waiting for it to be fully released since\nGot it a few minutes after it's released; progress from prologue was still there\n\nUnique game, Great Time Killer, Engaging Story\nLovin it so far\n\nEdit: Played for another few hours in the span of a few days...Still love it", "timestamp_created": 1685028130, "timestamp_updated": 1685720923, "voted_up": true, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.622846782207489014", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "149219877": {"recommendationid": "149219877", "author": {"steamid": "76561197987544734", "num_games_owned": 380, "num_reviews": 34, "playtime_forever": 1372, "playtime_last_two_weeks": 0, "playtime_at_review": 1372, "last_played": 1698703801}, "language": "english", "review": "No tool degradation \n\n10/10", "timestamp_created": 1698704409, "timestamp_updated": 1698704409, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.608741462230682373", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139126622": {"recommendationid": "139126622", "author": {"steamid": "76561198007050257", "num_games_owned": 1275, "num_reviews": 26, "playtime_forever": 1770, "playtime_last_two_weeks": 0, "playtime_at_review": 611, "last_played": 1685465609}, "language": "english", "review": "I have been looking forward to this game for a long time.  I had played it during a demo event and loved it.  Grabbed it soon as it came out and am taking my time really enjoying the game play.  It has a really neat mechanic that lets you place new area tiles down and explore as you go along so that you build your own map.  The quests are nice and give you things to explore and help you along your progression.  The building it pretty cool.  There was a problem early on with moving your items in your home but the devs listened to feed back and corrected the issue. They even replied to my first review letting me know the issue was fixed.  I like how you can build your home the way you want it to look.  I also like the how your house has a level and the better the building the higher that goes.  I also think leveling up the work bench is a good concept on progression.", "timestamp_created": 1685238973, "timestamp_updated": 1685284807, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.608521878719329834", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1685281950, "developer_response": "We are sorry that the hammer mechanic in the 1.0 version of Above Snakes was not to your liking and apologize for that. We received many reports in that regard and patched the game accordingly.\n\nYou can now move furniture, workstations, walls and roofs with your hammer without losing any resources (patch 1.0.2).\n\nPlease check out our patch notes here:\nhttps://store.steampowered.com/news/app/1589120/view/3698063796876350468\n\nIf these changes are to your liking and lead to a more enjoyable experience, we would greatly appreciate if you could update your review accordingly."}, "139245276": {"recommendationid": "139245276", "author": {"steamid": "76561198087322280", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1318, "playtime_last_two_weeks": 0, "playtime_at_review": 1250, "last_played": 1685417551}, "language": "english", "review": "This is a really fun game. As it states about 20 hours of main story game play if you are not rushing through. I really like the way you explore and build out your world just the way you want it.", "timestamp_created": 1685412129, "timestamp_updated": 1685412129, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.608389854431152344", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "146446576": {"recommendationid": "146446576", "author": {"steamid": "76561197966510539", "num_games_owned": 0, "num_reviews": 48, "playtime_forever": 1101, "playtime_last_two_weeks": 0, "playtime_at_review": 1101, "last_played": 1694924184}, "language": "english", "review": "Short game, runs out of steam near the end and some of the grind is tedious. I really like the tile set concept, but the limitation on them is frustrating, and deleting one shouldn't have a penalty when you can't reasonably tell which ones you need to place, and in the end some tiles you just couldn't connect, they provided a solution in the form of a mountain tile, but there is literally a mountain in the whole tile, meaning you still have to walk around it, wasting time and resources.\n\nThe story isn't that good, more so when you realize it's two white guys making up magical zombie native myths. But it didn't seem that offensive, just nothing too creative. The end was, uhh, just magic macguffins with little old native lady ghosts spouting nonsense. But the game cycle is good, the upgrade path is decent and the house building is fun, but limited in usefulness after you realize you can just drop a platform and bed and sleep anywhere. Fast travel requires a gathered resource each time, sprinting is limited, so missions that have you going back and forth are more tedious than anything.\n\nSolid 6/10 if you want a new farming game to craft up stuff", "timestamp_created": 1694924736, "timestamp_updated": 1694924736, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.60684657096862793", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139110983": {"recommendationid": "139110983", "author": {"steamid": "76561198030201204", "num_games_owned": 0, "num_reviews": 52, "playtime_forever": 736, "playtime_last_two_weeks": 0, "playtime_at_review": 612, "last_played": 1685304423}, "language": "english", "review": "There are some interesting systems in this game - build your own open world to explore and create homesteads in and decorate - but overall the game relies on grinding and filler rather than depth. The first new tile of a terrain gives you nearly everything interesting in that terrain, and building more of the basic terrain means nothing new but a longer travel time to the unique places you need to build. Unique places and quests get gated behind grindier and grinder resources, to the point where the game expects you to gather materials to build a farm and water plants for three days to get the ability to move to the next unique place, which is another arena battle out of three you have to win to move the plot forward, and then you have to go water plants for three days to open up the next arena battle.\n\nJust overall a slow game that wears out its welcome pretty quickly.", "timestamp_created": 1685222563, "timestamp_updated": 1685222563, "voted_up": false, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.604295790195465088", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "141391412": {"recommendationid": "141391412", "author": {"steamid": "76561198103341037", "num_games_owned": 355, "num_reviews": 14, "playtime_forever": 1172, "playtime_last_two_weeks": 0, "playtime_at_review": 1172, "last_played": 1686348289}, "language": "english", "review": "Heck yeah i recommend it.\n I was nervous about all the negative Nancy who - i guess played a different version? ? ? \n\nThe walk speed being too slow - personally i think it balances great (its not too slow, especially when you get to sprint around), it encourages you to make every trip count sorta deal. \n\nBut where i thought it would be too stressful playing a survival zombie game like project zomboid i was completely and utterly relaxed. Challenged of course, when i felt comfortable too. \n\nWhat a wonderful time, you quite literally get to move at your own pace with is a breath of fresh air for most. \nYou like zombies? its got it. You like too many zombies where you feel overwhelmed and sweat profusely? If i had wanted to put myself in that position i could have lol. \n\nYou dislike crafting cause you never get the materials the game needs you to get cause of dumb drop rate trances? So long as you know where to get it from, there will always be materials for you to gather within reason of course. (re spawn times and what not)\n \nYou get to design how your map is laid out too, that includes erasing world tiles and setting up a different one. \nThis game surprised me. I genuinely want to see more of it and this game concept for other stories as well. I really like how when you research certain world tiles, you know what you're researching for. For example, some tiles have Story Plots on them. Like a guy in a cabin deep in the forest, or, few people at a lone camp in the prairie, which i tend to focus down on when i am nice and comfy in my current game session with as much water or other resources that make me wanting to get out there and get adventurous. \n\nSpeaking of designing, you get to build your own fort, and get encouraged through passive benefits to keep building off of it. You do get to customize when it comes to the main characters gear which guards against either heat, damage, or cold... \n\n[spoiler] Bro you get a dog and it helps you when youre running around, picking up your loot and bringing it back You get to pet said dog. HOW PERFECT IS THAT?! And so far the zombies dont seem to try to attack your dog, so thats an added relief. [/spoiler]\n\nBut, before i ramble on too much and take the fun out of things, try this game out for yourselves, you wont regret it. Theres apparently a new game mode too, and I gotta go try it out.", "timestamp_created": 1688582890, "timestamp_updated": 1688582890, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.603721976280212402", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139610904": {"recommendationid": "139610904", "author": {"steamid": "76561199481546118", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 365, "playtime_last_two_weeks": 0, "playtime_at_review": 365, "last_played": 1685519799}, "language": "english", "review": "i really wanted to like this. But to me it was far too much forced interaction with AI characters, take on a quest and gather rss. But even though there are dialogue choices, I didn't have a chance to care about why I would want to help these other settlers, mostly I wanted to say I wouldn't help ...felt more like a free to play mobile game than a bought PC game. Unfortunately I try and give a game a chance before deciding not for me and I missed the refund option on Stream (first I have tried to refund)", "timestamp_created": 1686001142, "timestamp_updated": 1686001142, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.591233313083648682", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139041720": {"recommendationid": "139041720", "author": {"steamid": "76561198094060331", "num_games_owned": 0, "num_reviews": 42, "playtime_forever": 826, "playtime_last_two_weeks": 0, "playtime_at_review": 14, "last_played": 1705991015}, "language": "english", "review": "You can play the best part of the game for free. There is really no need to buy the game except to just complete the story. The free prologue is actually 25% of the entire game. There really just is not nearly enough to do in a game like this to justify the $24.99 price tag. Unfortunately I feel like this title is going to milk its players for money with DLC instead of just having a robust base game. For that reason, I'm refunding.", "timestamp_created": 1685132544, "timestamp_updated": 1685132544, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.590547323226928711", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1685187610, "developer_response": "Sorry to see you go. The prologue is 1-2 hours of gameplay while the campaign of the full game offers about 20 hours of gameplay (at least that is how long most people seem to take). We get that the progress % on the save game might be confusing, since it is not accurate. We will improve on that."}, "139000424": {"recommendationid": "139000424", "author": {"steamid": "76561198055181230", "num_games_owned": 483, "num_reviews": 7, "playtime_forever": 241, "playtime_last_two_weeks": 0, "playtime_at_review": 208, "last_played": 1685320757}, "language": "english", "review": "Overall, I think this is okay at best. I was excited when I played the demo a few months ago but here we are.\nAs others have said the gameplay loop is fairly simple, which is fine. Gather resources, get map, expand, repeat.\nThere isn't really a story, more of fetch quests with, \"Oh yeah this is happening.\"\n\nI have a couple nit-picks but really, my immediate negative insight is that some things just don't seem to respawn. \nKill 2 deer that spawn in forest, they haven't come back after 6 day cycles. No deer = no hide = no progression.\nInstead I found myself 'scooping' up water to quickly get a map tile so I can erase the one I have and immediately replace it with a copy that Miiiight have a spawn of deer? What!\n\nAnother comment mentioned not being able to teardown your base to move things, maybe I want a window over here or maybe I want to move my bookcase. While I agree that, for 'balancing' you shouldn't get 100% of your stuff back, at least set up a system that allows you to move items you've built within the tile they are in if you're worried about people packing up their base and moving it across the map.\n\nZombies also don't seem to respawn, after you've cleared a tile they just don't come back it seems which is vastly different from the demo where you'd see 3-6 a night. I've seen 2 on the map, in a single tile, at one time. \n\nA couple small things, it's cool you have a 3 item cooking process but ffs let me batch cook.\nIf you're not going to make the cooking automated like the crafting of items then let me have a button that says, 'cook all' or 'repeat recipe' \n\nAnyways, I'll probably finish it. By the sounds of it it isn't a very long 'story' so since it's a game that takes more than 2 hours to dig in and get it I may as well.\n\n--If you enjoy slow, crafting/building, aesthetic, grind survivals than this isn't terrible. It's just boring.", "timestamp_created": 1685074461, "timestamp_updated": 1685074461, "voted_up": false, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.58992534875869751", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "154687275": {"recommendationid": "154687275", "author": {"steamid": "76561198009289583", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 5028, "playtime_last_two_weeks": 0, "playtime_at_review": 1982, "last_played": 1704512500}, "language": "english", "review": "I really liked this game! 90% relaxing, 10% frustration on my part. Progress is very tile dependent, which is fine. Home building, looting, crafting, hoarding were all enjoyable. Just a really nice relaxing game, good story. I believe the team has plans for some DLC/ more content which will be nice, and give a chance to close some open plot \"holes\".", "timestamp_created": 1703826174, "timestamp_updated": 1703826174, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.589349091053009033", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139049781": {"recommendationid": "139049781", "author": {"steamid": "76561198043990015", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 1208, "playtime_last_two_weeks": 0, "playtime_at_review": 1208, "last_played": 1685141747}, "language": "english", "review": "Cannot recommend this game in it's current state. Too many bugs, poor QoL, very dull overall. Perhaps with some updates it could be good or even great, but it's rough. M yplaytime shows 20 hours but it was more like 15 because I was AFK with it open for quite a bit. Here's what I found wrong with the game IMO:\n\n***SPOILERS***\n\nFishing spots don't respawn unless you die, or log out and back in.\nRespawn rates in general are very poor when you need a lot of materials.\nbuying from stores is a joke, extremely expensive items, little sell value of your items.\nevery single item in the game doesn't feel like an improvement. only does modernly more damage. You only need teh next tier because the game locks materials behind the net tier.\nItems dont present themselves logically. For example, you finally get a winter jacket and become immune to cold, then you have the ability to get additional cold protection after you're already immune. Also I never was able to even make that item because the drop rate on a polar bear was so bad. it wasnt even nessecary anyway because you get the next tier of armor quickly. Also this leaves a gap in protection because you cant wear that coat in hot environment which is the rest of the game.\nYou unlock Silver ore after gold, when gold is better. I crafted Silver axe/pickaxe/gun and literally never used them, I beat the game before I killed any monster.\nmine cart system for ores is completely unbalanced. Grinded to make a long mine track and it gave hardly anything and wasnt nessecary.\nDialouge and story options are super flat. Your choises do not matter at all. side quests are completly useless.\nkesy are completely useless. A common key cost 50 gold, so it should be giving you 50+ gold of value right? no, you get rocks, or 1 hide, useless.\nThe wolf cub you get is annoying and digs around but you get basically nothing from it, again like 1 hide or a bone\nthe lake tile is completely useless, you literally can't even access it. there's nothing on it anyway\nThe map is hard to plan out effectively without knowing what the pieces look like because they are grayed out with a lock on them so you have to unlock all tiles in the biome before you can plan out the map. Re-inking is expensive overtime.\nThe map is \"lockable\", meaning you can create dead zones you can never build in based on the pieces that are avaiable, which makes ground navigation annoying\nthe map is only rotatable to the corners of the tiles, not the sides. this makes navigating certain tiles really difficult like the canyon, villages, or tiles with a building on it because the obsticles cover your view from walking or seeing a door.\nrocks and trees can make your homestead delete itself. had several cases of things because deleted after save quitting and coming back. you lose all reasources from it too it doesn't break it just literally disappears.\nbreaking down your home doesnt give full resources back, admittedly this is a minor complaint but some resources early are difficult to obtain. Building a homestead is basically useless, you dont need a \"base\" to play the game.\nalso why is the cheapest and nicest looking building pieces at the end of the game? making wood planks and boards are way more obnoxious to build than using just rocks.\nMy Tara Brown quest glitched, I chose to kill her but she was unkillable so I have a quest I cannot complete even after finishign the game. cannot target her with any weapon rifle or bow, and cannot blow her up using TNT. Also the end of the game goes over the things you did to help everybody and it said I was a  good person for letting her live, but I didn't let her live (well i guess I did because I couldnt kill her but still)\nOnly one fast travel point you can place is very annoying, you get to the point in the game where you have to run back and forth between your base and the progressing areas, took me hours for no reason.\nCook book is mostly unnecessary after you get water and fish/meat.\nbosses and game difficult in general is jokingly easy. Only died because I afkd and something randomly decided to attack me.\nWhy does the game take 3 minutes to load after a death or boot? so incredibly long.\ncombat system is extremely basic, you don't even get a real weapon. I guess your axe is the weapon but feels kinda cheap and not much expression there. Bow, and later rifle, is completely broken because everything moves so slow and basically gets stunned when you hit it. However the combat aiming is also completely broken and your arrows will fly off in some completely random direction because there's some sort of auto aim assist.\nshop owners wont let you shop with them if you choose another dialogue option first, you have to close the dialoug and reengage with them to open the shop.\n\nArt direction is nice... Concept is super cool... Could be such a smoother diamond but for right now its rough rough. I hope the dev/devs can make a ton of improvements as I would love to recommend this game and I see so much potential. Don't regret making the purchase but the value is pretty horrible right now.\n\n", "timestamp_created": 1685143346, "timestamp_updated": 1685143346, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.588821113109588623", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "146197735": {"recommendationid": "146197735", "author": {"steamid": "76561198097541926", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 2426, "playtime_last_two_weeks": 0, "playtime_at_review": 2426, "last_played": 1694053360}, "language": "english", "review": "It becomes repetitive after a few hours and the story was not engaging at all", "timestamp_created": 1694566401, "timestamp_updated": 1694566401, "voted_up": false, "votes_up": 10, "votes_funny": 2, "weighted_vote_score": "0.588074147701263428", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139106285": {"recommendationid": "139106285", "author": {"steamid": "76561198122568593", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 490, "playtime_last_two_weeks": 0, "playtime_at_review": 490, "last_played": 1685082865}, "language": "english", "review": "This feels like a game where if they spent a little more time thinking about the mechanics they put in the game it could of been great. \n\nProblems:\nThe tile system is cool but it never amounts to anything beyond spam the same tile over and over to get the resource to get the next tiles. \nThere is a sanity meter that does nothing except punish you for looting zombies. \nCombat feels awful. The bow is really wonky to aim. Swinging at enemies feels weird. There is a roll dodge mechanic but combat is easier to just face tank enemies and kill them or just shoot them with the bow. \nThe fact that the horse isnt ride-able is a sin. \nThe decorations in the house are not intractable. \nThe dialogue is very stiff and some lines repeat in the same conversation. There also doesnt seem to be any sort of registration that you already talked to the person so you end up repeating the same long conversation just to get to the characters shop option.\nFarming shows up waaaaay to late in the game for it to mean anything. \n\nIdeas to fix them: \n\nThe tile system should of had a puzzle aspect to it where you had to get the right tiles to line up in order to unlock the quest tiles. You put all these different tile types in but there is no real need to do that. Also would of been a cleaner look to have the tiles blend instead of the cracks running through everywhere. \nSanity meter either needs to go away or increase the loot that zombies have. There is basically zero reason to fight them unless they are in your way. Even at night you just walk past everything. \nCombat needs to get refined.\nMake housing decorations useful. Let me put clothes in the dresser. Let me put books on the shelf. Let me sit by a fire in my house with my dog. \nFarming just needs to be in earlier. Im 8 hours in and I just now unlocked it and I dont feel like I'm taking my time with this game. Farming will give a sense of daily tasks to do. This could also help the cooking and meal mechanic that feels lack luster. \nLet me ride the horse. I have 80 tiles in my game and the only fast travel spots are so close it doesnt make that much of a difference to have that sort of fast travel. \nFrom what I can tell the dialogue is translated to English so that may be the root of the stiffness but maybe give it another pass over and check for the duplicates. I think the fisherman had the most issues with that for me. \n\nEnding thoughts:\nThis could of been a very cool game but it just felt lost. The tiles concept is cool but outside of that it felt like they didnt know what to do. Either commit to a cozy chill game or have a bunch of mechanics. It sits somewhere in between where the cozy gamer will get frustrated with the resource grind and lack of intractability with your home. The more intense survival craft gamer will get bored with the shallow mechanics and poorly done combat.\n\nI will still finish this game and will update if opinions change.", "timestamp_created": 1685216914, "timestamp_updated": 1685216914, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.584884166717529297", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "138984432": {"recommendationid": "138984432", "author": {"steamid": "76561198053408270", "num_games_owned": 0, "num_reviews": 33, "playtime_forever": 5772, "playtime_last_two_weeks": 0, "playtime_at_review": 5727, "last_played": 1685348093}, "language": "english", "review": "If you're looking for a chill survival game that also has a story, this might be a game for you. I love the tile mechanic, which allows you to build your own world as you go. There's a nice progression in the game, which made me feel good every time I unlocked something new. The cooking was fun for me, too, as you can play around and discover your own recipes.\n(If you're expecting hardcore-survival, you won't be happy with this game.)\n\nWhat for me could be improved: The story is nice, I like that there is one and it's also not bad, but I didn't really connect with Aiyana and her story. I wish I did. But maybe that's just me...\n\nThere's still a free Prologue, which lets you play the beginning of the game to try it out.\n\nI was a Kickstarter backer and have played since the pre-alpha (which also explains the many game hours Steam already shows). It was a great experience to see how the game evolved. The developers are very involved with the community and open to feedback, which added to the experience :-)", "timestamp_created": 1685047448, "timestamp_updated": 1685047448, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.576235949993133545", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "144757433": {"recommendationid": "144757433", "author": {"steamid": "76561197976488660", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 1557, "playtime_last_two_weeks": 0, "playtime_at_review": 1531, "last_played": 1703129130}, "language": "english", "review": "Well I was really hoping to like this. I ran out of a crafting ingredient which I cannot seem to get, but hear that I can get it after I pass a certain area which does not really make sense. Also all the tiles that you lay down do not match up with the other biomes which I thought you can mix up all biomes with all tile combinations. I put in a good 25 hours and really enjoyed them until I am stuck at this one area where I cannot progress without this certain ingredient. I am hoping they will fix some of these things in the future updates, but in the meantime I will be uninstalling this until some major update happens where the limitations are fixed.", "timestamp_created": 1692663096, "timestamp_updated": 1692663096, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.575828433036804199", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1692692395, "developer_response": "Glad to hear that you enjoyed the game so far!\n\nIf you let us know what ingredient you are missing, we are happy to help. I am sure that it is just hidden very well somewhere and we would be able to help you.\n\nIn case that you really ran into a bug, we are happy to fix your save file if you send it our way (via community discord or to tobi@squareglade.games).\n\nBest regards,\nTobi"}, "143491578": {"recommendationid": "143491578", "author": {"steamid": "76561197975856762", "num_games_owned": 440, "num_reviews": 25, "playtime_forever": 1967, "playtime_last_two_weeks": 0, "playtime_at_review": 911, "last_played": 1693231062}, "language": "english", "review": "Nice little Game. Deeper than you think at first glance.", "timestamp_created": 1691285673, "timestamp_updated": 1691285673, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.574468076229095459", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139375267": {"recommendationid": "139375267", "author": {"steamid": "76561198311739822", "num_games_owned": 0, "num_reviews": 36, "playtime_forever": 523, "playtime_last_two_weeks": 0, "playtime_at_review": 290, "last_played": 1686091045}, "language": "english", "review": "I can't take it any more. I played 200h of Force of Nature 2, which is a very similar game. I enjoyed every minute of it. I've been trying to work out what it is that makes this game dull and tedious and completely devoid of fun. Here is what I can come up with.\n\nThere is no sense of discovery. FoN2 kept me playing because I was excited to see what come next. It never disappointed, each biome required new praparation and a different approach. In this game, all tiles look and feel the same. You know what you're gonna get. Land =/= exciting place to explore. Land = more running, longer distances.\n\nIn FoN2, every area was full of enemies you had to defeat before you could gather resources. In Above Snakes, you can find the odd zombie here and there. What I'm unhappy about is what they replaced fighting with. They introduced boring time sinks. You run long distances every day between destinations. It feels like a running simulator. You have to wait/hope for respawning resources. Hunger and thirst make you spend entire days gathering to satisfy these needs, there is zero point to it other than a time sink.\n\nThere is no replayability. It does not matter where you put your tiles. The steam page says things like \"endless replay value,\" which is completely bogus and deceptive. It is okay that the game is not for everyone, I can accept that I got unlucky with this one. However, this sense of false advertising is what triggered me to post this review eventually.\n\nFull disclosure, I only played about 5h (in about 5 sessions), which translates into 35 in-game days. I have unlocked the native settlement and made the leather boots, after which I had no will left in me to continue. I see no point as I figure the rest of the game will be more of the same thing. Even the writing is boring. The quests are like... post my mail for me, make my boots for me, etc. Honestly, I can't.", "timestamp_created": 1685632281, "timestamp_updated": 1685632281, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.572968780994415283", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139048485": {"recommendationid": "139048485", "author": {"steamid": "76561198000762494", "num_games_owned": 482, "num_reviews": 58, "playtime_forever": 604, "playtime_last_two_weeks": 0, "playtime_at_review": 511, "last_played": 1703627384}, "language": "english", "review": "Skinning a rabbit drops antlers 10/10", "timestamp_created": 1685141228, "timestamp_updated": 1685141228, "voted_up": true, "votes_up": 4, "votes_funny": 5, "weighted_vote_score": "0.569378018379211426", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139326895": {"recommendationid": "139326895", "author": {"steamid": "76561197965396869", "num_games_owned": 0, "num_reviews": 237, "playtime_forever": 610, "playtime_last_two_weeks": 0, "playtime_at_review": 610, "last_played": 1685501744}, "language": "english", "review": "The developers have been very quick to patch issues and tweak the game based on player feedback and I decided to mention that first because it's impressive that there have been so many quick fixes for issues in such a short period of time.  Many larger developers can't or don't do that so it's clear that Square Glade Games cares about its product and its customers.\n\nOne interesting core gameplay mechanic is that you create the game world from tiles.  You start off with a very small world and expand the world using tiles as you play.  There are some tile placement rules but they're pretty simple.  Tiles have to transition from one biome type into another gradually.  That means you can't plop a snow biome next to the desert, or a plains biome next to a lake, you have to use pieces that have both biomes on them to join the major biome types together.  It's actually a bit like a puzzle and you do have to think about how you're placing tiles.  If you're careful you can keep most of the special locations fairly close to your initial tile but you don't have to.  Beyond the tile placement rules I mentioned you pretty much have full freedom of where to expand the game world.  If you want to place things very far apart - you can and the game does have some limited fast travel so that won't hinder you too much.  I haven't found the boundaries of the map, nor have I run into any kind of tile limit other than the fact that there are some unique tiles that can only be placed once because they're essentially \"story\" tiles that will move the narrative forward.\n\nCombat is simple but it works fairly well and the farther your progress the more combat you'll probably encounter.  I don't have a lot to say about it.  Click to attack, right click to attack with your ranged weapon, space to dodge roll.  I haven't met any truly challenging enemies yet and I'm a bit past the halfway point so if complex or very difficult combat isn't your thing then you'll be fine.\n\nThe game also has a heat/cold system so you have to wear biome appropriate clothing or you freeze or overheat and slowly start taking damage.  It's not hard to manage once you have the right clothing.  I just have my cold/warm weather chest armour on my hotbar so I can swap whenever it gets cold at night, or too hot in the desert, or whenever I wander into the snow biome.  Walking into the desert wearing fur lined armour should be uncomfortable, and going into a frozen arctic-like biome should be deadly if you aren't wearing warm clothing, and for me it's one of those little immersive touches that I really like to see in games.\n\nGathering will take up most of your time and it can feel a bit tedious when you collect your 30th or 40th plant, or you have to cut down 3 or 4 fields of wheat just to get a dozen wheat, but that's one of the things the developer has been tweaking so that the grind is reasonable.  Luckily you can eventually build crop plots that will yield 2 crops for 1 if you don't fertilize and water them so you can always keep a supply on hand and that drastically cuts down on how much harvesting you have to do.  It's especially helpful for plants that grow in biomes you've placed farther from your base.  Trees, rocks, and ore are gathered using an axe or pick, and you can also harvest some resources from trees by holding the harvest key before cutting them down.  Not quite sure why you can't just chop the tree and get all the resources at once but you can't (hopefully the dev. will address this to further reduce the gathering tedium that can build up pretty quickly).\n\nSpeaking of your base - you aren't limited to one base.  You can build almost anywhere and can build multiple bases if you want to.  Expand as much as you want, move base pieces around if you don't like the current configuration (another recent positive change made by the devs.  Before the change you had to dismantle items to move them which meant losing a few resources, and then re-build.  Anyway how and where you build becomes up to you once you get beyond the initial \"tutorial\" section. Building is pretty simple and as you level up your crafting bench you unlock different things.\n\nThe game's got hunger, sanity, thirst, and fatigue systems in addition to health that you have to manage but it's generally pretty easy to deal with.  Sleep, drink certain beverages, or stand near a cooking fire to replenish fatigue.  Some foods regenerate multiple things, some occasionally have negative effects such as consumables that raise food but lower thirst or raise thirst but lower health.  You can hunt several critters for food and other resources and can go fishing to obtain fish oil and fish that you can cook into one of the best foods in the game - fish skewers.\n\nOverall the game is a fairly slow burn but it's generally well designed with a few things here and there that tell you this is a less experienced developer that had limited resources but that only adds to the charm.  I'm pretty impressed with this game and I'm very likely going to play it through a second time once I finish it and I plan build the world in a very different way when I do just to see how that affects the way the game plays and feels.\n\nI can definitely recommend this one, it would be well suited to anyone who wants a less hectic zombie survival game with a story, and while the tile system is fairly simple its fun to build and expand the world.", "timestamp_created": 1685551113, "timestamp_updated": 1685551113, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.566644787788391113", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139049135": {"recommendationid": "139049135", "author": {"steamid": "76561198058967990", "num_games_owned": 0, "num_reviews": 55, "playtime_forever": 1171, "playtime_last_two_weeks": 0, "playtime_at_review": 223, "last_played": 1685824794}, "language": "english", "review": "I'm doing this review because... well, I can, as a valued customer. I'm 4 hours in and it's just kind of boring. I don't get it, the demo was really like oh wow this is going to be cool... but now playing the actual game... it's like a mindless mobile game or something. I'm genuinely feeling I'm playing a max 10-12€ game with the 22€ I paid for and that's pissing me off enough to not recommend it at this point. Pretty harsh maybe considering the playtime but I'm sure if a reason to change my mind appears, I will. And for that money I'll suffer the boredom no matter what. Besides the devs seem nice and active and the game's been out like a day so I'm not saying this is hopeless. But something exciting better happen to the literal world in the game or a lot of people will be disappointed. \n\nThough if you want something numbingly chill with no hurry or care in the world... THEN this is for you, sure, why not.\n\nEdit 1: Still utterly and hopelessly disappointed. I'm nearing the end of the game and I am STRUGGLING with it.\n\nThe only positive improvement was the ability to move your base parts and such without having to destroy them... but what is the point in that when base building is absolutely pointless otherwise? It's not creative either so there's no fun coming from that side. All you have to do is slap down a few floors where you can place your bed and cartographer table (sure you can make a 2x2 if you need the perks).\n\nThey did add some silly little event that had no point and there was some kind of magical improvement done too which makes half of the users games lag like no tomorrow (including mine). I'm just so disappointed I literally can't say these things in a nice manner anymore.\n\nAnd what else... oh, the map pieces. In the beginning it was fun but now towards the end it's so infuriating how none of the pieces fit anywhere so you have to destroy your old ones which means endless dull grind for beeping berries and feathers. Thankfully half of the map pieces become useless after they serve the purpose (getting items and such needed for that stage) so its no big deal removing them.\n\nWhat made me stop the game and start angrily writing was my armor. You grind and do quests for the cold climate armor then use it for 5 minutes until you don't need stuff from that area anymore and when you enter the hot climate... your armor will be harmful to you so you can't wear it anymore!! Where is the logic!??\n\nI did allow comments now but I'd really like to NOT hear from the developer unless you can arrange me a refund. I'm so mad I STILL think I should get it.", "timestamp_created": 1685142289, "timestamp_updated": 1685748683, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.565743029117584229", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "141262138": {"recommendationid": "141262138", "author": {"steamid": "76561198054997988", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 989, "playtime_last_two_weeks": 0, "playtime_at_review": 989, "last_played": 1688439709}, "language": "english", "review": "Feels incomplete.  There isn't really an exploration, it's just lots of grinding to craft the next thing you're told to craft.  Usually this involves running back and forth between biomes that can't be placed next to each other.  I think the different biomes would have been more fun if there was some point to them beyond just manually gathering resources.  Most of the crafting upgrades are meaningless, I played the entire game with the 2nd or 3rd wood axe, then crafted the additional axes just to do it.", "timestamp_created": 1688440017, "timestamp_updated": 1688440017, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.565630435943603516", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "138966803": {"recommendationid": "138966803", "author": {"steamid": "76561197966597699", "num_games_owned": 561, "num_reviews": 10, "playtime_forever": 2542, "playtime_last_two_weeks": 0, "playtime_at_review": 2372, "last_played": 1685877298}, "language": "english", "review": "\"Above Snakes\" is just a wonderful, cozy game you can play at your very own pace!\n\nBuild your own world, explore it, hunt deer, catch fish, fight zombies!\nAnd when you're done, continue exploring the story of Aiyana, the city of Corpse Creep and what happened to its residents!", "timestamp_created": 1685025994, "timestamp_updated": 1685025994, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.565317034721374512", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139004933": {"recommendationid": "139004933", "author": {"steamid": "76561198004662737", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 321, "playtime_last_two_weeks": 0, "playtime_at_review": 321, "last_played": 1685082843}, "language": "english", "review": "5 hours in and im still feeling like im in the tutorial, the game is way to easy every quest i have got thus far was for gear progression, they have almost nothing to do with the main story. The quests were fun the first few times but got repetitive very fast, gearing up quickly just became a grind fest and time sink with no challenge and little feeling of accomplishment. Most the quest just feel like side quest yet they are built into the main story chain. if you want to play a better zombie, crafting survival game go play Dysmantle. Otherwise the only thing i feel this game has over that one is the self map gen.\n\ni may came back to this game if i see a major update, but as it is one thing id like to see is a reduction in the required resource farming and let me remove map section freely without needing to run around and mindlessly wast a few min gathering basic resources, its that kind of shit that just make the game boring.", "timestamp_created": 1685083602, "timestamp_updated": 1685084897, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.5625", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140401093": {"recommendationid": "140401093", "author": {"steamid": "76561198014863727", "num_games_owned": 425, "num_reviews": 79, "playtime_forever": 66, "playtime_last_two_weeks": 0, "playtime_at_review": 66, "last_played": 1687159677}, "language": "english", "review": "I'm conflicted about this game. I decided not to refund it, but to point out the problems here in a review.\n\nAlthough there's a lot of ambition here, and I really wanted to like this game, I find after playing for an hour that I was feeling frustrated and bored, not engaged.\n\nAt its root, it's yet another scavenge-build-explore survival game, with the serious problems such games often have. Much of your playtime is just repeating the same actions to get enough food and water to keep playing; in terms of fun, that's just wasted time; adding the day/night cycle and monsters at night means that travel time becomes another time sink with no fun payoff.\n\nThe two things that I hoped would save the game are the tile-based world building and the exploration story. If I weren't wasting so much time collecting berries and wondering where to find water after the first nonrepeatable bottle, I think the idea of rearranging the tiles to facilitate your adventure would play well.\n\nThe story is a bit thin, but having one at all is a step up from most \"survival\" games. Again, if I wasn't wasting so much playtime on repetitive gathering, the extra impetus to lay new types of tiles and explore their terrain might actually have been seminal, in the same way that Slay the Spire or FTL created new genres.\n\nThey've announced they are playtesting a \"new game mode\". If that new mode drops the hunger/thirst mechanics completely to let us concentrate on the fun stuff, I'll be excited to revisit this game.", "timestamp_created": 1687285609, "timestamp_updated": 1687285609, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.560439527034759521", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139442259": {"recommendationid": "139442259", "author": {"steamid": "76561197992034913", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 882, "playtime_last_two_weeks": 0, "playtime_at_review": 882, "last_played": 1685491325}, "language": "english", "review": "not enough content/quality for the price tag. short story, good potential unrealized.", "timestamp_created": 1685737771, "timestamp_updated": 1685737771, "voted_up": false, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.559054732322692871", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139251907": {"recommendationid": "139251907", "author": {"steamid": "76561198289631653", "num_games_owned": 21, "num_reviews": 1, "playtime_forever": 3531, "playtime_last_two_weeks": 0, "playtime_at_review": 2228, "last_played": 1688032929}, "language": "english", "review": "Alright, this is a very lovely game, if you are looking for something to kill time and slow building game(farming game?). The story line feels like a very long training session about how to build everything in this game. I do love this game, so here is an idea for the developers:\n\n1. DLCs can be about new town and new kinds of tiles. (charge us about 2-3 dollars per DLS seems fair)\n2. You have to give the dog/wolf a home, it's tagging along is buggy and not really useful. I think we should have options to leave it home or guard the home tile(maybe)?\n3. We need to do something about the ram usage.  I have pretty high end PC with with recent generation cpu, current generation gpu, 32g of rams, but it seems like it is not enough anymore. (the ram got fill up so quickly when I run around covering more land, I'm thinking load only the tiles on and around the screen?)\n\nNow, something me as a player wants(call them my wishes):\n1. I want to build a second and even third floor.\n2. Can we please have more than one of that horse thing?\n3. I want to build a dock and a boat.\n4. Can we please have the option to upgrade our bags?\n5. Maybe have different sizes of the plant farm? It took me a whole game day every time I harvest and plant them again.\n6. I miss the cave(golden bars, I know I do not need it to craft anything rather than the ring. I just want a whole box of it and just like at them time to times lol).\n\nFirst-time comment on steam, these may sound like nagging(sorry if it feels like that). I think this game is really something guys, so do not give up on perfecting this game.", "timestamp_created": 1685426509, "timestamp_updated": 1685559101, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.558961033821105957", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139453422": {"recommendationid": "139453422", "author": {"steamid": "76561198032154580", "num_games_owned": 554, "num_reviews": 48, "playtime_forever": 626, "playtime_last_two_weeks": 0, "playtime_at_review": 626, "last_played": 1685756520}, "language": "english", "review": "I really liked the demo and bought the game but got very bored around 10 hours in. I got to the point of unlocking mines and it's just the same gameplay loop of collecting items to unlock new tiles then collecting more items to hand in for a quest. The tile system is fun and interesting but the game itself gets too repetitive after a while. I don't mind grinding in games but this couldn't keep my interest or make me want to keep going. My save file says I am 69% complete.", "timestamp_created": 1685756566, "timestamp_updated": 1685756566, "voted_up": false, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.557220697402954102", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139060770": {"recommendationid": "139060770", "author": {"steamid": "76561199207438627", "num_games_owned": 379, "num_reviews": 28, "playtime_forever": 6, "playtime_last_two_weeks": 0, "playtime_at_review": 6, "last_played": 1685160652}, "language": "english", "review": "STEAM DECK REVIEW - Handheld Only. Frame Buffer tested at 2GB and then 4GB. Cryoutilities Optimised Settings.\n\nFirst load, the cut scene lagged and stuttered really badly. After skipping it, the game just runs generally choppy. It just wasn't a pleasant experience so I restarted and tweaked some settings. It wouldn't even get passed the first load screen after that :(\n\nReset all settings, reinstalled and restarted. Still couldn't get passed the intro load screen.\nIf you're looking for a steam deck title to play, this isn't it unfortunately and it would have been ideal.", "timestamp_created": 1685161106, "timestamp_updated": 1685161106, "voted_up": false, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.557022809982299805", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1685187360, "developer_response": "Hi and sorry to hear that there were some technical problems with the game on your Steam Deck. We would be incredibly happy to be able to be in contact with you (e.g. via our community discord) so solve this.\n\nThe game is Steam Deck verified and multiple review sites and Steam players (and also we ourselves of course) confirmed that the game runs smoothly on Steam Deck. Therefore we think that there might be some other problem with your specific configuration.\n\nAs said, we would love to talk and solve this."}, "139557484": {"recommendationid": "139557484", "author": {"steamid": "76561198076311320", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 746, "playtime_last_two_weeks": 0, "playtime_at_review": 746, "last_played": 1685907928}, "language": "english", "review": "12 hours of fetch quests, with a weak story.", "timestamp_created": 1685908102, "timestamp_updated": 1685908102, "voted_up": false, "votes_up": 5, "votes_funny": 2, "weighted_vote_score": "0.556424736976623535", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139177911": {"recommendationid": "139177911", "author": {"steamid": "76561197970290746", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 1129, "playtime_last_two_weeks": 0, "playtime_at_review": 630, "last_played": 1685899959}, "language": "english", "review": "First of all, this is NOT a game that is intended to be some hardcore survival challenge.  Negative reviews saying \"its easy\" are true, yes, it's easy, it's supposed to be.   I would call this \"casual survival\", and with that goal, it does a fantastic job.  The tile mechanics are very reminiscent of a little niche game called Forager, and it works great.\n\nIf you want something relaxing and light hearted, this will work great for you.  If you are looking for serious challenges with lots of dying and harsh survival conditions, this is not your game; so avoid it and avoid writing a negative review because you didn't understand what you were getting into.\n\nAs for the duration?  I pay $24 at McDonald's for a family of four... and the meal lasts 30 minutes; so those arguments are completely invalid.\n\nGreat game, try the prologue first, which is free and see if its your cup of tea.", "timestamp_created": 1685307501, "timestamp_updated": 1685307501, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.555645465850830078", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "138979008": {"recommendationid": "138979008", "author": {"steamid": "76561198004712211", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 272, "playtime_last_two_weeks": 0, "playtime_at_review": 249, "last_played": 1686379561}, "language": "english", "review": "As a Kickstarter backer I have played the game for a couple of hours now - and so far I can say that this is a diamond in the rough. Is it worth your money? That depends on what you want.\n\nThe game's unique world-laying mechanic is a really clever idea which allows you to create a western landscape of your own choosing. In other games, you will need to learn the map. Here, you get to know it intimately while bringing it into existence. Be careful with you placement though. In the early hours of the game at least it is quite easy to create a situation where you cannot really connect between two pieces (I had a triangle which needed forest, grassland and lake and I did not have the appropriate piece, so for now I am forced to take the long way around repeatedly...)\n\nThe gameplay itself is solid, if somewhat on the grindy side. The flow of the survival mechanics needs some polishing. Do not go about in the correct order and you can lock yourself out of the necessary progress. For example, animals do respawn extremely slowly (if at all; after 5 days ingame the watering places are still empty) and since you need leather to progress you can either create a forest full of little lakes, ruining the immersion, or prepare yourself for a long waiting time.\n\nThere are other minor grievances: Bows shoot immediately and aiming (at least with the mouse) is somewhat difficult, as the directions are quite strict. I have not yet found a way to keep the bow drawn. To my knowledge, crafting tables also do not use materials stored nearby (or the radius for the storage chests is very very small).\n\nBut the story so far is interesting and I am looking forward to play more - in the hopes of a lot of future patches. Thumbs up, especially since this is clearly a work of passion!", "timestamp_created": 1685040727, "timestamp_updated": 1685040831, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.555145561695098877", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140191480": {"recommendationid": "140191480", "author": {"steamid": "76561198041536466", "num_games_owned": 0, "num_reviews": 47, "playtime_forever": 3500, "playtime_last_two_weeks": 0, "playtime_at_review": 3500, "last_played": 1686968141}, "language": "english", "review": "I'm not sure if you should buy this game or not. You probably shouldn't unless it's on sale.\n\nThe first  half of the game is reasonably fun and you feel good about building (both the world and your home) and collecting things to improve your building and so on. But then you realize that the game still has hours of story left and it basically becomes a glorified fetch quest for the later half of the game. The fact that you have to build a world tile farther away from your home to spawn it makes each trek out of your home worse and worse. It's not really worth it to build a new home there since the fast travel system encourages you to stay near the one you built and use it to go across the map. Even then the fast travel points are placed by the user so they're often far away from the actual tile you need to go to.\n\nAlso the story is bad, the writing sounds like I'm talking to a quest board and no interaction with any NPC in this game produced any sort of emotion other than \"I have to talk to this guy to complete my quest and get another one or else I can't do anything because he has the tile pieces I need.\" The story itself is the most bland story: there are zombies, man how'd that happen, good job you fixed it, credits.  Then my game crashed in the credit screen. :/\n\nIt's okay. Probably worth like $10-$15 and it's not worth it to finish it just play it for the neat mechanic the stop when you feel like it.\n\nLeft the game on in the background a lot because the latter half is so boring, and just fyi it does NOT like when you alt tab.", "timestamp_created": 1686969091, "timestamp_updated": 1686969577, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.555071532726287842", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "141355323": {"recommendationid": "141355323", "author": {"steamid": "76561198030754781", "num_games_owned": 0, "num_reviews": 98, "playtime_forever": 1860, "playtime_last_two_weeks": 0, "playtime_at_review": 185, "last_played": 1689337560}, "language": "english", "review": "Straightforward and simple little game without surprises, negative or positive. Good for the occasional lazy, rainy afternoon.", "timestamp_created": 1688546653, "timestamp_updated": 1688546653, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.554455459117889404", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139036467": {"recommendationid": "139036467", "author": {"steamid": "76561198078335352", "num_games_owned": 278, "num_reviews": 68, "playtime_forever": 2907, "playtime_last_two_weeks": 0, "playtime_at_review": 251, "last_played": 1697764747}, "language": "english", "review": "One of the most unique and impressive games I've got the pleasure to experience so far in 2023.\nFrom the simple and attractive world building design to the story which, to be fair, reminds me of a certain creepy pasta story centered around zombies in the Wild West, this is truly a gem to enjoy!\n\nI give this a jackalope and a domino of falling trees/10 <3", "timestamp_created": 1685126477, "timestamp_updated": 1685126477, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.554455459117889404", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139194884": {"recommendationid": "139194884", "author": {"steamid": "76561198077628967", "num_games_owned": 162, "num_reviews": 4, "playtime_forever": 447, "playtime_last_two_weeks": 0, "playtime_at_review": 333, "last_played": 1708393754}, "language": "english", "review": "Above Snakes quickly became AT LEAST one of my top 3 favorite survival games. It's uncomplicated, well designed, and a joy to explore the world instead of a chore- just make sure you're changing that camera angle to see everything! I've played 5 hours STRAIGHT (genuinely, no breaks) so far and have barely scratched the surface of what's on offer. We're only a few days after launch and the devs have already been hard at work implementing QoL changes players have asked for.\n\nGrab the game, friends.", "timestamp_created": 1685336640, "timestamp_updated": 1685336640, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.554054081439971924", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139483484": {"recommendationid": "139483484", "author": {"steamid": "76561198024166825", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 883, "playtime_last_two_weeks": 0, "playtime_at_review": 883, "last_played": 1685796926}, "language": "english", "review": "Cozy crafting game with a nice story. You can build your own world with tiles.\n", "timestamp_created": 1685803473, "timestamp_updated": 1685803473, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.552946507930755615", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139148313": {"recommendationid": "139148313", "author": {"steamid": "76561198025116695", "num_games_owned": 7755, "num_reviews": 55, "playtime_forever": 803, "playtime_last_two_weeks": 0, "playtime_at_review": 384, "last_played": 1685467443}, "language": "english", "review": "Above Snakes is a wonderful Open World Story driven RPG- Survival game. The game is interesting and very relaxing one. The story is nothing special, but the game itself if very enjoyable to play. It combinates the best parts from the Dorfromantik with a kind of Subnautica. The surviving doesn’t make difficult and easy to handle. In the game itself is a lot to explore. Many different biomes are waiting to be discovered.  Positive is also that the game is not overloaded with different items. The soundtrack is simple, but works very good for this game.", "timestamp_created": 1685272730, "timestamp_updated": 1685272803, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.55241858959197998", "comment_count": 2, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "154584476": {"recommendationid": "154584476", "author": {"steamid": "76561198075953204", "num_games_owned": 107, "num_reviews": 23, "playtime_forever": 1816, "playtime_last_two_weeks": 0, "playtime_at_review": 708, "last_played": 1703808948}, "language": "english", "review": "Had this on my wishlist, kinda forgot about it until it was gifted to me for the holiday - and I can say that I am thoroughly enjoying this game so far. It's chill atmosphere calls to my soul and its very laid back.  I am not very far into the game but I can see the potential and a lot more content that I have not even gotten to yet! \n\nI'm excited to progress further, and see what else there is! I really like the unlocking of map pieces to progress, it helps to feel accomplished - and that you can edit them and change your map to your liking.  \n\nI give it two thumbs up! \n\n", "timestamp_created": 1703722361, "timestamp_updated": 1703722385, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.546667575836181641", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140072585": {"recommendationid": "140072585", "author": {"steamid": "76561198010439005", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 2212, "playtime_last_two_weeks": 0, "playtime_at_review": 1787, "last_played": 1686980193}, "language": "english", "review": "Super cute and worth it to play. Fun crafting and survival/base building on a casual level.", "timestamp_created": 1686786185, "timestamp_updated": 1686786185, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545454561710357666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139480277": {"recommendationid": "139480277", "author": {"steamid": "76561198075633065", "num_games_owned": 835, "num_reviews": 29, "playtime_forever": 801, "playtime_last_two_weeks": 0, "playtime_at_review": 774, "last_played": 1685903340}, "language": "english", "review": "Interesting concept, wonderful art style, simple but not grindy mechanics.", "timestamp_created": 1685799444, "timestamp_updated": 1685799444, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.545454561710357666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139380464": {"recommendationid": "139380464", "author": {"steamid": "76561197994155660", "num_games_owned": 0, "num_reviews": 32, "playtime_forever": 396, "playtime_last_two_weeks": 0, "playtime_at_review": 336, "last_played": 1694639316}, "language": "english", "review": "Strange name aside; Above Snakes is a fun \"frontier style\" world builder that has a unique take on character and world progression.  I admire that the game isn't just an empty sandbox, and that it allows you to shape the world as you see fit.  The game has addicting things to monitor like your normal energy, hunger and thirst meters.  There are also character quest to complete which I found to be a great addition, as to not feel so alone in such a sparse existence.  My only real frustration with the game has been with crafting.  I found myself within the game stuck and reliant on internet videos and FAQs because I was unable to update a tool or find a resource within the world.  It's been mind numbingly frustrating and if I ever quit the game, it will be because of that alone.  Aiming is also a bit off as when I am hunting animals in the woods later in the game, I find the controls don't quite help me understand if I am aiming at the target and more often than not, I miss the target completely.  It's at that time that I switch to the ax and just chase down deer and rabbits in sheer frustration.  \n\nI think this game is for anyone who enjoys a level of creation and discovery and loves to micromanage every little bit of an avatars existence.  I truly find it fun and think it's a sliver above other world builders like it.", "timestamp_created": 1685638972, "timestamp_updated": 1685638972, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545454561710357666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "154068148": {"recommendationid": "154068148", "author": {"steamid": "76561198312495263", "num_games_owned": 0, "num_reviews": 17, "playtime_forever": 987, "playtime_last_two_weeks": 0, "playtime_at_review": 731, "last_played": 1708120959}, "language": "english", "review": "I like the relaxed style of the game. I like the concept of survival games but I usually find the zombies or whatever too difficult for me, this I can handle. my only criticism is that the days are rather short for getting anything done.", "timestamp_created": 1703174773, "timestamp_updated": 1703174773, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545188963413238525", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139346018": {"recommendationid": "139346018", "author": {"steamid": "76561198000587031", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 2236, "playtime_last_two_weeks": 0, "playtime_at_review": 2236, "last_played": 1685573684}, "language": "english", "review": "There are some really great concepts at play here, and a pretty nice overall visual style, but I can't help but finish the game and feel... disappointment? \n\nNear 40-hours in and the storyline is complete--maybe I could have done this faster and maybe not, but so much progress here is arbitrarily gated behind \"gather this resource to unlock this biome, now gather this new resource to unlock the next biome, and so on\" that it feels as if there isn't really much gameplay here, it's just an extended series of fetch quests of your own logistical makeup and some survival mechanics thrown in to drag it out even more. \n\nI'm not sure what I was expecting exactly, but I thought it would be a little less shallow. I might change this review to positive if they make any updates to add more content but this game just feels like a bit of a slog at this stage.", "timestamp_created": 1685578588, "timestamp_updated": 1685578588, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.543676674365997314", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "141944469": {"recommendationid": "141944469", "author": {"steamid": "76561197995873585", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 604, "playtime_last_two_weeks": 0, "playtime_at_review": 305, "last_played": 1689294840}, "language": "english", "review": "While it has a decent story, overall I find the game kind of lackluster. Night and day cycles are too short. The controls are annoying. It feels like it needs more polish.", "timestamp_created": 1689200190, "timestamp_updated": 1689200190, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.54356849193572998", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139895596": {"recommendationid": "139895596", "author": {"steamid": "76561198365913164", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 1240, "playtime_last_two_weeks": 0, "playtime_at_review": 278, "last_played": 1687281481}, "language": "english", "review": "Great game overall, I really like these mechanics with random tile generation. It's not like those usual survival games you can find and can feel a bit grindy sometimes, but it's a great mix of survival, exploration and farming mechanics with specific quest line.", "timestamp_created": 1686496320, "timestamp_updated": 1686496320, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.54356849193572998", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139312792": {"recommendationid": "139312792", "author": {"steamid": "76561198102964034", "num_games_owned": 77, "num_reviews": 6, "playtime_forever": 1187, "playtime_last_two_weeks": 0, "playtime_at_review": 820, "last_played": 1685615794}, "language": "english", "review": "great game, and the devs listen to the community", "timestamp_created": 1685532519, "timestamp_updated": 1685532519, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.54356849193572998", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "145848045": {"recommendationid": "145848045", "author": {"steamid": "76561198037338835", "num_games_owned": 178, "num_reviews": 5, "playtime_forever": 2135, "playtime_last_two_weeks": 0, "playtime_at_review": 1960, "last_played": 1706142127}, "language": "english", "review": "If you like survival games ... you need to check this game out.\nIf you like top down games ... you need to check this game out.\n\nIf you don't like above or unsure ... you need to check this game out.\n\nHad a good few hours on this game now and i love it. \nThe little storylines are great, the tasks you have to do and the gameplay is so smooth and enjoyable.\nInteresting characters and scary zombies lurking in the dark.\n\nI can't wait to see where they take this game next.", "timestamp_created": 1694089817, "timestamp_updated": 1694089817, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.539537310600280762", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139198449": {"recommendationid": "139198449", "author": {"steamid": "76561197998230534", "num_games_owned": 472, "num_reviews": 33, "playtime_forever": 1810, "playtime_last_two_weeks": 0, "playtime_at_review": 1529, "last_played": 1685370177}, "language": "english", "review": "This game is so easy it literally has multiple achievements for dying. And I only half joking.\nJokes aside, this game has design choices that contradict each other or don't work at full potential. My opinion in bullet points:\n- story doesn't fit the genre. What the point of randomly generated world if story quest hand holds you, always tells where exactly to go and what to do? There is never anything that you don't know in advance about, and you can't find anything \"ahead of the story\";\n- grinding for resources to unlock tiles isn't fun. It makes you feel like a rice- I mean wheat farmer;\n- tiles always have exactly what you expect them to have. No point in random. In my opinion, tiles should come in stacks of 10, with quest or special event tiles mixed in. Scrap farming for tiles, add something different to gain tile decks, let build the world in large chunks at once, don't tell players, what they get. Add fog of war to unvisited tiles;\n- way too little stuff to \"gain\" for surviving / exploration game. All you have is story gated upgrades to (two) tools and a house. Game would benefit from more complex production chains. And chopping WHEAT with AXE felt very awkward, to the point that people constantly asking, how to get wheat.", "timestamp_created": 1685344180, "timestamp_updated": 1685344180, "voted_up": false, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.539212882518768311", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "141656749": {"recommendationid": "141656749", "author": {"steamid": "76561198149907373", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 67, "playtime_last_two_weeks": 0, "playtime_at_review": 67, "last_played": 1688876953}, "language": "english", "review": "An \"Open World\" with RPG ingredients that does not allow you to define your character.\nExtremely basic and boring in terms of the story and the crafting.\nThe zombie-oriented theme has been extremely abused recently and does not help to create an attractive wild-west story.", "timestamp_created": 1688882318, "timestamp_updated": 1688882318, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.538610994815826416", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}}, "query_summary": {"num_reviews": 26, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 467, "total_negative": 108, "total_reviews": 575}, "cursors": {"AoIIPwB7zHShpNgE": "Mon Apr 22 23:49:09 2024"}}
