{"reviews": {"159775468": {"recommendationid": "159775468", "author": {"steamid": "76561198345523987", "num_games_owned": 0, "num_reviews": 98, "playtime_forever": 493, "playtime_last_two_weeks": 0, "playtime_at_review": 493, "last_played": 1709475878}, "language": "english", "review": "This game is not functioning any more. It requires a Python 2.7 library, which it does not include. Python 2.7 has been discontinued for many years.\n\nUnless you're willing to spend a day messing around with libraries, possibly compiling a Python 2.7 library from source, don't get this.", "timestamp_created": 1709476823, "timestamp_updated": 1709476823, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.539797306060791016", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "32415855": {"recommendationid": "32415855", "author": {"steamid": "76561198095460100", "num_games_owned": 1585, "num_reviews": 5, "playtime_forever": 6716, "playtime_last_two_weeks": 0, "playtime_at_review": 6417, "last_played": 1617240301}, "language": "english", "review": "Having played over 80 hours of this game (majority of it in the beta branch) and seen the dev at work I can safely say that, what this game currently lacks in difficulty and content, the dev makes up for in dedication in fixing and improving the game and willingness to help those who need it.\n\nThis game has potential, lots of it, it just needs some time to grow.\n\nStarting off the review with that.\n\nCrea is a game with the same base structure as games like Terraria and Starbound, but they are not the same games, with over 700 hours of game time on Terraria, I will admit I went into Crea expecting it to be a lot like it, I was wrong and was punished for it, numerous times.\n\nYou will die in this game, with more slowpaced combat that almost requires the use of your trusty shield to survive, until later on in the game, more on that in a bit.\nThe combat mechanics as of right now is a bit like Dark Souls if I may; bait, counter and repeat.\nHowever if you decide to use the bow or magic, combat sadly becomes a little bit too easy, the game is too nice when it comes to projectiles, they are too slow and are easy to predict, bosses suffer greatly from this.\nWith that, let us talk about a weak point of the game, the difficulty.\nWhen you first start, the game will seem to be very difficult and you will die at least once in the first 15 minutes.\nBut once you get experience, unlock a few skills and naturally get better, you will notice that, hey, this isn't so hard?\n\nThe balancing in this game is sadly something that definitely needs attention somewhere down the line, especially so when it comes to bosses, all bosses can be done naked, as long as you have a weapon that is up to date.\nThe bosses die too quick and their attacks are of no threat, due to what I mentioned earlier, projectiles are too slow.\nThey have a long wind up time before they start moving, and when they finally start moving, they are too slow.\nIt's possible to one shot the last boss with a bow with the right build.\n\nContent wise the game sadly is lacking as well, it's there, but lacking, but I trust that I will edit this review later and change this. :)\nThere are 4 bosses, something called Horde Realms which is something that has a chance to spawn after killing something called a xxx Spawner of all mobs in the game, they are kind of like mini dungeons that only consist of the mob that spawned the realm portal.\nThere are also dungeons, great for leveling and loot, pretty standard, they function a bit like ARPG dungeons, in that they have various \"quests\", for example \"Pacifist\" meaning, don't kill any mobs, and bonuses/penalties, for example increased/decreased experience.\n\nEDIT: With the recent patch adding enchantment, the gearing up part has become a great deal more fun.\nTrying out different enchantment builds is very fun, especially using the more unique ones!\n\n\nLoot wise, there's a few different tiers and variations for each weapon type (sword, bow and wand) as well as armor.\nGenerally there's three different weapon and armor sets per tier that you can craft, one for each type of weapon.\nThere's also scrolls that can be researched, I've only found one weapon scroll, a sword, as well as a bunch of different accessories.\nBosses also have a chance to drop unique weapons and accessories, same with Horde Realms that seem to all have something unique.\n\nCrafting, the crafting in this game is more in-depth than Terraria, in that you have various skills to increase the quality of equipment before you run out of \"Balance\", for people who've played FFXIV A Realm Reborn, the system will feel very familiar.\nIt could use some looking into, it's very easy to get max quality right now.\nDoes require some thinking but not enough I believe.\n\nEDIT: Recent patch made the crafting significantly harder, sound like a bad thing? Nah, much better this way. :P\n\nBugs, yes, this game has them, like any other game, but the dev is very dedicated in solving them, and has made great progress on the beta branch of the game.\nThe most jarring bug right now that some people seem to experience, is a bug that makes water mobs fly away.\nPersonally haven't experienced this after the last patch on beta, though some people still do it seems.\n\nEDIT: With the most recent patch, a lot of bugs were fixed, mobs flying away being one of them. :P\n\nAnyway, I've gone on long enough, Terraria fanboys can downvote as much as they want.\nThe game has potential and I'm looking forward to see where the game goes from here.", "timestamp_created": 1497464904, "timestamp_updated": 1512791843, "voted_up": true, "votes_up": 247, "votes_funny": 8, "weighted_vote_score": "0.906979858875274658", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "35784798": {"recommendationid": "35784798", "author": {"steamid": "76561198048417808", "num_games_owned": 189, "num_reviews": 22, "playtime_forever": 946, "playtime_last_two_weeks": 0, "playtime_at_review": 946, "last_played": 1500478845}, "language": "english", "review": "I'll recommend it on principle but be careful buying it. It's not a bad game but there's almost no incentive to continue playing it, it's not finished (at least, I hope like hell it's not), and updates are slow. The developers are certainly due some praise, though. They are trying to expand on the Terraria style of game, not just milk the genre with more of the same. Problem is, at this point, while their ideas are good and have an enormous amount of potential, they just really don't add much to the game. I suspect in time they'll get these things polished out to where they work well and become fun elements but they're not there yet and may not be for quite some time.\n\nIf you haven't played Terraria, get that first, without question. Same type of game, loads more content and features, lots of mods. Plus, it's cheaper than Crea.\n\nIf you haven't played Starbound, get that second. Same type of game, lots more content and features, lots of mods (and workshop support). Plus, it costs the same as Crea.\n\nIf you've played both of those and wish you had another game like them, go ahead and get this but don't expect it to be the next Terraria or Starbound. It's not, and it's got a long, long way to go to be on par with either of them.", "timestamp_created": 1508205374, "timestamp_updated": 1508637906, "voted_up": true, "votes_up": 165, "votes_funny": 1, "weighted_vote_score": "0.899414896965026855", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "39860655": {"recommendationid": "39860655", "author": {"steamid": "76561198052980899", "num_games_owned": 0, "num_reviews": 31, "playtime_forever": 2670, "playtime_last_two_weeks": 0, "playtime_at_review": 1675, "last_played": 1568151744}, "language": "english", "review": "I paid more for this game than I did for Terraria, and I am already plain bored tired.\n\nThere is an immense amount of information hidden from the player. The user interface is subpar. There is basically no guidance whatsoever. Dungeons are terrible and never worth the time, effort, or risk. Equipment progression requires the hoarding of random material loot drops because you cannot seek out materials to craft higher level gear.\n\nI just boosted my home zone to 20 levels over my character because the cryptic messages do not give you any idea of what is happening. After checking the full map, I realized what \"zones\" meant, and that the monster level boost was not going to be for the ones on the screen, like stuffing a pig before you eat it. Instead, every new monster that spawns is going to be so damn powerful that I will not be able to fight back. All of this after I went through the effort of making the house and setting up storage and workstations.\n\nBecause there is no contact damage in the game besides lava, invisibility removes all aggro and makes you invincible. Monsters don't attack if they can't see you. You can perform gathering and use functions without breaking the invisibility spell. Invisibility is the only way to survive some ridiculous dungeons where you are supposed to, quote, \"Do not kill monsters,\" or, \"Healing has no effect.\" Not killing monsters means no XP, no combat TP, and no drops. If there are no chests to loot, there is literally nothing to do but waste time. When healing has no effect, damage on you is permanent and it forces you into safing like all hell or just going invisbile and not even bothering. Speaking of combat, I NEVER use the shield. It's basically there to give defense stats. Actually USING the shield would put you in harm's way for no good reason when you can just run for your life. Attacking might even be a better option because attacks can interrupt the enemy, and specific attacks stun.\n\nThe \"progression\" system for combat is incredibly dull. Very early on you get a taste for everything you will ever use. There is nothing new or interesting to discover. Leveling up spells and attacks just makes them slightly more effective, except for two magic spells that gain bonus effects at/near max level. This makes the grind even more life-draining. What am I supposed to be looking forward to?\n\nCrafting was interesting at the start. Getting ingredients to study in order to make recipes that use them was a really great idea. Forcing item quality to be the result of a game-able system is not interesting at all, however. Even worse, all of your precious artifacts and enchantment loot are locked into whatever quality level you happen to get. Those enchantments might be the main source of power in your equipment, due to resource limitations or the fact that everything that you need can only be acquired as a random loot drop eventually. Items are level locked, too, so if you happen to get something really nice, you might not be able to use it anyway, and enchantments carry their own level that will override the weapon they are put on if the enchantment is a higher level.\n\nThere is a talent in the Explore list. These are not talent trees. These are talent lists. There are no pre-requisites. There is no specialization. There are only level requirements and TP costs. Anyway, this one Explore talent is called Barter. Barter gets you better prices with NPCs. There's just one problem, though. There are no NPCs. I've been playing for too many hours for so little to have actually happened outside of me digging around and stabbing things.\n\nI had to convert the game's soundtrack files from .ogg to .mp3 myself. There isn't a proper folder or files, but there is a soundtrack folder a few clicks in. I have paid (extra) money for soundtracks on other games, and I have enjoyed games with soundtracks at no additional cost, but despite the age of the game and how goddamn easy it is to just ship a proper soundtrack with the thing, whoever made Crea decided not to.\n\nThat map I mentioned earlier? Despite being a map and all, and regardless of the fact that teleport waystones are a basic part of the game's travel experience, Crea's map does not show discovered waystones on it. Several waystones come with non-names like \"Undiscovered Crystal\", and the stone list reorganizes itself based on the location of other stones relative to the one you are teleporting from, like knowing \"this stone is 1500 units West of you\" is somehow even remotely useful compared to a coordinate system that grounds you in 2D space. Basically, I have little to no idea where any of the stones are relative to a given destination, like the last place I died so that I can go pick up all of the stuff I dropped. The map shows the bag's location, though. I know, right?\n\nAs far as just moving around in the game, even the sprint is too slow. Attacking things moves your character around, including going past the thing you are attacking. Jumps are super short, something the double jump does not fix. Grappling hooks are so unsatisfying to use, I try not to use them if I don't have to. Trying to attack in the air just feels bad.\n\nI got this game because Terraria hasn't seen a proper PC update in too long. I have been waiting for Terraria 2. This was a perfect example of how extensible of a bad job you can do, puttting in time and effort to make something that remains unfinished, uninspiring, and unfun, and still get paid because it looked like a game that was actually novel and enjoyable.\n\nBuy this if you want to learn how not to make a game. It's not \"different\", it's just bad. This game sucks so much I that look forward to being severely disappointed again and again by every other attempt at 2D sandbox this cloning booth has to offer.\n\nEDIT: While ranting out loud to the person I live with about how awful this game is, I realized I forgot to mention THE HOTBAR. Basic stuff like combat buffs are a huge chore that pulls you out of the game experience. If you even bother to use all of the buffs, you will be switching hotbars to the one you put all of the buffs on, then you will be going through them every two minutes or so while standing still waiting for your stamina to refill. There is no gambit/preset/combo anything. You have to do all of them individually, every time. Trying to use all of the available attacks off cooldown is terrible for melee because of the position of the number keys relative to the size of any human hand, and there's basically nothing to do with magic because you only have three offensive spells that don't lock you down! If you're going to take ideas from MapleStory, how about taking the whole thing so it doesn't suck?", "timestamp_created": 1517813708, "timestamp_updated": 1517814611, "voted_up": false, "votes_up": 263, "votes_funny": 15, "weighted_vote_score": "0.872297883033752441", "comment_count": 8, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "10285992": {"recommendationid": "10285992", "author": {"steamid": "76561198055771600", "num_games_owned": 295, "num_reviews": 12, "playtime_forever": 9615, "playtime_last_two_weeks": 0, "playtime_at_review": 6707, "last_played": 1501371087}, "language": "english", "review": "Crea is a sandbox exploration and building game, much like Minecraft and Terraria. Unlike Minecraft, it's 2d and doesn't suffer from 3d camera troubles, and unlike Terraria, it's multiplatform, so it can be played Linux native.  It also adds RPG elements so you can level up, focus on your skill sets and chose between various different armor and weapon types depending on your play style.  \n\nWeapon classes: Each weapon class has it's own upgrade tree that branches off towards the top into a variety of top tier weapons\n - Sword/melee: Your normal hack and slash. \n - Pike/melee: Stabbing from a slight distance\n - Wand/magic:  Sling spells without using MP\n - Bow / Range:  Plink away out of range.\n\nIn addition, there's magic, which can be used alongside your weapon which comes in both offensive (fireballs and the like) and defensive (healing, shielding, etc)  \n\nArmour types have a similar branching tree that the weapon classes do.  There's basic armor, then it branches off to give the choice of 3 top level armors.   \n\nWeapons, armor and mining tools can all have bonuses, something that you can put your skill points into improving. Like in an RPG, not all items are the same, which means you can almost always make better equipment as you continue to level. This gives a nice feeling of progression to the game.\n\nLike Terraria, there is a boss battle that changes up the world a little.  However, this is mostly an upgrade without the race against the clock aspect battling the Wall of Flesh gave.  A new ore is peppered through the world, and a new category of drops is added to the mobs, allowing for higher level equipment.\n\nThe monsters in the game scale to your level, rather than being procedural. A low level character will always encounter lower level monsters and vice versa no matter where in the world they happen to be.  \n\nAs a benefit to exploring, Crea has a built in fast travel/teleport system. Way crystals can be set as spawn points and as long as you carry a shard with you, you can always teleport back home.  Way crystals are in random locations across the world and under the surface, making it much easier to get back to digging through the cave system. \n\nCrea is also very easily moddable.  Items can be created, the game files tinkered with, near anything you want can be done.  The official forum has a section for people to swap mods and get advice on how to make their own. Even with almost no programing knowledge, it's pretty easy to look at the source files and fiddle with things until you get the result you want. \n\nCrea is still in beta, but it's a very active beta with a very active dev and decently active community that's pretty good at pinning down the bugs and coming up with possible workarounds until the official patch comes out.  Most bug fixes are pretty swift it arriving, especially when they're big ones.  It's very playable as is. Multiplayer is still a bit wonky as of this review, but it was recently given a complete overhaul and I assume will be fixed up as the dev has a very good track record in that respect. \n\n\nOverall, a very enjoyable addition to the genre and very worth getting.", "timestamp_created": 1401456146, "timestamp_updated": 1401456146, "voted_up": true, "votes_up": 184, "votes_funny": 3, "weighted_vote_score": "0.815747916698455811", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "17243046": {"recommendationid": "17243046", "author": {"steamid": "76561198042253185", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 31367, "playtime_last_two_weeks": 0, "playtime_at_review": 10453, "last_played": 1603745863}, "language": "english", "review": "Hi everyone. I've been part of the Crea community for a very long time now and I finally got around to updating my review. I'm going to go through the features of the game and talk a little bit about them so you know a little about the game beforehand.\n\nImportant Note: Since I wrote this review I've become part of the Crea development team. As such I won't be updating this review further as I feel that being part of the development team would result in a biased review. That said, this review was written at a time when I was not part of the development team. So the original review still stands in its integrity. It is worth noting that many things about the game have changed since the review, so it's no longer necessarily accurate.\n\nFirst of all, let's talk the game's origins. This game originally started with the idea of \"Terraria but moddable\" according to the dev. Since then it's changed wildly. The game is still a 2D sandbox game (and indeed to many people that's enough to make it practically the same as Terraria) but it has integration of RPG elements and a strong emphasis on exploration.\n\nNext let's discuss the combat. The combat in Crea is very dynamic, a lot of dodging and blocking, and with a lot of skills for you to use. There are even combos, and there are several different paths you could go in terms of combat. However it does take some getting used to which may be a downside for many people. The combat in the game has a different patterning compared to most other 2D games that makes you watch the enemy closely and react to their patterns in order to attack optimally. While not similar to Dark Souls combat, the difference between Dark Souls combat and standard 3rd person combat in video games is a good comparison. It requires you to engage enemies differently from any other 2D game I've played, and it requires you to think about what you're doing actively. This isn't for everybody, so just know what you're getting into, and know you'll have to think if you want to fight well in Crea.\n\nNext is the crafting. Crea takes a new approach to crafting compared to other sandboxes, in that you discover the recipes by researching the pieces of the items themselves. The end result of this is that finding a new recipe is more like a scavenger hunt than anything else, as you look for the piece that completes your recipe. Some people love this while unfortunately this comes off to others as grindy. I personally believe this is a presentation issue, and the developer has discussed doing massive changes to the crafting system to improve it, so that may see changes in the future.\n\nNext is exploration. Exploring in Crea is something that it often feels like there is a good reason to do, in fact, it almost always feels as such. While it doesn't feel like exploration is the core of the game (as, indeed, it isn't), exploration is rewarded, and required. The materials you need are not centered in a small place, they're all over the world, and should you decided to spend most of your time underground, the tunnels always feel more like you're spelunking, than anything else.\n\nThe next big piece is modding. This game has possibly the best mod support I've ever seen, so in the future, there will likely be a wide range of different ways you can play the game, all through modding. Of course that does first require that a community forms, which is something to keep in mind, but if one does form you'll see modding content created much faster and more seamlessly than most other games out there.\n\nThe next thing I'm going to talk about is my least favorite thing in the game, the primary toolbar. While many people like the strange toolbar that Crea opted to go with, my personal opinion is that it's not the best. The toolbar at the bottom has two modes which each have two loadouts. There's a combat and exploration mode. You switch between the modes with R and the loadouts with tab. It's clunky when you start but as you get used to it becomes efficient. That said, I'm a bigger fan of the simplicity offered by a single toolbar. I think that simplifying the toolbar would benefit the game greatly.\n\nNext is something I feel I should discuss in this review. This game had a rough launch. I'm going to briefly tell the story of what happened though from my perspective. Leading up to the launch the game looked very stable. The developer was looking for bugs and encouraging people to test it, but none were showing up (or rather no one was reporting them if they were). I know this since I was (and still am) a moderator of the forums. As far as the developer could tell, the game was stable. As such, he left early access. On leaving early access the amount of people playing the game increased a hundredfold. Literally the number of people playing Crea was about 100 times greater than it was during early access. Because of this many, many bugs appeared. For some people the game was refusing to run, for others it crashed often, for some the multiplayer was unplayable. It was a mess. The main developer was distraught and spent a ton of time fixing bugs. He was constantly working his way through a list of bugs for over a month after launch, and these weren't small bugs. For a couple of them, he had to do things such as completely rewrite the netcode for the game. Anyone who's even tried to program netcode knows that's no small feat. The developer several times worked from 9 AM one day to 3 AM the next to fix the bugs. The community watched him do it to, it's common for the developer of the game to livestream the development in order to interact more readily with his community (and contrary to some accusations I've seen, the developer definitely doesn't play favorites if people subscribe or donate. In fact I don't even think most of the people subscribed own Crea, they just like to chat as they code....) The game is now stable. Watching the reports, there hasn't been a crash report in a while. I won't say the game's perfect, it's a long way off. Getting the game stable is only now (July of 2016) getting close to wrapping up and after that the game still needs a lot more content and needs some systems reworked before it's full potential is available, but it will get there. I've been along as this game was developed for a long time and the developer has consistently shown he puts the playerbase first. He takes feature requests, he actively engages in solving bugs that only plague one person, he requests feedback on ideas before implementing them, he listens to player feedback and reverts changes that people don't like. If nothing else, I have confidence in what this game will become because I've seen the developer in action and he's exactly what most people wish the developer of their favorite game was like.\n\nCrea is not for everyone, but I think many people will enjoy it, if not now, then in the future.\n\nAnyway, long story short, I'd recommend this game (if you somehow didn't get that already).", "timestamp_created": 1437952277, "timestamp_updated": 1482474190, "voted_up": true, "votes_up": 309, "votes_funny": 18, "weighted_vote_score": "0.812075197696685791", "comment_count": 20, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "41812565": {"recommendationid": "41812565", "author": {"steamid": "76561198026797849", "num_games_owned": 1046, "num_reviews": 55, "playtime_forever": 3252, "playtime_last_two_weeks": 0, "playtime_at_review": 2849, "last_played": 1525640750}, "language": "english", "review": "This game is actually good. And although negative reviews do have certain true points, mostly they are exxagerated. Crea is heaviliy inspired by Terraria (what similar game does not) including most mechanics, so it is true that you might be a bit confused about certain things if you haven't played something like this before. Crea does go a bit forward though with a Talent Point system and Chaos Crafting system, that are quite interesting, but not perfect indeed.\n\nThe main downside of this game is that it appears to be abandoned; the fact that makes total sense, because it had a peak player base around June 2016 (1 662 ppl) and since then it hasn't been more than 165 players peak at any given month with less than 50 players starting from February 2018. In it's current state (May 2018 - v.1.5.5.) Crea is totally playable with the content I've managed to finish (defeated last boss and finished all available research) in about 35 hours playing together with my gf and not rushing (mostly).\n\nMaybe at a certain point in future something will happen and this game will be back with more content and marketing that might get more players (like Terraria v.1.2.4.1 that was pretty much confirmed as a last update of the game, but after a year it started to receive new updates and content and is still securing 10k-20k players daily). If it does, make sure to give it a try, it is worth it.", "timestamp_created": 1525269773, "timestamp_updated": 1683496459, "voted_up": true, "votes_up": 68, "votes_funny": 2, "weighted_vote_score": "0.811754286289215088", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "48913512": {"recommendationid": "48913512", "author": {"steamid": "76561198006986577", "num_games_owned": 684, "num_reviews": 468, "playtime_forever": 2528, "playtime_last_two_weeks": 0, "playtime_at_review": 2528, "last_played": 1549931565}, "language": "english", "review": "Try as it might to set itself apart from Terraria, those things ultimately get in the way of the enjoyment.  First of, everything this game shares with Terraria, Terraria does better(art, sound(Crea's music is terrible), progression, enemies, bosses, world building).  That being said, Crea sets itself apart with an RPG system of leveling skills and attributes, and a unique crafting system.  However, both of those systems tend to become irrelevant due to the poor balancing.  You quickly become far overpowered even with the worst gear.  The lack of enemy types and enemy density in the world creates a fast monotony due to having to run dungeons repeatedly just to fight things.  This game is very enjoyable and refreshing for a while, but starts to drag on real quickly.  Despite all of this, there are so few games in this genre that I still recommend it for something a little different, just not at its ridiculous full price.", "timestamp_created": 1549838742, "timestamp_updated": 1549838742, "voted_up": true, "votes_up": 49, "votes_funny": 1, "weighted_vote_score": "0.809908568859100342", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "19768711": {"recommendationid": "19768711", "author": {"steamid": "76561198044946578", "num_games_owned": 0, "num_reviews": 24, "playtime_forever": 3151, "playtime_last_two_weeks": 0, "playtime_at_review": 1772, "last_played": 1544758684}, "language": "english", "review": "I don't write a lot of reviews, or a lot of anything, so bear with me.\n\nCrea is a very fun game. Combat, mining, building, and crafting in a 2D world. It's similar to Terraria, which is what interested me, but far far from a clone. It's early access, so expect bugs. Luckily, the developer is very active on the forums. He is very helpful, and I've personally watched him solve three or four bugs on his twitch stream. I believe he spends hours every day with his stream up, and anyone can come in and inform him of difficulties they're having. I also think he has promised to release updates every week, however some weekly updates might only be bug fixes.\n\nIn Crea, your character gains xp on each monster kill and levels up. Each level up gives 2 stat points, and you can spend them on health, stamina, attack, defense, intelligence (matk), mind (mdef), agility (ranged), and luck. I would say the coolest thing about Crea is the talent system. You have a talent tree for Arms (swords, axes, and bows), Syle (magic), Gathering (mining), Crafting, and Exploring (double jump, lockpick, inventory boost, and other noncombat boosts).\n\nCombat is, like I said, similar to Terraria. At least the controls are. Left click to pew, but with each click of an attack or use of a skill, your character's stamina will drain. If you allow your stamina to reach zero, your movement speed is reduced and you cannot act until it reachs about half. So always stop attacking before you reach zero. \n\nCurrently there are swords, spears, bows, and wands. Each weapon style has a standard left-click attack, and then each weapon has the possibility of dropping with an element (earth, wind, water, fire), as well weapons can have secondary attributes (piercing bow, lifesteal sword, damage buff on kill axe, ricochet bullets, etc.).\n\nTwo very important commands would be the ability to block and dodge. Dodge causes your character to roll forward or backward with invincibility frames. Blocking reduces the damage you take from an attack. Combat also has skills, unlike Terraria. Active skills such as fireball, shield stun, triple shot, protect, raise (multiplayer), heal, etc. Passive skills include stat increases, weapon power increases, shield power increases, move while charging, move while blocking, etc. Passives are boring, but useful.\n\nMining is mining. Grab pick, mine ore, build better pick, mine better ore, etc. It works. Currently I've discovered the ore progression bronze, iron, silver, and gold. Not sure what's after gold, or how many ores come after gold. I've heard people mention Corium, which I believe may be the endgame ore. I'll skip over the building aspect, since it's never interested in me.\n\nCrafting is fairly simple as well, at least the act of crafting is. You just open the window, click a recipe you've unlocked, and clicked craft. Where Crea sets itself apart from others is the act of unlocking recipes, which is very in-depth, but also pretty annoying at times. Recipes have a crafting level I believe, but you can't see what level they are. Whether or not you gain crafting experience is dependant on the level of item your crafting. \n\nYou have to research recipes using base materials. So if there was an iron pick, and it required wood and an iron bar, you'd need wood and an iron bar. You would also need to be a high enough crafting level to unlock crafting iron picks. Then you'd approach the research table, and it would say that you can currently research iron bars and you can research wood. You research with the wood, it tells you you've learned part of the iron pick recipe. You research with iron bar, it tells you you've learned the entire recipe for iron pick. Then you can craft the iron pick.\n\nIf you have half of a recipe unlocked, you can view it in the research table and you'll see a dark shadow of the other items required. You might recognize them. If you don't feel like hunting down or finding out what else is required, then you can spend Scraps to finish the recipe without researching. This will unlock the recipe. Scraps are obtained when you research normally.\n\nAnother awesome aspect is the dungeon system. You can sometimes find portals to dungeons in the world, and sometimes they spawn when you break a monster spawner. Another method is to unlock the Dungeoneer NPC, and paying him in currency and stone to send you into a dungeon. You can pick and choose the dungeon difficulty, size, and modifiers, or click the random button. Dungeons are awesome for finding loot you haven't unlocked and for grinding experience.\n\nGripes:\nI can't seem to unlock the next tier of wands, and I don't know if it's because I don't have the materials or because I don't have a high enough crafting level. I can craft better swords, bows, and axes than I can wands, and I'm playing a mage build character. Without crafting levels displayed on the crafting window, I don't know what items to even craft to level up my crafting. \n\nMagic, melee, and range do not seem to be very balanced. I haven't managed to use melee successfully at all. Magic is decent, but pales in comparison to similarly leveled range (range is 3-4 times more powerful, for sure). However range requires the crafting of arrows, and I have a hard time crafting enough to keep up with my dungeoneering (as far as I know, feathers only drop from birds one at a time, and I don't see them very often). Stamina drains very very fast, but you get used to it. It's a real bother when fighting the plants that multiply if you don't break the eggs in time.\n\nSilver seems to be more rare than gold, as I have found way more gold than silver on two different characters in two different worlds. Five ore per bar is not a big deal with bronze and iron, but at the silver and gold levels it feels like way too much. Character leveling (not talent) feels a bit too slow. \n\nAll in all, I would definitely recommend this game. It's not very expensive, and it's definitely very fun. I will be putting way more hours into Crea.", "timestamp_created": 1450470541, "timestamp_updated": 1450470541, "voted_up": true, "votes_up": 74, "votes_funny": 2, "weighted_vote_score": "0.808586418628692627", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "23229427": {"recommendationid": "23229427", "author": {"steamid": "76561198041482163", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1231, "playtime_last_two_weeks": 0, "playtime_at_review": 1110, "last_played": 1596410647}, "language": "english", "review": "To be clear, I never really review games, but due to the low amount of reviews for this game in particular, I figured it would help to write one myself. Furthermore, I'll try to be as clear as I can concerning what I've experienced in this game in the short amount of time I've played it. I'm not going to do a pros and cons, so the review might be a little long. I'd rather discuss what the game offers and leave it at that. If you don't want to read a long ass review, skip this one entirely. \nLastly, one thing to note, keep in mind that this game is in Early Access. This means there are some bugs, but none of them are gamebreaking from what I've experienced. For example, I entered a dungeon and was suddenly unable to grapple and another time could not jump to the left or right, only up and down. This was fixed by restarting the game. \n\n[b]Overall Appeal:[/b]\nI think a lot of people will get into this game because of its similarities to other titles, such as Terraria and Starbound. I personally have played only a little of Terraria and quite a bit of Starbound. To put it simply, the things this game does have in common with those is that it's your typical sandbox: you can build, craft, and fight things, all on your own accord. In the meantime, Crea offers a little more variety than I experienced in the other two, with its skill and crafting system, which seem to have more thought put into them, as well as more freedom. I'll cover this later, but in any case, I believe that this is a worthy alternative to the other titles. I had a lot of fun playing and enjoyed all aspects of the game equally, some more so than I did in Starbound/Terraria. The look of this game, including its UI, might not appeal to everyone, but I liked it a lot. \n\n[b]Skill System:[/b] \nThe skill system is one of the big major upsides to this game, imo. This allows more character based progression, putting aside what armor and weapon you have equipped, and allows more of a rewarding experience. Differentiating from the titles mentioned previously, this game allows you to obtain experience and TP. TP is then used to level up skills and obtain new ones, similarly to an RPG.  It includes categories for Arms, Style, Gathering, Crafting, and Exploration. I'll explain each below:\n[list]\n[*]Arms includes weapon skills, focused more on melee attacks, weapon proficiency, shields, and archery. \n[*]Style is for those of us who like to use magic, including spells, wand proficiency, and the potency of your damaging spells as well as your heals. \n[*]Gathering is pretty self-explanatory. It includes skills that make your tools more effective by increasing the power, pick-up range, as well as how many blocks you can dig up/gather at once with a tool. \n[*]Crafting is also pretty self-explanatory (except maybe not really). I'll cover how the crafting system works in its own section.\n[*]Exploration includes skills such as ledge grabbing, double jumping, lockpicking, and sprinting. It also allows you to level up stats such as your Stamina and Luck. \n[/list]\n\n[b]Crafting System:[/b]\nThe crafting system is different from both Terraria and Starbound, in that you need to gather materials and research them to discover recipes. This means, for example, you pick up a material, use your Research Table to research it, and discover a new recipe. Under Recipes, you will see the recipe, as well as outlines of the other materials needed. If you can tell what they are, great. You go get them, research them, and learn the recipe. If you don't, then it's a matter of finding them as you progress through the game and discovering the recipe via researching those materials. As well as this, every time you research, you gain scraps, which can be used to skip finding the undiscovered materials of a recipe and discovering it ahead of time. They can also be used to avoid spending your materials researching.\nFurthermore, there's also a Chaos system I haven't really explored yet. I might update the review when I understand it more, but from what I gather it allows you to use skills (obtained via the Crafting category) to increase the quality of items you make via a separate crafting process that is optional when making items. I'm guessing that this is mostly used when making Armor/Weapons in order to apply stats or status effects. Again, I'm not sure, but it's worth mentioning in order to emphasize how intricate this system is in particular.\n\n[b]Gathering System:[/b]\nI only want to cover this because I've seen a handful reviews saying that gathering/digging is too slow. I don't know if these people just didn't get far enough in the game to figure out the skill system, or if they're saying it's too slow no matter (which is kind of pushing it). I want to clarify that gathering is slow in the beginning, but as you obtain new tools and gain TP in Gathering, then use it to level skills that increase the power/reach of your tools, it gets [i]much[/i] faster. No problem here unless you're just too impatient to level it up.  \n\n[b] One thing to note before buying: [/b]\nI got this game for myself and my boyfriend, who doesn't have that great of a computer (to be honest). Neither of us experienced any lag, issues getting the game running, or setting up multiplayer in the beginning. However, as time went on, the game became unplayably laggy for him. We believe this is due to the large amount of processes this game runs in the background for its UI, called \"Coherent UI host\". I'm not sure if this is a bug or if it's supposed to do this, but by the time it was running 10 or so of these processes, he could not move or use any skills. \nI, on the other hand, had no issue playing for long periods of time and have yet to encounter anything other than the occasional stutter when the game autosaves. In other words, if you have a potato for a computer, it might be a little risky to get this game right at this point in time. I say this because the devs said they would update this game early June, which might fix it. Have to keep in mind the game is still in Early Access, so this doesn't affect my opinion of the game overall and I still had fun playing.", "timestamp_created": 1464328213, "timestamp_updated": 1464329203, "voted_up": true, "votes_up": 41, "votes_funny": 1, "weighted_vote_score": "0.804105520248413086", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "28481510": {"recommendationid": "28481510", "author": {"steamid": "76561198044953223", "num_games_owned": 740, "num_reviews": 7, "playtime_forever": 7004, "playtime_last_two_weeks": 0, "playtime_at_review": 2677, "last_played": 1579745151}, "language": "english", "review": "I'm not really a writer, especially not a review writer, so this might be a little rough.\n\nThis game obviously takes heavy inspiration from Terraria, which is probably why you're checking this game out, and that isn't necessarily a bad thing. This game does have many elements to prove it isn't a straight up 'clone' as many people have put it.\n\nPositives:\n+ Adds RPG elements such as various talents (skills) and leveling. \n+ Various skills you unlock as you level up different skill trees as well as new armor and weapons you can unlock help alleviate the grind to a point where (personally) it is practically unnoticeable (I have only played up to about level 30, which is a little over the halfway point).\n+ Melee and ranged skills aren't necessarily OP compared to the magic skills, and vice versa.\n+ On that note, there's a good variety of combat skills.\n+ Every action you take, including running around the world, gives experience towards its respective talent, with each branch (melee, magic, crafting, gathering, explore) giving unique skills to use.\n+ Researching various crafting recipes is interesting and rewarding.\n+ Dungeons are interesting and there are many different modifiers that can affect how you play through the different floors.\n+ The main dev (Jasson) is very involved in the community and very passionate about his game, he's personally helped me and a friend with a few pretty big bugs, some of them game-breaking, and we have since solved them and they are no longer an issue.\n\nNow, regrettably, on to some of the bad:\n- Researching is cool, but it can be unclear as to how to progress through some of it, such as when a boss needs to be defeated before you can research higher level stuff.\n- Boss fights are kind of boring and too easy, and it isn't made entirely clear how to access the fights (though the wiki is quite helpful). The first boss in particular has this problem, and it is not made clear that you need to fight them at all to continue.\n- This might be a personal thing, but I would like to know what weapons and armor upgrade to whichever next tier without needing to do in-depth research on the wiki to figure out which sets I want/need to craft specifically (such as what armor leads to a dead-end and which armor goes up to the max tier).\n- Starting out can be quite difficult, confusing (with so much stuff to do), and therefore a big pain unless you push through and get a few skills unlocked and leveled up, but hey, it is an RPG.\n\nAnd two neutral things:\n+/- First is there's definitely less content here than in Terraria, the game's inspiration, but I will defend it by saying that this game appears to have [i] much[/i] more content than Terraria did when it released over 5 years ago, so to give it a comparison in that regard, this game is coming along quite nicely. Also I want to mention... that game has been updated for a good 5 years. It [b]should[/b] be more fleshed out than a game that released just over six months ago. This is a neutral point for me because I still wholeheartedly think that it's fully worth its price.\n+/- Second thing is the chaos crafting. This is where you can craft either a better version of a weapon or piece of armor, or more of an item you need than you can make by just pushing the craft button. Personally I'm a huge fan of this system and it's quite enjoyable and rewarding, however, some people may not appreciate it as much. It can be pretty confusing to someone just starting the game, as it is kind of complicated and strategic as you unlock higher quality levels.\n+/- I moved melee combat to a neutral point because in the beginning it's very difficult to get accustomed to it, but at the later point in the game you can actually begin to facetank [i]some[/i] enemies, but there is still blocking and strategy involved inside of that.\n\nAll in all, I've enjoyed this game as much as I did Terraria when I first played it, if not more than I enjoyed Terraria. There's tons to do, and I'm a sucker for the leveling, crafting, and research systems that have been implemented here. The devs are very vocal and friendly, and not only open to suggestion, but they will also help you as best as they can with any problems that you may run into when you play. They really do care about this game and their players. This game is an easy recommendation from me. I'd be happy to answer any questions people may have if I am able.", "timestamp_created": 1482216336, "timestamp_updated": 1482432425, "voted_up": true, "votes_up": 44, "votes_funny": 1, "weighted_vote_score": "0.79873204231262207", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23671280": {"recommendationid": "23671280", "author": {"steamid": "76561198014777737", "num_games_owned": 1803, "num_reviews": 30, "playtime_forever": 4483, "playtime_last_two_weeks": 0, "playtime_at_review": 4483, "last_played": 1466676182}, "language": "english", "review": "[h1]TL;DR: As it stands, Crea is a Terraria clone with less content and way more bugs.[/h1]\n\nThis review is going to be quite long, so let's get to it.\n\nCrea caught my eye right along with Planet Centauri, but PC was (and still is) in early access, while Crea had just been released, so I decided to give it a go. The game is clearly a Terraria clone, so let's get that out of the way, and let it be clear that I'll be making comparisons between the two throughout the review.\n\n[b][i]THE GOOD:[/i][/b]\n\n[list]\n[*]Adds a few RPG elements to the formula;\n[*]Every action you take gives you \"experience\" in that kind of action, unlocking upgrades as you level up each activity;\n[*]Researching new items is interesting and makes more sense;\n[/list]\n\n[b][i]THE BAD:[/i][/b]\n\n[list]\n[*]A ton of bugs, glitches, crashes, freezes and so on;\n[*]Despite not having seen everything there is to see, it clearly has less content than Terraria;\n[*]More expensive than the game it fails to improve upon;\n[*]Its Dungeons aren't really worth it at all, and their procedural nature ends up creating a frustrating and annoying result;\n[*]Boss fights have no \"epicness\" to them, they just feel empty and silly;\n[*]It's hard to tell whether you're progressing towards new unlocks and discovering new things, or just mindlessly grinding;\n[*]It's pretty damn hard to tell what you need to do in order to discover new things (more on that later);\n[*]Skills and upgrades are poorly developed/designed and often feel like something your character should start with instead of having to grind to unlock;\n[*]Combat is very frustrating, especially melee;\n[/list]\n\nNow, it's clear that the Good vs. Bad list gives you enough reason not to buy the game, but keep on reading as I elaborate on some of the bad aspects and later explain why there's a chance I may change my recommendation someday.\n\nAbout [b]discovering new things[/b]:\nIt feels like the game forces you to do what it wants you do to, and if you don't, you don't progress at all. In a sandbox game, that is obviously terrible, but it gets worse when you take the fact that you have skills to level up into account. Their balance ends up getting screwed and your character will have tremendously high levels of certain skills, while they will be lacking in others, and that just feels pretty bad. It doesn't help that, sometimes, no matter how much you explore you'll end up not finding anything new, as all chests suck pretty bad, no matter their quality, and since you're not doing what \"the game wants you to do\", it just gets frustrating and boring.\n\nAbout [b]the combat[/b]:\nFighting in this game is not fun, is not intuitive, and most important of all: it's [u]not fair[/u]. It is designed in such a way that enemies' attacks are not telegraphed, most having instant cast times and no warning that they're coming. Yes, after a while you learn what certain enemies do, but that doesn't stop them from being completely unpredictable and unavoidable. Sometimes you end up just overwhelmed by a bunch of enemies who don't take their time crushing your health bar, while others leave you silenced, stunned and snared, while still dealing damage to you, all from a single enemy and all that at the same time! It's TERRIBLY designed in my opinion, and fighting them is not a joy that you also get xp from winning, it's a grind that you hope you don't end up dying midway.\n\n[b][i]FINAL AND IMPORTANT CONSIDERATIONS:[/i][/b]\nThe dev for this game clearly loves it and its community, and he is working day and night to fix every last bug the game has, and releases almost daily updates with a bunch of fixes. I am really glad when an independent dev is this transparent with the community and is passionate about bringing a good experience to the players. He even livestreams his development and fixes issues people report in real time.\n\nThat said, in the end it all comes down to how good the game is, and currently this game is in a state I DO NOT recommend people to buy it. The bugs are just too many, the content is just too little, with most of it repeating itself only with bigger numbers, the combat is boring and frustrating and exploring is not really rewarding at all, as you only see and collect more and more of the same, with a few changes here and there. What I see in this game is a lot of POTENTIAL, but potential itself doesn't make the game entertaining or unique, it's just what it could be, but may end up never becoming. In conclusion, Crea is not worth it right now. Go play Terraria and check back later.", "timestamp_created": 1466440848, "timestamp_updated": 1466440861, "voted_up": false, "votes_up": 298, "votes_funny": 12, "weighted_vote_score": "0.796241641044616699", "comment_count": 13, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "53928103": {"recommendationid": "53928103", "author": {"steamid": "76561197992723110", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 2186, "playtime_last_two_weeks": 0, "playtime_at_review": 1412, "last_played": 1565231317}, "language": "english", "review": "TLDR review: Terraria with skill gains and level ups. Nothing earth shattering, but a good bang for your buck if you like this  kind of game. I know I do.", "timestamp_created": 1562511651, "timestamp_updated": 1562511651, "voted_up": true, "votes_up": 41, "votes_funny": 0, "weighted_vote_score": "0.792120993137359619", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23567607": {"recommendationid": "23567607", "author": {"steamid": "76561198048659492", "num_games_owned": 5472, "num_reviews": 216, "playtime_forever": 2640, "playtime_last_two_weeks": 0, "playtime_at_review": 405, "last_played": 1473160142}, "language": "english", "review": "Disclaimer: i recieved this copy for free to write a review about the game. However this will not influece my review. Source of consideration: Siege Games\n\nCrea is a sandbox rpg game with a lot of farming, digging, gathering and exploring. The graphic is simple 2D graphic, however its not bad.\n\nHeard from friends, that Crea is a Terraria 2.0 game. I do own Terraria, but my library pretty huge so not had time to play that game yet, i cant confirm that information.\n\nCrea allows you to level your character in many different ways. Your gathering, crafting, arms skills, spell skills and alone your hero get different experience and all these have different leveling system. Reaching next level on those experience trees unlock purchaseable abilites/boosts for your character. So you can see, character development is pretty deep in Crea.\n\nYou cant craft any item you want right away. you need collect materials/ingerdients and then you need study those items, research them and then develop what could you craft from those. Sounds painful? its not, its fun, even if the research process destroys the item. New armors, weapons, building materials will be available as you progress through the game and as you research how to create those items, Crea offers a long and enjoyable gameplay while you build up your character, its house and clear hostile fauna.\n\nSadly i not had much time to play Crea yet because of Euro 2016 and Copa America, but i allready love it and would recommend to anyone, its a pretty decent game for its genre, developer definetly spent a lot of time on it and one of the few games on steam what actually left early access and now officially released! Additionally, Crea has an affordable price which not much compared to the playtime this game offers.\n\nPros:\n+deep character development\n+deep item research system\n+multiplayer available but you can enjoy single player just as much as multiplayer if you prefer that\n+the random generated worlds are huge, you have a lot to explore, monsters grant you hard, challenging figths\n+some might dislike this, but map shows suggested levels for areas so you can avoid areas where you would encounter much stronger enemies\n\n\nCons:\n-i have some issues with combat. magic casting too slow, melee much faster and stronger, it might change later as character evolves, ill keep an eye on this and will update review.\n-i need to further investigate the reason but sometimes i have lags and performance issues what i shouldnt have as my rig much-much better than requirements.\n\nOverall rating: 8/10 for the genre however i not seen any better game for this genre yet.", "timestamp_created": 1465987644, "timestamp_updated": 1465987726, "voted_up": true, "votes_up": 42, "votes_funny": 0, "weighted_vote_score": "0.791061758995056152", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23483605": {"recommendationid": "23483605", "author": {"steamid": "76561198023892474", "num_games_owned": 0, "num_reviews": 61, "playtime_forever": 2265, "playtime_last_two_weeks": 0, "playtime_at_review": 993, "last_played": 1466483079}, "language": "english", "review": "I am not going into differences/ similarities of this game with Terraria, others have done that and have done a great job explaining. \nI am just going to tell you why I like Crea:\n- looks great and runs fine on my old labtop\n- great RPG and leveling up mechanics; this was the main reason that made me buy \n- lots of skills to learn and master!\n- fun one-way challenge dungeons and battle arenas\n- lots of treasures to discover and areas to explore\n- every enemy has a different attack strategy and you have to learn those and figure out how to beat it\n- there are actually enemies that only attack when you do, so you can actually spend some time doing your own thing without something trying to kill you every 10 seconds. BIG PLUS for me\n- relaxing music\n- so far no zombies\n- great active, enthusiastic and friendly developer\n\nBe warned- this game is addictive. Just played 8h straight, just thinking \"only going to level up one more skill\" and \"collecting some more ore for a new sword\".\n\nIf you like 2D exploration, crafting, building and adventure games, you should give this a try. Very much recommended.", "timestamp_created": 1465561975, "timestamp_updated": 1465561975, "voted_up": true, "votes_up": 41, "votes_funny": 6, "weighted_vote_score": "0.790143609046936035", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "42025339": {"recommendationid": "42025339", "author": {"steamid": "76561198109381029", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 7514, "playtime_last_two_weeks": 0, "playtime_at_review": 1009, "last_played": 1606264537}, "language": "english", "review": "So I am a huge fan of sandbox/RPG/crafting games. I could play Terraria, Starbound, and Crea forever. Despite my recommendation, there are many issues that I have with the game.\n\nPros: \n- I love the talent system in this game. Other 2D sandbox games don't have leveling system at all which I've always wanted to have. You earn TP (talent points) by playing the game and doing different actions related to each talent. This makes for a very smooth progression. There are perks (e.g. double jump) that you can get by progressing that you generally have to craft for in games like Terraria. \n- Cute art and a fun design. I'm a sucker for well designed creatures. \n- Runs great on my old machine. \n- Unique crafting system. It doesn't get boring that's for sure! \n- Check points throughout the world so you can quicktravel. LOVE LOVE LOVE this! The checkpoints come in the form of permanent crystals. It costs crystal shards (that you can easily mine for) but it is very nice to be able to pop back where you wanted to be. \n- Useful NPCs. I can't be the only person to think the NPCs in Terraria/Starbound are fairly useless. Theres a couple of good ones but for me, they are mostly in the way. The NPCs in Crea actually provide valuable resources. \n\nCons: \n- The dungeons: I like the concept by itself. Much like the check point crystals, you enter the dungeons via special colored crystals. Not every dungeon has the same goal which is also nice. Some you have to hit switches, or kill all monsters, or just make it to the end without dying in 20 minutes. However, once you finish the dungeon, that's it. You just exit and continue. No reward for finishing it which is a bit of a let down. There are chests throughout the dungeon that grant rewards but I can't help but feel like there should be some kind of reward for actually finishing the dungeon. Maybe a bonus of the in-game currency? \n- A bit too freeform: I love freeform games. It's why I play games like Crea. However, there is not a lot that keeps me motivated to play. To draw comparisons: Terraria is all about entering Hardmode and defeating all the bosses. Theres a semi-linear progression that you can choose to follow or not. Starbound has a story that you can complete at your leisure. I am not asking for a story line but I would like to have a better way to access the lore of the game in a rewarding and satisfying way. \n- Farming/Gardening: why bother? If there is a reason to cultivate the plants in the game beyond some basic crafting, then I'm just not seeing it. \n- Level Progression: soooo slow. The only way to progress to the next level is through combat. The talent system is wonderful at getting you do to all sorts of things (crafting, mining, combat, etc.) but if it's not combat, then no XP. It's frustrating when you've been exploring for 2 hours but haven't gained a single bit of progress in the XP department when it counts for another game mechanic. It just doesn't make a ton of sense for me to be able to gain all this progress in one aspect of the game, but be stilted in another. \n\n\nAll in all, there are some definite improvements that could be made to the game that would motivate me to stick around. I enjoy the game-play and the exploration but it just needs a bit more to be truly something.", "timestamp_created": 1526244724, "timestamp_updated": 1526244724, "voted_up": true, "votes_up": 43, "votes_funny": 1, "weighted_vote_score": "0.788437485694885254", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "21407385": {"recommendationid": "21407385", "author": {"steamid": "76561198052782160", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 2012, "playtime_last_two_weeks": 0, "playtime_at_review": 1632, "last_played": 1560222640}, "language": "english", "review": "\ntl;dr\n\nThe game is solid and if you've been wanting character progression in games like Minecraft or Terraria that extends beyond just gear, this will scratch that itch. It's got a kink or two for me but most of that is based on personal taste.\n\nLeaves are money/10\n\nLong version:\n\nCrea satisfies a lot of itches I have about games. It has an EXP system that actually means something first of all, so all that \"self defense\" actually gets you something.... which is better self-defense outside of gear. More than that though, there's more to it than just combat.\n\nSpend a lot of time gathering? You get gathering XP, which can level up gathering talents; make your tools better, get a chance of getting multiple resources, it's all quite satisfying. Spend your days crafting? Get better at that, make better things with bigger stat bonuses. Which brings me to the stat system, another rpg element that I've missed in similar games. It's pretty standard as far as rpg-stats go, having your bread and butter physical-and-magical versions of attack and defense. You can bump up your health and stamina(used to attack or cast) as well, or your luck, but I haven't felt that the game railroads you into building up one stat or another.\n\nThe combat is split nicely between melee and magic, both of which have some ranged and melee options. Some players go mixed, others dedicate to magic or melee only; like many other things it's up to the player.\n\nThe building reminds me of Terraria, but with more furniture. Nightstand/10, would craft again.\n\nThe crafting is... interesting, as it's mixed with a research system where you need to essentially figure out what you'd need to make something. It consumes the material items or \"scraps\" that are produced during research, and you can't craft a given item until you've researched all it's components. It makes crafting things a bit more satisfying, though it can be tedious if you don't know what the next item is based on the siloette or where to get it. \n\nThe NPC system is based on putting outfits on figures. This brings the figure to life as that NPC, which can be \"collected\" as the outfit to then move base. Personally it kinda freaks me out that my base is full of wooden figures walking around, pretending to be human like I don't notice they're fucking made of wood, but that's just me.\n\nMy only two problems with the game are perhaps personal, but they may or may not resonate with you. One, for the longest time the game would randomly lag and be borderline unplayable. That seems to have fixed itself, so I may have missed an update where this was addressed. Secondly, it has Minecraft syndrome.\n\nI don't mean it's trying to be Minecraft. I mean there's no real direction at first and it's left to the player to figure things out. It's not spectacularly complex, certainly not to the point you can't figure it out, but I've found myself feeling a bit lost at points. The best thing I can tell you is to set small goals for yourself; you can do a lot in Crea, and having a plan helps. Build a house, shank a slime, dig a tunnel, cast some spells, get your shit pushed in by a Harvester, you do you.", "timestamp_created": 1456242144, "timestamp_updated": 1456242144, "voted_up": true, "votes_up": 55, "votes_funny": 8, "weighted_vote_score": "0.786851882934570313", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "28105449": {"recommendationid": "28105449", "author": {"steamid": "76561198000621658", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 418, "playtime_last_two_weeks": 0, "playtime_at_review": 260, "last_played": 1476899010}, "language": "english", "review": "Ok, so...\nThere are a lot of starbound, minecraft, terraria clones out and about these days.  They involve hours of endless grinding for materials and \"exploring\".  Some of them have interesting quirks like an advanced crafting systems for gizmos and gadgets or a semi-sophisticated battle system.  Both of those things exist in this game which create depth and playability, but the game lacks soul.  What I mean by that is the world is rather repetative, enemies are boring and forgettable, gathering materials drags out for hours and there's limited to no explanation for how to accomplish certain things.  I mean I get that the idea is to explore and discover how to construct and craft different things, but it feels more like a drawn out scavenger hunt without clues to the locations of the things you need.  The game is in early access, and we all remember how terraria and starbound were at this stage, so we'll see how the devs do with creating more interesting content.  For now, I'd recommend holding off on purchasing.", "timestamp_created": 1480535447, "timestamp_updated": 1480535447, "voted_up": false, "votes_up": 103, "votes_funny": 3, "weighted_vote_score": "0.786628365516662598", "comment_count": 11, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "79361165": {"recommendationid": "79361165", "author": {"steamid": "76561198020313592", "num_games_owned": 987, "num_reviews": 578, "playtime_forever": 3867, "playtime_last_two_weeks": 0, "playtime_at_review": 1643, "last_played": 1672154139}, "language": "english", "review": "[h1]Overview[/h1]\n[b]Crea[/b] is a single-player and co-op open world sandbox set in a once prosper fantasy world, now corrupted by chaos. Players impersonate a hero, which has risen to challenge the corrupted Gods, fight the evil that plagues the world and restore things as they should be. Starting out with nothing, one has to build a base to then craft, fight and research their way to success - while also finding the truth about past events.\n\n🟩 [b]The Good Side[/b]\n[list]\n[*][b]Mastering the Forge[/b]\nGear crafting in Crea is done with a brilliantly designed system. To make each equip piece, a mini-game has to be played in which one needs to get as much Quality as possible without running out of Balance. To achieve this, many skills become available with various effects - enabling the counter of random modifiers that keep appearing during crafting. An entire skill tree is in fact dedicated only to this process, as the game goes on also Enchanting Gems and Consumables come into play at some point, further expanding the mechanics around it.\n\n[*][b]Expect the unexpected[/b]\nAt all times, this title delivers a solid variety of monsters, random events, equipment types and progression possibilities. While the world is not THAT big, it has a lot of content that expands with progression. In addition to unique attack patterns and stats each, monsters appear in upgraded or entirely new forms as the game goes on, while random events and dungeon portals provide constant novelty. Abandoned treasure vaults, unique gear pieces, elite monsters, blueprints from an ancient past waiting to be deciphered, are only some of the things one can encounter or collect.\n\n[*][b]One hero, many paths[/b]\nCrea offers several skill trees one can invest into, that translate in different playstyles. Be it melee, ranged weapons or magic, each approach is equally viable with strengths and weaknesses to match. The XP system for skills is use-based, meaning players need to keep using a specific type of weapon to gain TP (skill points) for that ability branch. The same goes for other activities as well, such as Exploration and Crafting - each of these trees enables acquiring new skills once one has the correct mastery level and points to unlock them. A well done and satisfying progression system.\n\n[*][b]Management heaven[/b]\nThis title understands the logistical issues that come with managing a base in a sandbox game, and has features to match. For instance, Crea allows players to automatically stack items from their inventory into the respective chests with one click, sort loot, rename containers, quick-transfer single items and a convenient trash bin to get rid of unwanted things. All these quality-of-life improvements merge to create a functional system that saves players a lot of time and annoyance that could derive from a more \"manual\" organization style.\n[/list]\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=2287197049\n\n🟥 [b]The Bad Side[/b]\n[list]\n[*][b]THIS was the final boss? Now what?[/b]\nWhile the bosses of Crea are decently designed in general, and can provide a solid challenge, the same can't be said for the final boss. With a single attack pattern, no special mechanics and unremarkable abilities, this bland fight ends the Hero's journey with an underwhelming triumph. In addition, new materials and recipes are unlocked afterwards, that however have no real point in being researched / crafted since the final bass is already gone and, to my knowledge (and the game wiki), there doesn't seem to be another one afterwards.\n[/list]\n\n[h3]Rating: Excellent[/h3]\n[url=https://steamcommunity.com/sharedfiles/filedetails/?id=1989090445]Click here for the complete Rating Chart[/url]\n[i]It took me around 27 hours to complete the game in Regular mode, while researching most items and building a full base. For the default price of 14€ and excellent quality, I can recommend without doubt to get Crea for full price.[/i]\n\n[quote]Liked this review, and want to see more of the same quality? Check out [url=https://store.steampowered.com/curator/39323490]Tamaster's Review Archive[/url] to see all my Reviews in a single, convenient location.[/quote]\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=2287197464\n\n[h1]In-Depth Breakdown[/h1]\n🎮 [b]Gameplay Analysis[/b]\nGameplay is divided into Exploration, Combat, Crafting and Character Management.\n\n[b]Exploration[/b]\nIs performed on foot, while fast travel is available between discovered Way Crystals if one has enough Shards. These fragments also allow returning to the Attuned (favorite) Crystal when used from anywhere in the world. The lands are not overly huge, but have a lot of generated content such as treasure vaults, random events, dungeons and elite enemies. Exploring is both a necessity and a pleasure thanks to good variety and tangible sense of reward. A handy map shows explored areas, while it can be upgraded by a specific NPC to also show found chests, crystals and more useful things.\n\n[b]Combat[/b]\nPlays out in different ways, depending on the player's favorite approach. The main schools are Syle (magic), Arms (melee) and Ranged (bows) - but one can also choose to combine them by becoming proficient in multiple styles, which requires more time. Each combat style has pros and cons to it, while the character stats influence heavily the effectiveness of certain skills (for instance Strength improves melee damage). Withe continued use, players gain XP for the relative skill tree, enabling them to acquire superior skill levels or entirely new ones. \n\nCombat relies on dodge-rolls, shield blocks or just well timed movements to evade or deflect enemy blows, while having up-to-date armor and equipment is fundamental to not become underpowered. The stamina bar acts both as Mana for spells and evasive actions, so managing it well is a crucial part of any fight - even if the regeneration is quite fast. Enemies can inflict a plethora of status effects such as Silence, Poison and more, but of course player spells or special weapons can do just the same.\n\n[b]Crafting[/b]\nBranches off between Normal and Gear crafting. The former one works like any other system of similar Sandbox games, where players simply need to gather the required materials near a crafting table to instantly produce the final item. On the other hand, Gear crafting is a much more complex (and unique) system that uses Balance and Quality as main stats of a minigame composed of modifiers, skills and usable items. \n\nThe aim of such system is getting the best quality possible, before running out of Balance, and this requires both experience in the form of skills, and working out the \"meta\" of the system by trial and error - at first it may seem annoying and unfair but once one gets the hang of it, it becomes quite brilliant to use. Research is another form of crafting that unlocks new blueprints, if the required material for the Project are all delivered.\n\n[b]Character Management[/b]\nIs performed via a series of classic menus, such as inventory, skill trees and equipment. Each level some Infusion points (stats) can be added to one's attributes to progress a character build, while the same goes for the various skill trees once a certain proficiency level is acquired. Thanks to many quality of life improvements and automation, managing inventories is considerably easier and faster than one would expect.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=2288368729\n\n[h2]Technical Corner[/h2]\n[u]Specs: RTX 2080Ti, Ryzen 9 3900X, 32GB RAM, 970 PRO NVME SSD[/u]\n\n[list]\n[*][b]Critical Problems[/b]\nNone.\n\n[*][b]Performance[/b]\nAverage VRAM Usage: < 1GB (negligible)\nAverage GPU Utilization: 30-40%\nSettings Used: All Maxed, 1440p 60Hz\nOverall Optimization Rating: Good\n\n[*][b]Bugs & Other Issues[/b]\nNone.\n[/list]", "timestamp_created": 1605539737, "timestamp_updated": 1607710452, "voted_up": true, "votes_up": 42, "votes_funny": 1, "weighted_vote_score": "0.774406790733337402", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "20924271": {"recommendationid": "20924271", "author": {"steamid": "76561198045359347", "num_games_owned": 455, "num_reviews": 19, "playtime_forever": 8195, "playtime_last_two_weeks": 0, "playtime_at_review": 859, "last_played": 1564896076}, "language": "english", "review": "It reminds me of the things I liked about Terraria; it doesn't have too much complex graphical detail, it's not hard to learn, and it has transferable characters in sandbox worlds! Though this game holds different things I like, for example the random dungeons spawned from crystals and learning recipes using different resources. Also, while Terraria does allow upgrading one's health, mana and accessory slots, this game extends on the ability to power up your character however you see fit.", "timestamp_created": 1454468719, "timestamp_updated": 1454468719, "voted_up": true, "votes_up": 30, "votes_funny": 0, "weighted_vote_score": "0.769551217555999756", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "47955213": {"recommendationid": "47955213", "author": {"steamid": "76561197998815819", "num_games_owned": 0, "num_reviews": 48, "playtime_forever": 866, "playtime_last_two_weeks": 0, "playtime_at_review": 866, "last_played": 1546172377}, "language": "english", "review": "[h1]Good Stuff[/h1]\n\n[b]Art:[/b]\nThe art in this game is really nice. The visual design of the characters, landscapes, and spells are all nicely done, as are the animations. The textures on the blocks you can place in world tile nicely together, and allow for some really pretty constructions, if you have the patience to make them.\n\n[b]Crafting:[/b]\nThe crafting minigame is really interesting. Normally, the words \"crafting\" & \"minigame\" would only elicit an eyeroll and maybe a sigh from me, but this one was neat. Without going into too much detail, you have to select various skills to try to make a high quality weapon, while managing 'entropy'. Once you run out of energy, the craft is over, and whatever quality you managed to get to is locked in. There is a surprising amount of depth in this system, and I found myself having to make tough choices, such as 'do I want to use my big cooldown and get a ton of quality incrase right in the start, or do I want to wait until I'm almost out of energy to activate a different ability that increases in power the longer I wait, to get a potneial HUGE payoff in weapon quality?' All in all, it was quite fun, once I figured it out.\n\n\n[h1]Needs Work, But It Could Easily Get There [/h1]\n\n[b]Research:[/b]\nThis game features a research system, which controls what items you are able to craft. The research system involves collecting certain items, and then consuming them to unlock a tier of research. Things such as \"Iron Working\" or \"Wood Carpentry III\" would unlock the ability to make iron armor, or fancy wooden beds, respectively. However, after a certain point, the specific items that the research require are oddly specific, and not really at all related to the research. It's obvious that these items are required due to progression's sake, so you can't unlock really strong stuff too early or easily, but it just falls flat to me.\n\n[b]Equipment:[/b]\nOn that note, the items & equipment that the player can use also could use some work. The player has a character level, and all gear has a level requirement to use. If you find gear higher level than your character, you can't use it, full stop. Speaking of finding gear, it seems that you never find gear at all, only \"enchantments\", which are little stat-nuggets you can put on gear you've crafted. So, if you are level 10, and venture into a level 25 area, manage to score some loot and escape, well nuts to you, you can't use that stuff until you're level 20-30. On top of that, because the real power of the gear comes from enchantments, all the gear feels samey. The basic sword does 10-20 damage, depending on quality level. The bronze sword does 15-25 damage, depending on quality level. They are otherwise identical. The same swing speed, the same reach, and the same knockback. The only difference is what stat-nuggets you slotted into them, for what effects it gets. (note, that while I enjoyed the crafting minigame, as stated above, the actual items you craft using it are boring and feel generic)\n\n[b]Skills & Abilities:[/b]\nThe skill system is pretty well done, but the actual skilsl themselves need some pretty heavy-handed balance to fix them up. Some skills, like quake (aoe, targets anywhere your mouse cursor can point) are really good! Other skills, like magic arrow, (it's an arrow, but more expensive and weaker!) feel pointless. Also, the buffs all suck, categorically. 10% reduced physical damage? I can't even tell! 10% fsater attack speed? Uh, ok I guess, but my friends whom I cast the spell on didn't notice it existed for all of 2 hours. Maybe they get better at higher levels, but at low levels, they suck, and I regreted buying them. On that note, trying to earn TP (skill XP) from buffs was also way too slow. My friend who used wands get to level 18 in magic, I was only taking the buff spells, and I got to level 6 in the same period of time, constantly spamming them at every opportunity. Feels bad.\n\n[b]Dungeons:[/b]\nDo one dungeon, you've done them all. I did 5 dungeons, and the last 4 of them were identical to the 1st one, just with a different tileset. 'Kill all enemies'. 'Flip all switches'. 'Find the key'. 'Defend this doodad'. Not all hope is lost, however. I think the dungeons could go from major snoozefests to really competant adventures fairly easily. The main change needed is to open up the dungeon prefabs to the workshop, and then potentially hold a contest to get the designs submitted into the game. Suddenly, it goes from just 5-10 room layouts, repeated forever, to 500-1000 room layouts. Mix & match the procedurally generated dungeon floors with some handcraft rooms, or even entirely handcrafted floors (realms). That alone would make dungeons a lot better, to avoid repetition, and actually encounter cleverly placed traps, enemy spawn locations, and puzzles / objectives.\n\n\n[h1]Not A Fan[/h1]\n\n[b]World Scaling:[/b]\nLittle did I know, but after about 15 minutes of playtime, I'd already seen almost every monster type in the game! The monsters I would fight later were just bigger, higher level versions of these same monsters, but with more HP & damage! I'm not saying there needs to be more enemy types, I'm merely saying that the game holds very little back. It throws all it's cool stuff at you fast, and after maybe an hour, it's already repeated quite a few times. The game relies heavily on it's progression for content, but all the progression is just re-doing the same things you've done before, but with bigger numbers attached. Level 15 enemies instead of level 5. Level 30 enemies instead of level 15!\n\n[h1]The Verdict[/h1]\nIt's a fun game, and I enjoyed the time I played in it. However, at this time, I don't really feel like I'm going to play it any more than the time I've already got in it, and that's a bit sad, because it's got a lot going for it. Not to beat a dead horse, but it's no Terraria. However, if in the future, it gets the ol' Terraria 1.1-style upgradearoo, then I'd happily go back and give it a go again.", "timestamp_created": 1546173944, "timestamp_updated": 1546176010, "voted_up": true, "votes_up": 25, "votes_funny": 0, "weighted_vote_score": "0.766209840774536133", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "60076026": {"recommendationid": "60076026", "author": {"steamid": "76561198045844610", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 3061, "playtime_last_two_weeks": 0, "playtime_at_review": 3015, "last_played": 1576693427}, "language": "english", "review": "It's a fun game but as someone that ADORES Terraria I just want to set expectations.\nIs it VERY similar to Terraria... yes.  You mine and craft with what you got.  As you progress to new tools and challenges there is more to mine, more recipes, the gear gets stronger.\n\nYou can, in this game, pick stats as you level and other skills which make it slightly different.\n\nThe game is fun! \nThe game is MUCH smaller than Terraria.  I've spent months on a single character / world with Terraria.  I felt like I had seen all this game's content in about a week.  I had a good time but this is game is just MUCH smaller.  If you want to scratch that Terraria itch... give it a go.  Just don't expect this to be on the same level as a Minecraft or Terraria.  There are a few bosses but otherwise its repetitive fighting and exploring.  There aren't really biomes or anything... the same enemies just scale up to your level.\n\nThis game is not difficult but its fun for a week or so.", "timestamp_created": 1576687454, "timestamp_updated": 1576687454, "voted_up": true, "votes_up": 30, "votes_funny": 0, "weighted_vote_score": "0.764058411121368408", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "13137165": {"recommendationid": "13137165", "author": {"steamid": "76561197993818292", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 5273, "playtime_last_two_weeks": 0, "playtime_at_review": 3044, "last_played": 1624942160}, "language": "english", "review": "Having played multiple games of this specific genre on Steam, I can definitely say that Crea offers the most enjoyable and creative experience of them (Terraria, Starbound, Edge of Space). To fully enjoy this game, however, you must like the genre first (\"sandbox\"), and you will need to adjust your habits from similar games.\n---\nTerraria started (well, maybe not just Terraria, but Terraria was among the first) the craze of (2D) sandbox games, but the game cannot be truly called an Action RPG as well. Game progress, including all the equipment and weapons you get, is defined solely through crafting and picking up items. Even health is determined mostly by finding Life Crystals. Weapons themselves become the measurement of progress, too. (That is to say, you probably won't be using a Minishark in hard mode, but the Megashark is conveniently there.)\n\nIn Crea, your progress and effort also define growth of your character in the form of skill points (experience). For every action that you take that is either appropriate or hard for your level, you gain experience. In fact, Crea becomes more of an RPG, because each character can level skills to their benefit. Even special skills become bound to your character, that were otherwise items in Terraria, e.g. Hermes Boots. I suppose I didn't realize how limited Terraria's design was until I saw (before I discovered Crea) how little space I have for everything. On a similar point, using equipment is straightforward; unlike the three aforementioned games, you can put those on your character's equipment screen and use the appropriate skill. For example, you can change your harvesting tool (which can harvest like an axe or pickaxe by the way) and not need to change your hotkeys.\n---\nIn Crea, not many enemies exist, but each is uniquely designed. Specifically, each enemy attacks in a different way, may be influenced by the time of day in some way, and exists in different biomes (with some possible overlap). Generally, you cannot just rush into enemies and make it out alive; by comparison, Crea is much harder than Terraria but more reasonable than Starbound (looking at you, tier 10 planets) and Edge of Space (when I played it; apologies if I'm wrong now). You need to carefully attack enemies, because running out of SP (energy meter) may possibly result in your death. Many of these enemies also have alternate attacks that are deadly. I'm glad that the game is challenging but not \"cheap\" either. Without spoiling the content, I can confirm that the bosses are also very specially designed. The game is unfortunately vague sometimes, so you may not have the right idea about accessing a boss.\n---\nMany of the gameplay issues I encountered awhile ago have been fixed. These weren't necessarily game-crashing glitches but more or less how you play the game. Thankfully, researching materials has become easier since you can use a fairly common item called Scraps instead of the item itself. Other things were changed, too, but the thing I'm most grateful of this game is that it's being very actively maintained and updated, considering the size and resources of the developing team. I don't want to stress the developers, but they've really made the game enjoyable as each update passes.\n---\nIn other thoughts, Crea has a very distinct yet nicely done art style. It doesn't look quite as \"pretty\" as Starbound's, but it's much nicer, especially considering the detail and relative sizes of objects. For example, several crafting stations (like the Ingot Mold) are tiny, but they are very nicely drawn and detailed too. For that, I consider the sprite work excellent. Additionally, the color palette is nice on the eyes and yet distinct - I can spot ore that is different, for example, so that's a plus.\n---\nWith that said, I fully recommend the game.", "timestamp_created": 1417249745, "timestamp_updated": 1417249745, "voted_up": true, "votes_up": 125, "votes_funny": 9, "weighted_vote_score": "0.759876072406768799", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "24917234": {"recommendationid": "24917234", "author": {"steamid": "76561197972290923", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 1222, "playtime_last_two_weeks": 0, "playtime_at_review": 1165, "last_played": 1474915028}, "language": "english", "review": "9/10, very enjoyable\n\nI'm not too far in, only 7 hours, but I have to say I'm enjoying it so far. Everyone goes into this game comparing it to Terarria, so I will make my points comparing the two for those of you, whom like me, want something worth playing in the same genre. The crafting system does take some getting used to, but i like the combat and RPG element.  The more the use particular skills, the more points you get to level up the tree those skills are in.  It's a neat system that encourages you to use whatever playstyle you like without having to rely heavily on gear for modifiers.  I've seen people complain that it can be grindy, but I don't see it anymore in this game than in Terarria (which i put EXTENSIVE time into, about 800 hours).  Sure, you have to grind out some baddies to get materials, but i remember building grind traps in Terarria and sitting there for hours on end collecting mats.  I like that you can customize your toon into a class build without having to rely specificly on armor sets, something I did not enjoy about Terarria.  The collecting/gathering is done well.  You can upgrade your gathering skill and collect large amounds of tiles at once, instead of having to chip away 1 at a time, another thing I am enjoying over Terraria. I do prefer Terarria's highlight mode, which will allow you to auto dig tunnels in a diagonal fashion to form easy stairs up or down.  This is something I haven't quite been able to perfect in Crea yet. They have mini-instances which you have to go into and complete objectives in order to escape.  They also have spawn rooms where you have to vanquish all the mobs and spawners, then you receive a huge loot stash.  So far, I feel both of those elemnts are rather rewarding.  There are random chests and ore to stumble across, and even spells that will light up  said chests/ore for a brief period of time so you can better see them.  I did hate having to rely on Spelunker potions in Terarria, and those spells have made me incredibly happy so far.  The higher you level them up, the higher grade ore/chest will be highlights. They also employ a waypoint system which makes traveling around a lot easier than having to build minecart tracks all over the entire map.  Overall I think its pretty good.  I enjoyed Terraria. I am now enjoying Crea.  When i get toward end-game content, ill re-review and let you know if anything changes.  As of right now, I would definitely recommend it to anyone who likes this genre of gaming.  Just remember; It's not Terarria. It's Crea. Terraria was fun, and so far, Crea is fun ;)\n\nEdit:  \n\n5/10 fun to start, but flops in the end. \n\nAlright. So after putting in about 20 hours, I have some new opinions.  One thing that Terarria does well which Crea does not is events and bosses.  When the goblins spawn for the first time, or that first night when the Eye of Cthulu attacks, it's crazy exciting, and gives you an objective to complete.  Kill those baddies.  It may mean you need to get some better gear, change the layout of your house, enlist the help of a buddy, w/e.  Crea is dissapointlingly lacking in this department.  Around the 15 hour mark, I found myself just looking for the next set of gear... then realized... why?  There is no main objective.  I don't have a supreme being to kill, or waves of monsters to defend my home from.  It just becomes the same 20 monsters that you need to kill over and over w/o any pot of gold at the end of the rainbow.  In short, it gets boring.  I have not even needed to dig in the last 10 levels.  Everything you need can be obtained from monsters, spawners, and dungeons.  So I have this massive world, but have only explored 1/4 of it ( ran through the entire map to see the different biomes/monsters) and feel no reason to even bother checking out the rest.  I read up on the bosses to see if/when they would spawn, and it seems all of them are non essential to progress in the game and can be avoided entirely.  What started out as a really interesting game has, after a few days of play, fallen flat.  If you enjoy mindless repetition and have no desire to accomplish and \"end\" to a game, then Crea is for you!  As for me, not so much.", "timestamp_created": 1471199031, "timestamp_updated": 1471360503, "voted_up": false, "votes_up": 80, "votes_funny": 7, "weighted_vote_score": "0.754811882972717285", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "29161646": {"recommendationid": "29161646", "author": {"steamid": "76561198336510469", "num_games_owned": 0, "num_reviews": 24, "playtime_forever": 862, "playtime_last_two_weeks": 0, "playtime_at_review": 215, "last_played": 1650746747}, "language": "english", "review": "Your first reaction may be that this game is a ripoff of other games.\nI loved Terarria. I loved Starbound. I love this game even more.\n\nWHY?\nThe combat and levelling system. It brings the game style to a whole new level. Do you like to craft? Your skill improves as you use it. Do you like to fight? As everything else, you get better as you progress. Also, some variety of enemies make the game more interesting.\n\nHOWEVER\nThe game runs slow for many, much like Starbound, including myself. I suffer through it, as I think its worth it, but you may not be so inclined.\n\nBUT...\nThe developer (who is quite active) has narrowed the problem down to the UI, and is completely re-doing it, not a small task. It will take time... BUT when its done, I'm sure the game will be so, so, so much better. And then this game will really shine.\n\nSHOULD YOU BUY IT?\nIf you liked the aforementioned games, and are intrigued by the levelling system, then by all means, you should give it a go. Keep in mind the optimization issues... but if the game is too slow for you, you will know right away and can request a refund.\nAlso, if you're new to the genre, I would recommend this game the most out of the three. The game does have a tutorial that introduces some basics, and the rest isn't that hard to figure out. Still, if you're having problems, the Crea community is friendly and helpful, so don't be afraid to check out the discussion boards.\n\nAll in all, I recommend this game over the other three, not only for the content I touched on, but also because this game has the most potential of becoming better.\n\nMy final suggestion: if you're adventurous, give it a try now... you can refund immediately if you have issues. But when the update comes (eventually, be patient), this game should be a must have on your list (if it lives up to the hype).\n\nAnyway, I'll try to remember to update this review when the game is updated, and let you know of my performance difference.\n\nSuggest you read the discussion board \"What Makes Crea Different?\" if you're curious.\nhttp://steamcommunity.com/app/280520/discussions/0/357288572117808789/", "timestamp_created": 1484054205, "timestamp_updated": 1484054580, "voted_up": true, "votes_up": 25, "votes_funny": 0, "weighted_vote_score": "0.745158612728118896", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "14282327": {"recommendationid": "14282327", "author": {"steamid": "76561197995626756", "num_games_owned": 502, "num_reviews": 30, "playtime_forever": 357, "playtime_last_two_weeks": 0, "playtime_at_review": 357, "last_played": 1422808912}, "language": "english", "review": "This is a pretty standard Terraria style game.  The only differences are that you craft NPCs and in order to learn new recipes you need to find a material and then research on it.  You can craft from chests, which is really nice.\n\nBy far the biggest downside is the bugs right now.  They simply make the game no fun because you're constantly losing items that you crafted, losing characters, having skills get bugged etc.  Give it 6 months or so for them to fix all the bugs and then it'll be worth it.", "timestamp_created": 1422808856, "timestamp_updated": 1422808856, "voted_up": false, "votes_up": 307, "votes_funny": 26, "weighted_vote_score": "0.743613719940185547", "comment_count": 17, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "23467036": {"recommendationid": "23467036", "author": {"steamid": "76561197982914211", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 1378, "playtime_last_two_weeks": 0, "playtime_at_review": 1205, "last_played": 1484085474}, "language": "english", "review": "So long have I waited for a game like Starbound and Terraria...\nCrea fulfilled my wish! \nWhile using already known elements, Crea also throws a great recipe research system into the mix. Innovative, crazy creatures and beautiful surroundings, many treasures to find and randomly generated dungeons.\nI have to confess, even after reading the developer's note about buying Crea on official release, I couldn't wait.\nSince that's the Early Access version, I will not complain about, but merely mention some negative aspects:\n\n- Before reaching ~lvl 10, the game is incredibly difficult (for a casual player). The monsters are a bit over the top. Especially, if you leave the starting biome too early, you will be confronted with permanent death.\n\n- High level requirements for items: even IF you manage to outrun and kite all the dangers, you might find a chest with very cool weapons...for level 20+. That is, if the chest is not locked in the first place. (In that case, you have to boost your explore skill high enough to enable the lockpicking perk. You will be pleased to find out that you have to craft lockpicks, plus, they have only a certain chance to open chests. Or look for a key within a dungeon)\n\n- the dungeons come with random parameters everytime you enter one (Awesome mechanic). But, you have to figure them out by trial and error. No explanation is given on how they actually affect you or the enemies. This is a minor issue though, because crafting the Dungeoneer buddy will help you sort through the different dungeon modifiers.\n\n- last but not least: at this point, the bowels of the planet ( volcanic fields) are pretty much empty, except for some stray teleporting monsters, who wanted to end their life by blinking into the lava.\n\nAs mentioned before, this is absolutely acceptable for an Early Access. And these points don't make Crea a bad game, at all. I fell in love with it. And if you're into exploring, digging, building and crafting, you definetely should give it a try.\nToday, the 1.0 build should be released and I am looking forward to it. Get this game, ladies and gents! Support the devs, they created something beautiful, here.", "timestamp_created": 1465474654, "timestamp_updated": 1465474654, "voted_up": true, "votes_up": 56, "votes_funny": 4, "weighted_vote_score": "0.724059045314788818", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "20498267": {"recommendationid": "20498267", "author": {"steamid": "76561198103370312", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 1664, "playtime_last_two_weeks": 0, "playtime_at_review": 1623, "last_played": 1530154679}, "language": "english", "review": "After 20 hours of gameplay in 3 days, it's well past time for me to give some feedback. Please note that this may contain spoilers for newer players.\n\nCombat:\nThe combat system is intricate and diverse. You can go from being a magic-wielding battlemage to a deadly archer to a brutal melee character, with no long-term effects if alternating between different playstyles. You have a lot of unique skills that can be used to kill enemies, defend yourself, or heal yourself. There are 4 different weapons; bows, swords, spears, and magic. \n\nBows are the most powerful of the 4 in terms of damage. The ammo is fairly simple to get assuming the player isn't using the bow for every minor encounter. \n\nPros:\nEasy-to-get ammo\nHigh damage output\n\nCons:\nOccasionally on shooting, the trajectory is a good bit off of what one would expect. You can more easily see what I am describing when shooting down at enemies. \n\nSwords are the next weapon and the better of the two melees. They are dangerous to use in comparison to other weapon types.\n\nPros:\nInfinite usage\n\nCons:\nLimited to ground or low-flying enemies\nDangerous to use, even with melee armor\n\nMagic is the third strongest of the 4 in my opinion. It is diverse in terms of skills, simple in terms of weapon types.\n\nPros:\nRanged attacks\nUtility and damage skills\n\nCons:\nWands have short ranged attacks that make them difficult to use\nLow damage output\n\nSpears are the final weapon. They are not very good at all.\n\nPros:\n\nCons:\nHard to use; aiming at enemies that are in you is practically impossible.\n\n\nThe combat weapons are interesting as there are a lot of them to use. Swords will limit players' abilities to button mash as there is a better way to swing that involves timing and precision rather than button-mashing. The stamina limitation is understandable but a little bit unnecessary for attacks, in my opinion. The magic wands and skills drain stamina rather than mana or something else of the sort, which makes little sense. Although this avoids confusion, it isn't very realistic.\n\nCrafting:\n\nThe crafting system is clever and fun. Crea has modifiers just like Terraria, however these modifiers are applied to weapons via a system called Chaos crafting. After playing a short minigame, the end quality that you score is then used to determine the quality of the modifier you receive. The system is interesting and better than Terraria's reforging system as it doesn't involve mass amounts of currency and the end quality of an item can be controlled through skill progression. \n\nIn addition to Chaos crafting, the other notable mechanic of crafting is research. Researching a recipe is necessary in order to craft it, and the researching is done by consuming crafting ingredients. The system only allows you to research items that for sure are used in something, and as far as my experiences go the consumption of an item guarantees you are on step closer to the end of a recipe. This system is a great way to create progression and it is a clever one overall. \n\nBosses:\n\nThe bosses in Crea aren't the best in my honest opinion. Although they are unique, the actual implementation is lacking.\n\nSano:\n\nSano is the first boss you will fight, generally speaking. The fight involves you to bring down the shield around her by using her own attack on her, and then you attack her like crazy during the 10 seconds before she resummons her shield. The fight is fun and challenging. The part about her that I don't like is that there isn't a clear goal to go to after defeating her. \n\nDormian:\n\nDormian is the second boss in the game. Dormian is the opposite of Sano in that the goals after the boss fight are clear but the actual boss fight is poor. The reason I say this is because the boss fight comes down to attacking the right clone of him to bring his health down. The actual attacks he uses are balanced and fun, however figuring out how to attack him is very complicated. After already defeating him, I still don't completely understand the logic behind which is attackable and which isn't. It came down to a game of attacking random ones so that when they all shifted again one of the ones I attacked would lower the health of the others. \n\nMiscellaneous:\n\n-Numerous bugs are in the game, however numerous bugs are being fixes every single day by the developer. \n-Performance issues that include massive drops in FPS that happen periodically. Performance was greatly increased over Weekly Update #23, however.\n-A longer tutorial that detailed parts of the game beyond Chaos crafting (remnas, for example) would be much appreciated by newer players. This is especially important due to the lack of an up-to-date wiki. \n-The developer, Jasson is very active and friendly. Numerous bugs are fixed each day and the developer is very helpful on the forums. It is great for the future of the game to have such a developer working on it and helping its community.", "timestamp_created": 1452651330, "timestamp_updated": 1452651330, "voted_up": true, "votes_up": 23, "votes_funny": 3, "weighted_vote_score": "0.721816658973693848", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "33655374": {"recommendationid": "33655374", "author": {"steamid": "76561198025835279", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 2802, "playtime_last_two_weeks": 0, "playtime_at_review": 2257, "last_played": 1515855210}, "language": "english", "review": "It's an absolute shame every platform has seemingly done away with star ratings -- though I think I get it, it's a way to drive sales.\n\nSince, I'd recommend this game, but I'd only give it about a [b]3 - 3.5 / 5 rating[/b]. It's an average game.\n\nThe first 20 or so hours of this game are amazing -- though I'd imagine this number might be lower if you accidentally discover what you're supposed to do first, or choose to play in a medium sized world first. \n\nMy spoiler-free review is this: this game will feel very familiar if you've played any crafting game before (quickly becoming my favorite genre) -- but, unfortunately, Crea doesn't really offer anything new in the genre. It does streamline certain things (things like weapons and gear do not have durability), and there is a heavy emphasis on fighting -- which isn't a bad thing, except, ultimately, it ends up feeling like fighting for fighting's sake. \n\nThere is lore in this game, but it is not presented in a forthright way -- thus there is little-to-no incentive to care about it. \n\n[b]My spoiler free review is this[/b]: if you're interested in a quick, 2D RPG-light, crafting/adventuring fix to play with a friend or loved one, I highly recommend this.\nBut if you're looking for something deeper, look elsewhere. I'm almost 40 hours in, and while I still enjoy it, about 15 or so hours ago the charm wore off, and now I am more or less chasing achievements where fun happens too infrequently. \n\nSpoilers: \n[spoiler]\nThis game's fun quickly diminishes when you kind of figure out the pattern: research everything, fight the boss, rise and repeat. Magic feels underwhelming and not as fun as melee. The game tends to flood the screen with bad guys, and magic is just too slow and weak -- I know there are ways to circumvent this via crafting; however, early game will dictate a player's choice, and most likely they will feel obligated to go toward a melee build. \n\nThere are too few areas and too few monsters -- there should definitely be just as much stuff going on up in the clouds as there is underground -- but there isn't -- in fact, in my large-generated world, I only got one or two areas where there was stuff happening high up -- and by the time I discovered it, it was nothing new -- no new textures and no new monsters. \n\nThe game needs more stuff to do besides just level -- ultimately everything comes down to: what is your level via combat. So there is a large incentive placed on leveling up your character as opposed to building a house, etc. \n\nThere needs to be incentives for crafting housing items (maybe during the night monsters get a lot stronger and way more aggressive?); also, there should be reasons for farming -- there are shears in the game, and when I discovered that, I thought I'd be able to mate and feed sheep, and maybe find other animals I could essentially farm -- but there was no \"gate\" item, no way to easily hear sheep (for fun I grappled a bunch of them up into my \"above ground\" \"farm\". \n\nThis game would benefit from quests, more mechanics, and more mysteries to uncover.   \n[/spoiler]\n\n\n", "timestamp_created": 1500484247, "timestamp_updated": 1500484247, "voted_up": true, "votes_up": 29, "votes_funny": 0, "weighted_vote_score": "0.716659069061279297", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "32833950": {"recommendationid": "32833950", "author": {"steamid": "76561197976237743", "num_games_owned": 0, "num_reviews": 125, "playtime_forever": 815, "playtime_last_two_weeks": 0, "playtime_at_review": 695, "last_played": 1585604091}, "language": "english", "review": "I've been following this game since 2015, and there's been a lot of improvement. The developer does streams, and there's a Discord server where you can interact with him. \n\nIt's a little slower than Terraria, but it does have its own, unique charm.", "timestamp_created": 1498517932, "timestamp_updated": 1498517932, "voted_up": true, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.713444709777832031", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23556924": {"recommendationid": "23556924", "author": {"steamid": "76561198069634986", "num_games_owned": 3365, "num_reviews": 92, "playtime_forever": 497, "playtime_last_two_weeks": 0, "playtime_at_review": 497, "last_played": 1465926204}, "language": "english", "review": "[b]Crea[/b] is a sandbox procedurally-generated crafting game with really nice graphics and interesting mechanics.\nIf this review is too long for you, I suggest you to only read the first paragraph about the game's content and the final verdict at the end.\n\n[h1]What is happening in the game:[/h1]\nThe principle is the same as in most other similar sandbox game: you have to kill monsters, gather resources, explore, craft and other things all in order to survive and make progress. Since there are many other similar games of this genre, the quality of the game is really important in order to beat the competition and this game certainly has the potential to do so.\n\n[h1]Pros:[/h1]\n[list]\n    [*][b]Graphics[/b] | The first noticeable thing is of course what this game looks like. It sure does look nice, I especially liked the little windows for crafting, researching and inventory. Also, when the night comes, torches emit warm light which truly looks amazing.\n    [*][b]Leveling[/b] | For most actions, you get some experience points and, after a while, you can level up in the action you were performing. For example, chopping down a lot of trees gets you a higher level of Gather. You also get a point to spend on your stats, such as Intelligence or Stamina.\n    [*][b]Researching and Crafting[/b] | Before you can craft anything, you have to research it first. I found this really enjoyable, since I got that [i]\"what am I going to get now?\"[/i] feeling every time I was going to research something. This also adds another great thing, which is uncovering the items gradually and this helps the player get familiar with them at his own pace. When you feel like you need some more items, you just do some research and hopefully, you get something you like.\n    [*][b]Two Modes[/b] | So, you basically have two loadouts: one for fighting and one for [i]\"friendly\"[/i] activities, such as gathering resources and placing items. In my opinion, this is a really good idea, since in some other games you have to switch to specific items manually and it can be quite confusing, but here it's as easy as pressing a button (literally) to be ready for a fight. \n    [*][b]Exploring[/b] | There is a surprising amount of content waiting to be discovered in this game. There are portals, hidden chests and a lot of other things. This is another one of those things that make this game better.\n    [*][b]Singleplayer and Multiplayer[/b] | You can play alone, but if you ever feel like you need some company, you can find yourself a server and play with others. Both are good.\n    [*][b]Steam Integration[/b] | This game has Trading Cards and Achievements. It also has Cloud and Workshop support, which is really awesome.\n    [*][b]Availability on Different Platforms[/b] | Crea supports all three major operating systems. Nothing else to add, it's just good to see that devs are actually caring about that.\n[/list]\n\n[h1]Cons:[/h1]\n[list]\n    [*][b]Lack of Dedicated Servers[/b] | There aren't any [i]\"official\"[/i] servers in existence right now, so you have to do some work yourself to find a community-ran server you can play on. This should be fixed, since not everybody has enough patience to find a server manually.\n    [*][b]Unfriendly to Beginners[/b] | You don't get many things explained in this game, you mostly progress by discovering things yourself. This can be really hard for some people (read: me) and it may present quite a barrier for people who are trying to get started with Crea. This a common problem with games of the same genre, I guess they just assume that we know everything from similar games.\n    [*][b]Resource Usage[/b] | This game really requires a long time to get itself started. I can sometimes hear my computer struggling. However, I have never seen any lags or FPS drops, so I'm not sure what to think about this.\n[/list]\n\n[h1]The final verdict:[/h1]\nCrea is most certainly a wonderful game. It looks good, it's very interesting and really entertaining. Although it may be hard for some people to get started, the enjoyment afterwards certainly exceeds the hassle at the beginning. If you like sandbox games, to give Crea a try, in my opinion it's worth it.\n\nWith love,\nBirdCute\n\n[quote]Note that my copy of this game was obtained for free for reviewing purposes. However, this did not affect the quality and objectivity of this review.[/quote]", "timestamp_created": 1465930390, "timestamp_updated": 1466348058, "voted_up": true, "votes_up": 49, "votes_funny": 1, "weighted_vote_score": "0.71269148588180542", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "25685161": {"recommendationid": "25685161", "author": {"steamid": "76561198062609598", "num_games_owned": 0, "num_reviews": 244, "playtime_forever": 1444, "playtime_last_two_weeks": 0, "playtime_at_review": 1437, "last_played": 1475733680}, "language": "english", "review": "This game has a lot of great ideas, it just doesn't have content.  This game is small, you have to grind a lot to see more of it.  It also doesn't feel like a finished game. It feels like a developer trying to point about how inventory management should work. There is so little content that I cannot reccomend it.", "timestamp_created": 1474782650, "timestamp_updated": 1474782650, "voted_up": false, "votes_up": 26, "votes_funny": 1, "weighted_vote_score": "0.708301663398742676", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "103378094": {"recommendationid": "103378094", "author": {"steamid": "76561198054768912", "num_games_owned": 156, "num_reviews": 57, "playtime_forever": 2352, "playtime_last_two_weeks": 0, "playtime_at_review": 2352, "last_played": 1587855629}, "language": "english", "review": "It had potential so I kept holding onto it but it's now effectively abandonware, as specified by the game creator: https://store.steampowered.com/news/app/280520/view/3108042149726906694. \n Basically the creator is saying they will no longer deliver what they promised because it's best for their mental health, oh, and they're working on a new game they hope everyone will support instead...", "timestamp_created": 1637743222, "timestamp_updated": 1637743451, "voted_up": false, "votes_up": 27, "votes_funny": 2, "weighted_vote_score": "0.707614004611968994", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "30805859": {"recommendationid": "30805859", "author": {"steamid": "76561198053653124", "num_games_owned": 0, "num_reviews": 65, "playtime_forever": 1243, "playtime_last_two_weeks": 0, "playtime_at_review": 1185, "last_played": 1493055222}, "language": "english", "review": "Thus far this game has exceeded ALL of my expectations! I came in expecting another build, craft, survive, game much like Terraria and Starbound...that's not what this is.\n\nThe combat system feels much more skill based at times (timing combos for more damage, knowing the reach on your next combo swing, and even buffing prior to combat or mid combat). The crafting system is more along the lines of Starbound, you have to unlock the recipes, and you'll spend plenty of time unlocking all recipes. The building feels familiar, and while there are no impending threats (pirates, goblins, etc... attacking your base, or even zombies at night or even ANYTHING moving to attack you) there are plenty of enemies and they can certainly be difficult, especially when you're out numbered!\n\nThe dev, Jasson, is AWAYS diligently working on the game and is very friendly and transparent! It's rare to find a dev as open as Jasson, and I definitely recommend checking his stream out on twitch sometime!\n\n10/10 Yes, play this one!", "timestamp_created": 1490756245, "timestamp_updated": 1490756245, "voted_up": true, "votes_up": 27, "votes_funny": 0, "weighted_vote_score": "0.705552875995635986", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "10387142": {"recommendationid": "10387142", "author": {"steamid": "76561198039417534", "num_games_owned": 4953, "num_reviews": 23, "playtime_forever": 712, "playtime_last_two_weeks": 0, "playtime_at_review": 487, "last_played": 1467706299}, "language": "english", "review": "Crea is another entry in the recently extremely popular 2D Sandbox genre. However, Crea is unique in that it acknowledges the roots of all this popularity, Terraria, and tries to build off of that with unique new mechanics while still trying to retain that core gameplay that we all know and love (or don't; it's all up to personal preference of course).\n\nFor those who may not be familiar with the genre, Crea plays like most other 2D Sandbox RPG sort of games. You walk around a randomly-generated landscape, clicking on blocks to collect them, killing enemies along the way. As you gather more varied and rare materials, you are able to craft various items, including weapons, armor, furniture, tools, and a few other miscellaneous items. To be able to learn how to craft most of the items however, utilizing the research system is necessary. To research more advanced crafting recipes, you need to use a small quantity of each material you find to discover what uses you can make of them. This system was pretty neat in my opinion and I would love to see it become a staple of the genre.\n\nThere are essentially three different ways of dealing with enemies in Crea: melee weaponry, ranged weaponry, and magic. Personally, I love using magic to sit back and pick off enemies from a distance, There isn't a large selection of magic or weapons, but there's still an adequate variety of them to dispose of any monsters in your path. There are also \"Divine\" spells that help to assist you with positive buffs or give some well-needed healing in dire situations.\n\nFrom a glance, Crea seems to be actually almost a direct rip-off of Terraria, just with a somewhat different art style. This isn't really true though, as Crea includes some great new additions to the typical 2D Sandbox game formula. To start with, Crea includes the usual gear-based progression system of acquiring new, more powerful weapons, tools, and armor as you acquire better, more valuable materials. Something possibly unique to Crea is its \"talent system\", where as you engage in combat, use spells, craft items, or research recipes you gain \"TP\", which can be used to boost each of the previously mentioned areas a bit. The more that you mine for example, the more TP you are able to gain to potentially make mining just a tad quicker. One thing that did bug me a bit when I had first started was that mining seemed to take quite some time, but after I crafted a snazzy new pickaxe and upgraded my mining talents things went much smoother.\n\nOne very unique aspect of Crea is the \"conflict\" system in place. If you don't actively slay monsters, they will continue to grow in strength and numbers throughout the world. This was very noticeable when I had played, as I immediately went on multiple mining expeditions early on and never really fought monsters above the ground until I had the gear that I wanted. When I finally had crafted all the gear that I wanted to take on (supposedly) anything in my path, I discovered that when I came back to the surface new \"Paragon\" enemies that were larger and more deadly than the previous enemies had appeared and were proceeding to kick my arse. Monster spawners had also appeared quite rapidly throughout my world, and these were generating more and more monsters to add to my growing problem. This system is quite cool in my opinion, as it creates a unique conflict for the player personally- do you sit safely in comfort and idly gather more materials, or do you engage the problem at hand before it becomes harder and harder for you to safely stroll out in the world? In addition, monsters actively level up as you do, so there's never really an overly easy battle in Crea. Bosses are also in the game I've heard, though I have not encountered any in my time playing so far.\n\nA fast-travel system is additionally in place in Crea. As you explore your randomly-generated world, you are able to find Way Crystals that allow you to travel immediately to another crystal in the world that you've already found. These Way Crystals can also be found underground, which is convenient if you're able to find one while mining deep below the surface and want to quickly travel between your home and your mining area.\n\nTwo features of Crea that I didn't delve very much into are multiplayer, which is supposedly new and thus has some early issues, and the extensive modding support the game includes. I did join one multiplayer server I had found from someone who left their IP address on the forums, and it was a bit of fun, but the multiplayer system did seem to be in its early stages for sure and there was a few small problems. The game currently is still in Early Access of course, so there's plenty of time for it to be cleaned up a bit more. I would like to see player names not just in the chat, but also above the players or maybe if you hover your mouse over them, and perhaps a basic server browser for those of us who may not have friends who also own the game or want to go hunting for public server IP addresses. Concerning the modding support in place, I honestly haven't delved into it much so far, but glancing at the forums on the developer's site, they seem to be very active in assisting any players wishing to create mods for Crea, and the system in place seems to be fairly easy to make mods to do nearly anything in the game. So far, no major mods seem to be out yet, but as the game is still fairly new hopefully fairly interesting mods are released.\n\nThe sound design of Crea doesn't seem to be a major focus, so there's not much to say about it. The sound effects are basic, but they work. While not overly prevalent, the music featured in Crea is alright. I would prefer to be listening to more active tunes, but the current set of peaceful, calming music is still pleasant to listen to.\n\nGraphically, Crea features pixel sprites very akin to that of Terraria or Starbound, but with a slightly more fantasy theme. Two things in particular stand out, to me at least: the designs of the monsters and the backgrounds when above the surface. The monsters all have a fairly unique look to them- to the degree that it's difficult to relate most of them to something we're familiar with. Sure, there's some scorpions, sheep (called \"speep\" in the game), and birds, but also some very unusual bird-like creatures, rodents, sinister slimes, and even odder things deep beneath the surface. Most of the monsters seem to fit in perfectly with the fantasy theme of the game, and it helps to increase immersion for sure. Now, while not overly incredible, the backgrounds as you move from biome to biome above the surface are pretty to look at, and help to differentiate different biomes as they gradually change to a new background as you move from left to right or vice versa.\n\nWhile others may argue which is the best of the 2D sandbox genre, it's important to note that most of the games are still in-development and can't be fairly judged. Crea is likely one of the youngest games in the genre, and so it's difficult to fairly assess it in its current state. As it is, I really did enjoy my time with Crea. I was able to build a small home after a few hours of mining. I had fun with defeating monsters of varying strengths and sizes, and exploring the vast world I was in. I don't think that I've even begun to dig deep into the amount of content Crea has to offer, and thus I'm not if I can safely say how much I might potentially enjoy it. \n\nThe game is also still in Early Access as I write this, so the amount of content and features that are in the game currently can only increase as time goes on. The developers are extremely active, and seem to have a great knack for talking with the community very often and answering any questions people may have on the forums. This is a game with a lot of heart and soul put into it, and so it appears that any issues the game might have will quickly be ironed out.\n\nI give Crea a 8.5/10 in its current state.\n", "timestamp_created": 1402181153, "timestamp_updated": 1402181153, "voted_up": true, "votes_up": 41, "votes_funny": 2, "weighted_vote_score": "0.701245129108428955", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "30416508": {"recommendationid": "30416508", "author": {"steamid": "76561198053244881", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 1025, "playtime_last_two_weeks": 0, "playtime_at_review": 892, "last_played": 1675331469}, "language": "english", "review": "Very good game for people who enjoy 2d sandbox games. Don't expect it to be just like Terraria or Starbound. It is similar enough for you to enjoy but takes an entirely different route when it comes to combat. The combat system is unique and smooth. The devs are great and respond well to feedback as well. 10/10 would buy again.", "timestamp_created": 1489099714, "timestamp_updated": 1489099714, "voted_up": true, "votes_up": 17, "votes_funny": 2, "weighted_vote_score": "0.695530831813812256", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "54508306": {"recommendationid": "54508306", "author": {"steamid": "76561198046847440", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 712, "playtime_last_two_weeks": 0, "playtime_at_review": 149, "last_played": 1565647423}, "language": "english", "review": "While it is clearly inspired by Terraria, it's RPG and skill mechanics make it feel different, and unique. \nI find the combat in Crea a lot more engaging than Terraria.\n\nIf you liked Terraria, and enjoy skills and spells, and combat, then Crea is for you.", "timestamp_created": 1565217552, "timestamp_updated": 1565217552, "voted_up": true, "votes_up": 26, "votes_funny": 1, "weighted_vote_score": "0.688430607318878174", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "24129406": {"recommendationid": "24129406", "author": {"steamid": "76561198003475383", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 1910, "playtime_last_two_weeks": 0, "playtime_at_review": 1910, "last_played": 1467791109}, "language": "english", "review": "Crea offers compelling exploration, gathering, crafting, building, and character customization experiences. Unfortunately, it also offers a poorly explained \"chaos\" system that may or may not pertain only to crafting and terrible controls. Be prepared to unexpectedly fall and to be overrun by enemies while switching item and spell sets or trying to use your grappler.\n\nCombat is rarely fun regardless of weapon choice or enemy type and it is often very difficult, like when ghost-like enemies called Harvesters move and shoot through terrain in a tight cave system, killing you without much of a chance. Some monsters seem to trigger a jarring player-character teleport like what happens in some network games when players have network latency issues. I did find a boss or something rather boss-like that seems to be invulnerable until one figures out how to drop its shield or does so by accident, but I haven't yet defeated it because it and its minions are better at attacking me than I am at fumbling with Crea's controls.\n\nThe user interface could use some work too. For example, the set-switching feels clunky (especially while in combat), it looks and feels strange to have placeable items hovering at the mouse pointer when I just want to gather or harvest, and after picking up a spell or item icon there does not seem to be a way to cancel dragging the icon (e.g., the escape key, which closes overlays). On top of all of that, overlays just kind of end up all over the place, blocking the view of the game environment. It would be nice if they could be more neatly arranged and controlled (e.g., auto-arranged, snapped, and toggled in sets) and perhaps translucent.\n\nHopefully Crea will improve in time. I am sure many people will enjoy the game as it is, but it stopped being fun for me long before I could discover all it has to offer.", "timestamp_created": 1467794476, "timestamp_updated": 1467794476, "voted_up": false, "votes_up": 48, "votes_funny": 1, "weighted_vote_score": "0.688110113143920898", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "34806807": {"recommendationid": "34806807", "author": {"steamid": "76561198045833400", "num_games_owned": 0, "num_reviews": 31, "playtime_forever": 986, "playtime_last_two_weeks": 0, "playtime_at_review": 932, "last_played": 1529638049}, "language": "english", "review": "Truthfully I enjoy this gamea  lot, the skill tree/lvl aspect is why I bought it for the price it's at *should be lowered*.\nI also have major dislikes, but even with those dislikes, I would tell you to buy this game and give it a shot.\n\nPros: \nSkill tree\nConstant feel of upgrading/expanding\nFairly good crafting system\nDungeons *somewhat buggy*\nSkill points\nLvl progression on map *if you choose*\nChange of map lvl *if you craft/use*\neasy teleports all around the map *something most games don't have*\n\nI just feel the game is all around done pretty well, no it doesn't have the content like Terraria/Starbound, due to the lack of people building/progressing on the game, but for how little people are working on it, I would say it's done fairly well. This game does need a community backing, I feel the game would grow or at least the workshop side of it would, and it would greatly help out where the games standing is.\n\nCons:\nLack of end game\nAfter first boss you just fly through\nCrafting is good, but item drops are random and could use a boost *planned I believe*\nFix the damn dungeons, idk how many I've spawned and gotten stuck in, or unable to do because I'm trapped in a room you can't mine urself out of, I've also pulled a mob into a wall *have to kill all to progress in this specific dungeon* and I tried for 20 minutes to kill it, even checking forums, no luck.\nAs stated by others, dev does seem to be giving up, delaying updates for another game, he promises to update this one, but sadly we do know how that goes, I'll give him the benefit of the doubt as this game is 5 years old, but I feel it just truly came to light. \n\nI feel playing this game with more than like 2/3 people will kill it for you, unless you have major goals, as you can progress very fast, and carry them through dungeons/instances and they will get the xp for it, so there is some catchup for them if they don't wanna be low, but it also ruins the experience. I myself feel it's fine where it's at, but the experience is gone for your friend.\n\nI would prefer this game to linger around a 5-$10 mark with how \"finished\" it is, and the part time coding/programming etc that is coming from the dev.\n\nThe skill tree aspect in this game, makes it worth it alone, it does seem a bit fast to finish most of it though.\n", "timestamp_created": 1504839334, "timestamp_updated": 1504839334, "voted_up": true, "votes_up": 19, "votes_funny": 1, "weighted_vote_score": "0.687749862670898438", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "70491424": {"recommendationid": "70491424", "author": {"steamid": "76561198060051370", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 1560, "playtime_last_two_weeks": 0, "playtime_at_review": 744, "last_played": 1679439936}, "language": "english", "review": "[h1]Crea is NOT Terraria[/h1]\n\n[b]TL;DR[/b] Crea is Skyrim - Terraria is Borderlands - ADOM (Ancient Domains Of Mystery) is Dwarf Fortress\n\nIf you like games where progression is slow and every achievement feels like heaven to you, but at the same time it's not a punishing experience, this is your kind of game! If you are more an insta-gratification mindset, move along :)\n\nIt is not possible to compare Crea and Terraria because both have completely opposite ways of approaching the end-game. In other words, the people who compares Terraria in terms of content are a joke for people who plays ADOM (Ancient Domains Of Mystery). Please understand the 3 games are 3 different styles:\n\nCrea - RPG\nTeraria - Rogue-lite\nADOM - Traditional Rogue Like (used to be called Hardcore Rogue Like, but Steam changed it for marketing purposes)\n\nLet's enlist a few points you might find useful:\n\n[olist]\n    [*]In T you can rush down digging to the bottom and with enough skill/luck you will find end-game stuff before the first night; in C you have to grind to increase skills and then plan how far will you go each day\n    [*]In T you know you will die because you didn't timely press buttons; in C you die because you're not prepared for that area\n    [*]In T you skip all low-tier materials crafting and aim straight for the high-tier/end-game stuff because you can wear it from the first night; in C you must pass through all tiers because only by grinding you can achieve the level to craft/wear better equipment\n    [*]In T you know you have to be a Mage and then: Every boss in the game: \"Why I do hear boss music?\" *player appears*; in C you have to choose class from the basic 3 (Warrior, Mage & Ranged) adapted to your gaming style\n    [*]In T you increase stats such as health and mana by getting/finding items such as hearth crystals and fallen stars; in C you increase stats by grinding xp (leveling up)\n    [*]In T you mainly (I said mainly) grind for money to buy better stuff; in C you have to grind each skill (called talent) to level it up (but does it way better than Skyrim since algorythms are not ridiculous)\n    [*]In T you stick to the ultimate super powerful godly invincible out of space item; in C you will see yourself switching from sword to spear to bow to fireballs, etc according to situation\n    [*]In T magic makes you a demi-god; in C magic aids you, but not over empowers you\n    [*]In T multiplayer is more a social experience; in C multiplayer is a cooperative one\n[/olist]\n\nI could continue, but I guess this is enough for all of you who are hesitating to try this one.\n\nP.S. There are some Mods that enhance content and all the rest of the cool stuff that you might miss from Terraria", "timestamp_created": 1591626655, "timestamp_updated": 1591627133, "voted_up": true, "votes_up": 55, "votes_funny": 1, "weighted_vote_score": "0.681335031986236572", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23563390": {"recommendationid": "23563390", "author": {"steamid": "76561198199045323", "num_games_owned": 6408, "num_reviews": 18, "playtime_forever": 491, "playtime_last_two_weeks": 0, "playtime_at_review": 491, "last_played": 1465956906}, "language": "english", "review": "[b]Review Written on Tuesday, June 14th, 2016[/b] \n\n[h1]Review[/h1] \n\nCrea is a 2D RPG sandbox type of game, I would be remiss not to mention the similarities to Terraria. It's obvious that the game got inspiration from Terraria but it doesn't mean that Crea is not a great game in it's own right. You can choose between a small, medium or large size world. Even the smallest one is quite big and has a lot to explore. \n\nThere's tons of things to do in this game, the crafting section has so many differents recipes which you have to learn from the material you've gather when exploring. Like all game of this type there's two mode building and fighting (or survival). You won't see the time pass while you play this game, you can easily sink many hours into it and never get bored. The addition of Steam workshop add tons of options, the possibilities are endless. This game was built with modding in mind. Since the devs are really active, I have very high hopes that future update will add even more content. \n\nOne thing I usually complain about is the lack of tutorial in those games, but not in Crea the tutorial is pretty good at explaining the basics, although I would have liked to see it explain more in depth. At the moment there's no dedicated server for multiplayer, so that might be a problem for some as it's very much the kind of game you would want to play in multiplayers. \n\nThe pixel style graphics are rather pleasing to look at if not great although I would have love them to be a bit bigger but that's very personal and it doesn't really change anything to the gameplay itself. \n\nIf you like exploring and aventuring you should definitely give Crea a try. This game is truly a work of love and has the potential to become a classic!\n\n[h1]Rating:[/h1] \n\n7.5/10 \n\n[h1]Pros:[/h1] \n\n[olist] \n[*]The tutorial covers the basis pretty well.\n[*]The integration of Steam workshop with modding will add lots of content and gameplay to an already pretty extensive game.\n[*]The RPG elements (leveling, skills, etc) add an interesting side to the game \n[*]The procedurally generated world are quite big and there's tons to explore \n[*]The devs are very active and there's frequent updates. \n[/olist] \n\n[h1]Cons:[/h1] \n[olist] \n[*]There's no dedicated server for multiplayer which in this kind of game is quite a significant downside \n[*]There's are still bugs, but as said before the devs are working pretty consistenly, so it should be worked out in a timely manner.\n[*]The graphics are a touch small for me, it was hard to see details well.\n[*]While the tutorial take care of the basis very well there's still a lot of aspects that would deserve more explaining.\n \n[/olist] \n\n[h1]Hardware Information[/h1] \n\n[table] \n[tr] \n[th][u]Hardware[/u][/th] \n[th][u]Type[/u][/th] \n[/tr] \n[tr] \n[td][b]Monitor[/b][/td] \n[td]Asus laptop 17 inch 1600 by 900[/td] \n[/tr] \n[tr] \n[td][b]Headphones[/b][/td] \n[td]Headphones[/td] \n[/tr] \n[tr] \n[td][b]Keyboard[/b][/td] \n[td]Asus ROG laptop[/td] \n[/tr] \n[tr] \n[td][b]Controller[/b][/td] \n[td]XBOX 360[/td] \n[/tr] \n[tr] \n[td][b]Mouse[/b][/td] \n[td]Microsoft mobile mouse 3500[/td] \n[/tr] \n[tr] \n[td][b]Microphone[/b][/td] \n[td]Microphone[/td] \n[/tr] \n[tr] \n[td][b]Motherboard[/b][/td] \n[td]ASUS ROG laptop[/td] \n[/tr] \n[tr] \n[td][b]CPU[/b][/td] \n[td]Intel Core i7 6700HQ 260 GHz[/td] \n[/tr] \n[tr] \n[td][b]GPU[/b][/td] \n[td]gtx 960m 2b[/td] \n[/tr] \n[tr] \n[td][b]RAM[/b][/td] \n[td]16 gb[/td] \n[/tr] \n[tr] \n[td][b]OS[/b][/td] \n[td]windows 8[/td] \n[/tr] \n[tr] \n[td][b]HDD[/b][/td] \n[td]1 tb[/td] \n[/tr] \n[/table]\n\n[h1]Disclaimer:[/h1] \n\n[code]Source of consideration: Siege games[/code]", "timestamp_created": 1465960808, "timestamp_updated": 1567382232, "voted_up": true, "votes_up": 19, "votes_funny": 1, "weighted_vote_score": "0.676194608211517334", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23531567": {"recommendationid": "23531567", "author": {"steamid": "76561198069747447", "num_games_owned": 5808, "num_reviews": 92, "playtime_forever": 645, "playtime_last_two_weeks": 0, "playtime_at_review": 645, "last_played": 1465839692}, "language": "english", "review": "[b]Crea[/b] is a 2D procedurally generated sandbox RPG. It finally left “Early Access” and I was excited to try it out. \nThe game requires many hours of gameplay to be able to explore it fully. This is my [b]first impressions review[/b] after playing for a few hours.\n\n[b]Let’s start with the good stuff:[/b]\n[list]\n\n[*]Crea’s visuals can be described as “cute”. Colorful 2D pixel graphics. Everything is a little bit too tiny (I preferred to play with 150% zoom) but overall looks good. Music is nice and relaxing. \n[*]There is a lot of content: a huge world to explore, tons of skills to learn, recipes to find and items to craft.\n[*]Crafting system is pretty extensive but beginner friendly. There are so many items you can create and build. It is not available right off the bat. You unlock it by leveling up and researching recipes and materials.  \n[*]Combat is challenging even when playing on “Easy”. Especially in the beginning before you get a chance to upgrade your character and find or craft better weapons and armor. \n[*]Unique monsters with different attacks and behavior. Some are very aggressive and will attack the moment they see you, the rest will only attack if provoked.\n[*]Developer is very hands-on with regular updates, progress reports and even Twitch streams. I recommend watching those if you want to learn more about the game and the people behind it.\n[*]Steam Workshop support (modding is highly encouraged). Steam achievements, cards and badges. \n[/list]\n\n[b]Here is what I didn’t like:[/b]\n[list]\n[*]My main problem with the majority of sandbox games (and that includes Crea) is a lack of proper in-depth tutorial. There are a couple of tips at the beginning of the game that only explain very basic mechanics. Everything else you have to learn on your own, usually by trial and error. Some quests or tasks on the early stages of the game would make learning process much more entertaining. \n[*]This game needs dedicated servers for multiplayer or more convenient way to play with friends (or strangers). Right now you can only connect to someone else’s server by typing their IP address. \n[*]Some minor bugs. I haven’t encountered anything game breaking. \n[/list]\n\n[b]I am giving Crea a thumbs up. It offers fun and addictive gameplay with virtually endless replay value. If you like sandbox games, I don’t think you’ll be disappointed by this one.[/b]\n\n[h1]PC Specs[/h1] \n\n[table] \n[tr] \n[th][u]Hardware[/u][/th] \n[th][u]Type[/u][/th] \n[/tr] \n[tr] \n[td][b]CPU[/b][/td] \n[td]Intel Core i7 5820K 3.30GHz[/td] \n[/tr] \n[tr] \n[td][b]GPU[/b][/td] \n[td]Nvidia GeForce GTX 970[/td] \n[/tr] \n[tr] \n[td][b]RAM[/b][/td] \n[td]16GB DDR4[/td] \n[/tr] \n[tr] \n[td][b]OS[/b][/td] \n[td]Windows 10 PRO[/td] \n[/tr] \n[/table]\n\n[h1]Disclaimer:[/h1] \n\n[code]A copy of the game was provided by the developer (Siege Games) for reviewing purposes. However, this did not influence my review in any way. [/code]", "timestamp_created": 1465792784, "timestamp_updated": 1465793283, "voted_up": true, "votes_up": 23, "votes_funny": 1, "weighted_vote_score": "0.676115155220031738", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "21233145": {"recommendationid": "21233145", "author": {"steamid": "76561197974781318", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 11936, "playtime_last_two_weeks": 0, "playtime_at_review": 3498, "last_played": 1705182718}, "language": "english", "review": "Nice clean graphics, a massive crafting system, complex and diverse, yet easy to understand levelling system.\n\n This game has come a long ways.  And I believe it is going to go a lot further. Whats more, the devs actually release patches, sometimes same day as a direct response to issues brought forward. Hard to ask for better support than that.\n\nOne of a few EA's that I can truly reccomend.\n\nIf you like starbound, terraria and the like, you won't be dissappointed.", "timestamp_created": 1455552987, "timestamp_updated": 1455552987, "voted_up": true, "votes_up": 17, "votes_funny": 2, "weighted_vote_score": "0.674582362174987793", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "48034569": {"recommendationid": "48034569", "author": {"steamid": "76561198044128584", "num_games_owned": 237, "num_reviews": 15, "playtime_forever": 2462, "playtime_last_two_weeks": 0, "playtime_at_review": 1429, "last_played": 1578098072}, "language": "english", "review": "This game is best described as \"Terraria with leveling\". And although that's technically true, it's slightly deeper than that. \n\nYou run around, collecting resources to build shelter and equipment. Sometimes, you fight bosses. There's a lorebook, too. Dunno what the story is, I didn't read it. On occasion, you'll come across instances, called dungeons, in the form of large, floating red crystals. You can see the difficulty of the dungeon just by glancing at the crystal, which is good. It lets you know if a dungeon is worth doing or not. You can also come across \"realm crystals\" when you sometimes kill monster spawners or paragon monsters, which are more difficult versions of the enemies in the game. These realm crystals are nice, because they're short, always contain plenty of monsters, and always have a loot chest at the end of them. I especially like them because they scale with your level. So even if you're having trouble getting to the max level because your world is mostly cleared of spawners, you can always just make another world, and run around the surface, finding realm crystals when you break spawners and slay paragon enemies. So, I really never had trouble leveling up when I needed to. \n\nThe content already in the game is, for the most part, well-refined and should definitely not be adjusted, The leveling seems fair paced, the stat progression isn't too meaningful, but isn't too empty either. When you put points into \"health\", it definitely feels like you're able to take more hits. The game doesn't hold your hand, but doesn't let you float out to sea like some of the newer \"Souls-esque\" games do. If you've played Terraria, you'll know exactly what to do in this game. \n\nHowever, there's something off about the game. It doesn't feel like a struggle to survive. Sure, the monsters are hard to kill, and they hit back. But my experience playing the game didn't feel like a survival experience. It felt like an MMO. Starbound has you fighting the elements. Terraria has you fighting the world. But this game just has you fighting monsters. The bosses in the game are apparently the equivalent of gods, but they didn't seem especially strong. I dunno, it wasn't bad, per se. But I'm just used to getting into high-stress situations in these types of games. And that never really happened. The game was just a little too easy to break. Melee attacks actually go though blocks in this game. So it was child's play for me to just close a door and hit enemies through it. \n\nThe dungeons were pretty good. Besides a few hiccups here and there, they never bugged out or straight-up stopped working. They're instanced, so they exist in separate \"realms\" than your world does, and unless I was playing with friends, I didn't think the game struggled to keep up.\n\nIn fact, the game never struggled to keep up at all, ever. It's terrifyingly well-optimized, and my frames never dipped under 60, even when a horde of monsters was on-screen, or I was fighting bosses that were throwing out numerous particle effects. \n\nHowever, after 15-20 hours, you've basically experienced the game in all it's entirety. There are no secret bosses, there aren't many rare or hidden items to collect, and there are no \"ultimate, game-breaking\" skills at the end of the talent progression. The game is missing core components to keep players going after they've hit the max level, and maxed out all their talents. And that's the problem with an RPG-style leveling system. In most games, namely MMORPG's, there's content end-game to pursue and conquer. And there just isn't any of that here. \n\nAnd that's where modding comes in. See, the game is coded in such a way that it's easy to modify and create new content in the form of mods. Install Python and a free text editor, and you're good to go. It seems great on paper, but in practice, any mod that I created crashed the game. Crash log files would generate and then disappear before I could click on them to see what went wrong. I even took another mod off the workshop, took the content files out, and put them into a new folder with a different name. And when I loaded that, the game wouldn't stop crashing. So although it's easy to see how the game was made, because all of the content code is accessible, actually installing your own mods seems to be finnicky and not practical, at least for me. Sure, there's a Discord channel where the dev team hangs out and tries to help with modding, but there's a reason why there are so few mods on the workshop: it's waaaaay harder than the development team thinks it is to get new content working in Crea. \n\nThe game is still getting big updates, so I have high hopes for the future of this game. But in it's current state, it's missing something to keep me coming back to it over and over again, like others in the genre. \n\nSo, if you like Terraria, and you like a leveling system in your RPG's, this game is definitely worth the 15 dollars. I bought it on sale for half off, and I still feel like I got my money's worth. If you have friends to play with, the game is even better. Does it need work? Absolutely. Is it playable right now? Yep. Will you have fun? Probably. I did, at least.", "timestamp_created": 1546415559, "timestamp_updated": 1546416724, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.671298861503601074", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "25471553": {"recommendationid": "25471553", "author": {"steamid": "76561198025384921", "num_games_owned": 0, "num_reviews": 79, "playtime_forever": 976, "playtime_last_two_weeks": 0, "playtime_at_review": 617, "last_played": 1569634959}, "language": "english", "review": "In short, very disappointing. It's got some neat ideas and a nice theme, but as far as gameplay goes, I regret buying it. Combat is clunky, crafting is slow due to the way things are organized, and it doesn't feel like there's much to find aside from random dungeons.\n\nIt might improve at a later date, but don't buy this as it is. If you must, wait for a really, really good sale.", "timestamp_created": 1473635044, "timestamp_updated": 1473635044, "voted_up": false, "votes_up": 25, "votes_funny": 2, "weighted_vote_score": "0.670834600925445557", "comment_count": 10, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "32319958": {"recommendationid": "32319958", "author": {"steamid": "76561197966545367", "num_games_owned": 0, "num_reviews": 27, "playtime_forever": 782, "playtime_last_two_weeks": 0, "playtime_at_review": 650, "last_played": 1497105854}, "language": "english", "review": "Crea isn't worth your time or your money. It's deeply flawed in every major aspect of the Terraria-like genre. There's no incentive to build anything. There's no incentive to explore. There's no joy in spelunking. There's no functioning combat system. There's no point in the talent system or the level system, other than pad the grind time. There's no functioning boss system. Crea is glitched and bugged out the wazoo.\nThe game fundamentally misunderstands what the point of these types of games are.\n\nFirst, the game isn't working properly on a technical level. There are game crashing bugs, there are skill bugs, there are map bugs, there are multiplayer bugs. Fighting bugs makes the combat system unplayable.\nYou'll run into lag in multiplayer, where the players exploring will cause the entire game to just stop doing anything while it's generating the new environment. You will run through empty caves where no minerals have yet spawned, no chests have appeared, no enemies appear and where you can't dig or place torches because the game is lagging behind too heavily. Then you'll hear your multiplayer companion swear over skype because they're suddenly unable to do anything.\n\nSecondly, the building and crafting portion of the game is completely unnecessary. You're delegated to progressing through the standard crafting tiers through the standard way of upgrading your standard crafting stations, getting the standard four weapons and the standard three armor parts. That's it. The rest is reskins with new stats, not changing a damned thing. You use the sword/spear, who work exactly the same, the bow or the wand. Nothing new, nothing exciting, nothing ever changing.\nYou don't build a base, because why would you? You don't spend any time in your base, you don't have anything to fill your base with, you can take your crafting tables with you instead when you do the arbitrary digging for copper->iron->silver->gold. There's no discovery to be made anywhere along the line.\n\nThirdly, combat doesn't work. At all. You trigger an enemy's attack, counter, rinse and repeat. Or you shoot at it from afar until it dies. Or, you build a one block wall and hit the enemy through it. This is of course on the rare occasions when enemies spawn at all, and on the even rarer occasion when they're not bugged out. The enemies get progressively higher stats as you walk the planet, but they're the same and their power levels are completely unpredictable. You can be around a lvl 7-9 crystal and suddenly face a lvl 24 enemy. It's stupid.\n\nFourthly, you never have any goals to strive for. You do, what, exploration? Why? To find what? You don't need anythin, you don't really want to do anything. You dig? Why? To get iron instead of copper for the work station upgrade? Yawn. You come across a red crystal with a dungeon instance? Skip it. Why bother?\n\nDon't get this game. Crea isn't worth it. Get Terraria. Get Starbound if it's on sale. Hell, get Minecraft before you get this. It's no good.\n\nEDIT: I did play the beta 1.4 patch, and that is the version of the game I've reviewed. The beta version of the patch was released on the 7th of June and I played it 3 days later, and my achievments were unlocked on the 10th of June to prove it.", "timestamp_created": 1497107120, "timestamp_updated": 1498510643, "voted_up": false, "votes_up": 109, "votes_funny": 5, "weighted_vote_score": "0.665731847286224365", "comment_count": 22, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1498320676, "developer_response": "Since this review the 1.4 update has been released which fixes a great deal of issues Crea was having. Combat has been revised and is much improved now. Crafting has also been upgraded and is more interesting now with Enchantments.  There is still no incentive to build in Crea right now but I'm working on changing that.\n\nUnlocking bosses has been made clearer which I believe is actually a large source of Kreegath's frustration. Bosses unlock a great deal of additional content including new ore tiers and more unique equipment.\n\nKreegath, I hope you get time to play the 1.4 update and fight some of the bosses!"}, "21878237": {"recommendationid": "21878237", "author": {"steamid": "76561198138830425", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 3070, "playtime_last_two_weeks": 0, "playtime_at_review": 203, "last_played": 1500868834}, "language": "english", "review": "Crea it's a Sandbox RPG style with a interesting crafting system that you need to research to know a part of a recipe and receive scraps from researching any item you found mining, choping, killing monsters etc..\n\nThe skilling sytem it's very good that gives you xp for each thing you do, if you chop, you get gathering, if you mine, you get mining, crafting you get xp that you can improve things and get better and better...\n\nThe art of the game reminds a bit terraria but it's not a \"clone\" every game have they diferences but they have some equal too, the art it's simply and beaultiful letting us to enjoy the view of sunrise and the music are something to feel too.. And it has workshop Yay!\n\nIf you like exporation\nThat is for you\nIf you like crafting system that you need to put in work\nThat is for you\nIf you like leveling up\nThat's for you\n\nit's worth", "timestamp_created": 1458171646, "timestamp_updated": 1458171709, "voted_up": true, "votes_up": 20, "votes_funny": 1, "weighted_vote_score": "0.664711415767669678", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "85355672": {"recommendationid": "85355672", "author": {"steamid": "76561198007711105", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 4278, "playtime_last_two_weeks": 0, "playtime_at_review": 4278, "last_played": 1597644459}, "language": "english", "review": "Do not buy this game. The developer has abandoned it. \n\nThis game had a lot of potential. Because I had someone to play it with, I did get a good 70 hours of gameplay out of it, but the game lacks polish in a number of areas. The skills system is very rough. The crafting system doesn't feel rewarding. And the boss fights are very unfinished. \n\nAnd that's even before you get into balance and gear. \n(The second boss (out of 4) drops the best weapon, bar none, in the game)\n\nMaybe the Dev thought mods would save it, but the community never blossomed enough for modders to really dig into the game. \n\nAnd you can ignore the post from August 2019- 1.8 isn't going to happen. The Dev has moved on to another game. \n\nTerraria or Starbound.", "timestamp_created": 1611622325, "timestamp_updated": 1611622325, "voted_up": false, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.664168477058410645", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "44188078": {"recommendationid": "44188078", "author": {"steamid": "76561198013879539", "num_games_owned": 738, "num_reviews": 50, "playtime_forever": 965, "playtime_last_two_weeks": 0, "playtime_at_review": 965, "last_played": 1535125864}, "language": "english", "review": "As a persone that loves Terraria and Starbound i realy can't get into Crea. The grind for resources are not appealing and the leveling are not that fun either since it takes forever it feels like. This game have \"Boxes\" or Zones that have certain levels, so instead of like terraria that the deeper you get the harder the enemies become,  you have \"starting zone\" level zone and linked \"Areas\" near your starting \"Area\" have a begining level and slightly start to increase the farther away from you are from your starting zone. But if you like to explore left or right on the surface as you would do in terraria or starbound you will meet super buff enemies that will kill you super easy. This is what realy kills it for me which realy saddens me. I can see the potential of becoming fun when i have level up a bit but it's the leveling that's so boring and grindy.\n\nUpdate: After trying the Progression i still can't get into it. Enemies levels are still crazy overleveled so it didn't feel like \"Progression\" did anything. I got 1 shot two zones under my starting area, that's not fun when i have to go down there to get resources to take down higher leveled enemies but to do that i have to grind the 6 \"starting zones\" that feels like forever just so i can go down there to kill them so i can get my resources.\nAnother thing i thinkg is very frustrating is the hitboxes on the enemies, they can always hit you though walls but i can't even touch them, very frustrating", "timestamp_created": 1534427313, "timestamp_updated": 1535126114, "voted_up": false, "votes_up": 42, "votes_funny": 0, "weighted_vote_score": "0.661855638027191162", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1534862283, "developer_response": "Hello Eldrac, do you know about the monster level \"Progression\" world option. This will  smooth out region levels and they will overall be much lower. As you defeat bosses the entire world will progress with you in levels."}, "23495616": {"recommendationid": "23495616", "author": {"steamid": "76561197998979251", "num_games_owned": 0, "num_reviews": 110, "playtime_forever": 2506, "playtime_last_two_weeks": 0, "playtime_at_review": 2149, "last_played": 1561927960}, "language": "english", "review": "EDIT 25 October 2016:\n- http://steamcharts.com/app/280520 - game is never played, IE dead\n- Bugs still not fixed\n-- Can play a 50gb Deus Ex Mankind Divided on Ultra settings, but this game lags after an hour of play, still not fixed\n- Proof the developer gave keys for good reviews: http://i.imgur.com/FKot7Or.jpg\n\n--Don't buy, do not get scammed\n\nOriginal Review June 2016:\nI feel like I should review this game as a warning before you buy the game. There are still a lot of bugs in the game and probably should still be in Early Access. I specifically wait until games come out of Early Access before I buy them (I hate the idea of Early Access). This one fooled me by coming out of Early Access before it was time.\n\n[h1]TLDR:[/h1] \nGame should still be in Early Access because of the bugs, otherwise would be a pretty good game (6-7/10). There are a few downsides that will never make it a great game, including level scaling. Read below for more information.\n\nMe telling my friend why Crea isn't good yet: https://www.twitch.tv/impalatv/v/73697872 (contains spoilers)\n\n[h1]My Impression:[/h1]\nI love every type of creation game from Terraria to Slime Rancher. They all have their own personal touches that make them different from one another. I am not going to compare them since most reviews cover that, I will write this review as a warning before purchase. \n\nAlso to note, most of the reviews are from people who [u]received free press copies[/u] and reviewed it positive. I challenge you to go through the reviews and find someone who received a key for free with a negative review. They basically are giving free press keys for good reviews.\n\nI don't like the posts by people of \"Hey give the developers a chance, they are trying. Crea will be good when they finish with the bugs.\" A good example of a successful launch by [b]1 man[/b] was [u]Stardew Valley[/u]. \n\n[h1]Positive:[/h1]\n+ RPG system added an innovation in the 2D sandbox genre (lots of skills, leveling, adds replayability)\n+ The usual Terraria style environment and world (Large/procedurally generated worlds)\n+ Menus are movable (I can move my inventory anywhere on my screen)\n+ Really good music, nice and relaxing\n+ Developer is somewhat active in the forums\n+ Steam Achievements\n+ Steam Trading cards\n+ Mods\n\n[h1]Negatives:[/h1]\n- BUGS, tons of them. Current Issues by developer ( http://steamcommunity.com/app/280520/discussions/0/357288572119003683/ )\n[list]\n    [*]Huge memory leak issues ( https://steamcommunity.com/app/280520/discussions/0/357288572119430553/ ). It uses CoherentUI_host.exe. This is used in other games and almost every game it is used in it causes severe FPS and LAG. Google search CoherentUI if interested. It also opens 8+ processes that you will see if you view task manager in Windows. Also, let it be known that this is a <100mb install and still has huge memory issues.\n[/list]\n- Unusually long loading times\n- As someone else mentioned, starting a new character can be quite the grind with the learning recipe process. I wouldn't normally mind this but with the frame drops, my hardcore character has fallen. I should also note that with the randomly generated worlds, I happen to get one that spawned almost on top of a slime hut. I think Terraria has a way to avoid this.\n- Lack of menu options, such as the zoom feature is nice to zoom it, but you cannot zoom out. There is also a lack of video options and windowed borderless bugs out every so often.\n- Online multiplayer is not hosted by steam (I don't play multiplayer so it wasn't a problem for me, but I saw some confused people in the discussions)\n- No ladders/rope, makes moving around your \"home base\" much more tedious\n- Level scaling of monster and bosses (very tedious, lazy programming)\n- Great summary of things that are a downfall of Crea ( http://steamcommunity.com/app/280520/discussions/0/357288572133823227/ )\n\n[h1]Decent Game:[/h1] [b]5/10[/b]\n\nHelpful review of Crea that has a recommend for it. I definitely agree with their points and even they admit that there are a lot of bugs ( http://steamcommunity.com/profiles/76561197982914211/recommended/280520/ )\n\nHelpful negative review ( http://steamcommunity.com/id/Docdra/recommended/280520/ )\n\nBest review ( http://steamcommunity.com/profiles/76561198006884898/recommended/280520/ )\n\n[code] You shouldn't have to watch a dev stream on twitch where he gets donations and subscriptions to get a bug fixed. [/code]", "timestamp_created": 1465618686, "timestamp_updated": 1477376314, "voted_up": false, "votes_up": 186, "votes_funny": 13, "weighted_vote_score": "0.660317897796630859", "comment_count": 12, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1466290876, "developer_response": "Hello! I'm the guy streaming and working on Crea. I just wanted to set a few things straight here since some conclusions are being jumped to.\n\nCrea came out of early access because I truly thought it was ready and learned too late that it was not. Crea did not come out of early access for cashflow. Crea's development is not motivated by money. We are looking for an apartment because our lease is up and we want to move into the city. That is all.\n\nI have been streaming development for nearly 4 years now so this is nothing new. I don't ask people for donations. I do say if people are enjoying the stream then they can let me know by subscribing. I'm excited to get subs just as much as any other streamer. Being a sub or donator does not get your bugs fixed any faster (or slower). The reason I stream is to share the development experience and have some connection to the outside world. This hasn't changed since the beginning.\n\nIf you would like anything else cleared up then feel free to join my devstream and ask away. I'm very open. https://www.twitch.tv/siegegames"}, "39549339": {"recommendationid": "39549339", "author": {"steamid": "76561198006032104", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1167, "playtime_last_two_weeks": 0, "playtime_at_review": 1160, "last_played": 1601472838}, "language": "english", "review": "Just play Terraria.", "timestamp_created": 1516681586, "timestamp_updated": 1516681586, "voted_up": false, "votes_up": 135, "votes_funny": 41, "weighted_vote_score": "0.65819317102432251", "comment_count": 8, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "31560477": {"recommendationid": "31560477", "author": {"steamid": "76561198123354974", "num_games_owned": 184, "num_reviews": 48, "playtime_forever": 4813, "playtime_last_two_weeks": 0, "playtime_at_review": 4409, "last_played": 1493503041}, "language": "english", "review": "If you're looking for more terraria,\nThis is a charming terraria clone that does a lot to make itself different.\n\n[h1] What's different? [/h1]\n-This game is a lot slower paced than terraria, reaching a feeling closer to minecraft.\n\n-The combat is slower paced aswell, all enemies, including the bosses, all have specific patterns that you can get around by learning their gimmicks, efficiently using the dodge roll,and using your many unlockable abilities.\n\n-The character progression is similar to that of an RPG, you get xp in specific categories while you play the game, meanwhile a main xp bar fills up. you can use all of that to unlock/upgrade abilities and upgrade your character.\n\n-Crafting is a bit more complex, you have to 'research' something before you can craft it, on top of that, you can make your gear stronger than normal by using chaos crafting.\n\n-You actually lose your things upon death, but you can get them back by going back to your death point without worrying about the items despawning, aslong as you have atleast 1 way shard in your inventory.\n\n-Enemy difficulty scales with the local area difficulty rather than constantly adding new enemy variants.\n\n[h1] What's the same? [/h1]\n-you get from tier to tier mostly through mining, but it's a bit less grindy to do in this game because one of the gather skills is a built in spelunker potion.\n\n-There's a handful of different biomes.\n\n[h1] Additional notes [/h1]\n-This game has a few bugs, but is mostly polished.\n-It takes a bit of time to learn the basics of the game.\n\nI give this game 8 speeps out of 10.\n\n", "timestamp_created": 1493995502, "timestamp_updated": 1493995502, "voted_up": true, "votes_up": 18, "votes_funny": 3, "weighted_vote_score": "0.65710759162902832", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "10296988": {"recommendationid": "10296988", "author": {"steamid": "76561197961494531", "num_games_owned": 0, "num_reviews": 24, "playtime_forever": 289, "playtime_last_two_weeks": 0, "playtime_at_review": 289, "last_played": 1401599296}, "language": "english", "review": "This is a [b]borderline[/b] recommendation for a game that looks and plays like Terraria and Starbound. However, this game does have some things setting it apart. The main difference is the RPG elements attached to it, where you can basically level up everything and even acquire new skills. Yet while the game has some neat features going for it, it also does some things wrong. And it is for that reason I can't recommend this game for everybody, so read on and/or watch my video to find out if this game is for you.\n\nhttp://youtu.be/Q2jJOsvPrVg\n\nFor those who want the basical summary, here's a concise pros and cons list of my thoughts.\n\n+The RPG elements of leveling your skills to make you fight, mine, and even craft better is very nice. You're not even limited on what path to take, so you can take every bonus you want for melee, ranged, magic, or building. It doesn't matter.\n+The sandbox world keeps you wondering what is out there and encourages you to explore. There is even plenty of caverns that lead into the depths of the world, so you don't have to mine everything over and over again.\n+By far the best feature I've seen from this game is the ability to use materials in nearby chests when you're crafting. No more sorting or looking through chests to find that one monster drop you picked up long ago. The game automatically senses you have it, and you just hit the craft button.\n+There's only one tool you have to upgrade that chops down trees and mines. You're not forced to choose between axes, pickaxes, or hammers.\n\n-The mining in this game is an absolute chore. It takes forever to mine out a path through the earth or ores, even after upgrading your tool a few times. It just drags the game out needlessly. The fact that it's only one block at a time and you have to set your mouse directly on it to mine doesn't make it any better either.\n-In order to craft things, you have to first research all the parts in order to make it. I actually liked this at first, but then my opinion changed after the first hour since the researching costs you the material, so you have to keep farming the same thing over and over again. Throw in the fact that you have to keep tossing away the same item multiple times for different recipes, and you're just gonna find yourself in an awkward place like I did where I was on the verge of making progression, but I either lacked a material to make the item, or I lacked a material to research so I could make the item. Combine it with the above negative and the fact you don't know what the item may be, and you got yourself in an annoying situation.\n-The monster spawn rate in this game varies way to much. Often times I never get a single baddie for ages, even when I'm mining deep down. This is terrible because you need a drop from a certain mob to make torches, but when you can't find it and run out of torches, you're forced to go all the way to the surface again and farm a monster that is sometimes a pain to find. But then there are times where my screen starts getting swarmed, and not with the mobs I wanted.\n-Some of the abilities are really underwhelming. I wanted to be a mage and maxed my fireball spell. Now while it did do more damage, the spell was just rubbish. It has cooldown of a few seconds that makes it really awkward to use. The animation finished in the blink of an eye, but for some reason, your dude can only stare at his enemy and let himself get wailed upon. Combine it with the paltry damage it does and the mana bar that limits its use, and spells become really worthless. Heck, the ice and fire spells both function the same to but only have a different sprite firing out. And when I found out my crappy copper dagger did more damage then my maxed spell, I just gave up on being a caster.\n-Because of the above, this game has a terribly slow pace. After 4 hours of playing this, I feel like I barely got anywhere, and it's not a good feeling.\n\nSo yeah, you may be wondering why I recommended this game after the big negatives I listed. Well, it's because I still enjoyed myself somewhat. I wanted to explore more and find out what skills I would get and what the world had to offer. That's the mark of a promising sandbox game.\n\nBut to be perfectly clear, I believe you can only enjoy this game if you liked a really slow, relaxed experience. If you want something more exciting, then I strongly suggest you go to terraria or starbound. But just keep in mind that this is early access, so maybe the devs will change the pace, or maybe they won't. So if you're still on the fence, it may be best to wait until this gets released. This has the potential to be up there with the big hitters, so I hope to see it go places.", "timestamp_created": 1401529034, "timestamp_updated": 1401608949, "voted_up": true, "votes_up": 30, "votes_funny": 1, "weighted_vote_score": "0.657084763050079346", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "96805456": {"recommendationid": "96805456", "author": {"steamid": "76561198047524140", "num_games_owned": 0, "num_reviews": 170, "playtime_forever": 615, "playtime_last_two_weeks": 0, "playtime_at_review": 615, "last_played": 1565377581}, "language": "english", "review": "Just remembered this game existed. Came back to see if there were any updates. No recent news when looking at the game in my library whatsoever. Came to the store page and looked at the update history. Last post was in 2019. Ironically, it was a post claiming that more was coming and that things were about to change.\n\nThis game is abandonware. Do not give these developers your money.", "timestamp_created": 1627903645, "timestamp_updated": 1627903645, "voted_up": false, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.654166042804718018", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "114757152": {"recommendationid": "114757152", "author": {"steamid": "76561197983234429", "num_games_owned": 441, "num_reviews": 9, "playtime_forever": 272, "playtime_last_two_weeks": 0, "playtime_at_review": 272, "last_played": 1587726732}, "language": "english", "review": "abandoned, incomplete game", "timestamp_created": 1651377146, "timestamp_updated": 1651377146, "voted_up": false, "votes_up": 21, "votes_funny": 0, "weighted_vote_score": "0.653809666633605957", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "30540531": {"recommendationid": "30540531", "author": {"steamid": "76561197979034849", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 3424, "playtime_last_two_weeks": 0, "playtime_at_review": 3369, "last_played": 1573558620}, "language": "english", "review": "Good game. If you just finished Terraria and wanted something similiar this might be a game for you. I was at the refund page right at the beginning because the game would not start at all, but i googled a lot and solved the issue. It seems it was just one of my computers having some SW issue.\n\nThe leveling system gives this genre a new type of gameplay.", "timestamp_created": 1489667804, "timestamp_updated": 1489667804, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.652675271034240723", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "41970969": {"recommendationid": "41970969", "author": {"steamid": "76561198159067182", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 4748, "playtime_last_two_weeks": 0, "playtime_at_review": 2526, "last_played": 1590252246}, "language": "english", "review": "The game is close to being abonded wait untill release I get this feeling the game is going to be dropped soon. Dev recently started promoting his new game while not updating this game for 8 months. Save your money, wait untill release.", "timestamp_created": 1525997253, "timestamp_updated": 1525997253, "voted_up": false, "votes_up": 47, "votes_funny": 7, "weighted_vote_score": "0.652087092399597168", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23561443": {"recommendationid": "23561443", "author": {"steamid": "76561197963606227", "num_games_owned": 6512, "num_reviews": 14, "playtime_forever": 526, "playtime_last_two_weeks": 0, "playtime_at_review": 526, "last_played": 1465769632}, "language": "english", "review": "[b]Review Written on Sunday, June 12th, 2016[/b] \n\n[h1]Review[/h1] \n\nThis game is an open-world sandbox game, similar to Terreria, Starbound, and the like. You can get randomly generated small, medium or large worlds in single-player or multiplayer modes. Lots of effort went into the crafting and gathering portion of the game, as well as the world itself and all the monsters you can encounter. Sometimes I die too easily, but usually that's my own fault, I need to be more careful.\n\nI enjoy how much there is to do in this game, you can discover so many different monsters, items to gather, ways to die, and so on that you can play in one world for a good while. The music is pleasant and the sound effects aren't bad, kind of sparse though. The graphics aren't bad, and I like that even if you have a higher resolution monitor you can use zoom to make things easier to see, otherwise the world is way too small at the higher resolutions.\n\nI consider this game a well polished and interesting hybrid rpg/sandbox/open-world game in the same vein as others that came before it. If you enjoy these kind of games, it is worth the asking price for it. Also the developers are active after this game left early access, so they definitely care about polishing the game even further. Overall this game is well worth money and I highly recommend it. :)\n\n[h1]Rating:[/h1] \n\n7.8/10 \n\n[h1]Pros:[/h1] \n\n[olist] \n[*]Great open-world sandbox gameplay, with lots to do and see. \n[*]RPG style system where you level up and can learn different things to craft and gather inside the game world. \n[*]Talent system to allow to level up all kinds of different skills and abilities you can use. \n[*]A massive amount of content already in the game. \n[*]I like the zoom feature with higher resolution graphic settings it allows your character and the world you are in to be bigger and easier to see. \n[/olist] \n\n[h1]Cons:[/h1] \n[olist] \n[*]UI needs a little more polish, it seems that items arent well organized and quantity of items for crafting is not very obvious. \n[*]On multiplayer, when I do an attack or receive an attack, it seems to lag for some reason, so the projectiles or melee attack stutter somewhat. I think this just may be related to a lagging server. \n[*]Best to play this game on a keyboard and mouse. So far the controller is hard to use in comparison.\n[*]Game gets a little repetitve after awhile, but it keeps it interesting with some variety.\n[*]The craft system could use some more intuitive UI adjustments and polish, overall it's pretty decent though.\n[/olist] \n\n\n\n[h1]Disclaimer:[/h1] \n\n[code]Source of consideration: Siege Games[/code]", "timestamp_created": 1465949331, "timestamp_updated": 1465953113, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.651819765567779541", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "12282046": {"recommendationid": "12282046", "author": {"steamid": "76561197993605266", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 268, "playtime_last_two_weeks": 0, "playtime_at_review": 206, "last_played": 1531860930}, "language": "english", "review": "I really want to like this game, but many aspects of gameplay bother me.\n\nResearching to create crafting templates is fun the first time through, but once I know how and what I can create it turns into a horrid grind if I ever start a new character.\n\nBeing unable to move while breaking down blocks or interacting with objects make movement feel slugging and hindered.\n\nAgain, I really want to like this game. Crea takes RPG aspects that add great value to gameplay that are simply not found in other version of the same gametype; such as Terraria.\n\n\n\n\nUPDATED REVIEW\n\nI was asked to re-review this game, so here she is!\n\nTo be honest, it felt more or less like the same game. There was more content, which is awesome. The workshop which is amazing, and excellent addition to a game such as this, even the controls felt better than I remembered. So in essence, almost everything I complained about in my previous review is either fixed, or generally better.\n\nBut still I cannot recommend this game.\n\nThis may be simply because the games RPG elements stand out compared to a lot of other game within this niche genre, but doesn't hold up to what I expect out of those RPG elements.\n\nIt is nothing personal, I just don't feel like the game goes the same places I would like it to.", "timestamp_created": 1411938727, "timestamp_updated": 1466728993, "voted_up": false, "votes_up": 70, "votes_funny": 3, "weighted_vote_score": "0.651033222675323486", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "88555814": {"recommendationid": "88555814", "author": {"steamid": "76561198119824944", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 4253, "playtime_last_two_weeks": 0, "playtime_at_review": 4253, "last_played": 1614828545}, "language": "english", "review": "I like both Terraria and Starbound a lot, and bought Crea looking for a different spin on a familiar genre. I got what I wanted, but I can't say it's something I'd recommend to anyone I've played those games with.\n\nThere's some good ideas in Crea, but almost none of them feel complete. Everything is loosely tied together by the grind of getting your character to the maximum level, and that is largely all Crea is: a grind. \n\nThere are some bosses, but they do very little to influence how you interact with the world. There are a few NPCs, but I honestly can't remember any of them offering anything particularly unique or necessary. You can build houses for them, but building feels awkward and clunky, as does the rest of the game.\n\nI like the weapon and armour crafting system, the enemy designs are good, and the way skills are implemented fits in very well. If there were simply more to the game and the rest of its features were cleaned up (neither of which seems likely at this point), I think there'd be something special here. As it is, I find myself wishing I could see the best parts of it integrated into Starbound, since I think they would fit perfectly and add a lot to that game.\n\nIf you're willing to overlook the quirks, the overall lack of content, and don't mind (or enjoy) playing through a grind, then Crea might be worth your time just to see what it does differently. I have ~70 hours into it, but I think 15-25 would be enough to get a thorough idea of what it has to offer.", "timestamp_created": 1615928721, "timestamp_updated": 1615928721, "voted_up": false, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.65087890625", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "31350224": {"recommendationid": "31350224", "author": {"steamid": "76561198037780770", "num_games_owned": 729, "num_reviews": 78, "playtime_forever": 457, "playtime_last_two_weeks": 0, "playtime_at_review": 457, "last_played": 1564701224}, "language": "english", "review": "It's really hard to explain just how bad this game is. My issue was that despite my early misgivings, I kept thinking the game would 'open up' after the 4 hours mark, and so I kept playing. Once I reached the first boss, that was when I knew...\n\nThis game suffers from No Man's Sky syndrome.\n\n\"What is NMS Syndrome?\", you may ask. Great question! It's a special sort of suffering that comes about when a game has just enough intrigue and promise to make you play past Steam's refund period, and then instantly drops off afterwards.\n\nThe problems with this game are not going to be fixed without a total rework and transformation into a totally different game, but let me go ahead and spend my time explaining to you just how extensive they are.\n\n[b]Music:[/b]\nThis might seem to be a silly thing to start with, but my god the music in this game is the blandest most boring OST I have ever heard. It's tough to even call it music, honestly. This was always my biggest problem with it. Once you realize there is no 'action' in the game and it's truly a slow, plodding, boring experience, the music begins to make sense, but by then you've already lost all hope.\n\nIf anything could start to make a dent in the playability of this game, making the music more interesting would be a big first step. Compare this to Terraria, which I consider the gold standard for indie game music. The music changes based on where you are in a planet, and it not only fits the general mood of an area, it also can help set the mood, like when you enter the Dungeon for the first time.\n\nCrea? The bosses don't even have different music. It's the same bland overworld track you've been listening to for 3 hours straight!\nNight-time/Day-time? Same music!\nUnderground? Hey, the music changes a little bit! Too bad it's still boring.\nTL:DR, the music in this game is below sub-par, it might as well not even be there.\n\n[b]User Interaction:[/b]\nOne of the reasons I bought this game was because of the big lauded User Interface upgrade that I saw so much about and how excited people were for it. Guess what?\n\n...it's good. Like, the UI isn't bad at all.\n\nBut the control scheme for this game is the worst thing I have experienced barring $0.99 games being resold from 1995 on Steam. I don't even know how to explain this, but here goes.\n\n1. You have two main 'control schemes' you must use. One is for exploration, the other is for combat.\n2. Each control scheme has a sort of alternate scheme you can switch from. As an example, you can have a melee/ranged and a magic loudout for your character, then your other scheme will be for exploration with magic spells to detect ore and such.\n3. So let's say you're playing with your sword and bow scheme. LMB will likely attack with the sword, and RMB will charge up and shoot your arrow. Want to switch to magic? Maybe you, like me, binded it to scroll-wheel-down. But if you want to switch to exploration mode, with your pickaxe and torches and stuff? That's a [b]totally different button[/b].\n4a. It gets better. The buttons you need to press change depending on what mode you're in. For example, in exploration mode, if you have a spell like the 'locate ore' spell on your hotbar in the '4' position, pressing 4 does not activate the spell. Instead, after pressing 4, you have to press RMB to activate it!\n4b. But let's say you're in combat mode, with your wands in hand and spells at the ready with Fireball tagged to the 4 slot. Pressing '4' DOES cast the spell! WHAT?!\n5a. Your actions against the lower hotbars also change depending on what menu you are viewing. For example, let's say you're in combat mode and there's an enemy coming. You don't have any of your inventory/character/talent windows or etc open, so if you right-click on fireball on your quick menu, it will cast Fireball.\n5b. But then let's say that you DO have an inventory or talent menu open... if you don't realize this and right-click on Fireball... it will [b]delete the god-damn spell from your hotbar[/b]! The enymy was already close by, now you have to frantically open up your talent menu, scroll to the fireball spell, drag it to your hotbar, close the menu, then right-click it again to cast it! Oops, you died!\n6. This one is more agregious, because of how asinine it is. In Exploration Mode, left clicking removes an object or mines a tile... and right click places one. Further, when you pluck comething out of your inventory, like a crafting table, and you then right click to place it... it doesn't place it! You often have to right-click twice! God forbid you left-click instead, you'll be baffled as to why you can't place this item down.\n\nOh no! An enemy is attacking! You're in exploration mode underground, and you need to switch to your weapons in a hurry! What do you do? In your panic, you hit scroll-wheel-down, but alas... that switches to your alternate exploration loadout. So you hit your other button and now you're in magic mode... but oops! You forgot to place a torch somewhere so now you're in total darkness! (Unlike in Terraria, you can't hold shift for a split second to illuminate your surroundings with a torch in your inventory)\n\nYou quicklly press the other button and swap your loadout to melee since this is CQC, but you're still totally blind. Swinging wildly, you quickly die. Or you try to run blindly, fall off a ledge, and take a ridiculous amount of fall damage.\n\nAll I'm saying is that the control scheme in this game is abominable. But even all of what I've said pales in comparison to the next point...\n\n[b]\"\"\"Sandbox\"\"\" Progression:[/b]\nYou know what I think makes Terraria great? You can be as good as you want at the game and it's all skill based. Sure, you might only be doing one-damage to the boss with each arrow you fire, but you're still actually damaging him. In Crea, you will often be fighting enemies at a much higher level than you and not be damaging them at all. Let's dive into core gameplay.\n\n[b]Leveling Up:[/b]\nIn Crea, as you perform an activity, you gain EXP for that thing. You have Arms, magic, exploration, crafting, and gathering.\n\nArms is your physical attacks and such. This includes melee and ranged weapons like bows. (All right, just bows. No guns or anything cool.)\nMagic is obviously stuff related to magic, mostly meaning spells.\nExploration is gained literally by walking around, and boosted by walking in areas you haven't been before, moreso in high level areas. This category also includes mobility upgrades like a double jump and sprinting.\nCrafting is leveled by crafting items, researching, etc. It not only allows you to refine items better, but get better sell prices and such.\nGather is gained when you pick up items, dig in the ground, etc. It includes a few 'spells' that allow you to see ore and treasure chests and stuff, plus lots of upgrades for mining speed and etc.\n\nSo the fundamental issue with leveling, especially in Crea, is that it just flatly locks you out of everything. In Terraria, double jumps can be obtained by finding a cloud in a bottle, and you might literally luck out and find those in a surface level chest five minutes into the game. In Crea, you're guaranteed 5 hours of grinding before you gain such a simple thing.\n\nBut the real issue is what leveling and stats do to the gameplay experience. Crea has leveled zones, meaning the further you are from spawn, the stronger the enemies are, to the point of just one-shotting you. Three of your leveling traits gain you zero combat survivability. The only way to increase your actual player level is to grind in combat by attacking every single enemy you see, and it takes a LONG time.\n\n.......[b]I hit the character limit for steam reviews. I really wanted to continue ripping this game to shreds but now I'm bored. Fantastic, that was effort wasted. Didn't know the limit existed.[/b]", "timestamp_created": 1493091085, "timestamp_updated": 1495917761, "voted_up": false, "votes_up": 108, "votes_funny": 16, "weighted_vote_score": "0.649073779582977295", "comment_count": 30, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23518910": {"recommendationid": "23518910", "author": {"steamid": "76561198000576151", "num_games_owned": 174, "num_reviews": 2, "playtime_forever": 567, "playtime_last_two_weeks": 0, "playtime_at_review": 567, "last_played": 1466260402}, "language": "english", "review": "Loving this game so far! I strongly recommend this game for anyone who enjoys Terraria. There are some things that Terraria doesn't do well that this game improves on:\n\n-Research systems removes the need to look up recipes\n-Blocks/bricks and walls are the same thing which makes building much easier\n-Separate toolbars for combat and crafting is amazing\n-Each monster has its own unique attack pattern that isn't just to run straight at you until you're dead\n-No need to rely on loot RNG to get core abilities like dash and double jump\n\n(And if you don't know Terraria, think Metroidvania meets Minecraft)\n\nI'm sure there are others but I still need to play more. Don't be concerned about developer support, he streams his development on Twitch and is already working on updating the game.", "timestamp_created": 1465731657, "timestamp_updated": 1465731657, "voted_up": true, "votes_up": 24, "votes_funny": 1, "weighted_vote_score": "0.648090600967407227", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "34748992": {"recommendationid": "34748992", "author": {"steamid": "76561198046475532", "num_games_owned": 0, "num_reviews": 108, "playtime_forever": 1961, "playtime_last_two_weeks": 0, "playtime_at_review": 1954, "last_played": 1552774296}, "language": "english", "review": "playing for too long causes an increasing level of memory leak that stacks", "timestamp_created": 1504582350, "timestamp_updated": 1504582350, "voted_up": false, "votes_up": 49, "votes_funny": 13, "weighted_vote_score": "0.647957563400268555", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23573193": {"recommendationid": "23573193", "author": {"steamid": "76561197994239917", "num_games_owned": 3174, "num_reviews": 37, "playtime_forever": 427, "playtime_last_two_weeks": 0, "playtime_at_review": 427, "last_played": 1466008779}, "language": "english", "review": "I'll start with the obvious. Crea is a sandbox RPG, which has a lot of similarities to Terraria. Crea is more about the characters personal development through levelling up and talents, along with weapon and armour upgrades. Crea also has a really cool research system behind the crafting. You need to find the pieces of what you want to make and research them to discover the recipes they can be used in. You can also use scraps (that can be easily obtained from research) to discover parts of the recipe without using the components you have. The crafting system goes even deeper than that, by using \"Chaos\" to imbue your items.\n\nCrea feels good to play, the mechanics all work well together and nothing feels too clunky. There are a few inconveniences, like being unable to use skills unless you're in combat mode. However the trade-off for that one is that there is a toggle for combat and building/exploration, which is a huge quality of life advantage. The world looks good, and there is some good variety in the biomes, items and enemy types.\n\nCrea shouldn't be written off purely as a Terraria clone, it's a game that takes the fundamental idea behind it and produces a fantastic experience. Having said that, if you liked Terraria and want something similar, this is definitely your best choice.", "timestamp_created": 1466012260, "timestamp_updated": 1466012260, "voted_up": true, "votes_up": 14, "votes_funny": 1, "weighted_vote_score": "0.64711683988571167", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "24392057": {"recommendationid": "24392057", "author": {"steamid": "76561197995974311", "num_games_owned": 356, "num_reviews": 19, "playtime_forever": 519, "playtime_last_two_weeks": 0, "playtime_at_review": 519, "last_played": 1468858265}, "language": "english", "review": "Not enjoying myself. Loved the first 2 hours and the inspiring music, all the good & fresh ideas but in its current state I can't recommend it as I got too lags in-game after a few hours of intense gaming.\nRegarding gameplay, combat feels clunky and boring despite the many skills (not visible enough in my opinion and not intuitive). Exploration is not rewarding, chests are greedy. Moreover the world feels empty. The idea behind the crystal teleporting you to instance locations are fun at beginning but it's always the same.\nI'm really trying to appreciate this game but mixing RPG elements with Terraria is not enough to me, the magic is not there yet.\n", "timestamp_created": 1468857659, "timestamp_updated": 1468857659, "voted_up": false, "votes_up": 19, "votes_funny": 1, "weighted_vote_score": "0.646978974342346191", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23578181": {"recommendationid": "23578181", "author": {"steamid": "76561197963550511", "num_games_owned": 26629, "num_reviews": 272, "playtime_forever": 2802, "playtime_last_two_weeks": 0, "playtime_at_review": 1417, "last_played": 1466967048}, "language": "english", "review": "[b]Review posted on Thursday, May 16th, 2016[/b]\n\n[b]Crea[/b] might be summarised as a [i]Terraria[/i] with light RPG features. Much like how [i]Terraria[/i] was heavily inspired by [i]Minecraft[/i] while promising major changes (and using a different engine), there are substantial differences from [i]Terraria[/i], including a different engine approach with [i]Python[/i]-based moddability. The standout features are a leveling and research system with stat points and magic spells, and it includes the vast bulk of features players are used to from [i]Terraria[/i]. The controls, crafting, fighting, digging and exploration make one feel right at home, and all the expected elements are in it and often expanded upon. Building elements and armor are largely the same, but different tool types have been simplified away. NPCs are 'crafted' too in an interesting system where you equip a neutral mannequin with a specific suit to assign a role to it.\n\nUnfortunately much like the afore-mentioned games this is inspired by, it's very much a game that hides many crucial details from you, forcing the player to play with out of game help like a Wiki. Whereas the initial items [i]Terraria[/i] or [i]Minecraft[/i] shipped with had very clear tiers, that isn't the case here. A bronze tool may have a specific upgrade part later on, while perhaps a bone one does not, and that isn't shown in the UI besides by mouseovering every known recipe.\n\nExperience gain is handled via a 'learning by doing' system, where fighting gives you combat XP, crafting gives you crafting XP; ditto for magic, gathering, exploration – and all of those have separate levels and unlocks ([i]talents[/i]) that you pay for with points gained from leveling. Regularly these unlocks come in the form of active abilities for your quickbar, and you will quickly run out of space for them.\n\nFor the combat, common RPG features like dungeons and mob spawners join familiar features like bosses, but unlike in [i]Terraria[/i] and the like, you will rarely actually use health potions and mostly rely on a healing spell fueled by your combined stamina / mana bar (shared between attacks, dodges, spells and so on).\n\nInventory management is once again a matter of coping with your very limited amount of slots, which themselves store an ungodly quantity of their particular items. One neat feature however is that you can craft using items stored in nearby chests, as well as use a forge you are not standing directly next to. In [i]Terraria[/i] it's always a bit of a needless fetch quest to grab the materials you need to craft from your sorted chests and walk to the right crafting station. Another convenience option after a few hours of play is obtaining extra inventory space in the form of bags, which sadly then can't be viewed all at once.\n\n[b]Crea[/b] is quite jolly for people who enjoyed [i]Terraria[/i], but isn't gonna win over those who didn't.\n\n[h1]Rating:[/h1]\n\n7.4/10\n\n[h1]Pros:[/h1]\n[list][*]lots of perfectly functional content\n[*]has everything people love from Terraria\n[*]moddable ([b]warning: mods disable Steam Achievements[/b])\n[*]frequent updates\n[*]free, non-grid item placement instead of only placing items in blocks\n[*]\"Terraria with a twist\"[/list]\n[h1]Cons:[/h1]\n[list][*]not very original (\"Terraria with a twist\")\n[*]need out of game help or a lot of trial and error to cope with the crafting and progression\n[*]a good few graphical bugs and glitches remain\n[*]poor combat AI pathfinding[/list]\n\n[h1]Hardware Information[/h1]\n\n[table]\n[tr]\n[th][u]Hardware[/u][/th]\n[th][u]Type[/u][/th]\n[/tr]\n[tr]\n[td][b]Monitor[/b][/td]\n[td]Samsung SyncMaster P2470[/td]\n[/tr]\n[tr]\n[td][b]Sound[/b][/td]\n[td]Sennheiser HD 580 and Samson Resolv 80a Speakers[/td]\n[/tr]\n[tr]\n[td][b]Keyboard[/b][/td]\n[td]Microsoft Siderwinder X4[/td]\n[/tr]\n[tr]\n[td][b]Controller[/b][/td]\n[td]Microsoft Xbox 360 Wireless[/td]\n[/tr]\n[tr]\n[td][b]Mouse[/b][/td]\n[td]Logitech G400[/td]\n[/tr]\n[tr]\n[td][b]Microphone[/b][/td]\n[td]Koenig Electronic CMP-MIC8[/td]\n[/tr]\n[tr]\n[td][b]Motherboard[/b][/td]\n[td]Gigabyte X58A UD3R[/td]\n[/tr]\n[tr]\n[td][b]CPU[/b][/td]\n[td]i7 920 at around 4 GHz[/td]\n[/tr]\n[tr]\n[td][b]GPU[/b][/td]\n[td]Geforce GTX 670[/td]\n[/tr]\n[tr]\n[td][b]RAM[/b][/td]\n[td]12GB[/td]\n[/tr]\n[tr]\n[td][b]OS[/b][/td]\n[td]Windows 7 64-bit[/td]\n[/tr]\n[tr]\n[td][b]HDD[/b][/td]\n[td]2x 1TB RAID HDD[/td]\n[/tr]\n[/table]\n\n[u]A review copy of this game was provided by the developer.[/u]", "timestamp_created": 1466033711, "timestamp_updated": 1466305701, "voted_up": true, "votes_up": 28, "votes_funny": 1, "weighted_vote_score": "0.643894970417022705", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "24663070": {"recommendationid": "24663070", "author": {"steamid": "76561198072453334", "num_games_owned": 0, "num_reviews": 30, "playtime_forever": 94, "playtime_last_two_weeks": 0, "playtime_at_review": 94, "last_played": 1470026881}, "language": "english", "review": "Honestly, wait until this game is more developed before you buy it. Mostly beacuse of the control layout. It is TERRIBLE (My opinion). You'll find yourself constantly dying in combat because you have to change to combat mode. And building is a pain because instead of having ten slots for the hot bar, theres two groups of five that you have to switch between. And the cursor will always have a block or item blinking on it like an eyesore. And your inventory is SUPER SMALL! and and and... Sorry Crea but you don't live up to the trailer at all. I suggest that you wait until the game is better developed to buy it. If you don't have a game like this, BUY TERRARIA!", "timestamp_created": 1470105437, "timestamp_updated": 1470105437, "voted_up": false, "votes_up": 25, "votes_funny": 1, "weighted_vote_score": "0.641627013683319092", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "22637343": {"recommendationid": "22637343", "author": {"steamid": "76561198021369856", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1216, "playtime_last_two_weeks": 0, "playtime_at_review": 550, "last_played": 1489699418}, "language": "english", "review": "I have been playing this game for about 10 hours now, and I have to say that it is actually a lot of fun. \n\nI wasen't really interested in the beginning but after play a bit and figuring out how the experience working. It has a very hard learning curve, but after learning how it works its a a very fun system. \n\nIt might still be in early access but the game is pretty good untill now. The game has some bugs, but the dev is working on it every day. He even streams how he works on it, and how he fixes the different bugs. \n\nI know this review is really short, but I hope this might make you want to try this game.\nGive it a shot :D", "timestamp_created": 1461622098, "timestamp_updated": 1461622098, "voted_up": true, "votes_up": 16, "votes_funny": 1, "weighted_vote_score": "0.638268828392028809", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "23544529": {"recommendationid": "23544529", "author": {"steamid": "76561198013775203", "num_games_owned": 12341, "num_reviews": 20, "playtime_forever": 525, "playtime_last_two_weeks": 0, "playtime_at_review": 525, "last_played": 1465858887}, "language": "english", "review": "[b]Review Written on Monday, June 13th, 2016[/b] \n\n[h1]Review[/h1] \n\nAs a 2D sandbox RPG, it's hard not to compare Crea to Terraria. Despite a somewhat similar pixel-art visuals and side scrolling adventuring, Crea has a lot to offer to be it's own game. While not a huge fan of the genre, I have still found the time spent so far to be enjoyable.\n\nCrafting is done by learning recipes through researching the different elements  you gather from exploring, or that you craft from the base materials. It's also nice that you're using the same blocks to build the side and back walls of your buildings. Combat is dynamic and doesn't feel too one-dimensional with various creatures fighting you in different ways. Some of them are also peaceful and won't attack you unless they're getting attacked first. The leveling and skills are interesting and the points you gain to spend in there areas are amassed through experience. If you're mostly avoiding fights, don't expect to have much points to spend to improve your fighting skills.\n\nThis can be a bit problematic sometimes because, in the case of fighting, it takes a bit before you can craft decent equipment so you might struggle with the wildlife when trying to explore the world in search of crafting material for research and building. It's hard to fight until you get the hang of it and some decent equipment ans skills, and it's hard to improve your skills and equipment if you're having trouble exploring and dying from attacks. Some type of monsters can only be found in certain areas so you sometimes need to grind for items that you need to explore a different area. (Like gathering wood and oil to make torches before doing some underground exploration.)\n\nWhile the game adds elements of lore that you can find through your explorations, the content feels a bit thin. There's also little to no explanation about some elements of the game (like teleport crystals) and you're left to find out for yourself what they're for.\n\nOverall, the game has enough to offer for fans of the genre. With the limited content, it's probably better to have people to play with to make the experience more enjoyable, but even as a single player game it's easy to sink quite some time into this.\n\n[h1]Rating:[/h1] \n\n7.6/10 \n\n[h1]Pros:[/h1]\n\n[olist] \n[*]Recipes are learned from research\n[*]Dynamic combats which requires varied strategies\n[*]RPG elements with stats and skills progression.\n[*]Relaxing music score\n[*]Ability to mod the game\n[/olist] \n\n[h1]Cons:[/h1]\n\n[olist] \n[*]Content is a bit thin\n[*]A bit hard to get started\n[*]Some things are confusing and aren't explained.\n[*]The GUI can get in the way at times\n[*]No dedicated server for multiplayer\n[/olist] \n\n[h1]Disclaimer:[/h1] \n\n[code]Source of consideration: Siege Games[/code]", "timestamp_created": 1465861232, "timestamp_updated": 1465861244, "voted_up": true, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.637476086616516113", "comment_count": 1, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23471319": {"recommendationid": "23471319", "author": {"steamid": "76561198053446846", "num_games_owned": 378, "num_reviews": 4, "playtime_forever": 3354, "playtime_last_two_weeks": 0, "playtime_at_review": 2793, "last_played": 1528073563}, "language": "english", "review": "Crea is a great mix of Terraria's sandbox, Starbound's combat and a unique system of Crafting, Researching, and adventuring!\n\nEach character has the option of branching into any of the skills available, so no restricting classes. And you can swap between different combat styles with a press of a button. \n\nTons of amazing furniture and building materials to make crazy complex and realistic houses and buildings. \n\nHilariously fun for multiplayer and tons of player to player skill interactions that make boss fights more interesting! \n\nA great rpg experience from the very start!", "timestamp_created": 1465493618, "timestamp_updated": 1465493618, "voted_up": true, "votes_up": 20, "votes_funny": 2, "weighted_vote_score": "0.635960280895233154", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "32836337": {"recommendationid": "32836337", "author": {"steamid": "76561198015183752", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 11079, "playtime_last_two_weeks": 0, "playtime_at_review": 6898, "last_played": 1566999674}, "language": "english", "review": "TL:WR\nIt is worth a try. It won't take you long to decide if you like it or not.\n\n\nWinded Review:\n\nFirst of all, if you are interested in this game hoping it will play like X sandbox game, expunge that notion from your mind right now. There are several reasons for this. Even among apples there are different varieties and you may not like Golden Delicious apples but go wild for Fuji apples. Same goes for games of a similar genre. In addition, this game is farily new when compared with other popular 2d sandbox type games (i.e. Terraria) and so it is frankly unfair to judge based on that. Would be like deciding if you like a cake based on the taste of the flower you plan to use.\n\nThe game has its bugs. The developers are focusing on dealing with the bugs rather than pushing out a lot of new content. [b]They try their hardest to respond to players who are having issues and figuring out if it is something they can fix.[/b] New things (monsters/features/etc) are slipped in as well to keep things interesting. But they have also overhauled the system a few times already. (The most current UI I am not a fan of, but it was an improvement over the previous.)\n\nI should be far more professional about this review and listing the various problems. But despite the problems I find, I still enjoy the game very much. \n\n\nIf you are able to get over the idea that it isn't, \"just like x game\" you will probably enjoy it as well. \nIf you are capable of understanding the game is in it's early infancy (release wise), you will probably enjoy the game.\nIf you need a game that tells you what to do next, you will find yourself not enjoying the game.\nIf you base a game's enjoyment based on how difficult it is, you may not enjoy the game very much.\n[i](Granted, difficulty will change from person to person. What is easy for me may be difficult for you and vice versa.)[/i]\n", "timestamp_created": 1498523571, "timestamp_updated": 1498523571, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.635309994220733643", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "106664816": {"recommendationid": "106664816", "author": {"steamid": "76561197966707130", "num_games_owned": 715, "num_reviews": 14, "playtime_forever": 849, "playtime_last_two_weeks": 0, "playtime_at_review": 849, "last_played": 1629744461}, "language": "english", "review": "The game had potential.\nFixing the progression, fixing the balance, reworking the UI a bit and implementing a few unique new things and it would've been a very enjoyable game.\n\nNow it's abandonware though, sub-par compared to the competition in the genre-type of it, not worth the price it's sold at for the mediocre content it provides.", "timestamp_created": 1640617784, "timestamp_updated": 1640617784, "voted_up": false, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.630576550960540771", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23638404": {"recommendationid": "23638404", "author": {"steamid": "76561198063574735", "num_games_owned": 21401, "num_reviews": 264, "playtime_forever": 2555, "playtime_last_two_weeks": 0, "playtime_at_review": 2555, "last_played": 1466967050}, "language": "english", "review": "Crea is a cute sandbox RPG with procedurally generated worlds that is heavily inspired by Terarria; therefore, if you enjoyed playing Terarria, you'll probably have a lot of fun with this one too. Even more so, since Crea extends what Terarria offers with a few new features that are very entertaining and nice.\n\nOne of the most important features is the leveling system: everything you do in Crea gives you experience points, categorized by what you do to gain them. The XP are not added only to your character level, but they're also split according to the action you perform: exploring will give you XP in the Exploration category, mining or cutting wood will give you XP in the Gathering area etc. In addition to that, there's a talent system - according to the level you have in an area, you can unlock passive or active abilities that make your character stronger or increases your gathering or crafting skills.\n\nThe two main aspects of these kind of games are split in two separate interfaces - there is a setup for survival mode (combat) and another setup for the gathering mode (building); each of these setups comes with two separate toolbars that you can customize according to your needs. Switching between the setups or the toolbars is very easy (one key press). However, having this kind of design makes it a bit difficult during early levels to perform both combat and gathering during the night, since switching to combat mode makes you lose the only source of light you have, leaving you in complete darkness to fight with your enemies, unless you put down a torch every few steps. This problem falls away at later levels by the time you acquire luminescent weapons or a spell that conjures a light orb that follows you.\n\nThe enemies are of various types and come with different fight mechanics: some of them should be meleed from behind, others can be killed easier using ranged weapons. This makes good use of the double toolbar setup for the combat mode, since you'll need to have both a melee set of weapons and a ranged one. I found the difficulty of the enemies at lower levels a bit too high, even on easy mode - they do a lot of damage; you need to parry or dodge a lot since the majority of them can kill you in 2 hits.\n\nCrea has Dungeons, how cool is that!!! Independent areas on the map, that despawn after completion, dungeons provide a lot of fun and... very cool loot(since you can snatch all the goodies and fill your house with shinies) :)\n\nThe crafting aspect of the game is extensive; you can craft the plain old way, by one-clicking (oh and by the way, crafting with this method is instant, there's no progress bar or waiting time until you get your desired item). As an alternative to that, the game features Chaos-mode, which is a mini game that makes use of crafting talents gained through leveling in order to produce better or more items. The crafting recipes are discovered by researching but you are only able to research recipes you have mats for. On one hand, this limits your crafting possibilities to items that you have mats for. On the other hand, you can't see a full list of everything that can be researched; if you want to craft a fancy item, you won't know in advance what you need to gather in order to research it, unless of course you spoil it for yourself by consulting the Wiki.\n\nThe clean interface features moveable windows, which is very useful while crafting, either for organizing your inventory and the needed mats or for comparing the stats between the crafted gear and the equipped one. However, even with these moveable windows, I found it quite annoying that I don't have any indication when a mob attacks me while having my screen full of these windows. I believe that a blinking screen or a red border would be very useful in this case.\n\nThe basics of the game are summarized into a short and concise tutorial; the information that it provides is in my opinion enough not only to get you started, but also to make you understand the mechanics of the game; the rest is left to the player's own exploration.\n\nApart from some small bugs that didn't disturb my gameplay enjoyment too much, I had only one problem with the game: it consumes quite a lot of PC resources despite the fact that it shouldn't; the lighting or having multiple things happening in the background is very CPU hungry, often causing spikes; after 3-4h in game my PC already starts to struggle with the high CPU usage and tabbing out doesn't help it at all. Since the developer is quite active in the forums, I have faith that this optimization issue will soon be addressed and fixed.\n\nI had a lot of fun playing Crea so far. I feel that it's a wonderful and well designed game that is worth the asking price. For the nice graphics, hours of entertainment, Steam integration with achievements and workshop, I highly recommend this game.\n\n[h1]Note: A key has been provided by the developer with the request to write an informative review. No other consideration, compensation or instruction was received. My personal opinions about this game are not influenced by this.[/h1]\n\n[quote]More reviews on the [url=http://store.steampowered.com/curator/11354094]Lilly's Corner Curator page[/url][/quote]", "timestamp_created": 1466279500, "timestamp_updated": 1521292555, "voted_up": true, "votes_up": 41, "votes_funny": 2, "weighted_vote_score": "0.629857003688812256", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "115454065": {"recommendationid": "115454065", "author": {"steamid": "76561198118965281", "num_games_owned": 197, "num_reviews": 31, "playtime_forever": 1908, "playtime_last_two_weeks": 0, "playtime_at_review": 1908, "last_played": 1608600045}, "language": "english", "review": "abandoned, lacks content...", "timestamp_created": 1652550495, "timestamp_updated": 1652550495, "voted_up": false, "votes_up": 25, "votes_funny": 0, "weighted_vote_score": "0.628977596759796143", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "38357958": {"recommendationid": "38357958", "author": {"steamid": "76561198052714222", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 612, "playtime_last_two_weeks": 0, "playtime_at_review": 612, "last_played": 1513650648}, "language": "english", "review": "My whole experience with Crea is unimpactful. I don't have any stories to tell about my time playing it. I just...did stuff. I did menial chores in order to earn skills and create items (using a confusing, arbitrary, what-does-this-even-accomplish crafting system) that are mediocre and unrewarding. I built houses for NPCs that just stand there motionless, like mannequins. I fought battles that no impact: I pressed the swing-sword button while little ball enemies walked at me, until one of us poofed out of existence.\n\nI guess there is one story: I once ran into this weird monster. It looked like all the other monsters of its type, so I attacked it like all the same. It turns out, it was a super monster! It spawned twenty minions, before killing me instantly with a critical-hit, smack-your-face-outta-nowhere ability. That's when I uninstalled the game.\n\nMeh. I don't even hate this game -- it a pleasant enough of a time-waster, but it was a time-waster, and not a tiny thing more. It's pretty much a textbook example of unremarkable.", "timestamp_created": 1513451618, "timestamp_updated": 1513458267, "voted_up": false, "votes_up": 21, "votes_funny": 4, "weighted_vote_score": "0.628832161426544189", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "48022425": {"recommendationid": "48022425", "author": {"steamid": "76561198144292893", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 2617, "playtime_last_two_weeks": 0, "playtime_at_review": 2490, "last_played": 1562612948}, "language": "english", "review": "If you like Terraria but want something less bullet-hell and better paced, this is the game for you.\n\nCrea takes the best elements from similar games and stays fresh. Combat is well paced and engaging. Leveling provides loads of possibilities for creating a character and refining a playstyle. It blends RPG elements with sidescrolling sandbox in a very balanced way, and theres always a feeling that there is more to explore. The world is visually distinct, the monsters vary greatly in how they attack, the crafting system makes building weapons and armor more than a collect-a-thon. The music is high-quality and fits the style. \n\nThat being said, Crea suffers from a general clunkiness. Sometimes animations glitch, sometimes the UI bugs out, etc. Subjectively speaking, people might be annoyed at how leveling up works or is applied, the somewhat narrow skills available for playstyles, and the slower paced progression of the game. \n\nOverall, this game is a rough gem that I absolutely recommend. With every bit of polish, the game shows a unique, well paced perspective on the side-scrolling sandbox game.", "timestamp_created": 1546374408, "timestamp_updated": 1546374408, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.622817397117614746", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23848930": {"recommendationid": "23848930", "author": {"steamid": "76561198045289933", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 480, "playtime_last_two_weeks": 0, "playtime_at_review": 480, "last_played": 1466994634}, "language": "english", "review": "This game is much like Terraria but some key differences include actual character leveling, skill trees of a sort, summonable dungeons. among other things. It is fun and I would buy it again but I must point out that this game is BUGGY/GLITCHY as HELL! I have had to restart about 4 times in my 6 hours of game time. Hopefully they fix some of this soon.", "timestamp_created": 1466994856, "timestamp_updated": 1466994856, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.622480869293212891", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "141217013": {"recommendationid": "141217013", "author": {"steamid": "76561197967223692", "num_games_owned": 917, "num_reviews": 223, "playtime_forever": 765, "playtime_last_two_weeks": 0, "playtime_at_review": 765, "last_played": 1659314776}, "language": "english", "review": "A dead, unfinished game abandoned by the developer. It has a lot of promise, which is why the outcome is so sad. There are large areas that need to be re-though out, and redone, and much, much more needs to be added in for it to be a full game. If anyone claims that this is a full game, or completed, they are delusional. It is too bad, because it seems like there was a lot of talent that went into making this game. A shame that it never got to where it could be, and that would have been a very good game.\n\nDon't buy this, don't support this developer. Even if it is on sale and super cheap, it just isn't worth it to support terrible business practices like this. I will not be buying any of their future games, knowing that they could be just as easily abandoned and people who paid good money for it screwed over. Not recommended in any way, shape, or form.", "timestamp_created": 1688394040, "timestamp_updated": 1688394040, "voted_up": false, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.622337579727172852", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "54552642": {"recommendationid": "54552642", "author": {"steamid": "76561198010631337", "num_games_owned": 571, "num_reviews": 42, "playtime_forever": 1807, "playtime_last_two_weeks": 0, "playtime_at_review": 777, "last_played": 1586032356}, "language": "english", "review": "Fun game clearly influenced heavily by Terraria, Starbound and Dark Souls. Its pretty good, much harder than Terraria.\n\nThree words: Dont. Play. Melee.\n\nThis game HEAVILY favours ranged/magic combat and playing as pure melee makes the game extremely difficult because you have essentially no counter to magic monsters that hit like a truck.\n\nOtherwise, pretty good game, will get better with more updates.", "timestamp_created": 1565452916, "timestamp_updated": 1565452916, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.622095942497253418", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "18420580": {"recommendationid": "18420580", "author": {"steamid": "76561198047564943", "num_games_owned": 0, "num_reviews": 27, "playtime_forever": 406, "playtime_last_two_weeks": 0, "playtime_at_review": 394, "last_played": 1463113514}, "language": "english", "review": "I do like this game and would continue to play  it if it weren't for the scaling of the game. At 1920x1080 the game objects are tiny. Any scaling or magnification just make this game fuzzy (appears like a gaussian blur effect) and unpleasant.\n\nThe developer should reconsider the sizing in this game.", "timestamp_created": 1444525820, "timestamp_updated": 1444525820, "voted_up": true, "votes_up": 18, "votes_funny": 2, "weighted_vote_score": "0.620604276657104492", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "11190421": {"recommendationid": "11190421", "author": {"steamid": "76561198015539882", "num_games_owned": 3128, "num_reviews": 142, "playtime_forever": 126, "playtime_last_two_weeks": 0, "playtime_at_review": 126, "last_played": 1405114335}, "language": "english", "review": "As of v0.8.5:\n\nPretty solid 2d exploration-building sandbox action-RPG. Sounds too complicated? Well, if you've heard of/played Terraria - you know exactly what's this game about.\nCrea has enough unique things going on to be considered worthy successor to Terraria, not just a straight copy. To name the few: experience based progression in all fields, skills system, progression in crafting, gathering and other areas, researching recipes and a bunch more minor things.\nAdd to this Python codebase that anyone can edit and, as a result of this, completely moddable game. With a pretty simple way to create ANY mods. And then you can mod the mods if you want. Because it's just python :D\n\nMore details in the video:\nhttps://www.youtube.com/watch?v=LMC40dOVf_A", "timestamp_created": 1405119122, "timestamp_updated": 1405119122, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.61736452579498291", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "23483556": {"recommendationid": "23483556", "author": {"steamid": "76561198017076824", "num_games_owned": 9324, "num_reviews": 373, "playtime_forever": 868, "playtime_last_two_weeks": 0, "playtime_at_review": 868, "last_played": 1465759791}, "language": "english", "review": "[b]Review Written on Friday, June 10th, 2016[/b] \n\n[h1]Review[/h1] \n\nCrea is a cute pixel like game much akin to Terraria. You harvest items like trees and minerals and then research these items so that you can craft them into different objects. There's a lot of exploration to be done which involves walking on the surface of the world or digging below. Beneath the surface you will find creatures, different kinds of minerals and treasure chests. The treasure chests can only be opened with keys that you can find by smashing pots or even by picking the locks using a lock picking skill which can be acquired by leveling up. There are lots of other skills you can acquire in different categories. If you explore a lot then your exploration XP increases and you can spend those XP on different skills to do with exploring like jumping higher or running faster. If you fight a lot you can use the XP on different skills to level up your weapons etc.. \n\nI have started to enjoy this game now but I have to say that you need to be VERY patient and do a bit of research into how this game works. The GUI is a bit confusing when it comes to crafting and in my opinion it is just harder to craft things than it should be. Perhaps its because I have never played a game like this before but I found it really difficult to work out what to do to start off with.Some people like the fact that you have to work out what to do whilst others prefer knowing from the off how to do things. I had difficulties with equipping items I had created and found the whole crafting side very frustrating. After 5 hours of playtime I am starting to figure out the procedure. First of all harvest your items whether its by chopping down trees, killing monsters or digging the ground. Eventually you will have enough resources to craft a research bench. Once that is crafted you can research into the resources you have found which will give you recipes for new items i.e. better weapons, furniture,spellls etc... Once you have these recipes you need to craft a work station to build them. If your inventory is full and you craft the item then the item will fall to the ground! You can buy another inventory bag or craft a chest to put your things in though, however I havent found enough resources to craft one yet.I think there is going to be a lot of grinding in this game to get the resources you need to research and craft items to eventually explore further away lands. The further away you venture from your starting point the more difficult it becomes and you will find yourself being killed by one hit of a flying fishes tongue or something. Once you have upgraded your character and have better armor and weapons then you can expand your horizons a bit and even visit other worlds through teleporting through the crystals that are laid out throughout the world. The graphics are nice if you like pixel like sprites and the music is relaxing and calming. The game got released yesterday and Jasson the developer seems very nice and responsive to any suggestions you might have. \n\nOverall I would say that if you like these types of games then it is a very good example of one. It has a charm about it and you find that you can play it for hours and not get bored. Try not to get too frustrated with the crafting side of things. It may seem frustrating and baffling at the time but you soon get used to it and then you will find that you proceed quicker. Even though there is a basic tutorial system it is not enough to answer all of your questions I found and I had to research the internet or ask friends how to do things. This is an area I think can be improved on. The game is quite difficult to start off with and you will find that you wont be able to venture too far away from your starting point without leveling up and getting better weapons. With Steams refund policy theres no excuse not to try it out though just be careful that you don't accidentally play over 2 hours as this game has a habit of devouring your daytime. \n\n[h1]Rating:[/h1] \n\n7.5/10 \n\n[h1]Pros:[/h1] \n\n[olist] \n[*]A good example of a Survival/crafting typed game with nice pixelated graphics and sound. \n[*]This game has charm in buckets and there are loads of nice touches throughout which keep you amused and entertained. The developer is always releasing updates too! The discussion forum is lively. \n[*]Good Customisation including character design and choices of worlds. \n[*]Multiplayer or single player options \n[*]The game has Controller support although sometimes this doesnt integrate well with the mouse and options. \n[/olist] \n\n[h1]Cons:[/h1] \n[olist] \n[*]The Crafting system is over complicated and the GUI needs a little rethinking. \n[*]A Lack of tutorials to tell you what to do. \n[*]Controller support seems to be a bit glitched with menus and it is difficult to dig solely with the controller. I found I would use the controller to move and fight but would use the mouse to dig. \n[/olist] \n\n[h1]Hardware Information[/h1] \n\n[table] \n[tr] \n[th][u]Hardware[/u][/th] \n[th][u]Type[/u][/th] \n[/tr] \n[tr] \n[td][b]Monitor[/b][/td] \n[td]LG IPS LED FLATRON IPS234[/td] \n[/tr] \n[tr] \n[td][b]Headphones[/b][/td] \n[td]Turtle Beach Earforce X12[/td] \n[/tr] \n[tr] \n[td][b]Keyboard[/b][/td] \n[td]Corsair Raptor K40[/td] \n[/tr] \n[tr] \n[td][b]Controller[/b][/td] \n[td]Microsoft Xbox 360[/td] \n[/tr] \n[tr] \n[td][b]Mouse[/b][/td] \n[td]Trust GXT 25[/td] \n[/tr] \n[tr] \n[td][b]Microphone[/b][/td] \n[td]Turtle Beach Earforce X12[/td] \n[/tr] \n[tr] \n[td][b]Motherboard[/b][/td] \n[td]ASRock Z97 Extreme 6[/td] \n[/tr] \n[tr] \n[td][b]CPU[/b][/td] \n[td]QuadCore Intel Core i7-4790K 4400 MHz 44 x 100[/td] \n[/tr] \n[tr] \n[td][b]GPU[/b][/td] \n[td]Gigabyte GeForce GTX 760[/td] \n[/tr] \n[tr] \n[td][b]RAM[/b][/td] \n[td]16GB[/td] \n[/tr] \n[tr] \n[td][b]OS[/b][/td] \n[td]Windows 8.1[/td] \n[/tr] \n[tr] \n[td][b]HDD[/b][/td] \n[td]Crucial M550 512GB SSD[/td] \n[/tr] \n[/table]\n\n[h1]Disclaimer:[/h1] \n\n[code]Source of consideration: Siege Games[/code]", "timestamp_created": 1465561746, "timestamp_updated": 1531144752, "voted_up": true, "votes_up": 20, "votes_funny": 3, "weighted_vote_score": "0.615819036960601807", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "61849016": {"recommendationid": "61849016", "author": {"steamid": "76561198268081123", "num_games_owned": 51, "num_reviews": 41, "playtime_forever": 925, "playtime_last_two_weeks": 0, "playtime_at_review": 426, "last_played": 1686521663}, "language": "english", "review": "'Terraria clone' doesn't do this game justice, even if it looks and somewhat feels like that at first. Instead of labeling itself as a Sandbox Survival game Crea tries to label itself as a Sandbox RPG with Survival Exploration features... though it's still a strange marriage in a few ways.\n\nThat having been said, the more time you put into this little beauty, the more you will understand why even through it's issues this game has some serious potential.\n\nWith only 7 hours in game at this time, some of the information here may not be indicative of end game (since I'm not there) but I'm confident that first impressions last forever and these are mine.\n\nCONS\n~ Balance - Crea has some growing pains going on and it's painfully clear, especially early on. Leveling up from 1 through around 5~10 can be a serious pain and it gives a bad image to the game as a whole (trust me, it gets much better later in the levels) This extends to gear having level requirements that might not make sense early on, but as you continue progressing it becomes better and better until it's no longer an issue.\n~ The grind is real - This is nowhere near the level of 'grind hell' games like Disgaea or RuneScape, but there is a noticeable grind that can get to you in the wee hours of the morn.\n~ Controls - If you've played other 2D sandbox games, the control system here is odd and confusing... at first... But after putting a few hours into it you really start to understand why this control scheme works so well for this game.\n~ Python - If you want to develop mods, you'll have to either know or learn Python. Definitely not the easiest bar for entry when it comes to programming, but not the worst either.\n~ Gamepad issues - Plugged in an Xbox 360 controller and everything was great... except for the right stick aiming. Looked around for a fix and came up empty. Ultimately gave up and went back to keyboard and mouse controls. Left was up, up was left, right was down and down was right. Xbox 360 controller was practically fresh out of the box with only about 2 hours in another game (literally a controller I had just received the same day)\n~ Sound Effect(s) - Seems like male and female characters use the same 'take damage' audio.. which is odd.\n\nPROS\n~ The aesthetics - This game is breathtaking. From the music to the art, it's a feast for the senses. 9/10 on visuals, 9/10 for music. Very well done, developer.\n~ Controls - At first the controls are jarring, but once they start to grow on you you might agree that this style of control for 2D sandbox games should be standard.\n~ Skills - Holy crud. So many useful skills that are available very early in the game. From ore detection to increasing your mining grid from 1 to 3x3 while still being very early in the game, not to mention Raise for multiplayer (starts off at 20% HP restored)\n~ Magic - All of your magic skills can be used regardless of current weapon, though a magic based weapon will affect damage there's still no need for you to equip one to use magic. Though I admit that I wish the cooldown for that first healing spell was lower...\n~ Fast World Generation - Might be a very small foot note to some, but worlds in this game generate *very* fast for me. Running an old Athlon CPU so this surprised me quite a bit.\n\nI think my biggest complaint with this game is the early game level requirements for gear. Feels like a superficial progression blocker that was added specifically to prevent players from using the best gear available to them. Maybe a modder will look into removing the level requirements from non-combat items because THEY ARE NOT FOR COMBAT.\n\nThat little gripe aside, this is a great little gem and I'm looking forward to the potential hundreds of hours I'll spend running around and whining about every new character having to reach level 7 to use an iron mattock.", "timestamp_created": 1579019451, "timestamp_updated": 1579019451, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.614980757236480713", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "22984743": {"recommendationid": "22984743", "author": {"steamid": "76561198066659845", "num_games_owned": 264, "num_reviews": 67, "playtime_forever": 359, "playtime_last_two_weeks": 0, "playtime_at_review": 332, "last_played": 1492020976}, "language": "english", "review": "A great game which addapted from games such as Terraria, but brought a new genre - RPG, SideScrolling, Sandbox & 2D. a must buy for anyone who loves these. with an adapting skill tree, an active developement team and a whole lot of fun, it's very much worth paying for :) is also great with friends. 8.2/10\n\n(I received the game from a friend, nothing to do with the developer)", "timestamp_created": 1463257308, "timestamp_updated": 1463257308, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.609709858894348145", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "92172905": {"recommendationid": "92172905", "author": {"steamid": "76561198030734477", "num_games_owned": 0, "num_reviews": 41, "playtime_forever": 1118, "playtime_last_two_weeks": 0, "playtime_at_review": 1118, "last_played": 1482274195}, "language": "english", "review": "The game was fun and still is but devlopment seems to have ended on it as there are no new updates or patches at all since about 2019, theres been no offical launch or anything so. its best to assume the game is dead.\n\nin current state the few bugs are minor and the core gameplay can and is still enjoyable enough. but id only buy it on sale for vast discount at this point. until the dev refocuses on crea instead of their new game they started up instead of finishing crea", "timestamp_created": 1621282073, "timestamp_updated": 1621282073, "voted_up": false, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.608737826347351074", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "67242525": {"recommendationid": "67242525", "author": {"steamid": "76561198029340758", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 1596, "playtime_last_two_weeks": 0, "playtime_at_review": 1596, "last_played": 1586757462}, "language": "english", "review": "Enjoyable, fairly unique and interesting. It does some great things with inventory management such as stacking items to nearby chests which makes dumping your goods after grinding realm instances a breeze. Crafting will pull ingredients from chests in the vicinity too, which is really neat.\n\nSpeaking of crafting, this is where Crea diverges from almost every game I've played previously. It is comprised of a step-by-step system in which you battle \"Chaos\" modifiers with crafting abilities in order to achieve the highest quality ranking possible before you run out of turns. It is a fairly daunting, yet novel mini-game that provides quite a bit of depth to a normally pedestrian mechanism. It is also a tedious obstacle course you are required to battle through every time you upgrade a piece of gear. And, given that crafting is also an experienced based talent, you'll find yourself battling the crafting boss plenty unless you play with a friend willing to shoulder that burden.\n\nThe gameplay is adequate, if a little underwhelming. I only played a magic (Style) user so I'll summarize only my experience with that slice of the game. The damage spells are largely disappointing and ineffectual for actual damage. Aside from the ability to spam abilities on cooldown from outside the reach of your targets, the brunt of your damage will be delivered with your wand. Your wand shoots little bubbles with very short range in an escalating combo of three shots. It's not very impressive, but it gets the job done. Until you get the wand from the second boss at which point you become a god and can shoot any monster at any point on your screen regardless of obstructions. The only spells you'll use from that point on are heals and shields while you click clack click pew pew.\n\nIt is worth noting that running the dedicated server on a linux box will likely result in game-breaking issues. Inability to port to (some) bosses, random displaced and inoperable doors, infrequent but annoying crashes-to-desktop.\n\nIf you enjoyed Terraria or Starbound, you might enjoy this - but try to get it on sale.\nIf you haven't played those - do that instead.", "timestamp_created": 1586798383, "timestamp_updated": 1586798383, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.60825800895690918", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "24416615": {"recommendationid": "24416615", "author": {"steamid": "76561198095371981", "num_games_owned": 0, "num_reviews": 23, "playtime_forever": 1764, "playtime_last_two_weeks": 0, "playtime_at_review": 1739, "last_played": 1497737306}, "language": "english", "review": "First off it's not Terraria but that's not a bad thing. This game has it's own style and it's an enjoyable experience like Terraria.  \nAnother thing is that it's constantly being updated and improved which is a good sign for the title. I can see this becoming one of my favorite games as time goes on. So, buy the game or don't buy the game. In the end, it's not Terraria but it is a spectacular game that I would recommend to others.\n\nThis game looks even more amazing now than before.", "timestamp_created": 1468970954, "timestamp_updated": 1494192539, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.60812455415725708", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43212271": {"recommendationid": "43212271", "author": {"steamid": "76561198205173612", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 534, "playtime_last_two_weeks": 0, "playtime_at_review": 505, "last_played": 1601710010}, "language": "english", "review": "I have mixed opinions about this game. On one hand, it's nice visually. The music is super calming, it's pretty (when it doesn't devolve into a glitchy mess). \nUnfortunately the avatar animations are really bad, it's like they were thrown in as an afterthought. They're very stiff, there's not much expression. You feel very disconnected. Combat sucks, too. \n\nAs for the game itself, it's a bit eh. Controls are wonky, you don't get any sort of explanation or guidance at all, which means you have to figure out the annoyingly complicated menu and inventory system yourself. The addition of unlockable skills is neat, when they're not flat-out broken. There's a LOT of glitches in this game. As mentioned earlier, the game (on my laptop at least) tends to just turn into a glitchy mess. Sometimes things won't switch, or I'll die randomly.\n\nNot sure if there's a story or not. Feels like there's an overarching lore, but it's confusing and fragmented and the game would be better without it.\n\nOverall, it's not awful but it's really not great either. Maybe a 3/10? Honestly just listen to the soundtrack online, it's the best feature.", "timestamp_created": 1530440510, "timestamp_updated": 1573281692, "voted_up": false, "votes_up": 10, "votes_funny": 2, "weighted_vote_score": "0.607672452926635742", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "12867104": {"recommendationid": "12867104", "author": {"steamid": "76561198107374235", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 548, "playtime_last_two_weeks": 0, "playtime_at_review": 252, "last_played": 1551631077}, "language": "english", "review": "Crea is an amazing 2D sandbox game much like Terraria, Starbound, and others. But unlike any of these it has its own twist on certain aspects. Like for example it is more on an RPG game because it has a talent point system where you level up in certain areas by doing different things. Another example is that it has magic in the game, like attacks and healing. Also in order to craft things you need to research them before you craft them so you know the recipes. Plus an amazing art style that really ties the game together.\n\nI highly recommend this game to anyone who likes Terraria and the 2D sandbox genre.", "timestamp_created": 1415566299, "timestamp_updated": 1415566299, "voted_up": true, "votes_up": 26, "votes_funny": 1, "weighted_vote_score": "0.605840086936950684", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "117307896": {"recommendationid": "117307896", "author": {"steamid": "76561197968909179", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1452, "playtime_last_two_weeks": 0, "playtime_at_review": 1452, "last_played": 1567806417}, "language": "english", "review": "Not bad if you can get it on sale, I think I paid $10 or $15 for a 4 pack, but totally not worth the full price considering it got abandoned. The website is a pretty bad joke as well, and you'd figure it should be decent considering the game is moddable. Wouldn't pay full price for anything else from this developer, considering it would likely be abandoned unfinished as well. 6/10 for the price I paid for it, 3/10 if I have to review it at full price.", "timestamp_created": 1655754166, "timestamp_updated": 1655754166, "voted_up": false, "votes_up": 17, "votes_funny": 1, "weighted_vote_score": "0.605656445026397705", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "33274596": {"recommendationid": "33274596", "author": {"steamid": "76561198041681580", "num_games_owned": 0, "num_reviews": 61, "playtime_forever": 2522, "playtime_last_two_weeks": 0, "playtime_at_review": 2189, "last_played": 1499960186}, "language": "english", "review": "Crea is a very relaxing game. That doesn't mean it is boring. Quite the contrary. If you have played Terraria or Starbound, you will see the similarities. However, Crea is going it's own way. Your character has a set of skills that level up as you use them, unlocking new things to use to help you. Lots of building and crafting, bound only by your imagination. I have only scatched the surface, and I look forward to how Crea continues to develop.\n\nThe developer is very responsive and helpful, something I can't say for most games. I highly reccomend Crea!", "timestamp_created": 1499260685, "timestamp_updated": 1499260685, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.604631245136260986", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "45224835": {"recommendationid": "45224835", "author": {"steamid": "76561198392632684", "num_games_owned": 365, "num_reviews": 110, "playtime_forever": 3556, "playtime_last_two_weeks": 0, "playtime_at_review": 1841, "last_played": 1686699244}, "language": "english", "review": "Cool game, but it has a lot of bugs with graphics on macOS. The textures of water and lava are superimposed on the foreground, so if you plunge into them completely, then the background and the character will no longer be visible. Have to re-enter the game to remove the hindrance.", "timestamp_created": 1539302598, "timestamp_updated": 1539883794, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.602139592170715332", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "106495655": {"recommendationid": "106495655", "author": {"steamid": "76561198027068989", "num_games_owned": 448, "num_reviews": 16, "playtime_forever": 39, "playtime_last_two_weeks": 0, "playtime_at_review": 39, "last_played": 1466075924}, "language": "english", "review": "Hmm, pretty sure i played a bit more than 0.7hrs. Not sure what happened there.\nWanted to revisit this game over the holidays, saw the dev post, discarded the idea.\n\nWhile i wish him all the best in the future on his new project, i hope he won't think about \nreleasing another unfinished pile junk that never gets done.\n", "timestamp_created": 1640441123, "timestamp_updated": 1640441123, "voted_up": false, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.601852357387542725", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "48157737": {"recommendationid": "48157737", "author": {"steamid": "76561198020897912", "num_games_owned": 1888, "num_reviews": 16, "playtime_forever": 1299, "playtime_last_two_weeks": 0, "playtime_at_review": 1299, "last_played": 1546814892}, "language": "english", "review": "Currently feels like the game is in beta despite it being version 1.6.  The bosses are difficult to figure out how to summon, and boss fights are not very interesting.  Some you can just walk up to the boss and wail on them and beat them without taking any dmg.  You unlock the highest tier weapons and materials by beating the end boss, so you don't have any new enemies to kill or any bosses that pose any challenge once you get the top tier weapons and armor.", "timestamp_created": 1546815127, "timestamp_updated": 1546815127, "voted_up": false, "votes_up": 16, "votes_funny": 1, "weighted_vote_score": "0.601765334606170654", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "17260630": {"recommendationid": "17260630", "author": {"steamid": "76561197971300180", "num_games_owned": 1449, "num_reviews": 21, "playtime_forever": 342, "playtime_last_two_weeks": 0, "playtime_at_review": 102, "last_played": 1461368249}, "language": "english", "review": "I don't generally review games, but the developers seem active (both developmentally and on the forums) and the game is pretty good, so I'll give it a positive review!\n\nI thought I was buying an RPG version of Terraria, and although I don't really feel like the game is anything like that, I will say that I'm enjoying the game that I bought. I'm looking forward to seeing this game progress toward the future and what directions the developers take.\n\n7/10 currently, possibly 11/10 in the future.\n\n", "timestamp_created": 1438059475, "timestamp_updated": 1438059475, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.601612269878387451", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "41324833": {"recommendationid": "41324833", "author": {"steamid": "76561198025760636", "num_games_owned": 0, "num_reviews": 35, "playtime_forever": 3518, "playtime_last_two_weeks": 0, "playtime_at_review": 3518, "last_played": 1514623242}, "language": "english", "review": "Good game, I had fun with it.  Just missing something to make it special like terraria,", "timestamp_created": 1523042349, "timestamp_updated": 1523042349, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.601531445980072021", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23768094": {"recommendationid": "23768094", "author": {"steamid": "76561197968730214", "num_games_owned": 0, "num_reviews": 24, "playtime_forever": 9560, "playtime_last_two_weeks": 0, "playtime_at_review": 8788, "last_played": 1552586604}, "language": "english", "review": "TLDR; I've played a ton of this game, and I remember it. Games like Oblivion, Fallout 4, Skyrim... I play them and forget, they come and go like wind.\nCrea sticks in your mind, the game is diverse, fun and very much a good thing. Play the game!\n\nAs you can probably, see, I've sunk over 100 hours into this game, over a wide variety of patches, changes and ideas. I've talked with the devs, found fun errors, created amazing things, and killed pretty much everything by blade, spear and bow.\ntldr; Crea is Dark Souls lore and exploration in an open world setting. Ambitious, awesome, and has many strands of progress.\n\nCrea is a good, different take on the Terraria style game the genre descends from. Instead of handholding, guides and mysterious landmarks, Crea has tasked you with exploring, investigating and noticing things. I stumbled into the first boss by crafting a Chaos Bed, and then using it. Maybe I should've expected a magical, cloning, nightmare boss, but holy hell was that a pulse pounding victory.\n\nLater, I check the other teleporter tabs and found a new boss I had not seen before, and proceeded to get my stuff kicked in until I found a strategy that worked and actually pulled it off. Was it easy? No. Was it fun? Mostly. Was it exciting? Yes. Like many things, the boss fights are taking a known value [Enemies, lava, water, fallling] and adapting a strategy. Instead of the Terraria style \"Build your own\" arena, Crea bosses come with an arena, or spawn in a fixed area where you determined they should be.\n\nThe crafting game is both light and heavy, and is constantly getting refined. You can make a weapon out of the barest, meagerest supplies possible, or you can forge it from start to finish to be a high quality, polished work, and the quality of the item will reflect this. This is done through a satisfying mini-game, where you race the chaos level you're injecting your works with, it starts out hilariously easy, 25 quality to 100 chaos, but will happily jump up to 200 quality to 100 chaos, and ramp up the challenge to perfect as well.\n\nThe game mechanics are crisp, polished and are really based on comitting to an action [without the imput delay of the PC Dark Sous games], and through planning, posititioning, properly levelled skills and the use of the dodge roll, I found myself going from a struggling meatbag to an acrobatic jerk who would dance through the enemies and loot their remains.\n\nAbove all, Crea rewards determination. As you do a thing, you get skill points for it, which can make you better at that. Crafting begets cooler crafting techniques, weapon combat helps you combat harder, etc. Not innovate, but well paced and most skills either bring a brand of utility [healing spells, ranged attacks] or help you get better at storming the world [ extra jumps/jump height, grappling ledges, extra inventory slots.] And yes, determination means I wish the game could be faster, but I also feel a sense of attachment for the characters I create.\n\nOverall, Crea is a very good, lightly flawed game. The dev himself is a kind, generous person, who may have dropped the game a bit early, but he had high hopes and a great heart behind it, and I know he's going to keep slamming out updates, content and great gameplay.", "timestamp_created": 1466799486, "timestamp_updated": 1498255276, "voted_up": true, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.601466953754425049", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "55409067": {"recommendationid": "55409067", "author": {"steamid": "76561198068226467", "num_games_owned": 128, "num_reviews": 35, "playtime_forever": 1662, "playtime_last_two_weeks": 0, "playtime_at_review": 1662, "last_played": 1566568227}, "language": "english", "review": "Well, maybe I am getting a little tired of indie games, but this one feels underwhelming and unfinished. I cannot recommend playing in the current state.", "timestamp_created": 1570032110, "timestamp_updated": 1570032110, "voted_up": false, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.60046619176864624", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "10334809": {"recommendationid": "10334809", "author": {"steamid": "76561197970627522", "num_games_owned": 0, "num_reviews": 47, "playtime_forever": 6747, "playtime_last_two_weeks": 0, "playtime_at_review": 51, "last_played": 1495936252}, "language": "english", "review": "I've been playing the Crea beta since the third phase started and Crea was available to all Kickstarter backers. The game has a lot of potential, and in a market that has spawned a lot of Terraria style of games, Crea manages to have its own unique style and feel that helps it stand apart from the crowd. Early game progress is slow, and the learning curve is a little steeper than something like Starbound, but once you've managed to get nice gear and delve deep into the underworld you feel as though you've accomplished something.\n\nOne big selling point of Crea for me, that lead me to back the project on Kickstarter in the first place, was the concept of developing from the ground up for complete mod support. The code is all exposed so the community will be able to help shape the game long after the initial release.While Crea has run into some development issues in the past, Jasson and Kelley have been active in the community and open and forthright during the entire process.\n\nIf you're a fan of Terraria and felt that Starbound didn't quite scratch that itch Crea might have what you're looking for. I've been playing the game on the DRM free version, so my Steam time played is deceptive. I've probably put over a hundred hours into various characters across the different builds of Crea since I started playing several months ago, and imagine I will find myself playing quite a bit more once the multiplayer functionality is a bit more stable. Multiplayer is where games of this nature, in my experience, really shine.", "timestamp_created": 1401808629, "timestamp_updated": 1401808629, "voted_up": true, "votes_up": 27, "votes_funny": 1, "weighted_vote_score": "0.59915459156036377", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "39827504": {"recommendationid": "39827504", "author": {"steamid": "76561198050442377", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 2710, "playtime_last_two_weeks": 0, "playtime_at_review": 2710, "last_played": 1501120092}, "language": "english", "review": "\nThe reasons I like Crea:\n\nIt's trying an RPG based system in a game type that typically doesn't have one.\n\nIt's a nice world to look at.\n\n\n\n\nThe reasons I don't like Crea:\n\nUsing abilities on friends in co-op is completely hit or miss. You need precise click aim to hit them, otherwise you just cast on yourself. So those times where your partner needs a clutch heal or stoneskin.... Yep... You just miss clicked them. Bad news.\n\nThe lack of quarky items in the game makes it super repetitive. The game mostly centers around crafting your items once you have enough materials. The problem is, the items are all the same with just basic stat increases. They all pretty much interact with the world the completely same way. You want to use spears? Congratulations! You now get use to see the same attack animation for the rest of the game.\n\nThere have been 2 instances where I have seen an item do something different. I once got a wand that would attack in a different direction if I clicked the attack again... And I saw a block of infinity. Basicly it was a block you could build with that would never run out. The game needs more of these please! More rewards than just materials. If you kill a boss the game rewards you with materials to build more repetitive stat items. Nothing clever.\n\nOh and the bosses? Yeah, there aren't many, and once you understand their mechanic, they go on farm mode. You can keep doing them over and over instantly to farm their material drop. It's not a rare occurance.\n\n6/10 game\n\n\n\n", "timestamp_created": 1517695641, "timestamp_updated": 1517695641, "voted_up": false, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.597632169723510742", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "16034069": {"recommendationid": "16034069", "author": {"steamid": "76561198045341687", "num_games_owned": 0, "num_reviews": 27, "playtime_forever": 6518, "playtime_last_two_weeks": 0, "playtime_at_review": 5206, "last_played": 1603254665}, "language": "english", "review": "I am someone who liked Terraria. I liked Minecraft a lot, too. I love open world games that are full of exploration, lots of things to do, and lots of loot to drown yourself in. 2d side scrolling games like this tend to be called Metroidvania games. \n\nI first got Crea many months ago and it was rough, unpolished and hard to play. I waited. MANY updates have come out since then so I decided to give it another try a few weeks ago. I am glad I did.\n\nCrea has an in-depth crafting system that actually takes a bit of thought to figure out. You don't just have materials, you have crafting methods. They call it Chaos Crafting. There's a variety of crafting techniques to apply while you are crafting something. It's up to you to find a combination that works well. If you do, you can get some amazing results. \n\nThe enemies in Crea are likewise as well thought out. You can't just run up and whack and enemies like you do to Terraria's slimes. Enemies in this game have different attacks, but they all have certain patterns that you can figure out. \n\nWhat the game needs most is variety in what the player experiences. Once you craft that next tier of armor and weapons you're off to do more of the same, just in a higher level area, battling the same monsters who are simply higher level. The game does have biomes, but as of this review, they're only surface biomes that don't mean a whole lot at the moment. \n\nHowever, the game is solid enough and enjoyable enough that the $15 price tag is well worth it at this point. Combat is a blast in this game. Since development is still very much underway who knows what we might see for the biomes or maybe even new, different underground zones. \n\nCrea has a ways to go before it could be a contender for king of Metroidvania Mountain. It's not there yet. It's got a ways to go. But it's certainly headed in the right direction.", "timestamp_created": 1432784708, "timestamp_updated": 1436940433, "voted_up": true, "votes_up": 54, "votes_funny": 2, "weighted_vote_score": "0.597608566284179688", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}}, "query_summary": {"num_reviews": 1, "review_score": 6, "review_score_desc": "Mostly Positive", "total_positive": 768, "total_negative": 219, "total_reviews": 987}, "cursors": {"AoIIPwowI3yuv+EE": "Mon Apr 22 23:49:32 2024"}}
