{"reviews": {"25222915": {"recommendationid": "25222915", "author": {"steamid": "76561197970652634", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 75219, "playtime_last_two_weeks": 0, "playtime_at_review": 68226, "last_played": 1473478023}, "language": "english", "review": "WARNING...\n\nTo all people planning to purchase this game on or after the 1 September 2016, The videos and pictures selling the game no longer accurately reflect actual game play nor do they show you the current building system.\n\nThe new patch limits you to a specifically small circle in which you can build your base. \nHave 20 people in your guild? You can only build a base the same size as every other guild including the guilds with one person in them.\n\nThe game used to be more like Mine craft where the more you farm the bigger you made your base, the better protected you were. Now building is relegated to a short distance from a tree that grows by feeding it money?!?!?!?! and as such you no longer have any freedom to build.\n\nThe new patch is terrible and the video \"Fight for the relics\" is also not a true example of the incoming patch.\n\nThe new patch has a faction system that is bugged and all PVP players just join the faction which controlls the relics therefore there is no one to fight as everyone is on your alliance or non PVP.\nThey took away the freedom of building to make the game more PVP orientated however there is no one to fight.\n\nBasically the game boils down to this.....farm to build a tiny base and then join the faction which controls the relics so you can get the buffs and make awesome high quality weapons so you can go out and NOT PVP as there is no one to kill.\n\nThe Steam Store videos and pictures need to be removed post patch or Oddone will be blatantly false advertising this game to an extent equal to Sean Murray.\n\nPlease upvote this if it helped or you agree.\n\nED", "timestamp_created": 1472453709, "timestamp_updated": 1475246252, "voted_up": false, "votes_up": 325, "votes_funny": 8, "weighted_vote_score": "0.940193474292755127", "comment_count": 11, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "38219967": {"recommendationid": "38219967", "author": {"steamid": "76561198036040256", "num_games_owned": 1466, "num_reviews": 43, "playtime_forever": 1253, "playtime_last_two_weeks": 0, "playtime_at_review": 1154, "last_played": 1538352783}, "language": "english", "review": "Potential that never took off.\n\nThe game had potential to be something interesting and fun and yet it was wasted due to both poor decision making and an inability to fix bugs.\n\nI don't get the Devs reasoning or thought processes.  They opened up a PvE faction during testing, decided that way too many people wanted to join it and it wasn't leaving enough people for the PvP people to attack, steal from and destroy their stuff, so came up with some half baked horrible system we have now.  Why they want to cater the game to the griefing minority rather than what the vast majority of the game showed them they wanted, I just don't know.\n\nSo many people have left already, I don't know that it really matters anymore.  I don't think this game will ever recover enough to get the players back who were all here before wide eyed with hope.  The hopes were dashed, the wide eyes were spit in, and I'm going to leave with those who packed it up as well.\n\nI'm too frustrated and disappointed in the decisions that the Developers make here to really go into more details about the game and the systems here.  I feel I've wasted more than enough time and money on this game already and just want to put it behind me.", "timestamp_created": 1512936836, "timestamp_updated": 1512936836, "voted_up": false, "votes_up": 258, "votes_funny": 8, "weighted_vote_score": "0.910085618495941162", "comment_count": 22, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "34405732": {"recommendationid": "34405732", "author": {"steamid": "76561198044433450", "num_games_owned": 394, "num_reviews": 9, "playtime_forever": 7303, "playtime_last_two_weeks": 0, "playtime_at_review": 3991, "last_played": 1620887625}, "language": "english", "review": "tree of life has a lot of cool mechanics and ideas going into it. it's a runescapey/sandbox game where you just grind and progress for the sake of it. the combat's simple, the crafting's simple, and the game doesn't hold your hand much, and that feels great. \nhowever, the game has completely lost direction and the developers *regularly* ignore their playerbase. they basically do whatever they want and don't bother to fix bugs or prevent hacking. as of the official release, the game absolutely favors griefing and picking on new players. there is NO penalty for robbing and killing people. if you decide you want to go kill new players and steal all their stuff, you can and they can't do anything about it. unless you have a very active, very large group of people, your guild will get destroyed very quickly as soon as you leave the starting area. after spending about 5 hours in the starting area, i decided to move my guild of two people to an area adjacent to the starting area, and within 5 hours it got robbed 12 times and then completely destroyed twice. it's very easy to avoid the defenses that someone can build in their guild, and very easy to destroy the whole guild. \ni loved this game in early access. people didn't fuck with you and there was even a neutral faction where you and your guild could be pvp protected so you could just enjoy your grinding. the pvp factions just happily fought amongst themselves and everyone else relaxed. long ago the game was very pve focused, but now the pve content is just for building up your guild defenses to protect yourself from griefers. now there's absolutely no way to be neutral, and these features were removed for absolutely no reason. it's what i mean by \"the developers basically do whatever they want\". \nsome people will probably enjoy the game as is, but everything that made me interested in this game is gone. i guess that's what you get with early access. i won't be playing the game again until these features get restored, or i can at least spend an hour offline without my guild and all the defenses i can possibly build getting destroyed.", "timestamp_created": 1503362930, "timestamp_updated": 1503557257, "voted_up": false, "votes_up": 302, "votes_funny": 11, "weighted_vote_score": "0.901863932609558105", "comment_count": 17, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "16388518": {"recommendationid": "16388518", "author": {"steamid": "76561198005952992", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 4707, "playtime_last_two_weeks": 0, "playtime_at_review": 4604, "last_played": 1435932799}, "language": "english", "review": "I do like this game. I really do, but please read on for my honest review.\n\nWhen I first played I accidently killed my friend trying to defend him from a bear and got flagged as a murderer. Then some random yellow name came up and murdered me in return. He doesn't get flagged. He took all the apples I got from punching trees too. I was left with a fear of other players, a few twigs and an empty stomach.\n\nThere were buildings everywhere. Buildings with stone walls, buildings with wood walls and some with no walls. Then I saw these little smoking squares on the ground and tried to pick one up. 'Trace of Evil' it said. I didn't really know what it was, but I moved on and found a little flat piece of land to call my own. Starting to build was fun. I found it really exciting. The ideas were all worked out and despite the poor translation of many item names, I managed to figure things out really easily. The controls were pretty intuitive and I liked the idea of not tab targeting enemies. \n\nThose kobolds really hurt when you're punching at them nude.\n\nAfter I got a nice little tent set up, a campfire and a couple fences my red name turned back to yellow. Feeling a bit more comfortable, I ran off and started to explore, picking up all sorts of resources and coin to help me along the way. The night time was really rough, I didn't realize there would be so many zombies and skeletons attacking my tent. When morning came around I had managed to die a couple of times and could not figure out how to repair my tent.\n\nAnother yellow name came along, he had a full set of armor and backpack and adorable cat ears. I asked him how to repair my tent and he explained to me. Of course, you hold your money in your hand to repair a broken tent. Why didn't I think of that?\n\nI thanked the kindness of this stranger, right up until he opened my tent and proceeded to take everything I had gathered, leaving me with two stacks of twigs and the firewood in my campfire. My stomach growled.\n\nAfter I realized you could make locks, I never stopped. Tinkering became my hobby and I was really enjoying the torches and lanterns it provided. I moved to a new location that had more resources, because the runs to gather copper was draining. \n\nMy new place started to get some walls up and I had cabins, it was looking pretty good. A tiny farm, a few chickens, it was great until some neighbor moved in right next door. I had asked her why she kept trying to look at my locked tents and why she kept taking my chickens. She didn't speak any english but it looked like Portuguese when she responded, I'm not sure what she said. However, her town built up faster than mine and even though I invited some friends, I never really managed to get my walls closed before the real raids started.\n\nIt only took two of them, but without armor and strong weapons we were defenseless. They moved in, destroyed our walls, our cabins our gates. Flattened our fences and worktables. Stole water from our wells (I know now you -can- lock a well) and used it to run around and murder us repeatedly. After about an hour of this, they left us alone. I repaired, managed to get another crude knife, continued to go about my daily routine, though a little shaken up. \n\nThen they did it again, this time with  more people. We were flattened in thirty seconds, murdered in less that and they proceeded to stick around and wait for us to respawn over and over again, scouring the woods and seeking us out to murder us some more for hours longer. I finally just logged out.\n\nThe next day, I went in to realize that there were traces of evil everywhere. The portuguese speaking woman had her base leveled and so did everyone else we could see. \n\nDecided to move again.\n\nAfter we moved, we had a great time. Skills were going up, we were trading, selling, making new friends. I had no problems with anyone but a few random rednames who tried to steal. Copper was harder to come by, but it was okay, I didn't mind spending over an hour to get an inventory full. I gave to the new players, helped my neighbors by repairing their walls, defending friends against an onslaught of raiders. \n\nThen the griefers came again. A new town, a new place and new walls with a guild hall. At first I didn't believe it. Everything was stolen from once again. My towers had no arrows, my cabins were empty and even the tree I planted to look pretty, was chopped down. What was so shocking though was, all my walls were still intact. \n\nDid they break in and take everything but was kind enough to repair the wall after they left? The gates were all locked as well, I was at a loss.\n\nHowever, each night, the same happened again. This repeated for three days. (My livestock was stolen by my \"friendly\" neighbors). On the fourth night I logged in about the time that the trace of evil had said and watched it. They weren't breaking down my walls, they were ghosting through them! I had never seen that before. He just walked straight through and stayed yellow named as he proceeded to take everything again with a constant onlsaught of 'u mad bro?' and 'lol' as I watched.\n\nI logged out and haven't been back online since.\n\nThe PvP of the game, doesn't bother me. I had no real qualms with the occasional raid, the occasional thief and even the yellow-name brazilians. What finally got on my nerves was the amount of consistant and repeated griefing that makes the game near unplayable. The straw that broke the camels back? The hacking. I have no idea how he did it or what exploit he was using, but there was no consequences for that person repeatedly taking from me and going around the system to do so.\n\nThe game is great, it's fun and if you want to risk it, I would highly reccomend you do so. For the price? Not so much. The upgrade gets you a tiny little backpack and a hairstyle, it's not worth it. It is not worth its current list price, even at early access.\n\nI know the developers are working on it. They are a team of three with only one community advisor to translate for them. They threw their game to the sharks and the players are feeding. I'm sure they did not realize what horrors would transpire as they put their game on Steam.\n\nIt is too early though.", "timestamp_created": 1434290316, "timestamp_updated": 1434290316, "voted_up": false, "votes_up": 527, "votes_funny": 68, "weighted_vote_score": "0.896883130073547363", "comment_count": 31, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "34428676": {"recommendationid": "34428676", "author": {"steamid": "76561198056102078", "num_games_owned": 0, "num_reviews": 33, "playtime_forever": 714, "playtime_last_two_weeks": 0, "playtime_at_review": 714, "last_played": 1503456739}, "language": "english", "review": "I'm a fan of making my own fun in games. Pursuant to that end, when I realized that every bit of grinding and progress I'd managed in my first ten hours was basically for nothing, my homestead had been looted and fallen apart in the twelve hours I was away from the game, and (despite the fact that I had progressed as far in several professions as the materials of Newbie Island allowed) my top-tier newbie weapons couldn't scratch the \"Outlaw Zone\" enemies, I resolved to cross the world to drown myself in the ocean on the other end of the expansive, if utterly bland, game-world. There's no way to drown yourself in Tree of Life. I didn't care. \n\nI collected a Green Poison Frog in a putrescent green swamp. I hauled that frog from that swamp, deciding to bring him in on my suicide pact. I had to put him down at one point to get a running leap up one of the sheer, vertical cliffs that dot the impassable landscape; terrain-humping in a manner that I'd perfected in Skyrim, I managed to scale the cliff, but had to leave my companion of nearly two in-game days behind. I collected a bull to replace him. I called him Bangs McCoy. Bangs and I made the trek across the Desert which for...reasons...abuts a dark and misty forest. We crossed the game's equivalent of the Alps... and finally made it to the sea. Bangs and I waded out into the ocean and hopped our way to the edge of the world.\n\nThis was far more satisfying than the mind-numbing grind. In every conceivable way.\n\nI crossed the continent acquiring woodland critters, in a futile attempt to drown myself in a virtual ocean. And I went one further...I bunny-hopped across the water to the very edge of that ocean, hoping to simply fall through a hole in this cel-shaded hell. I couldn't do it. I hung there on the edge of oblivion with Bangs, treading water. \n\nAnd that's kind of an apt metaphor for this game: \"Treading water on the edge of oblivion.\" \n\nDo not play Tree of Life. It is folly. They have my money. They don't deserve yours.", "timestamp_created": 1503457441, "timestamp_updated": 1503457441, "voted_up": false, "votes_up": 158, "votes_funny": 55, "weighted_vote_score": "0.883756816387176514", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23705657": {"recommendationid": "23705657", "author": {"steamid": "76561198028202604", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 102472, "playtime_last_two_weeks": 0, "playtime_at_review": 71075, "last_played": 1522384909}, "language": "english", "review": "I've put off writing this review for a long, long time because I've very mixed feelings about it.  \n\nI've played this game since early Alpha release (around July 2015) and have around 1500 hrs in game over two accounts (this takes me up to about 6 weeks after the Beta release).\n\nFirstly I'll start with the good / what I like about the game:\n\nGOOD\n1. The game has awesome scope to build a base / castle / home.  You have pretty much got total freedom to make any layout of your choosing and you can design the base for looks or to be safe from raiders / thieves from a strategical standpoint.\n\n2. There are a variety of skills / professions to chose from... around 20 (some not fully completed though at the time of writing this). So for a guild of about 8-10 people, everyone is valued and becomes a valued member of the team, which is important for the social aspect of this game.\n\n3. The environment / different biomes looks great.\n\n4. The crafting variety is very good.\n\n5. The variety of weapons and corresponding weapon skills is quite diverse.\n\n6. The map is relatively large.\n\n7. The community liaison person (OddAlice) is very nice and works very hard.  \n\nHere's the bad / what I dislike about the game:\n\nBAD.\ni. The lag.  There servers are often laggy when a moderate number of players are online (say 400-500).  There are also random lag spikes and FPS drops for no apparent reason.  Note: I am aware the game is not optimized yet (I'm running a top of the line Alienware rig, so it shouldn't be an issue for this game).\n\nii. The crafting system is currently a little buggy and its almost impossible to craft higher quality items.\n\niii. There is a desync when fighting (both PvP and when fighting PvE monsters).  It is almost impossible to hit someone who is moving, so unless you both stand still and take it in turns trading hits, battles are pure frustration and become boring fast.\n\niv. There are many small bugs that are not very significant but very irritating that have been around since Day 1 and have not been fixed (despite people calling out for them to be fixed on the forums).\n\nv. The developers do not communicate with the player base.  They are silent for long periods and tend to only reply when there is a massive uproar with the players.  Then the response is often vague or scant on content.\n\nvi. The developers appear to be more focused on tweaking existing features / graphics, rather than fixing the small bugs mentioned before or adding new content.\n\nvii. There is practically NO END GAME CONTENT.\n\nviii. The profanity filter on the game chat is overly sensitive, so censors non-offensive words.\n\niX. At Beta release the developers covered 75% of the map in mist.  You cant view these areas properly and you cant build on these areas.  It's a huge annoyance to everyone who plays.\n\nX. The game is a little too grindy.  I dont mind grinding in a game and this is Korean so I understand and expect it to be a little grindy.  The grind in Alpha was just about right, but in Beta they made it way more grindy.  \n\nXi.  Forever chopping trees... many joke this game is actually a lumberjack simulator.  This is ok when you are in a large guild, but because a serious pain in the a$$ if you dont have 5+ players.\n\nXii.  The recent milestones released by the developers appear to take the game in a very different direction to how it is currently or how it is referred to in their reviews and promotional videos.  I know this is early access and things change, but this could take the game in a totally new direction.\n\nXiii.  Mice infect your base if you are offline for about 12 hrs.  After 24 hrs your base starts losing HP.  This is VERY irritating.\n\nXiv. The devopment team are very small so new content is VERY slow and recent comunication suggests patches for new content will be every 2-3 months.\n\nXv. Patches / hotfixes to date appear rushed out and untested.  This results in very buggy content and usually every patch is followed up by a hotfix.  \n\nTL:DR: \n\nPvP is broken due to the desync.  Its been like this since Day 1 and little has changed in over a year to fix this.  There is no end game content (guild wars etc.)\n\nPvE is currently broken as the crafting is buggy, you cant build on 75% of the map and there is no end game content (like quests / dungeons / bosses etc.)\n\nSo all in all I give this one a thumbs down. This is on the basis that over the past year, not a lot of core features / funamentals have been added and major bug fixes are still not dealt with (desync).  Also, the last 2 months of Beta suggest a similar approach will be taken this year. \n\nI suspect the developers dont have the resources to deliver on their promises so I am doubtful this game will make it over the line or it will be realease in much the same state it is in now.\n\nI would LOVE to be proven wrong though...", "timestamp_created": 1466601866, "timestamp_updated": 1467109858, "voted_up": false, "votes_up": 151, "votes_funny": 4, "weighted_vote_score": "0.871795296669006348", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "28504855": {"recommendationid": "28504855", "author": {"steamid": "76561198028255555", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 2303, "playtime_last_two_weeks": 0, "playtime_at_review": 1894, "last_played": 1518913064}, "language": "english", "review": "I bought Tree of Life back when it first came out and played it for a bit on and off for months. Recently though I had to stop playing due to changes made to the game by the Devs. When originally offered the game was billed as an open world pvp game with systems in place to prevent griefing and to penalize those who killed or robbed too often. This system worked, the game was alive, people fought, betrayed, worked together and the server had a healty population. Of late however they have switched to a four faction system, with the faction you start in being invulnerable to any type of pvp and the other 3 being dedicated war factions. Thius has caused quite a change in the health of the game, with a large part of it being a much more inactive player base.\n\n  In a large part this can be attributed to what they created in exchange for open world pvp, a faction pvp game with 4 factions, one pve only and invulnerable which was in a way needed since the game was rife with glitching griefers and being offline was a death setence to any camp, the other 3 being war factions which are the only guilds allowed to pvp. This has led to a system by where one faction has 11 guilds in it (The max number of guilds a war faction can have out of a total of nearly 2000 guilds on the US server currently) and the other two are empty as trying to join the other factions is a death sentence as the map shows the locations of every guild, allowing the 11 guild faction to rush you and destroy you. This has imbalanced the pvp of the game so badly its become unplayable. On the EU and Asia server 2 of the war factions have 0 guilds, and on the US server one has 0, one has 3, and one has 11. Along with this the introduction of a invulnerable faction with nearly 2000 guilds has resulted in the player trade market becoming nearly obsolete. Back when I first started playing there were shops everywhere selling all sorts of items, now your lucky if one out of 10 guilds has a shop. I myself am not a huge pvp player but even I can tell the faction change was made with poor research and understanding of what goes into a faction game. \n\nOn top of that, they added relics that buff the faction that has them. This means the 11 guild faction always owns all of the relics, granting a large boost to their players in pvp on top of the massive number difference. Again, poor research and understanding on the part of the Devs.\n\n  Along with this change, the game itself has stagnated, with little movement made in the way of adding new content. Currently most mobs in the game are simply renamed/re skinned versions of their lower level form, resulting in a constant flow of goblins, kobolds, and mermen when exploring. These two things combine to make the pve aspects increasingly tedious.\n\nOh and did I mention cash shop items have been added instead of content? 25$ mount anyone?\n\nOver all if you have any interest in this game, I would warn you away from purchasing it and suggest you try a different game. Perhaps in another year or two they may have fixed some of these issues, but if their history is anything to go by, that is unlikely.", "timestamp_created": 1482317171, "timestamp_updated": 1482317943, "voted_up": false, "votes_up": 96, "votes_funny": 0, "weighted_vote_score": "0.865358412265777588", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "21381074": {"recommendationid": "21381074", "author": {"steamid": "76561198030800360", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 36695, "playtime_last_two_weeks": 0, "playtime_at_review": 14136, "last_played": 1472871326}, "language": "english", "review": "I have ben playing this game for a month. All along I have been wondering to myself - \"Why isn't anyone playing this game, its awesome.\"\n\nNow, this game is hardcore. After a month of hard work, my stats were halfway to max. You spend hours gathering, hours crafting. The progression is SUPER slow. I'm ok with all of that. But the game is very well made and thought out and I kept wondering why doesn't anyone play this game.\n\nThe servers never get wiped - so there is a camp every 50 feet in the game. There is no global chat - which really sucks. But it is still a super fun hardcore survival game. \n\nSo, last week, I got jumped by a clan. I fought them for hours - it was a blast. Even though I eventually lost, I had a great time and I knew I could start over. The killed me, trashed my base and took everything I had built up. One complaint - when you build towers in this game, you can stand under them while you are being slaughtered and they will do NOTHING for you. They will only attack if the enemy does damage to your base. \n\nStill, it was fun, really fun. I started over, built my base back up, resupplied myself. Then I got my revenge. The clan that attacked me wasn't around - so I completely trashed their base. Sweet revenge! \n\nSo, the \"criminal\" system in this games doesn't care if you are defending yourself or getting revenge. I became marked as a criminal. Didn't really affect me. \n\nI went back to work, gathering, leveling skills, gathering, leveling skills, endlessly. No matter, my base was expanding, my supplies were growing, I was starting to be able to make good armor and weapons. \n\nA week later, some guy comes durping along and kills me. No big deal. I respawn and fight him again, and again. he kills me a half dozen times, steals my stuff and eventually leaves me alone. I am fine with all of this. Greifing is part of a hard core game. \n\nWell, I reset up my base and I am determined to go look for this guy. I go to remake my armor and weapons and I find that HALF my skillpoints are gone. It is a game penelty for \"being a criminal.\" So, this game punishes you HARSHLY for defending yourself against overwhelming odds (the clan) and being griefed???? I asked the community about this and basically got \"thats the rules , cry moar, hardcore, don't be a criminal.\"\n\nOnce again, you will become a criminal for DEFENDING yourself. The you will LOSE a months works because someone decides to greif you.\n\nThis game isn't \"hardcore\" its f-ing retarded. \n\nAfter all this time of wondering why nobody plays this game.......NOW I KNOW!!!!!\n\nI cannot believe how much time I spent trying to play, telling all my friends how great it was all to come to this.\n\nNo wonder the servers are empty!!\n\nNo wonder nobody plays.\n\nThe devs have spent a lot of hours making this game 99% awesome. Too bad they made a game that has no players and probably never will onc ethey realize what a waste of time they are in for.", "timestamp_created": 1456124527, "timestamp_updated": 1456124527, "voted_up": false, "votes_up": 240, "votes_funny": 28, "weighted_vote_score": "0.861740291118621826", "comment_count": 10, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "34388781": {"recommendationid": "34388781", "author": {"steamid": "76561198058991100", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 15135, "playtime_last_two_weeks": 0, "playtime_at_review": 9469, "last_played": 1620893125}, "language": "english", "review": "I have NEVER written a review before, I normally don't think  it's necessary even if I like a game or not, but Tree Of Life [ToL for short] is a game that I have sunken a lot of time into and stuck around for many different versions of the game. None of them are as bad as the newly released-not-in-bata version or whatever you want to call it.\n\nBefore I start really complaining about how quickly this game went down the drain for me, i'd like to explain the game as whole. If you enjoy logging into a game and knowing that most of your time will be filled with chopping trees or wondering around looking for a resource until your inventory is full with said resource so you can craft 100 of an item you may or may not need in order to level up a certain skill, then you wouldn't mind the grind of ToL. The first time I ever played this game I was dumped off at a beach by myself 0 information and they weren't many people around to help. I was truly alone to explore and venture freely and I loved it. I wouldn't say that this game is something you should play solo, I 100% suggest finding at least one other person to play with because you only have so many skill points to invest into your tree and although certain skills aren't nearly as important as others, it's nice to be able to dabble into different things.\n\nWhen I first joined, everything was open PvP and that didn't bother me all too much, I got killed a few different time, stolen from on occasion and lost a few buildings from time to time, which I would easily deal with. Once I was more settled, I rarely had anyone mess with me. Eventually the factions came out. Three PvP centered ones and then one neutral faction that couldn't be affected by the other three. I personally am not one for PvP, but it was also good for new players to get on their feet before choosing to cross over to anther faction. It was super reassuring to me that I could play this game in much more laxing way. In all honesty, ToL is a very relaxing game without having to worry about the PvP. Most people did not enjoy the PVP system at the time because it was centered around fighting over relics, which gave out buffs to whichever faction owned them. So, people would just swap factions for the buffs and no one would actually fight. \n\nWhich is why I think the devs didn't really think about the new PvP system enough. People complained that no one was fighting because there nothing to really fight for when you can just join the faction with the most power and didn't need to fight. So now, your dumped off on a shore, but unlike before you can't really just go anywhere because they made certain things level capped.. I mean you can leave your faction's newbie area but the mobs are super strong and hardly worth killing in the higher leveled areas.So it's really not worth leaving, even more so because they took away the neutral faction so not only do you have to worry about giant spiders shitting on your chest, but some random enemy faction, at any level even the starting area can come on over, kick your ass, steal your stuff, break your buildings and kill your live stock. You can't log out for more than hour with out anything I just mentioned in the last sentence happening to your stuff. If you don't have the time to stay logged in to protect your stuff then there really is no point in playing. Plus everything is so packed tight with people right now, that resources are scarce so being stolen from so early on is honestly tough. Even with what's considered your guild's protection; an arrow tower. It shoots arrows out at red named people [enemy factions], but all they have to do it step out of your guild's bounds and heal up before going back to kill your tower and they rinse and repeat this process until the towers dead and you have nothing left when you log back on.\n\nI can't keep up with the theft game this MMO has become. It's sad really, I wanted more out of this game. I really wanted to enjoy it. Everyone is just out to beat up on the newer little guys and it's a shit show since there really isn't anything else to fight over. Just everyone scewing each other for no REAL purpose other than asshole-ier.", "timestamp_created": 1503294958, "timestamp_updated": 1503336953, "voted_up": false, "votes_up": 147, "votes_funny": 7, "weighted_vote_score": "0.859288871288299561", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "18440106": {"recommendationid": "18440106", "author": {"steamid": "76561198119080316", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 8445, "playtime_last_two_weeks": 0, "playtime_at_review": 5644, "last_played": 1456151881}, "language": "english", "review": "IMPORTANT NOTICE: You can't have a neutral review, so I've chosen negative. I'm not telling you to not play Tree of Life, just informing you of what you'll face if you decide to play it. Thanks.\n\nI used to have a great property in the desert, surrounded by wooden walls, it was pretty... And it felt secured. I had all my crafting skills maxed out, good neighbours, I've even had a bull for 2 hours before someone stole it while I was mining, but I didn't really mind, I was not a traveller. I had seeds for every plants, every crafting stations, a huge stockpile of rocks and logs for those in need. I had towers filled with arrows to protect my camp from monsters. I had two animals of each kind in my small farm so I could get eggs, milk, etc without searching for hours outside. Sweet memories.\n\nAnd then, two things happened.\n\nOne day, a guild arrived in the desert and began to plant swamp trees. After less than a week, the whole desert had been polluted by those trees, it didn't look like a desert anymore. You can always cut trees, I said to myself, so I didn't care that much. But my friendly neighbours simply left the game for that. Oh well, I said to myself, someone else will eventually settle there.\n\nLater, one member of this guild came to my camp and asked for some help. I gladly accepted to help them build walls, I had a lot of rocks and limestones anyway. So I took all my limestones, closed the door behind me, went to their camp and worked there for an hour or so. This guy thanked me and I went back to my place. The thing is, my place wasn't here anymore. While I was helping him, other members of the said guild raided my cute little camp. They had destroyed my walls, towers, lockpicked all my storages. They had killed all of my animals, destroyed my fields, and they had thrown everything on the ground to make it despawn. I've helped them during one hour, and they have returned me the favor by ruining a mounth of hard work.\n\nOf course at first I was very angry, so I took out my sword and killed them all, green and red players alike. They didn't expect this at all, so they didn't fight back. After my rampage, I simply gave up on playing. I didn't want to spend a whole week building a new camp with those guys around. Also, I had turned red for the first time of my short life, so they would have just killed me over and over again, my armor and sword weren't infinite... So I have just stoped playing. Thanks to them, I have a social life now.", "timestamp_created": 1444642525, "timestamp_updated": 1446401347, "voted_up": false, "votes_up": 575, "votes_funny": 215, "weighted_vote_score": "0.85739743709564209", "comment_count": 74, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "17352956": {"recommendationid": "17352956", "author": {"steamid": "76561198047404327", "num_games_owned": 319, "num_reviews": 21, "playtime_forever": 1154, "playtime_last_two_weeks": 0, "playtime_at_review": 1138, "last_played": 1439140069}, "language": "english", "review": "I bought this game to play along side the Mrs, last night we logged off, she has played 46hours I have played 17,  I have basically been farming for her to build towers and walls so we can have out own area, last night 1 player, just 1 destroyed a wall while being shot by a tower, then went to all 15 howers in our small area and took out the arrows (guessing since all were empty) he then proceeded to destroy all of the animals and all of the cabins (storage houses) we had.  This was (based on the purple smoke that appears when people do bad things so you know who has done it) in responce to yesterday when his friend walked into out camp and died due to towers because he was trying to kill the animals (we did not do anything).  The fact that 1 Lone person can undo 63 hours of game time and cause you to have to farm for at least 15 hours just to get back to where you were is imo rediculous.  I will never recomend this game to anyone", "timestamp_created": 1438534499, "timestamp_updated": 1438534499, "voted_up": false, "votes_up": 244, "votes_funny": 10, "weighted_vote_score": "0.846071898937225342", "comment_count": 10, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "34475432": {"recommendationid": "34475432", "author": {"steamid": "76561198027285638", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 356, "playtime_last_two_weeks": 0, "playtime_at_review": 356, "last_played": 1503641095}, "language": "english", "review": "I should have read more about this game before I paid for it.  Often games have separate areas or servers for PVP.  This one is a free for all, with the predators given full access to noobs.  I know most people love the pvp aspect of games, but I wanted the adventuring, crafting, community building aspects I had read about.  So I innocently set out to learn the ropes.  Before I had even figured out how to do much more than gather and craft the most basic things, I had been robbed and left for dead.  I had so little for anyone to even want.   I don't think it is much fun to be ambushed and bullied.  It happened three times in the last two evenings I played.   There was no sport in this.  Had I investigated this game more carefully, perhaps I would have realized it was not for me.  So I would not recommend this for fun.", "timestamp_created": 1503645214, "timestamp_updated": 1503645214, "voted_up": false, "votes_up": 174, "votes_funny": 10, "weighted_vote_score": "0.843343257904052734", "comment_count": 10, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43762134": {"recommendationid": "43762134", "author": {"steamid": "76561198019048991", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 290483, "playtime_last_two_weeks": 0, "playtime_at_review": 218632, "last_played": 1587368254}, "language": "english", "review": "I DO NOT RECOMMEND THIS GAME.\n\nI have been a daily player in this game for over two years. With seven separate accounts and over 8k hours invested into this game. I am suggesting that you do not purchase this game. \n\nThis game, while cute and very charming, is a money pit of time and effort. It is a full release title that is still being developed and managed like an Alpha game. With consistent, yearly wipes of the map. And complete rewrites of the basic game play. Investing any time in this game is like flushing it down the toilet. A thousand hours spent learning the newest versions with it's re-worked craftingand building....only to have all of it erased by the development team. Even after it has been stated that no wipes would occur. It's painful to see. Development of this game is like watching a toddler try to navigate it's way through a field of broken glass....in the dark.\n\nThe development team for this game is terrible at communication. In fact \"terrible\" might mislead you to believe that there is a standard for \"good\" communication with these developers. This is not the case. The developers do not provide patch notes to explain changes that have taken place. The server will literally go down for 12 hours at a time with no attention to the community or players. And even though there is an outside company used to manage the community....questions and concerns about in game issues are always followed with the same response from the CM's. \"We'll pass it along\" or \"It's been fowarded.\" WIth absolutely NO follow through from the developers.\n\nThis isn't a sour grapes post. It is a review that I waited a long time to write. In hopes that the developers would actually turn things with this game around. They haven't. If things with this game change in the future I will amend this review. Until that time....DO NOT INVEST YOUR TIME IN THIS GAME. \n\n\n\n", "timestamp_created": 1532627527, "timestamp_updated": 1532627527, "voted_up": false, "votes_up": 74, "votes_funny": 4, "weighted_vote_score": "0.83696824312210083", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "40047818": {"recommendationid": "40047818", "author": {"steamid": "76561197970995556", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 52821, "playtime_last_two_weeks": 0, "playtime_at_review": 49375, "last_played": 1533438046}, "language": "english", "review": "OK...first, i am not a veteran of the game but have 840 hrs invested since Steam launch...well Aug. of 2017. I have Chars. on ea server and the playstyle does change.\n\nThe Steam page has not been updated as for what the videos and description shows. about 1/3 of the content from before Steam launch is not available (as of this posting). The description does not let the Buyer know some key points. It is 90% open world pvp with only the new player area safe (from you being killed by an enemy faction) and even there...if you leave the zone you forfiet that also.\n\nSolo play is not Impossible but if you want to expierience the full content of the game you must either create more steam accounts or have a guild of say 5 active players.(there are ways to have the community help you) But in essence you will be dissappointed at some point because you yourself as one player cannot do it all.\n\nOddones is very tight lipped when it comes to communication. They use CM's to act as a middleman which cannot divulge in the actual work being done or why. They have a test server which they have closed off to the general public...Why i have asked (with no reply) dont you want the community to help you make it better so more people will want to purchase it and stay longer? They are adept at giving the community activities to keep your appitite wet though...But at a point you will see this is a moot issue...Ahem, where is the content shown on the Steam page? (again...no reply)\n\nSo... i have supplied a sour review so far but...\n\nThe game is cute with its bug-eyed toons, the grinding is not too bad (if you like chopping trees down). The feeling of acomplishment is there in all skills. They are trying to curb botting/hacking but like any game like this, there are ways around it and some people just like to be Asshats.\n\nEven with lack of content that is implied to be there the game is still fun...well duh...840 hrs ( I know...I'm a sadist). with that i will still give the game a Thumbs up.", "timestamp_created": 1518536320, "timestamp_updated": 1518536495, "voted_up": true, "votes_up": 105, "votes_funny": 10, "weighted_vote_score": "0.831951558589935303", "comment_count": 11, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "17378922": {"recommendationid": "17378922", "author": {"steamid": "76561198026984214", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 6238, "playtime_last_two_weeks": 0, "playtime_at_review": 5971, "last_played": 1463010149}, "language": "english", "review": "I began this game a few days after launch and through it was quite fun.  Lots of things to do, enemies to kill, and levels to be gained.  20 hours went by and I was addicted. Then patch after patch came through. Items got nerfed, pvp became corrupt, evil guilds started wrecking havoc on honest people trying to enjoy the game without penalty.\n\nI still continued to play as i had made friends and wanted to grow.  After about 80 hours, I capped out my levels.  Realized that the world was quite small, the amount of enemies was incredibly smaller, grinding enemies proved to be worthless as enemies dropped only copper/silver/gold, linen, and a rare worthless mask.\n\nMoney is worthless in the game. Everyone tended to craft their own items, or have a guild mate craft them. As soon as you bought an item, a better one would be crafted making yours obsolete, and left to be dropped on the ground.\n\nThe biggest grief of the whole game is the sheer time it takes to build a fortress, wood walls, stone walls, towers galore, only to have a single point in the wall broken and all your loot ravaged. Lock Picking is too easy. The penalty for thieving/murdering/pillaging is non existant due to a broke pvp mechanic.\n\n80 Hours of building can be destroyed in minutes of harrassment.\n\nIn my opinion, the biggest killer of the game was a patch that reduced the durability on end game items so drastically that they were not even worth crafting. In addition, armor had durability which ended adventurers trying to make a living by grinding enemies. Hours and Hours dedicated to crafting end game gear, only for it to be nerfed to something of a joke.\n\nNot to mention, the game lags incredibly bad now.\n\nThats my rant.  I rated the game an A+ near launch, and easily left to a flat F now.  Server populations have to be about 10 people at any one time. A huge drop from launch. You would see hundreds of people. Now you literally have to search far and wide for someone. And when you do, its usually just someone reminiscing of the past when the game was alive, looking at a burning destroyed fort that once thrived.\n\nTake my advice and dont waste your time here.", "timestamp_created": 1438672181, "timestamp_updated": 1438672181, "voted_up": false, "votes_up": 92, "votes_funny": 2, "weighted_vote_score": "0.831676006317138672", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "34320845": {"recommendationid": "34320845", "author": {"steamid": "76561198083118806", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 1154, "playtime_last_two_weeks": 0, "playtime_at_review": 1154, "last_played": 1503030829}, "language": "english", "review": "I really wish this game had single player mode. I love the graphics and style of the game, but i'm not a big fan of jumping into a world thats already polluted with random abandoned structures.", "timestamp_created": 1503030975, "timestamp_updated": 1503030975, "voted_up": true, "votes_up": 177, "votes_funny": 4, "weighted_vote_score": "0.831541001796722412", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "38182845": {"recommendationid": "38182845", "author": {"steamid": "76561197984771826", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 5710, "playtime_last_two_weeks": 0, "playtime_at_review": 5099, "last_played": 1507594430}, "language": "english", "review": "Looks flashy on the outside. Has no depth. PvE is the same from beginning to end, gets stale pretty fast. No endgame PvE. PvP is nothing but running, running, running. Must have at least 5 players to max out all skills, which means if you want good armor, weapons, medicine, food (for buffs), a strong base, you need at least 5 dedicated players. If you don't like playing games with groups of people this game probably isn't for you. Weapons break way too fast. It's a constant grind, craft, break, build, repeat--and I have had my fair share of grinds. From beginning to endgame and forever after that, you better get used to cutting down trees and mining ores every single day. \n\nThere are videos from the devs showing a big chest of gold, this doesn't exist. Their website has a drawing of a rogue-like character dual wielding, this doesn't exist either. 95% of the dev posts from the forum responding to player requests and complaints are one of them saying along the lines of \"We will look into this, I cannot promise anything will be done.\" Devs aren't doing anything worthwhile to the game, instead they make cosmetic items like shark suits and cute bunny ears.\n\nThe game is really fun when you start. You start to level your weapon crafting and armor, and carpentry. You get to see your base come to life--if you have the friends to help you with it. The game is relaxing if you just want to turn your brain off and cut down some trees. Beyond that, after putting about 100 hours into this game I cannot recommend it. The game ultimately feels empty, there are no rewards for killing other players than hoping they drop something nice (which you only drop 1 item out of your inventory when you die). You kill a low-level player, they drop a rock, and then you get a 10 silver bounty on your head and every enemy can now track your movement on the map.\n\nNow the devs are doing some bland diary-search quests for some NPC named Robinson. Diaries are hidden across the map and you find them and they tell you something. Maybe it will lead you to the big chest of treasure in one of their videos from months ago that still isn't in the game? They aren't making improvements, they are just doing what they want to do and not listening to the community.", "timestamp_created": 1512832439, "timestamp_updated": 1512832701, "voted_up": false, "votes_up": 83, "votes_funny": 2, "weighted_vote_score": "0.831066548824310303", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "36613464": {"recommendationid": "36613464", "author": {"steamid": "76561198202207783", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 22747, "playtime_last_two_weeks": 0, "playtime_at_review": 22687, "last_played": 1511063618}, "language": "english", "review": "At this point in time, I would not recommend purchasing this game.\nI have played it for 379 hours, so I can't complain that I did not get my money's worth. However, new players will struggle playing this game because the start-up zones are being constantly attacked and there is no proper defence mechanism to avoid that.\nUnless you know people in the game which are still playing and can help you, you might find it difficult to navigate this game.\n\nThe devs seem not to care about the important feedback they receive from the community and focus their interest on other aspects, I could give examples of this, but there are so many people who have posted valuable information in their reviews and on forums.\n\nI'm quite disappointed, the game reached a point of being unplayable and I suspect the devs wanted to it crash and burn otherwise I see no other reason for not having fixed the issues reported, for a long time, by the community.\nI will no longer invest my time in this game because it is no longer fun to play.", "timestamp_created": 1511064883, "timestamp_updated": 1575208291, "voted_up": false, "votes_up": 64, "votes_funny": 0, "weighted_vote_score": "0.831025540828704834", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "28578163": {"recommendationid": "28578163", "author": {"steamid": "76561198199016513", "num_games_owned": 57, "num_reviews": 1, "playtime_forever": 208559, "playtime_last_two_weeks": 0, "playtime_at_review": 148338, "last_played": 1531018550}, "language": "english", "review": "Lol... Look how many hours I have into this game.....\n\nCongrats on running off your core founders.\n\nOnly good thing I can say is a met a group of people that we now play co-op in other games.\nGot this game like day 2-3.  Been through every major wipe, and reboot.  Gave it a chance to be something.  \n\nDev's IDK.   Things that were not broke, lets break them.  Things that we said no to, they told us too bad.  2500+ hours into a game.  And you will be chopping trees for another 1000+ hours.  No more beautiful strategic base building.  No more Permared.  No more fun.  \n\nYou were something once special and fun.  Now you just another lost child’s toy.  I will not be returning. I suggest that the rest of you don’t drink the kool-aid. Be wary of all these mostly positive reviews.  \n\nThere are many other PVP, PVE sandbox games whose devs maintain weekly updates, listen to their founders, and make things work.  You get more than “So Sorry”, Here’s Double Bouns for failed update after failed update.  \n\n", "timestamp_created": 1482546623, "timestamp_updated": 1482546623, "voted_up": false, "votes_up": 110, "votes_funny": 4, "weighted_vote_score": "0.82842552661895752", "comment_count": 16, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "34415184": {"recommendationid": "34415184", "author": {"steamid": "76561198008476765", "num_games_owned": 217, "num_reviews": 5, "playtime_forever": 40825, "playtime_last_two_weeks": 0, "playtime_at_review": 40098, "last_played": 1461568391}, "language": "english", "review": "I played this game for about 3 months and really loved it, BUT, and this is a very big BUT\nDevs don't care at all about people ABUSING glitches or even HACKING. Another guild made the game unplayable for us (and others), to the point that most of the server (EU) was almost completly empty. I know of at least 2 other guilds of 20 people each that all quit because of this. All a guild had to do was to abuse a very certain glitch and the game was completly unplayable. As far as I know that glitch was fixed, but the devs took about a year (I think) to fix it, and they did nothing to prevent people from using it during that whole time. Just imagine if there is a new glitch those people or others find...\n\nHACKING - My guild got hacked, I recorded it and sent it to the devs, they didn't care at all, didn't do anything about it and we all were forced to quit. They answered at first, and then they just stopped and completly ignored us. The hackers used hacks to fly over walls and make us crash when we tried to defend ourselves when they raided.\n\nI have spent 680 hours on this game, and I can tell you it is a very good game, until a bunch of ****ers come and ruin everything with glitches and hacks which you can't defend yourself against, you can't trust the devs to come to your help, and all the time and work you spent on advancing will be for nothing :/\n\nSo I don't reccomend getting this game, there are plenty of other similar games you can play where this just doesn't happen in.", "timestamp_created": 1503406429, "timestamp_updated": 1503406429, "voted_up": false, "votes_up": 104, "votes_funny": 5, "weighted_vote_score": "0.828239679336547852", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "34526480": {"recommendationid": "34526480", "author": {"steamid": "76561198024387022", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 2070, "playtime_last_two_weeks": 0, "playtime_at_review": 2070, "last_played": 1503828156}, "language": "english", "review": "Tree of Grinds\nI've never written a review for a game, never felt necessary to do so. I hope that if you read this I'll might be able to save you from lots of disappointment and anger.\n\nLet's start at the beginning. We bought a four pack and started to play a week ago. Four friends, we are accustomed to each other, been playing mmo's for like a lifetime. We started to build our base, improve it slowly, building taller walls, craft buildings, etc.\n\nWe even managed to move our base to a higher lvl territory after long hours of grinding. (Half of this game is about the grinding which wouldn't be a problem itself.)\n\nOne day we collected loads of materials for our friend, when he'll be online he can boost blacksmithing (so we can have better weapons), and we put these precious, rare materials to one of our guild vaults.\nWe logged out satisfied at 3:00 AM, with the comforting tought that we achieved something today. Hard work always pays...\n\nUntil it's not.\n\nWhile we were sleeping like normal working people who require sleep to maintain a biorhythm (Ye, I know, sleep is for the weak, but still.) six guys robbed our base and took everything. Maimed and kill our livestock, raised all of our buildings to the ground.\nThat feeling, when you log in the next day and find everything you worked for are in ruins, it's just.... Meh.\nOkay we worked ourselves up, \"It doesn't matter, let's do it again.\" Only with higher walls, and harder defenses.\nWe grinded like 10.000. (I'm not joking.) firewood, to build more taller walls, archer towers, etc.\nAnd the next day it happened again.\nAnd again.\nAnd you are not able to do a single thing, because you are sleeping.\nIt just doesn't worth your time, and if you don't pay tones of money as ingame purchases, you'll be robbed. And killed. And robbed. And again.\nShort version for the game mechanics: Grind-grind-grind-grind. \n\nFor last words, I really am a calm person. I can count on my single hand how many times I was really angry. But if I would be able to reach through my monitor, and grab the neck of those filthy animals who repeatedly took everything we collected (without us being able to do ANYTHING about it.), I would snap those little necks without any remorse.\n\n", "timestamp_created": 1503830451, "timestamp_updated": 1503830451, "voted_up": false, "votes_up": 152, "votes_funny": 28, "weighted_vote_score": "0.827369749546051025", "comment_count": 13, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "16035664": {"recommendationid": "16035664", "author": {"steamid": "76561198007267429", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 582, "playtime_last_two_weeks": 0, "playtime_at_review": 582, "last_played": 1432797391}, "language": "english", "review": "Tree of Life is, as it stands, a good game. It's a good game. You run around, you pick up sticks, you make little houses and ride cows. What's not to like? The game's got charm in spades, and it's fun for about 12 hours. After those 12 hours, you have a problem if you want to keep your stuff. I'm not going to say it's impossible, but it's very hard. You don't get walls until Carpentry 18 and even then they're not very effective. You don't get locks until tinkering 14 and that's if you're lucky enough to find iron which, for me, took a total of four hours.\n\nEven then, the locks do nothing. People will destroy your houses, and I've seen this pretty much everywhere. If you're not in a guild or a relatively large group, your buildings will be destroyed shortly after you log off. Don't leave any farms growing either, they'll often be taken. Your mounts? Not locked to an individual, so they can be ridden away by anyone that wanders by. But that's not the worst part.\n\nI was attacked by reds shortly after starting the game, and that was FINE. That's a fair fight, where I'm innocent and you're the aggressor. What's annoying are the reds and yellows that work together. The reds distract you while the yellows look through everything in your town that you can take. If you attack and kill them, you get turned red, which is what they want so they get full loot rights because you're a 'murderer'. It's not the strategy that bothers me, it's having a game so poorly guess moral choices when it gives us no laws. We're not protected, so until I get locks on every house, anyone can just grab anything. My towers? Pitiful damage that red players can casually stroll through. And that's just for a handful of people that just felt like bothering someone else.\n\nThe hamlet I built will probably be gone by tomorrow, that's fine. I'll remember the fun I had before I was tricked and killed by two random people that were passing by. It's still a good game, it's like wurm and harvest moon had a baby, but I feel like will never effectively protect my belongings without being part of a much larger town, and that sucks. So I won't be playing.", "timestamp_created": 1432798524, "timestamp_updated": 1432798524, "voted_up": false, "votes_up": 325, "votes_funny": 16, "weighted_vote_score": "0.82723391056060791", "comment_count": 22, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "16109549": {"recommendationid": "16109549", "author": {"steamid": "76561197985014704", "num_games_owned": 162, "num_reviews": 1, "playtime_forever": 29610, "playtime_last_two_weeks": 0, "playtime_at_review": 5411, "last_played": 1506125038}, "language": "english", "review": "Great game with a lot of substance for a survival game\nPenalty system for RPK\nFarming\nDecent combat (soft targeting)\nCrafting\nProgression, Progression, Progression (you hit things with hammer to level your hammer......you feed cows and such to level your ranching.....you plant seeds/harvest to level your farming--to level a skill you have to actively do it and i love this aspect\nBase Building\n--Griefing-- (if you're about it)\nThere's truly something here for everyone--\nJust avoid being red.....not sure if it's really worth the risk....but it depends of the situation\nI think that the day night cycle is fine because it gives people a chance to acquire linen easily without having to go across the map....(as i do live in the boonies)\nCons: \nyou cant really defend your guild base from yellow names without risking going red\n(i think if you're defending your territory everything should be fair game)\nso The penalty system can be changed a little..\n", "timestamp_created": 1433124403, "timestamp_updated": 1433124403, "voted_up": true, "votes_up": 151, "votes_funny": 7, "weighted_vote_score": "0.814457237720489502", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "36192597": {"recommendationid": "36192597", "author": {"steamid": "76561198260259254", "num_games_owned": 30, "num_reviews": 1, "playtime_forever": 72310, "playtime_last_two_weeks": 0, "playtime_at_review": 68328, "last_played": 1528566282}, "language": "english", "review": "The idea of this game is good and I have play this game since the Early Access state. However the administration team, those GM, are making all players disapointed except korean player. If both of you and a Korean player are violating the game policy, they will do nothing to the Korean player but ban your account permanently. Although my account has not been banned, I still cannot play this game under this unfair circumstanes. Please DO NOT PURCHASE this game. It is unworthy.\n\n遊戲概念十分吸引，但管理團隊極度偏坦韓國人。在這遊戲不可能得到一個公平合理的遊戲環境。請不要在這遊戲上浪費時間和金錢。", "timestamp_created": 1509545317, "timestamp_updated": 1509545317, "voted_up": false, "votes_up": 104, "votes_funny": 7, "weighted_vote_score": "0.814301252365112305", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "16447355": {"recommendationid": "16447355", "author": {"steamid": "76561198119036609", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 1854, "playtime_last_two_weeks": 0, "playtime_at_review": 1351, "last_played": 1434443298}, "language": "english", "review": "I've never felt so alone playing an online game.\n\nSo why are there so many positive reviews?\nBecause the developers gave permanent extra inventory slots and a hair style to the people that wrote a positive review.\n\nThe game is in Early Acces. With it comes the usual crappy client issues like unexplained fps drops, screen tearing, client crashes, but that's the least of your worries.\n\nI really wanted to like the game, but I'm afraid it's very dull, featureless, boring, repetative, flawed and most importantly - time consuming.\n\nLet's start with the major flaws:\nThere is no party chat or global chat or guild chat. Wait! There is no party in the game. The sole guild feature in the game is that you can use your guild members' buildings if they put a guild lock on it. So where are your friends in the world? Ask them on Skype or Teamspeak, cuz there is no other way to find out. So for an online game, it's amazing how antisocial this game is, and how hard it is to play with others. And make no mistake. This is NOT a game you can solo, unless you play like 70 hours for the first 4-5 days, and at least 3 hours every day after that. \n\nNight and day follow each other in quick succession. Night time is so dark, that you literally can't see anything. I'm not joking. It's pitch black. Seriously. Black. This means that you either spend LOTS of resources on lightning (which is very dumb) or you limit yourself to tasks that don't require moving or seeing (standing 10 minutes crafting, harvesting lumber or stone). If you try to do anything else then you'll be GREATLY penalized.\n\nTraveling is superslow, superboring, superblehI'lljustaltf4.\nBut you'll need to travel, because certain resources like \"lava sculpture\" (red ore) or corn or whatever is not found in your home biome. Let me translate:\nYou want to get lava? Push WWWWW for 10 minutes. Look at a completely black screen (night) for 10 minutes. Do some mining, then head back and push the same boring WWWWW for 20 minutes, and stare at a completely black screen for 10 minutes. As there is no fast travel.\n\nIt took us about 80 manhours to build a base that can put up a small defense. Which means it has 1 of each type of buildings, 6 storage buildings, a wooden wall, and about 14 mark2 towers.\n80.\nHours.\nWithout a base you can't do anything, cuz crafting is dependent on crafting buildings, and storage space, so no fort = no buildings = no anything.\nEach night (every 10 minutes) zombies and skeletons will spawn and chip away at your walls. It takes about 5-10 minutes for 1 of these creatures to chip away at your walls. A tower kills them in about 10-15 arrows. Our base has to fend off about 4 mobs each night. So 15arrowpermob * 4mobpernight * 72 nights a day means you'll need about 4300 arrows a day. Those will have to be crafted by a carpenter. Someone will have to collect those mats. 20 arrow = 1 copper 1 lumber 1 feather. So you'll have to craft this recipe about 200 times a day. Just crafting all that shit requires you to sit at the crafting bench for 20 minutes, and crafting the lumber will take about 10 additional minutes, and that's the easy part! You have to collect these resources first, and that will take at least 2 manhours. You also need to repair the damaged buildings with coins. Certain monsters drop coins, and it will take about 10 minutes of beating up kobolds and skeletons and shit to have enough to fix your buildings.\n\nSo all in all, your completely minimalistic base spends about 3 hours a day just to defend itself from monsters at night with a high success rate.\nAnd that's only if RNGesus didn't spawn the monsters in an uneven way.\nAnd that's only if players didn't grief you. We were griefed every few hours. And you will be too! We went for a 20 minute break on the first day. Base got destroyed. We went to sleep on the first day. Half the base was destroyed. We went to sleep on the 2nd day. All our buildings were lockpicked. The arrows were stolen from our towers, so much of what the players didn't take or destroy was destroyed by monsters entering the disarmed base.\nBut the best thing is:\nIf you don't repair the base each day. Don't restock your arrows every 24 hours then your base will be leveled in 1 day, and you'll lose the time put into your lost items and buildings.\n\nLet me rephrase that:\nTHERE IS NO POINT IN PLAYING THIS GAME, UNLESS YOU ARE WILLING TO SPEND AT LEAST THREE HOURS A DAY ON JUST FORT MAINTENANCE.\n\nAnd even if you do. Some player might just decide to destroy your whole base for fun. He can do that naked with his fists if he wants to.\n\nBut why would you want to play this game? It has virtually nothing to offer besides building a base and crafting.\n\nCombat is really annoying and boring. Targeting is hard. You'll often end up hitting your buddy instead of the monster you are trying to hit. Trying to hit moving enemy players is hard, and not fun. There are no combat skills. So combat is basically clicking left button over and over again.\nFighting monsters is boring. There aren't many of them either. Again: you are just spamming 1 button the whole fight.\nThe world is dull too. Lack of landmarks or scenery or points of interest or variety.\n\nPvP is pretty much nonexistent except for griefing. You know why? Cuz it's boring, tedius, not rewarding, pointless.\n\nOh wait. There IS PvP in the game! In the form of griefing. This game is a griefers paradise. Through a long array of game design flaws and exploits people will destroy your base, and get away unpunished.\nYour weakass useless defense towers don't attack if they grief in certain ways:\n-They can harvest your crops\n-They can kill your animals\n-They can destroy your farmlands\n-They can destroy your workbenches, fire pits, planning tables, cooking tables and a few other things.\nWhen they destroy other buildings or kill you they will become \"red\" for a few minutes, and your towers will attack them, but it's so supereasy to tank/bandage towers and lockpick them and take out your arrows, or just facetank the arrows until they are depleted and the towers will stop firing.\nLong story short, anyone can EASILY break into your base if they want to grief you. We played for 4 days, and we encountered griefers every few hours. I estimate that about 10-15% of our time was spent on gathering resources that the griefers destroyed or took.\n\nThe game is FULL of griefers!\n\nI could go on for a long while about how...\nThe game was probably literally translated by Google translate. I'm not even joking.\nPair this with the fact that item decriptions are pretty bad or miswired (Egg says it's rotten meat, and so on).\nCharacter costumization doesn't exist.\n... and so on, but just save yourself from this game.\n\n\nWe scouted the surrounding areas, and about 95% of all bases on the world are abandoned wrecks, so, like us, most players get annoyed by the dull and frustrating game experience and just leave.", "timestamp_created": 1434471494, "timestamp_updated": 1434471494, "voted_up": false, "votes_up": 164, "votes_funny": 10, "weighted_vote_score": "0.810759663581848145", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "35785250": {"recommendationid": "35785250", "author": {"steamid": "76561198300547214", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 38978, "playtime_last_two_weeks": 0, "playtime_at_review": 14361, "last_played": 1614300036}, "language": "english", "review": "I want to say I love this game sooo much but I really can't :( Don't get me wrong I still play it daily, maybe because I'm stuborn.... But there are many things that bugs me about this game. 1. cheaters who are on the ban list are still free roaming around playing in game... not sure how that happen :( 2. very imbalanced system... cheaters were able to use stamina cheats / dupping items etc to get ahead there's no way to really catch up to them especially that they are still allowed to play the game...  3. many bugs are still not fixed.. when you get  to certain level in healing, you're suppose to be able to revive dead allies, but it's broken and developers never fixed it still. 4. when you are offline people are able to raid you, and chinese players would take advantage of that, they go to the american server and wait to strike during night time... 5.  spies are allowed, some people bought another steam account and infiltrate the oposite faction to locate where the bases are. \nDEVELOPERS OF TREE OF LIFE IF YOU ARE READING THIS PLEASEE FIX THIS! \nI do love the style of the game... but too many  stuff that makes it impossible to rate this possitive.  \nIf things change in the future I will rewrite my review, but as for now... NO... don't buy this game and waste your money!", "timestamp_created": 1508207821, "timestamp_updated": 1508207821, "voted_up": false, "votes_up": 65, "votes_funny": 5, "weighted_vote_score": "0.808654546737670898", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "30971904": {"recommendationid": "30971904", "author": {"steamid": "76561197964373272", "num_games_owned": 0, "num_reviews": 71, "playtime_forever": 87, "playtime_last_two_weeks": 0, "playtime_at_review": 87, "last_played": 1461495228}, "language": "english", "review": "I'll try to keep this simple.\nThere's good points to the game, I like the concept, and building up a little town with your friends or guildmates. The graphics are cute, although not very impressive.\n\nUnfortunately the bad points really killed it for me. Like many games of this kind, it ends up being crowded very quickly.  Wanna build a fort? Yeah, well so does every other player, and they'll take up any decent space. You end up with scattered little junky player tents everywhere and no sense of order.\nGetting resources to build anything takes AGES, and worst of all, other players can exploit your work. I had several times where I spent a while cutting down a tree, only to have another player run up and last-hit it, and thereby steal all the resources.\nWhich brings me to the next bad point, the community in the game seems as likely to kill you or rip you off as to say hello. I had guilds in small in enclosed areas shooting at me simply for trying to run by, plenty of people trying to last-hit resources on me, etc.\nFinally, it's just boring. The whole game is a long, slow grind. Combat isn't really fun, it's about as generic and dull as it gets. Try playing an MMO where all you can use is your basic attacks. It's something like that.\n\nAt it's core it feels like there was some potential here, but the execution is so bland, slow, and exploitable that it just isn't fun. If you're in a large guild of people dedicated to the game and grind, you might have some more fun with this. Otherwise, there are better games out there that are more worth your time.", "timestamp_created": 1491445123, "timestamp_updated": 1491445123, "voted_up": false, "votes_up": 70, "votes_funny": 1, "weighted_vote_score": "0.804562151432037354", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "50848489": {"recommendationid": "50848489", "author": {"steamid": "76561198030555140", "num_games_owned": 123, "num_reviews": 6, "playtime_forever": 1873, "playtime_last_two_weeks": 0, "playtime_at_review": 561, "last_played": 1559596727}, "language": "english", "review": "Do NOT purchase this title. Tho it is a fantastic and fun game, which I personally LOVE.  The company has announced the LIVE servers will be shut down approx 3 months after MAY 15.", "timestamp_created": 1558832024, "timestamp_updated": 1558832024, "voted_up": false, "votes_up": 58, "votes_funny": 2, "weighted_vote_score": "0.801663100719451904", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "24432543": {"recommendationid": "24432543", "author": {"steamid": "76561198021383527", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 34209, "playtime_last_two_weeks": 0, "playtime_at_review": 32182, "last_played": 1467584784}, "language": "english", "review": "Cant recommend this game. Too many flaws.\n- Horrible community. Just check out the Discussion section of this game.\n- Lots of bullies and griefers.\n-The game itself encourages griefing. Someone steals from you, they get debuff for 30 seconds. You attack and kill them after they steal from you, it's you that becomes wanted. Don't know how that makes sense.\n- If you plan on playing alone or in a small guild, don't bother playing. You're just collecting mats for\nthe griefers. (High levels can easily break into your base no matter how good your locks and \ndefense are).\n- Even with a large map, there is nowhere to build because of lot's of abandoned camps.\n- Pretty boring leveling system. No matter how high you get your Logging, Mining or Fishing up,\nit makes no difference in how fast you chop/mine/fish. There are no better logging or mining tools\nother than the starter ones. Also, leveling weapons do nothing other than adding the base stat.\nYou don't get new weapon abilities at higher levels.\n- PVP targeting system is horrible.\n\nAfter spending several hours playing this game, I can tell you most of your time in the game will be spent chopping down trees, replacing items stolen from you, or repairing your base. Other reviews I've read were infact true. Unfortunately, it took me hundreds of hours to realize it.  Normally, I would give Early Access games the benefit of doubt to fix and make improvements but the Devs for this game is completely satisfied by how everything already is.", "timestamp_created": 1469052485, "timestamp_updated": 1469052485, "voted_up": false, "votes_up": 61, "votes_funny": 1, "weighted_vote_score": "0.801039040088653564", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "18639038": {"recommendationid": "18639038", "author": {"steamid": "76561198004480717", "num_games_owned": 123, "num_reviews": 32, "playtime_forever": 23678, "playtime_last_two_weeks": 0, "playtime_at_review": 22987, "last_played": 1464266951}, "language": "english", "review": "This game shows promise, but the updates come as slow as molasses and the player base is slowly dieing, making the game less and less interesting. The few players you will find are usually griefers. \n\nIf you plan on maintaining a base in this game, try to have a group. Maintaining a base as a solo player will take you 30 mins to 1 hour daily of upkeep or you risk losing all your stuff. Even then a group of griefers could decide they don't like you and wreck everything you own.\n\nI enjoyed this game in the beginning but the slow death of the server population and the nonchalant update schedule lead me to leave this negative review. Hopefully future updates can breath life into the game and bring back a more healthy player population.", "timestamp_created": 1445606440, "timestamp_updated": 1445606440, "voted_up": false, "votes_up": 84, "votes_funny": 3, "weighted_vote_score": "0.798280656337738037", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "22889604": {"recommendationid": "22889604", "author": {"steamid": "76561197965632649", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 548, "playtime_last_two_weeks": 0, "playtime_at_review": 548, "last_played": 1461992238}, "language": "english", "review": "Fun game.  Very fun game, infact.  The crafting mechanic is nicely implemented and was one of the reasons I bought the game.\n\nI should have done some research on the community.  This community acts like a surivival-game version of EVE's community.  If you're not affiliated with some alliance, or friends with an alliance's father's brother's nephew's cousin's former roomate, well then you're screwed.  You will be killed (or have a high chance of it).\n\nIf this game ever institutes private hosted servers (like ARK), then I will change this review to an Thumb Up.  Until then, however, it will not be recommened by me.", "timestamp_created": 1462849370, "timestamp_updated": 1462849370, "voted_up": false, "votes_up": 68, "votes_funny": 8, "weighted_vote_score": "0.798237860202789307", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "34874246": {"recommendationid": "34874246", "author": {"steamid": "76561198049021322", "num_games_owned": 672, "num_reviews": 27, "playtime_forever": 160, "playtime_last_two_weeks": 0, "playtime_at_review": 160, "last_played": 1505089243}, "language": "english", "review": "Bought the four pack to play with 3 others I knew.  We started the game, and the tutorial quickly told us to chop down some trees.  We were instantly yelled at by several people in game for \"not replanting the trees.\"  You can replant trees?  The game said nothing about replanting.  We were told we were going to be reporting for being bots (which we clearly answered back that we were not), and proceeded to be stalked by several people in game while we were trying to learn what was going on.  \n\nEventually, after some time, we managed to finish the tutorial only to find out that our own self-made guild tree (your own Tree of Life) would EXPIRE after 6 days if you didn't pay in-game funds for \"rent.\"  What does that mean?  Did that mean all of our in game assets would suddenly become public if we didn't log in enough to pay the rent?\n\nOVERALL...\nIt seems like the game could be good, but it has a built-in system designed to force you to have to play in order to keep any progress you made.  There is a series of micro transactions which can increase your travelling speed and/or inventory slots, which is annoying.  Money is required to keep your guild alive, but takes up actual inventory space...  The tutorial is HORRIBLE...  Badly worded...  occassional horrible misspellings (\"survey\" is not spelled \"suvery\").  Swimming is slower than just jumping across the water's surface...    Many resources seem to be more limited than they should be, and as a result, players tend to yell at each other for doing things the game tries to tell you to do.  This game is just BAD and has a severe lack of direction.\n\nEDIT:  I understand the game's need to delete out unused assets to allow gamers to not be overburdened on finding free locations.  What I can't understand is why I would be forced to log in and play the game to do this once every 6 days.  Why not 2 weeks?  Or a month?  Or maybe add additional servers so that I don't feel pressured to play a game once every 6 days??\n\nAlso, the vitriol this review seems to be getting from the obvious members of the Tree of Life community nicely sums up the experience we had.  A game is capable of directing its players into learning how the world works in ways that does not cause such volatile reactions.  Thank you to those of you with your angry comments, because I hope you all help others to steer clear of this product.", "timestamp_created": 1505091779, "timestamp_updated": 1507427893, "voted_up": false, "votes_up": 150, "votes_funny": 2, "weighted_vote_score": "0.79610741138458252", "comment_count": 18, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "35253227": {"recommendationid": "35253227", "author": {"steamid": "76561197992734826", "num_games_owned": 314, "num_reviews": 29, "playtime_forever": 1658, "playtime_last_two_weeks": 0, "playtime_at_review": 1658, "last_played": 1506564861}, "language": "english", "review": "Day one:\n               Run around doing the quests \"tutorial\" Place a place to store my goods, plant a tree. Log off.\nDay two:\n               Found out my base was ravaged and pillaged by 1 person.\n               Deleted character went to another faction, Got my 2 nefews to play with me.\n               Built new base with help, tree, multiple buildings.\nDay three:\n               Loged in to find my base was ravaged again by 1 player.\n               Was informed I had to use servey sticks around base to protect it. I did this.\n               Loged out to work on a new computer build.\n               Loged back in and found everything smoldering in fire, Again by 1 player.\n\nFindings:\n               The game is fun.\n               The fact you loose your base every time you log out is truely frustrating, \n               Even when built in the starting safe area.\n\nI suggest you stay away, Game is NOT new user friendly. Hope this helps.", "timestamp_created": 1506565727, "timestamp_updated": 1506565727, "voted_up": false, "votes_up": 153, "votes_funny": 7, "weighted_vote_score": "0.794220030307769775", "comment_count": 20, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "18025243": {"recommendationid": "18025243", "author": {"steamid": "76561198008095135", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 38151, "playtime_last_two_weeks": 0, "playtime_at_review": 7871, "last_played": 1542633170}, "language": "english", "review": "It was a good game to me.\nAfter I have my own house, my own property. I need spent all my real life time to guard. Filling arrows, fixing walls, repair structions, re-lock gates and cabins.\n\nIF I didn't play for a day I will get robbed by lots of thief.\nThis thief system will just destory all time I had spent. All I can do is watching them break into my property and steal everything from me,\nSo that means all effort I have spent on this game will never be insuranced.\n\nI just a normal guy with a job. I only can spent 1 or 2 hours for gaming everyday at night. And I don't want this game kidnap all my time.\n\nCan I ask for refund?", "timestamp_created": 1442196164, "timestamp_updated": 1442196164, "voted_up": false, "votes_up": 187, "votes_funny": 45, "weighted_vote_score": "0.792501270771026611", "comment_count": 10, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19846652": {"recommendationid": "19846652", "author": {"steamid": "76561198115733973", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 1392, "playtime_last_two_weeks": 0, "playtime_at_review": 1299, "last_played": 1466883564}, "language": "english", "review": "I played this game for about 15-20 hours, so I can say with confidence that I believe it is not worth the money. It's fun at first - build your own town/camp, farm for supplies, have a grand old time guilding things just so you can level crafting skills, ect...\n\nThen you log off for the day and come back to a destroyed camp, raided stockpiles, and missing resources. EVERY. SINGLE. TIME. The people on this game are rude and destroy another person's hard work just because they can. Nobody wants to work for their own stuff - they would much rather steal it. I know a lot of people will say \"well join a guild and you'll be safe\". Wrong! All it takes is one wall being taken down for an entire fortress to be destroyed.\n\nSo long as people can come in and undo any hard work I put into this game (in one night, no less), I will NEVER recommend this game to another person. In fact, I would strong advise against buying the game. It's $20 wasted just to get frustrated every time you log in. I'm sure there are players who would say the opposite because they have entire towns of their own, but this is my opinion. Getting started in this game is next to impossible thanks to other players. Save you money and your time.", "timestamp_created": 1450805073, "timestamp_updated": 1450805073, "voted_up": false, "votes_up": 151, "votes_funny": 19, "weighted_vote_score": "0.782390356063842773", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "18848510": {"recommendationid": "18848510", "author": {"steamid": "76561197971877862", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 42176, "playtime_last_two_weeks": 0, "playtime_at_review": 17379, "last_played": 1602735746}, "language": "english", "review": "Hey guys,\n\nSome of you have played the game.  Hopefully you have.  Some of you have yet to play, and are reading reviews to determine if the game is worth spending the money on.\n\nWell, as of today I'm sitting at somewhere near 250 hours played.  Hardly a long time compared to some who play this, but certainly longer than many.  I wanted to share my thoughts about the game in as objective a way as I can possibly do.  I do like the game though, so I have to be honest when I admit that I am hoping you give the game a really good shot.  I will explain.\n\nThis game is tagged as an Early Access Massively Multiplayer Survival PvP RpG Sandbox.  Now I feel it necessary to break that down a little bit to explain each part and how it pertains to Tree of Life specifically.\n\nI write this review based on my experience on the NA server.\n\nEarly Access.  \nTree of Life is Early Access.  I need to stress how important it is that everyone who plays this game remembers this fact.\nWe have paid to get involved in the games development.  That has lots of perks, like getting to know the game inside and out, before it goes live, and they have told the players we get to keep our characters during any major changes that will happen through the process.  This gives long standing players a good individual advantage.  But everything with a positive, has a negative.  For example, any change they accept, or decide to do, will impact everyone.  So if they make a decision based on one persons recommendation, it affects every player.\n\nMassively Multiplayer.\nSo we all know this.  In Tree of Life, the game had thousands of players who got impatient or interested in other newer games and left Tree of Life for shinier things.  It's ok they did because now is a great time to get into the game and start building a fort for yourself.  With all the old players gone and their forts destroyed there is loads of free space to work with and start training up your skills.\n\nPvP\nThere is a very interesting PvP dynamic to the game, though due to a recent decline in player population, the PvP is really minimal.  Most of the remaining players whom I've met have no desire to cause trouble and actually focus on building care packages or helping out newbies.  The early learning curve is a bit tricky but with help from your peers, it becomes much easier.\n\nRPG\nCurrently there are limited elements for roleplaying.  There are very basic social actions and only a local chat.  This is easily circumvented with Steam friendships or voice chat amongst friends.  Not a deal breaker in my mind, though some extra chat functions would be a nice addition to the game.  I'm not sure where their goals are here but it doesn't change the fact that this game does lack many RPG elements.  There are no quests or missions and no NPC's to speak with or trade with.  Considering the game is in early access and they are still writing code, I expect this will change once they add Monster Villages to the game in the next couple weeks.\n\nSandbox\nAs far as Sandbox goes, you even get to make a shovel to dig in the sand!  You build stuff.  You build more stuff.  You gather resources and build even more stuff.  It's never ending, but that's the grind.  It isn't fun for everyone, and with the lack of other material it can become really tedious at times.  Still, I find it rewarding to make stuff for my friends or design walls of a fort.  There are certainly some enormous forts in the game.  Impressive constructions that's for sure.\n\n\nMany are concerned about Stability with an early access game.  I have only experienced one or two crashes since I started playing, and the FPS is good so long as I don't come across a fort with 30,000 sections of wall in construction.  The game has lots of potential and I know you can easily get a couple hundred hours of play.  Check out their website and official forums for more information.\n\nI want to give a rating but since I have limited experience with early access sandbox titles, my rating wouldn't be objective.  So, I'll just give it a thumbs up and hope to see you in game sometime.\n\nCheers\n\nSkrem", "timestamp_created": 1446510389, "timestamp_updated": 1446510498, "voted_up": true, "votes_up": 83, "votes_funny": 8, "weighted_vote_score": "0.780014574527740479", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "16929901": {"recommendationid": "16929901", "author": {"steamid": "76561197963619755", "num_games_owned": 0, "num_reviews": 59, "playtime_forever": 17975, "playtime_last_two_weeks": 0, "playtime_at_review": 11066, "last_played": 1437489512}, "language": "english", "review": "Not going to leave as long of a review as others, however the exploiting of the flagging system totally breaks this game for myself and my friends. \n\nBasically what happens now is someone runs up to your gates, unlocks them. Then runs away while their flag drops. Then they run in free of attack to take/look at everything you have. If you lock your buildings they do the same thing. They lockpick and then run away for their flag to drop. Right now there is a bug that allows someone that is blue(good) to unlock your gates/buildings and as long as they don't move they won't get attacked by your 100 towers you built up. So that's what people do. \n\nWhen you do find someone that is in your city and killing your farms, workbenches, animals, etc... you kill them and then you become flagged. Once you are red not even your own towers will protect you from harms way. All due to you trying to protect your city.\n\nThe population is super low. On a busy night we might see 5-6 people while traveling the whole map of broken/abandoned cities.\n\nAnyway my friends and I are moving on, though we gave our money so I guess it really means nothing.", "timestamp_created": 1436291635, "timestamp_updated": 1436291635, "voted_up": false, "votes_up": 66, "votes_funny": 1, "weighted_vote_score": "0.778087496757507324", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "50771026": {"recommendationid": "50771026", "author": {"steamid": "76561198065710776", "num_games_owned": 0, "num_reviews": 27, "playtime_forever": 540, "playtime_last_two_weeks": 0, "playtime_at_review": 540, "last_played": 1558509568}, "language": "english", "review": "Dont Buy... The support for this game is ending, and the servers wont be up longer then 3 months due to lack of funding. It does not stipulate this on the Steam Page and by the time you find out like I did Youll already have 9 hours plus in the game, and the only way I found out is because I was googling for in game help on some understanding, and ran across the article  by accident. Steam wont give a refund even tho the developers stated they would for any purchases in the last month. I wont be supporting any new titles from Steam that are indi developers due to their bad business of not refunding when shit liked this goes wrong. They got your money and running to the bank with smiles. while your left in the dust scratching you head.", "timestamp_created": 1558557146, "timestamp_updated": 1558557146, "voted_up": false, "votes_up": 40, "votes_funny": 1, "weighted_vote_score": "0.776331007480621338", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "34319296": {"recommendationid": "34319296", "author": {"steamid": "76561198213383188", "num_games_owned": 145, "num_reviews": 39, "playtime_forever": 28, "playtime_last_two_weeks": 0, "playtime_at_review": 28, "last_played": 1503022813}, "language": "english", "review": "Wow, the game trailer and screenshots were so decieving.. \nWas excited for a harvest moon MMO type of game :(\nThe graphics are awful, as well as the gameplay..\nThe idea of the numerous classes and being able to do whatever you want and building whatever whenever, loved it..but the way it was used in the game, I was very disappointed.", "timestamp_created": 1503022920, "timestamp_updated": 1503022920, "voted_up": false, "votes_up": 107, "votes_funny": 2, "weighted_vote_score": "0.774695038795471191", "comment_count": 11, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "44476916": {"recommendationid": "44476916", "author": {"steamid": "76561198447134346", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 95654, "playtime_last_two_weeks": 0, "playtime_at_review": 80250, "last_played": 1561350811}, "language": "english", "review": "DO NOT BUY THIS GAME! \n\nUntil you see these reviews change, its not worth spending hard earned money for a broken game that was wiped AFTER a full release. We have been promised weekly updates by the devs, only for it to happen one time with incomplete and false answers. There is no communication at all. It's just \"lets wait and see\" anytime we all ask for answers. Anyone who bought this game before July 15th should be refunded their money, for game and DLC. It would be like buying a new car and then someone deciding to take it back and give you one with a missing door and 3 wheels. Complete fraud, to the letter. They completely changed the game from the one most of us bought and now its a bug filled, incomplete, poor excuse for a replacement of the addictive version we all loved. There is no one to ask for help, except all of us veteran players who are now so disgusted with the way we have been treated that we no longer care to play. I have probably over 4000 hours now and do not care to play this version anymore. They wiped almost a years worth of work on my castle and all the materials I had saved up all gone.. All the weapons that took me weeks or months to make.. gone. It just makes me sick. I made tons of friends here and we used to have CM's that would come in game and ask how things were going and it felt like home. Now it feels like a ghost town without a single care given to all those who have been here for thousands of hours supporting this game. We even used to have community events that were really fun, looking at you Cerus and Naso.(If you saw this update coming, I don't blame you for leaving) If you want a broken version of some teletubbies game, this might be for you. Always check steamcharts. com for true player numbers, they don't lie.\n\nOMG, I just looked at the second video in the Steam store page for this game and it still shows monster invasions, tresure hunts, level 50 weapons and armor and more.. How is that even allowed? FALSE ADVERTIZING!", "timestamp_created": 1535677113, "timestamp_updated": 1535677953, "voted_up": false, "votes_up": 44, "votes_funny": 0, "weighted_vote_score": "0.767269134521484375", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "34487961": {"recommendationid": "34487961", "author": {"steamid": "76561198045842124", "num_games_owned": 479, "num_reviews": 5, "playtime_forever": 173, "playtime_last_two_weeks": 0, "playtime_at_review": 173, "last_played": 1503688188}, "language": "english", "review": "Played for about 45 minutes with no problem. Got spawn killed in very back of starting zone by player from another faction. He destroyed my base with his friends. Thought i'd start over in a new base no big deal. Played for about 30 minutes, attacked and base destroyed again. Tried 1 last time for about 30 minutes and my base got destroyed again. Game makes no sense that high level players can just roam a spawn zone killing new players. In the hour that I played without dieing it was extremely confusing. Overall would not recommend.\n\nSide Note: All the screenshots and videos they show on the  store page are older or fake. So they are no actually what the game looks like.", "timestamp_created": 1503688537, "timestamp_updated": 1503688537, "voted_up": false, "votes_up": 86, "votes_funny": 0, "weighted_vote_score": "0.762903988361358643", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "35425890": {"recommendationid": "35425890", "author": {"steamid": "76561198016505817", "num_games_owned": 297, "num_reviews": 55, "playtime_forever": 7064, "playtime_last_two_weeks": 0, "playtime_at_review": 6810, "last_played": 1531763757}, "language": "english", "review": "Only 70% of the content you see in the video and listed on the read more about the game has been removed.\n\nI am unable to recommend this game right now as there are a number of exploits like infinit stamina, duping, glitch teleport(Where your character pretty much blinks forward) and even though there has been a number of videos posted of players abusing those bugs/glitches weeks later they are still playing the game. Using the same exploit over and over and over to raid your base or to kill you. \n\nBeing raided and killed by someone that is playing fair is on thing but going against cheaters... you're better off watching paint dry than put any game time into Tree of Bugs.\n\nThe NPC raid against player bases has been removed, building fencing like you see in the video does not protect your belongings from other players not even faction members. Without any peg stacks or walls your base is free game for anyone to loot.", "timestamp_created": 1506969552, "timestamp_updated": 1531359488, "voted_up": false, "votes_up": 64, "votes_funny": 0, "weighted_vote_score": "0.760096967220306396", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "18895048": {"recommendationid": "18895048", "author": {"steamid": "76561198040597611", "num_games_owned": 164, "num_reviews": 3, "playtime_forever": 100330, "playtime_last_two_weeks": 0, "playtime_at_review": 96458, "last_played": 1524507521}, "language": "english", "review": "As an original \"fanboy\", this Early Access title started out fun and promising for me. However, almost 12 months down the road with over 1,500 testing hours under my belt, I now have my doubts.\n\nThe developers seem to have strayed away from their original vision. Rather than balancing and fixing current features, they totally change or remove them.\n\nLike other enthusiastic ToL community members who adopted this title from day one, I've now lost faith in testing this title. For me, the final nail in the coffin was yet another major exploit, in which the Devs fail to take action. A complete overhaul of base defences and raiding, which now favors griefers even more so. And, the picture painted on the official forums by the Devs regarding the delivery of a PS4, luxury meals. Well... basically living the high life. A harsh opinion? But a valid one.\n\nFrom a solo and group players point of view, content updates are by far few and exciting these days. Pointless events, when priority should focus on bug fixes and community concerns. Once you have your occupations/skills maxed and a fully built base (if you're lucky enough not to have the exploiters easily destroy it), there's little else to do but replenish arrows that are easily stolen unless you grind for materials to create top locks every 10 days! It's extremely hard to encounter other players, the 3 servers barely have 100 players between them, considering in June/July there were over 1,200! But some how I always bumped into a griefer or an exploiter.\nCommunity feedback seems to fall upon deaf ears these days. With valid community concerns receiving the occasional \"Please wait a bit more\"\n\nIn the past the devs have acknowledged their failings with previous Kickstarter/Beta programs. However, in my opinion have failed to learn from their mistakes.\n\nIf you're expecting an end title in the near future, I suspect you will sadly be disappointed.\nI therefore suggest you read the Steam Discussions and Official Forum before you spend your hard earned money.", "timestamp_created": 1446749694, "timestamp_updated": 1464976982, "voted_up": false, "votes_up": 66, "votes_funny": 3, "weighted_vote_score": "0.757696032524108887", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "23917545": {"recommendationid": "23917545", "author": {"steamid": "76561198063381615", "num_games_owned": 0, "num_reviews": 28, "playtime_forever": 17320, "playtime_last_two_weeks": 0, "playtime_at_review": 17320, "last_played": 1467269096}, "language": "english", "review": "I spent basically 300 hours on this game. As a level 45 sewing character i can finally craft myself some crude linen cloth.\n\nIf you know what crude linen cloth is, you will understand my review.\n\nIf you don't, let me explain...\nWhen you first start the game and you kill something, you get yourself linen cloth. This can literally be achieved in less than 5 minutes after starting a new game. After you get 6 pieces of linen cloth you can \"sew\" them into one linen cloth roll. This is the first crafting thing you make for your armors, less than 30 minutes into the game. Consequently this linen cloth roll is bad quality (\"crude\") because your skill level (\"sewing\") is only 1 out of 50.\n\nAfter spending 300 hours you will be level 45-50 sewing. Very high right, there is no way you will make bad \"crude\" quality linen cloth right? WRONG. 300 hours later you will still make bad quality (\"crude\") linen cloth rolls. \n\nIn other words, you have just wasted 300 hours and your first ever crafting recipe at level 1 is still giving you garbage because the devs are too busy partying in hawaii to care. \n\n\n\nThe best part? before some update a few months ago or last year you actualy used to be able to get rare items if you were high level. But why reward a 300 hour grind? amirite trololololol\n\n\nedit: I found this list online, it gives an accurate example of patch changes since launch for this game:\n\n1.We put too many features in the early access. Remove tons of content!\n2. Too many criminals? Nerf crime so criminals appear friendly.\n3. Bows better than melee? Remove all damage from bows!\n4. Two-handed weapons deal too much damage? Make them deal less than one-handed weapons!\n5. Also, we've nerfed one-handed weapons to deal less damage too.\n6. World isn't big enough! Announce world wipe shortly after launch but give no ETA.\n7. 1500 durability is too much. Lets drop it to 150!\n8. Arrows too easy to make? Drop stacks to 20 a pop!\n9. Ok, ok. We'll raise stacks back to 80 but you can't feed chickens for feathers.\n10. You needed those feathers for walls? Sorry, collateral damage.\n11. People are eating and healing too quickly. Put a cooldown on everything (apples/eggs/etc worthless).\n12. Still too many criminals. Add yellow mechanic so more criminals appear friendly.\n13. Dying as red now makes you lose days/weeks of exp.\n14. Improved cooking! But these foods will still be unstackable.\n15. Too much crime! Lockpicks use oil? Make oil only drop if you know ranching (and tell no one).\n16. There is too much quality floating around. Lets nerf lv 50 masteries to be like lv 25.\n17. Players should work harder to craft arrows they've already worked hard to unlock. Make quality arrows 6 feathers!\n\n\nThrough these changes you will notice a miracle has taken place, where an almost perfect game has literally been stripped of it's content and destroyed with nonsensical changes. This folks, is a reversal. Modern games after release get better and better, but no, OddOne developers are hipsters, they want to go against the grain and make their good game worse. \n\nWell played OddOne, you trully lived up to your namesake.", "timestamp_created": 1467185909, "timestamp_updated": 1467222255, "voted_up": false, "votes_up": 49, "votes_funny": 8, "weighted_vote_score": "0.755622386932373047", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "18280768": {"recommendationid": "18280768", "author": {"steamid": "76561198072485016", "num_games_owned": 0, "num_reviews": 96, "playtime_forever": 3004, "playtime_last_two_weeks": 0, "playtime_at_review": 2850, "last_played": 1434559680}, "language": "english", "review": "Cute. But it ends there. Casual players will find it irritating that thiefs can steal it all from you in just an hour while you are offline. Even shorter. You can work for days just to lose it all in very small time frame. If you find a ground maybe you can escape that, but not everyone likes to group up. Roleplay as travelling salesman and you are ok I guess. I did have fun for few days but its not worth my money since there is no incentive to log in after I have explored the world and built few settlements. Maybe it will change later as they add features but right now its not worth the money spent in my humble opinion.", "timestamp_created": 1443730950, "timestamp_updated": 1443730950, "voted_up": false, "votes_up": 63, "votes_funny": 5, "weighted_vote_score": "0.749492764472961426", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "16744814": {"recommendationid": "16744814", "author": {"steamid": "76561198064267583", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 3208, "playtime_last_two_weeks": 0, "playtime_at_review": 2454, "last_played": 1461505103}, "language": "english", "review": "The graphics and audio are pleasing and the game play is fairly fun. The control system has clearly been designed with future mobile support in mind which tends to make it a little bit counter intuitive; it still needs to be polished. There are also some annoying bugs that are hard to pin down, such as tooltips failing to work and so forth. All of these however are to be expected for an early access game and shouldn't discourage anyone from trying the game out.\n\nThere are, however, several key design flaws to the gameplay that lead me to not recommend getting this game while it is still in earlier access. My wife and I tried playing together and found that anything we built was most likely destroyed the next time we logged in. It was also almost impossible to find open land to build on as the world is quite crowded. In addition to the frustration of having anything you build be destroyed there are many situations that can arise in the gameplay that can prevent you from being able to play.\n\nI logged in after having not played in two weeks and found myself inside someone's base. I can't escape the base in any way. I didn't want to try to knock down any walls as I did not want to develop a criminal record. After waiting for a long time hoping a player with access to the base would open the gate I conceded that I would have to try to knock down a wall to escape, despite not wanting a criminal record. I am unable to attack any part of the walls, however, without being quickly killed by the base's arrow towers. I am now effectively stuck in the base with no way to escape or play the game. Until these types of large design flaws are addressed I would advise against paying for this game.", "timestamp_created": 1435428189, "timestamp_updated": 1435428189, "voted_up": false, "votes_up": 46, "votes_funny": 4, "weighted_vote_score": "0.747786939144134521", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "42795016": {"recommendationid": "42795016", "author": {"steamid": "76561198069675496", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 118276, "playtime_last_two_weeks": 0, "playtime_at_review": 113571, "last_played": 1528386864}, "language": "english", "review": "got around 3k hours clocked on this game. been playing since day 1.\n3 acounts. old server maxed every skill.\npros\n-finally seperate server. should have done this day 1 to prevent the massive latency lag and pvp issues\n-better UI system than the first day release.\n\ncons\n-game is dead.\n-imposing build limit ( which kept a lot of players like myself away). build limits was not what was advertised when i first started teh game\n-faction and pvp rework system. cant really pvp  and steal anything anymore. i believe that this was not balanced well.\nsure many high end players would raid and grief newer players with bad defence and locks back in the days... but completely seperating the factions into two is just plain dumb imo....\n-lots of stuff still not implemented ( music ... etc)\n\nbasically gave this game a lot of chances.\nbeen playing since day 1.\ni still log back on once a month to check if the devs have actually taken our opinions into consideration.\nwould still see that they did not.\nwill come back next month again", "timestamp_created": 1529261410, "timestamp_updated": 1529261410, "voted_up": false, "votes_up": 70, "votes_funny": 4, "weighted_vote_score": "0.747134685516357422", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "34526181": {"recommendationid": "34526181", "author": {"steamid": "76561198024434983", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 2661, "playtime_last_two_weeks": 0, "playtime_at_review": 2635, "last_played": 1504012528}, "language": "english", "review": "Tree of life or should I call it Tree of lies? Dont let the cute little characters fool you in the video above how they enjoy the game on their fast mounts and feed their little animal. You will see none of that, the reason is if you go to sleep some determined ***hole will eat himself into your base kill your hardly collected animals and steal all your stuff that you couldnt get in your inventory. There is almost no consequence in killing players or being a criminal someone might set a bounty on you , so what?They dont care they keep coming until they make this game unenjoyable to you.  The video above did not show the dissapointment I felt over the losing of my stuff and getting murdered in in my own base. The video above is a lie oh and did I mention its a pay 2 win game? You can buy a mount for 20 euros (it costs more than whole ****ing game)  that runs really fast so the endless grinding you are doing is a lot faster and since you level up faster you get really strong a lot faster than those poor guys who are only on feet. And since they are already stronger than you they will not give you a chance to have a mount or lvl up your ranching skill because they will destroy/kill what they cannot take from you. I havent been so dissapointed since No man's sky great job developers. Do not buy this game until they make some serious changes to it.", "timestamp_created": 1503829466, "timestamp_updated": 1503829466, "voted_up": false, "votes_up": 67, "votes_funny": 0, "weighted_vote_score": "0.746700525283813477", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "35240772": {"recommendationid": "35240772", "author": {"steamid": "76561198026817091", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 7423, "playtime_last_two_weeks": 0, "playtime_at_review": 7423, "last_played": 1464099981}, "language": "english", "review": "Do not buy this game.\n\nDevelopers are liers.\n\nEverything you see on the trailer stays in the trailer.\n\nAll they did for long early access was sell DLC and try new system they wanted, NOT what users wanted.\n\n", "timestamp_created": 1506515605, "timestamp_updated": 1506515605, "voted_up": false, "votes_up": 76, "votes_funny": 0, "weighted_vote_score": "0.744804441928863525", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "35499536": {"recommendationid": "35499536", "author": {"steamid": "76561198139810362", "num_games_owned": 0, "num_reviews": 28, "playtime_forever": 2684, "playtime_last_two_weeks": 0, "playtime_at_review": 2684, "last_played": 1466290844}, "language": "english", "review": "No, although the game sounds cool and nifty and the graphics is easy to the eyes, the community is shit prob even below that, you either get attacked by already large clans or join super edgy children that makes you want to \"not\" have children of your own, I'll say this again do not buy, its crap.", "timestamp_created": 1507222461, "timestamp_updated": 1507222461, "voted_up": false, "votes_up": 54, "votes_funny": 12, "weighted_vote_score": "0.742130517959594727", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "32282705": {"recommendationid": "32282705", "author": {"steamid": "76561198060325578", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 4454, "playtime_last_two_weeks": 0, "playtime_at_review": 4053, "last_played": 1510612081}, "language": "english", "review": "This is definitely one of those games you need a group of people to play with. YOU HAVE TO HAVE ONE. I mean you can't be  Kirito in SAO on this, you'll leave really quick at seeing how deserted it looks. They messed it up pretty bad. Unless you have a group of people to play it with, I wouldn't recommend it.", "timestamp_created": 1496981156, "timestamp_updated": 1496981156, "voted_up": false, "votes_up": 60, "votes_funny": 4, "weighted_vote_score": "0.741357684135437012", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "34316157": {"recommendationid": "34316157", "author": {"steamid": "76561198005338928", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 9, "playtime_last_two_weeks": 0, "playtime_at_review": 9, "last_played": 1503007675}, "language": "english", "review": "Game supports in-game purchases for power.", "timestamp_created": 1503007794, "timestamp_updated": 1503007794, "voted_up": false, "votes_up": 199, "votes_funny": 2, "weighted_vote_score": "0.739309966564178467", "comment_count": 24, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "35891404": {"recommendationid": "35891404", "author": {"steamid": "76561198040662730", "num_games_owned": 369, "num_reviews": 33, "playtime_forever": 27345, "playtime_last_two_weeks": 0, "playtime_at_review": 27329, "last_played": 1590581591}, "language": "english", "review": "I really want to love this game. I just dont think it was ready for release as it's very buggy. There are also a lot of exploits and cheating happening with few repurcussions from the developers. \nThe population a few weeks after release is very low. \n\nThe store page makes it looks like it's PvP optional. It is not. The entire map is PvP, meaning even in the starter area a max level enemy can pop and kill you as you spawn in the world. Even if one chooses to stay in the relative protection of the starter area with a max level camp, it can be invaded and destroyed. \n\nThis is a brutal PvP game, so if you're looking to avoid that and focus on PvE just buy another game.", "timestamp_created": 1508592851, "timestamp_updated": 1508592851, "voted_up": false, "votes_up": 43, "votes_funny": 1, "weighted_vote_score": "0.737737953662872314", "comment_count": 1, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "40605899": {"recommendationid": "40605899", "author": {"steamid": "76561198014741924", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 2378, "playtime_last_two_weeks": 0, "playtime_at_review": 2378, "last_played": 1520122917}, "language": "english", "review": "After ~level20 tech nothing to do\n\nDON'T BUY THIS \nTo play normaly you need to buy some staff ingame shop, x10 more then game cost. Without mount and backback you will cry, every day, every night.\nThe vehicles I created and the backpacks break down and quickly, premium mount and backpacks are immortal.\n\n99.99% space is empty, nothing to do. \n\n\nIf you need intersting sanbox - buy something different. Please.\n\n\nBorring sandbox 10/10\nMoney to the wind 10/10\n\n", "timestamp_created": 1520339248, "timestamp_updated": 1520339248, "voted_up": false, "votes_up": 33, "votes_funny": 4, "weighted_vote_score": "0.737209856510162354", "comment_count": 11, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "39048304": {"recommendationid": "39048304", "author": {"steamid": "76561198050422859", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 68417, "playtime_last_two_weeks": 0, "playtime_at_review": 5060, "last_played": 1604540455}, "language": "english", "review": "Fairly new player with about 60 hours in the game.  I'm not sure why all the negative reviews really because been playing the game about 5 days and having a blast.  If you know survival games then you know there is always a grind.  This is a bit more grindy than some but less than others.  It has a pretty good progression system for skills if IMHO a bit limited in how you distribute them but seems like the CM's in the community care about players feedback and they have a very active discord.\n\nI would say if you like more PvE than PvP the game in the current state is for you.  There is PvP but it seems pretty light because there are new player area's to help players get started.  New changes are making the game better all the time and instead of just blasting a negative review about things you don't like as in any true community you should take your concerns to the Dev's and see how receptive they are to change.  Noone wants their game to be a failure but the community should help developers realize their vision.\n\nThanks for a very solid game if you ask me it has huge potential...not that anyone is asking me...but my 2 cents anyway...", "timestamp_created": 1515072712, "timestamp_updated": 1515072712, "voted_up": true, "votes_up": 31, "votes_funny": 3, "weighted_vote_score": "0.7364235520362854", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "34991755": {"recommendationid": "34991755", "author": {"steamid": "76561197994447796", "num_games_owned": 1061, "num_reviews": 8, "playtime_forever": 6387, "playtime_last_two_weeks": 0, "playtime_at_review": 6319, "last_played": 1512304972}, "language": "english", "review": "Tree of Life looks like a casual sandbox RPG game with faction wars and base building. However, that's only how the game advertises itself. In reality, it is a game caters and rewards hardcore players who join large groups while inadvertently punishing guilds in small numbers (3 or fewer). The game revolves around constant deterioration of equipment and supplies, in addition to a mandatory tax that is paid weekly in real time, which makes it too time consuming for solo/duo players to keep up.\n\nThe game provides 21 skills (called masteries) to gain up to 50 levels in, while allowing 320 total levels spread between economic (living) and combat. This means you can max out 6 skills only and combat will require you to level 2-3 of these skills, leaving you 3-4 economic skills to choose to max out. While this sounds like a great thing to encourage interaction and a living community, it means soloing/duoing is essentially impossible. Arrow/Cannon towers require carpentry to build and blacksmithing/tinkering to maintain. Your armour and weapons will require blacksmithing, tailoring, and tinkering. Those skills alone means solo players will have zero combat skills if they wish to build their base, and that means they can not kill the enemies required to get the materials.\n\nWeapons and armor constantly break, which is a good thing to keep the economy moving. However, because they break so often and quickly, you will likely go through 2-3 weapons in the process of gathering materials to make another 5, not including any hits you take to your armor and bags. Armor is difficult to maintain and you usually can only afford to maintain the lower level suits, and sometimes not even those. As you level up to higher levels, you will be able to maintain them  better and longer, but will still find yourself farming 5-6 hours to counter maintenance in order to have 2 hours of actual fun playtime.\n\nThere are three factions that you choose from when making your character. These factions can attack other factions, but can't attack their own. There is a faction chat in game, but even on the American server it is usually dominated by French or Chinese and getting a response to a question or discussion in English is actually a very rare thing. If you're a small guild or group, don't expect to  rely on help from others in Faction chat as they likely will not understand you, or you will not understand them.\n\nThe game has a heavy advantage to those who are willing to pay for in-game items in the premium store. $25 will get you a mount that you never need to maintain other than feed. You can get a mount in game, however it will not have the built-in light source that premium mounts come with and will die after a set number of uses, forcing you to gather materials for another one. If you're not a rancher player, then you will never make your own mounts. Bags can be purchased for $10-15 and provide extra inventory space that doesn't break. Bags crafted in game will degrade just like armor and weapons. What makes this dangerous is if one breaks while holding items, all of the items spill out. This is not a concern for the player who pays real cash.\n\nOverall, Tree of Life is not a game I can recommend. I have put in a great number of hours hoping the game would get better as many online games do. Sadly, there is no end game and the grind never changes.", "timestamp_created": 1505552907, "timestamp_updated": 1505552907, "voted_up": false, "votes_up": 44, "votes_funny": 0, "weighted_vote_score": "0.734442651271820068", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "34357890": {"recommendationid": "34357890", "author": {"steamid": "76561198078482606", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 25787, "playtime_last_two_weeks": 0, "playtime_at_review": 25644, "last_played": 1504197761}, "language": "english", "review": "This game was buggy but tons of fun when it first released into Early Release... The nights were filled with danger and DARK forcing players to hudle around Campfires for the 5 or 10 minutes that it was night and talk and get to know each other. There was no World wide chat even for Guilds so you were forced to communicate in person to find out about the wars and adventures down south since we had settled in the north. Because Nights were so dark trips down south felt like massive adventures. You had better hope there was a friendly Guild who had set up shop along your path that you could hangout with for the night. It wasn't uncommon to meet traders traveling around selling their wares and bringing news of some massive Guild Invasion they had just witnessed. Your surrounding Guilds were your community. Guilds watched out for each other and brought word of Raiding Parties that were entering the area. At that point it was time to mobilize your surrounding Guilds and start community patrols. The wars were huge and required knowing the game including the little bugs that you could take advantage of in order to get the upper hand... Some wars even required a little Environmental Terrorism to finally win. \n\nThose were the fun days though. With the official release of the game however there is no fun to be had. The charm of the game has been lost. This release brought many changes alot possitive and my guild was really excited when we first got in and started seeing the changes... Then came the warden tree and the small ugly bases it now forces. All Creative freedom the game once had has now been elimenated in it's place boxes or diamonds are forced on everyone. That would have been ok if you got a decent number of additional walls with each Tree upgrade. However your stuck with 5 additional walls with each upgrade. The Upgrades are time consuming and expensive even for the largest of guilds. Taking days just to find the materials you need and then the 10 Silver for the first upgrade. All this work for 5 additional walls which isn't even to construct an airlock on your base. Base defenses aren't much better... You get 2 Watch Towers with the intial Warden Tree and then an additional Watch tower with every upgrade. Won't do much against a full on assault... \n\nAs much as I love this game and have had so much fun in it prior to this release I can't possible recommend this game in the condition it's currently in. Really sucks because this was the developer's final chance to have this game succeed. RIP Tree of Life! It's been fun!", "timestamp_created": 1503172225, "timestamp_updated": 1503172225, "voted_up": false, "votes_up": 59, "votes_funny": 1, "weighted_vote_score": "0.733940422534942627", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23217439": {"recommendationid": "23217439", "author": {"steamid": "76561198006573232", "num_games_owned": 0, "num_reviews": 54, "playtime_forever": 5139, "playtime_last_two_weeks": 0, "playtime_at_review": 5079, "last_played": 1463890360}, "language": "english", "review": "The crafting system is moderately fun but extremely grindy in typical eastern mmo fashion. Unfortunately, anything fun or interesting about the game is overshadowed by the fact that the game appears to have been designed foremost to make griefing as easy as possible. Anything and everything you build can and probably will be destroyed by some random person for no reason other than, \"they can\".", "timestamp_created": 1464267502, "timestamp_updated": 1464268065, "voted_up": false, "votes_up": 59, "votes_funny": 6, "weighted_vote_score": "0.73090749979019165", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "16110305": {"recommendationid": "16110305", "author": {"steamid": "76561198075701885", "num_games_owned": 284, "num_reviews": 1, "playtime_forever": 1715, "playtime_last_two_weeks": 0, "playtime_at_review": 1594, "last_played": 1434701984}, "language": "english", "review": "TL;DR: This game has a ton of potential but needs some serious work. My recommendation is to wait at least a couple of months.\n\nI don't believe I can recommend this product at this time. Perhaps, after a couple more months of patching and refining, I will be able to change my rating, but there is a lot to be done before then. Let me be perfectly honest here, I enjoyed this game thoroughly, for a while, at least. The following is my specific tale in this game so far:\n\nThe beginning of my play through started with me wandering one of the starter isles in the pitch black of night, bumping into murderously slap-happy zombies and skeletons. Armed only with my karate pokes of justice, I quickly learned that fleeing was the best strategy. One of my friends soon arrived on a stolen bull with a saddle and soon led me to a nearby encampment where i could steal one for myself. Now riding our trusty beeves, we rode off into the wilds looking for this base my friend assured me was safe for us.\n\nWe crossed many different terrains on our way to the promised lands, from mesas to geyser fields to forests to crevasses, the land certainly wasn't the same looking for very long. It is at this time that I encountered the first of many bugs: My friend started randomly and rapidly taking damage whilst riding his trusty mobile steak platform and soon died. He dropped all of his stuff and became a spooky ghosty. This was no big deal at that moment because there was no one else around to steal any of his stuff so he quickly repossessed his now slightly used corpse and we continued on our journey.\n\nWe finally reached the base after about 45 minutes of travelling in circles and around hills, mostly because my friend relied on his memory to guide us instead of the coordinates he had copied down. They welcomed us fully into their guild and we had a place to rest at last. We quickly started working for our keep in our own ways: I was a tree puncher and log hauler, while my friend worked on his tinkering and rapidly became the resident Batman, what with his useful gadgets that he whipped out like locks for houses and lanterns.\n\nNight descends rapidly and rather frequently in this game, and it gets dark. As my least favorite Pyromancer in Game of Thrones says: \"The Night is dark and full of Terrors.\" Zombies and skeletons are attracted to settlements and bases; the larger the base, the more they attack and it wasn't long before houses started to collapse from the undead onslaught. We would fight off the invaders as best we could, but the night is so dark and the torches so nearly useless at actually illuminating the surrounding area, we were usually too late to save anything. \n\nNow there is a way to repair in this game, but that brings us to a significant problem in this game: Very poorly translated tool tips that offer no real insight into what an item does. Now, some items are rather self-explanatory, fishing rods allow the catching of fish and swords are for filleting the creatures of the night, but others are just a mystery. For example, hostile mobs drop bronze coins. These coins are not used for a currency system or bartering. Instead, you take these coins and place them on a damaged building and then just hammer them into the side of it. This has the magical effect of repairing the building... somehow. The description on the coins did not point to this, indeed, the only thing I could make out about them is that they \"have goblin face\" on them. Another hilarious mistranslation would be the lumber mill. I believe that it is called the \"Snow-Shredder.\" Because wood chips fall like snowflakes I suppose?\n\nAnd then there is the raiding aspect of the game. At this point in time, I see no reason to do much in the way of hard work when you can either steal all you need, or just have your stuff stolen. Yes there are locks in the game, however you can also pick those locks. If your big stuff like cabins or walls gets destroyed, you have a 24 hour grace period to repair it before it disappears, but most of the planning buildings and tables don't get this grace period and are flat out destroyed. People can parkour over walls and steal stuff inside the encampment, including mounts. You can also loot while mounted and be impossible to stop, since you cannot fight on the back of a mount and the only way to catch someone on a mount is to be mounted yourself, so you are kind of at an impasse, except the other guy has all your stuff.\n\nThings like this kill the fun factor of this game for me. Why should I work hard at something when the next time I log on, my fields have been torched and all my livestock butchered? When our walls are dust and our resources drained?\nIf you are a marauder, this will probably be a dream game for you. Rapid, unpredictable attacks on resource rich areas on the back of meals on wheels will make you the richest in the land, until someone steals that from you in turn.\n\nI suppose, what I'm finally getting at is this: This game has some amazing potential and I am prepared to love it to death, if only it gets more polish on it, someone hires a proper translator, and a serious look is taken at the crime system.", "timestamp_created": 1433129740, "timestamp_updated": 1433129740, "voted_up": false, "votes_up": 167, "votes_funny": 26, "weighted_vote_score": "0.730438411235809326", "comment_count": 13, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "34527875": {"recommendationid": "34527875", "author": {"steamid": "76561198016178447", "num_games_owned": 56, "num_reviews": 34, "playtime_forever": 3268, "playtime_last_two_weeks": 0, "playtime_at_review": 3110, "last_played": 1521554955}, "language": "english", "review": "1. Those who starts early has a clear advantage over you.(needs more server resets!)\n2. There are people who has multiple accounts, who joins ur guild with one account, takes out ur arrows from towers as recruit! and then the guild gets raided by main account.\n3. You shouldnt be able to start a guild as 1 person, there is literally over thousands of guilds with only 1 person in it!\n4. Every crafting skill needs some wood, but u dont get too much wood when nobody plants the trees back!\n5. The animals gets tamed ny someone who is on otherside of the map and never sees the animal again.\n6. The monsters are close to eachother and you are often forced to fight a bundle alone\n7. Its clearly not pay to win, but those who pay, get a huge huge advantage, because u can log out with all your stuff so u \n    cant get raided.\n8. People wont trust u, so u wont get a guild, and if u do they will tell u to work for them otherwise u get kicked.\n9. Armor gets worn down too fast! and it takes too much work to craft them compared to use time.\n10. Map is really really bad, literally cant see anything on the map except guilds and colors(mountains and sea is what u can see for the most part)\n11. This game has huge potential, graphics is good. but need to make changes ASAP otherwise it will be a dead game in few months, already low player base!\n\n\nEdit:20.Mars.18\ndownloaded the game to give it a new chancce. sadly there is not a single soul left on EU server. please dont buy this game, unless u are going to play with friends, in that case beware if a faction is full u might not be able to join it as a full group maybe only 2/3 can join it :(", "timestamp_created": 1503835105, "timestamp_updated": 1521555134, "voted_up": false, "votes_up": 91, "votes_funny": 3, "weighted_vote_score": "0.729469478130340576", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "38134924": {"recommendationid": "38134924", "author": {"steamid": "76561198122776789", "num_games_owned": 90, "num_reviews": 10, "playtime_forever": 212, "playtime_last_two_weeks": 0, "playtime_at_review": 206, "last_played": 1489876657}, "language": "english", "review": "Do not bother with this game it has an overcrowded starter area and if you try to get away from it or you venture into the world, a high level player will come along and destroy everything you took so long to build up.", "timestamp_created": 1512671071, "timestamp_updated": 1512671071, "voted_up": false, "votes_up": 50, "votes_funny": 2, "weighted_vote_score": "0.728448867797851563", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "34363563": {"recommendationid": "34363563", "author": {"steamid": "76561198097656388", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 478, "playtime_last_two_weeks": 0, "playtime_at_review": 478, "last_played": 1503117175}, "language": "english", "review": "At first glance, this looked like a very interesting MMORPG with a sort of cartoon like feel similar to WildStar. The reality was a great deal different. \n\nFirst, you're competing with a great many people for resources. There are no chests to be created like in MineCraft, and instead there are survival tents. Which some people see as fair game to raid while you're off trying to grind those same resources to actually do anything. Eventually, you can make a Warden Tree, but it can only be planted if you're in a guild as it, along with survey stakes, will mark out a territory for your guild which will actually prevent anyone from taking your stuff - for seven days. Then you have to pay a 6 silver fee (which seems to be the equivalent of 600 copper, but I could be wrong since I never reached the silver coins) to extend that protection. Not good nor fun if you want to play solo, and it reminds me a great deal of just a fancier version of the Empire app games where you have to keep shelling out money to protect your stuff or you get wiped out by one of the bigger empires out there. I had people going through my stuff while I was right there working on various other things, taking my hard won resources.\n\nThere were a few people willing to help, but the TUtorial video was no help at all in how to do some basic things, like enter the chat room to ask questions of those more familiar with the game or that the survey stakes had to be as close together as possible to actually activate the \"Territory\" setting. Definitely would only recomend it to anyone who enjoys those Empire app games, but for an MMORPG experience, it falls flat.", "timestamp_created": 1503195741, "timestamp_updated": 1503195741, "voted_up": false, "votes_up": 60, "votes_funny": 3, "weighted_vote_score": "0.725258350372314453", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "16052099": {"recommendationid": "16052099", "author": {"steamid": "76561198031960795", "num_games_owned": 262, "num_reviews": 9, "playtime_forever": 2130, "playtime_last_two_weeks": 0, "playtime_at_review": 1920, "last_played": 1433202787}, "language": "english", "review": "Howdy!\n\nFirst off, I'd like to say this is a great game if you're playing with a group of people.\nI have recruited and played with 30+ people, and all of them are nice guys, none of them are trolls, and they're all really friendly.\nI cannot take part in how hard this game would be in the absence of good people, but I can tell you about the game mechanics themselves.\n\nThe Bad:\n\n-Translations are HORRID. It's painful to read through the itemnames and descriptions. It's easy to see what the items are, but its still painful.\n-You can walk up 75 degree cliffs.\n-Trolls and greifers are existent. It's a sandbox MMO, and early access at that, so it's inevitable. But tolerable.\n-Crafting is a GRIND! But not intolerably so.\n-There needs to be more early storage options. Chests and whatnot.\n\nThe Good:\n\nNow for the good parts!\n\n-Music is AMAZING. Feels like your playing harvest moon the whole time, and doesn't feel repetitive.\n-The PvP, in my opinion, is spot on. While a lot of people are complaining about it, it's not as big a deal as they are making it out to be. It is annoying to die, but you only lose one item.\nIf you're of average intelligence, you won't be baited into turning yourself into pvp-flagged.\n-Crafting feels USEFUL.\n\n\nIt's a great game if your playing with people, but I can tell that it would be a giant pain in the arse to play alone.\nDon't buy this game if you get irritated quickly, can't relax, or take the time to enjoy the little things.", "timestamp_created": 1432884972, "timestamp_updated": 1432884972, "voted_up": true, "votes_up": 35, "votes_funny": 2, "weighted_vote_score": "0.721074283123016357", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "34985361": {"recommendationid": "34985361", "author": {"steamid": "76561198002552553", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 28210, "playtime_last_two_weeks": 0, "playtime_at_review": 27915, "last_played": 1532234891}, "language": "english", "review": "Anyone would classify this game as \"Beta.\" It's CLEARLY unfinished:\n\nIt has lots of bugs.\nIt has severe design flaws.\nIt was severe balance issues.\nThere is absolutely zero PvE endgame.\nThat video you see? No. Just... no. There is no treasure chest to find. Fish people don't attack your base. There are no musical instraments. Even if you slow down that building speed to normal, you STILL can't build anywhere near that fast.\n\nDo you have feedback? So did we. 2 years of it, to be exact. They ignored all of it until \"fit hit the shan.\" Faction locks preventing friends from playing together is a \"high priority\" now. We warned them of this situation a year ago.\n\n\"Be patient\" is just condescending at this point.\n\nI posted the above on September 15th, 2017. Today is March 14th, 2018. There's a post on the forum complaining about faction locks. In case you are wondering about how fast \"high priority\" is.", "timestamp_created": 1505526735, "timestamp_updated": 1521064589, "voted_up": false, "votes_up": 46, "votes_funny": 1, "weighted_vote_score": "0.720988571643829346", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "22501715": {"recommendationid": "22501715", "author": {"steamid": "76561198002558331", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 5620, "playtime_last_two_weeks": 0, "playtime_at_review": 3553, "last_played": 1463152792}, "language": "english", "review": "The game is unfinish and still got some problems. But i still able to have fun because there are many helpful and kind player in the game.\n\nYou will like this game if :\n1. Love to play as a part of a community\n2. Enjoy building, crafting and farming game\n3. Seeking community driven sandbox MMO\n\nIf 1, 2 and 3 are your thing, but prefer PVP more than PVE, Life is Feudal is better for you than this game.\n", "timestamp_created": 1460999177, "timestamp_updated": 1460999177, "voted_up": true, "votes_up": 51, "votes_funny": 4, "weighted_vote_score": "0.719120681285858154", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "31031823": {"recommendationid": "31031823", "author": {"steamid": "76561198125101900", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 13157, "playtime_last_two_weeks": 0, "playtime_at_review": 12981, "last_played": 1476654282}, "language": "english", "review": "Where do I start?\n\n  I bought the game awhile ago. Yes, it was very grindy back then, & yes, it still took awhile to build up, but what game isn't? It was also just as cramped back then, but that can't be helped. The devs, however, made sure to kill the game after their last few changes. \n\n> you can't build where you want anymore; you have to pay in game currency for land taxes, and that limits you to a small plot of land - while this was a move to attempt to reduce clutter, it took away the freedom that made TOL the game I fell in love with. I met close friends, I LOVED logging in. I eventually strated dreading it, & just gave up. It's not that fun anymore.\n\n> The NA servers are riddled with people who.....AREN'T FROM ANY PART OF NA\n> The mounts, while fun, are far too expensive for how fast they actually are.\n\n\nIn conclusion, the game itself has some fun points. The resources, the mobs, it's all part of a cute, fun game. However, until the DEVS stop F*CKING with a perfectly good game, I don't recommend playing it at this time.\n\nHopefully this review doesn't get me banned, as it appears others have been for theirs. Oh well.", "timestamp_created": 1491710701, "timestamp_updated": 1491710792, "voted_up": false, "votes_up": 54, "votes_funny": 1, "weighted_vote_score": "0.714383542537689209", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "40766491": {"recommendationid": "40766491", "author": {"steamid": "76561198072179334", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 4319, "playtime_last_two_weeks": 0, "playtime_at_review": 4031, "last_played": 1517284894}, "language": "english", "review": "I'll keep this short. The game is fun to play at first, but as time progresses, you realize how grindy it is. It isn't possible to play solo and they mandate working together; which is fine, but the population is dwindling so working together is challenging to do. The 30 day average population is around 144 people, which is small when spread out over 3 different factions. \n\nThe game had a lot of potential, but they seem to be short on development hours to make it what it needs to be and have abandoned older features due to them being broken.", "timestamp_created": 1520867181, "timestamp_updated": 1520867181, "voted_up": false, "votes_up": 27, "votes_funny": 0, "weighted_vote_score": "0.713106691837310791", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23485193": {"recommendationid": "23485193", "author": {"steamid": "76561197967856388", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 56307, "playtime_last_two_weeks": 0, "playtime_at_review": 42290, "last_played": 1503532867}, "language": "english", "review": "[h1][b] Edit 5/5/2019:  It's finally come to light proof that the sale of this game is a scam/money grab by Oddone to continue to get resources for other games.  They are no longer providing support or updates to the community.  Many people can't even play the game because it's so incomplete that it will not launch.  Sorry, but it's over. [/b] [/h1]\n\n**Edit 10/24: The preview content videos and pictures are somewhat out of date and do not represent all available game play.  Buyer beware**\n\nEdit: 4/4/17:  I was banned from the discussion forums for my negative opinion.  \"Obstructing Business\" was the reason.  I gave my opinion that the game is not in a positive place and that I cannot encourage anyone to purchase the game right now.  Suspicious.\n\nEdit: 4/29/17:  I finally heard back via Email regarding my forum ban asking for my steam account.  I provided the information but have not had action or response from them in several days.  I also made some edits to my review based on the current system.\n\n[i][b]I'm pretty sure some people are just blindly downvoting this honest review [/b][/i]\n\n[h1][b][u]*****DISCLAIMER*****[/u][/b][/h1]\n[i][b]I will edit this review as changes to the game are made.  My current opinion is neutral, however that is not a recommendation option, so I currently opted for a thumbs down. [/b] [/i]\n\nThis game has its ups and downs.  I do support the game however I do not recommend this game for everyone.  Currently my opinions reflect the most recent milestones post by the Dev, which changes the direction of the game completely.  I understand this is early access [b][url=http://steamcharts.com/app/361800#All]however the community is currently dwindling (click here)[/url][/b]\n\n[h1]Pros[/h1]\n[list]\n[*]They said they will be removing the PvE faction so that way people will not be able to exploit the PvP system.\n[*][strike]Building system is great for a sandbox, and will only get better.[/strike] \n[*]The ability to spec into several professions is awesome.\n[*]Dynamic tree planting/regrowth/creep/terraforming is awesome (We turned the desert into a forest temporarily)\n[*][strike]Guild Territories surrounding your structures[/strike]\n[*][strike]Creative / Strategic players can make stronghold bases that are not easily penetrable.[/strike]\n[*]Has a tendency to have a very dedicated and outspoken community\n[/list]\n\n[h1]Cons[/h1]\n[list]\n[*]Community is all but dead.  Devs are no longer responding to community\n[*]You can only make a cookie cutter style base.\n[*]You really cannot expand your guild territory.  Being strong is is limited.\n[*]They have since changed the building structure to a \"Warden Tree\" that you have to build around.  You cannot build in the open world.\n[*]Lag / DSync / Exploiting is rampant - In terms of live PvP the netcode is terrible and unplayable.  \n[*]The devs have repeatedly promised things and when they don't meet the deadline, they simply ignore the community.\n[*]There is a fog/mist covering about 75% of the map right now.  You can get about 2 weeks of content in this game before you hit a plateau and or brick wall.\n[*]You pretty much need to be in a big guild in order to accomplish much in the game.\n[*]Only one character per account\n[*]The devs advertise 24 fully created classes however only 22 are active, and the rest are not even fully functional.\n[*]Updates are few and far between compared to many active Early Access games.\n[*]The Communication from the Dev team is horrible.  [strike]They put all of the communication on one person (OddAlice) who has nice intentions,[/strike] however several players have been offended by poor translations that come off as culturally inappropriate.\n[*]The communication from the Dev team temporarily improved with the addition of OddBearHug to the Services team.  He has since begun banning people for giving negative reviews of the game.  He also does not follow up on communication.  He is very unpopular in the community and is only causing the game to have more of a negative view.\n[*]Let me reiterate communication between the community and devs is an issue.\n[*]They say your opinion matters, however you would rarely know.  \n[*]There is a split in the community between hardcore PvPers and Passive players.  (I suppose this will be fixed with the alliance update\n[*]The cash shop is stupid expensive.\n[/list]\n\n\nAll in all, I have enjoyed my time playing this game.  The politics required to get yourself and your guild anywhere get exhausting after a while, but I suppose some changes expected down the road might help.  There seems to be a huge social/cultural split between English speakers / Brazilians / Russians / Chinese which makes several people uncomfortable when they can't get into a guild because of their country.  There is a lot of raw human nature you will become aware of in this game that people feel uncomfortable with because there is a real lack of direction when it comes to social interaction.  There is not a large griefer/racist community, however that is what the PvP/Cultural split might be referred to.  It is not an easy game to play, and it is easy to pass blame onto the PvP/Racist reasoning.\n\n I promise you the game is great if you have the patience   [u][b]If you catch the game on sale get it.  Do not buy this at full price.[/b][/u]", "timestamp_created": 1465569236, "timestamp_updated": 1557061087, "voted_up": false, "votes_up": 73, "votes_funny": 3, "weighted_vote_score": "0.711733758449554443", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "16110277": {"recommendationid": "16110277", "author": {"steamid": "76561198019587551", "num_games_owned": 137, "num_reviews": 2, "playtime_forever": 6205, "playtime_last_two_weeks": 0, "playtime_at_review": 5928, "last_played": 1482178486}, "language": "english", "review": "So, first off. This game has its issues, but it's pretty fantastic. The game is a bit grindy, seeing as it's Korean in origin, that didn't surprise me right off the bat. What did surprise me was an incredible early access game, that has had me playing for nearly 6-7+ hours a day since the minute I added it to my Steam Library. The game, at first glance, seems typical of most survival type early access games currently on the market, and you would think the only difference is it's choice in art style, well.. that's not quite the case. This game, is relatively similar to other survival games (ie. Build a base, sustain it, defend it, pvp, raid, etc.) but, it has some great RPG elements, like actual leveling up, hard stats such as INT, STR, DEX and CONS that most of us RPG players are used to. The game has a kind of Runescape mixed with Rust type of vibe to it, it seems very open ended with no short of things to do and I personally love it. The dev team for the game is small but dedicated, and I'm excited to see where this game goes.", "timestamp_created": 1433129528, "timestamp_updated": 1433129675, "voted_up": true, "votes_up": 31, "votes_funny": 0, "weighted_vote_score": "0.711098194122314453", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "34320875": {"recommendationid": "34320875", "author": {"steamid": "76561198044758616", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 15, "playtime_last_two_weeks": 0, "playtime_at_review": 15, "last_played": 1503030691}, "language": "english", "review": "So choppy and pay to win. I didnt need more than 30 mins to feel like I purchased a browser game. No thank you.\n\nEdit. 9/6/17\nTo some, games where mechanics like speed can be seen as p2w. just an opinion, no need to get salty at a review, they are opinions. I didn't need more than 15 mins to decide that they game felt really cheap, choppy, and I was frankly in a hurry to not pass the 1 hour mark so I could get a refund. The advert videos for this game were misleading to me in the fact that Imy experience in game play was different. My frames bounced all over. I also had random crashes, of which i'm ok with I dont have some 3k gaming system, game looked cool with interesting and fun graphics, but I found it lacking in UI, controls, gameplay.", "timestamp_created": 1503031124, "timestamp_updated": 1504728271, "voted_up": false, "votes_up": 150, "votes_funny": 2, "weighted_vote_score": "0.710180819034576416", "comment_count": 11, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "39614128": {"recommendationid": "39614128", "author": {"steamid": "76561198199862427", "num_games_owned": 208, "num_reviews": 14, "playtime_forever": 3319, "playtime_last_two_weeks": 0, "playtime_at_review": 2513, "last_played": 1578402765}, "language": "english", "review": "❤ Audience :\n\n☐ Kids\n☑ Everyone\n☐ Casual players\n☐ Pro players\n\n☼ Graphics :\n\n☐ Potato\n☐ Really bad\n☐ Bad\n☐ OK\n☑ Good \n☐ Beautiful (with few mods)\n☐ Masterpiece\n\n€ Price / quality : \n\n☐ Full price\n☑ Wait for sale\n☐ Average\n☐ Refund it if you can\n☐ Dont do it\n\n€ Requirments :\n\n☐ 90' PC\n☐ Minimum\n☑ Medium \n☐ Fast\n☐ High end\n☐ NASA computer\n\n☼ Difficulty :\n\n☐ You just need 2 arms \n☑ Ez\n☐ Easy to learn / Hard to master \n☐ Hard (first few hours)\n☐ Dark souls\n\n\n€ Game time\n\n☐ Really short ( 0 - 2 hours)\n☐ Short ( 2 - 8 hours)\n☐ Few hours ( 8 - 12 hours)\n☐ Long ( 12+ hours)\n☑ Endless\n\n@ Story\n☑ It doesnt have\n☐ Still better than Twilight\n☐ Average\n☐ Good\n☐ Fantastic\n\n§ Bugs\n\n☐ Game itself is one big BUG\n☐ Bugs destroying the game\n☑ Lot of bugs\n☐ Few Bugs\n☐ You can use them for speedrun\n☐ Nothing\n\nOthers:\n\nBuy it when its out of early access! \nFunny to play but not good yet\nOverall: 7.0/10", "timestamp_created": 1516911336, "timestamp_updated": 1516911336, "voted_up": true, "votes_up": 61, "votes_funny": 9, "weighted_vote_score": "0.710139870643615723", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "50969452": {"recommendationid": "50969452", "author": {"steamid": "76561198371550930", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 101856, "playtime_last_two_weeks": 0, "playtime_at_review": 87123, "last_played": 1685588040}, "language": "english", "review": "没事乱改什么  不改的话 人都不会走 改了之后这游戏走了％99.9的人  我是亲眼见证游戏的开始 以及火爆 然后堕落 全是你们自己作死 怨不得别人", "timestamp_created": 1559288059, "timestamp_updated": 1559288059, "voted_up": true, "votes_up": 18, "votes_funny": 4, "weighted_vote_score": "0.705491304397583008", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "22803206": {"recommendationid": "22803206", "author": {"steamid": "76561198076650179", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 4091, "playtime_last_two_weeks": 0, "playtime_at_review": 1499, "last_played": 1476674008}, "language": "english", "review": "this game is fun but what bothers me is the outlandish price of its store content the game has been out a month and you already have pay to win objects that cost OVER the price of the game, i dontt mind the whole fact you can start with a mount, amazing bag space sure ok its alil slanted, alittle i mean alot but the price is stupid, you want to put out mounts and bags sure but i think the price needs tto go down by at least 60%", "timestamp_created": 1462408914, "timestamp_updated": 1462408914, "voted_up": false, "votes_up": 37, "votes_funny": 3, "weighted_vote_score": "0.704394817352294922", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "16231258": {"recommendationid": "16231258", "author": {"steamid": "76561197987388969", "num_games_owned": 1737, "num_reviews": 235, "playtime_forever": 544, "playtime_last_two_weeks": 0, "playtime_at_review": 544, "last_played": 1433863610}, "language": "english", "review": "::Disclaimer::\n\nUnlike the hundreds of other reviews before mine, I want to publically state; I am not being paid or sponsored by anyone to write a review. Apparently, previous reviewers have been given copies of the DLC upgrade in exchange for reviews. Just wanted to put it out there, I am not one of them. I write this, because I purchased the game and I felt it important to write a review to educate and inform others of my experience.\n\nImagine, 7 days to die(without zombies), mixed with Minecraft(without the blocky graphics), topped off with Harvest Moon. Yep, that is Tree of Life in a nutshell. It has aspects of all three games, making it fun, addictive, and exciting. A Crafting-Survival game, or at least it should be. The game bills itself as a crafting-survival game in a multiplayer world, where you can work with others to create communities; However, Earlier notices from game developers indicated that PVP would play a small part of the overall experience, but that the game was about crafting and survival and would be largely PVE in nature. This unfortunately, does not appear to be the case with this game.\n\nGrief of Life, or Tree of Grief as it is being billed in some online discussion threads, places you on a very large, open world island, with multiple biomes. where you are pitted against the islands inhabitants, and the strange creatures that emerge from the shadows at night. Build structures for safety as fast as you can, but beware creatures as well as other players can and will bust up your fort. The Game currently utilizes a Criminal Flagging system. Criminal flagging is earned by attacking other players and/or their structures. As a Criminal flagged red, you are unable to approach other cities or player watchtowers without automatically being attacked. Also as a criminal, anyone is free to attack you without reprecussions or negative consequences. Once a red player is killed, their backpack can be looted. Since the Criminal flag lasts a number of realtime minutes/hours, this has led to abuses of the flagging system, where neutral players camp and grief them without any reprecussions, going as far as preventing those characters from materializing after death, because they are instantly killed once they resurrect. Yellow players are neutral, and have the option to be a trolling douche, or not. They can go near player encampments without being attacked, If a yellow tagged player is killed, they do not lose their belongings, but it is always best to stay cautious when around neutral players. Neutral players can also build in and around your cities, limiting where you can build. They are also capable of stealing your crops, and your livestock, as well as anything not bolted down with locks, without any sort of reprecussions. You have no way of removing them from your area, without flagging yourself as a criminal. \n\nIt is still in Alpha testing and there are some bugs, clipping issues etc,  just from the initial experience I've had playing, Tree of Life is definitely a game to look out for as a goto crafting-survival in the future, assuming they are willing to fix some of the major flaws surrounding PVP and Griefing. I saw massive potential with Tree of Life and originally intended on giving it a thumbs up review, because I saw just how much fun the game could be. Unfortunately right now, it appears the game is overrun with a segment of the gaming community who thinks the entire game should be a pvp battleground and wants to change the nature of the game. They are also willing to attack anyone off-game, who disagrees with their interpretation of how the game should be. \n\nThe development team, while initially speaking out against griefing and abusive PVP play, have since remained quiet and appear to be hedging their bets on which way they will take the game in the future. So if you are interested in playing with others on a game where cooperation is encouraged and general douche-baggery is frowned upon, this is currently not the game for you. If you are all about wallowing in a PVP Litterbox and want a game where you can free for all against other players without any serious reprecussions, even to the point of being able to play-obstruct others, in a wild west Douchefest, this game is right up your alley. Unfortuantely, If the game isn't changed to prevent player abuse, or at the very least properly labelled for the PVP Litterbox it is, there will be thousands of people very dissatisfied and disapointed with what could have been the go-to game for crafting-survival sandbox multiplayer game", "timestamp_created": 1433628032, "timestamp_updated": 1433692883, "voted_up": false, "votes_up": 166, "votes_funny": 10, "weighted_vote_score": "0.703465700149536133", "comment_count": 20, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "34663247": {"recommendationid": "34663247", "author": {"steamid": "76561197992616712", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 10219, "playtime_last_two_weeks": 0, "playtime_at_review": 1636, "last_played": 1506443772}, "language": "english", "review": "DISCLAIMER: I don't usually write reviews but after seeing the bad reviews for this game I had to speak up. Scroll down if you just want pros-cons and no detailed story.\n\nAfter reading the reviews for this game I was a bit hesitant to buy, but when I saw it was on sale for like $15.00 I told myself might aswell give it a try and if I don't like it within 2 hours I can always go for a refund.\n\nNeedless to say I passed the 2 hour mark and so far i'm quite impressed, I started the game completely blind I didn't even look at a video for the game. The game is pretty good for explaining things it gives you a makeshift quest tutorial to teach you some basics (you will have to learn a lot on your own it doesn't hold your hand through everything{BUT the community is great and will help if you ask, will explain more later})\n\nI've seen  quite a few people complain about the PVP in the game, which I can understand as it takes a while to set up protections in your base especially if you are alone. BUT just recently last night they added ghosts that protect the noob zones (novice areas) which should help deter any PVP in the starter zones to help new players get a head start SO if you read any previous reviews stating you will get attacked early and wont be able to start that is no longer the case as of today.\n\nAs for the rest of the game, the graphics are pretty decent, the attack system is very OS Runescape which I loved runescape back in the day for its simplicity. \n\nThe thing that I probably like the most about the game is the community, everyone in the community seems to be willing to help, such as this one time I was wandering out to explore the map (which is pretty damn massive) and found a bull and I tamed it but then found out i'd have to carry it home (you move damn slow when you are carrying a large object) I made it about 1/4 of the way back and ran into another faction member who laughed that I was just carrying a cow. He then asked if I wanted a cart (me being new I didn't know you could use a cart to carry large objects such as animals or logs) I said yes and he gave me his cart and I was able to make it back to my base in 1/10 of the time. That is just one instance, i've had only good interactions with other faction members giving me stuff and helping me out.\n\n\nPROS AND CONS\n\nPros \n-Decent price tag\n-Awesome community\n-Simple fighting mechanics (kinda like OS runescape)\n-Market system\n-Cool skill system (some may not like that you can't max every skill but I like it due to you needing others to get other skill items)\n-Guild system (Grab a couple of friends make a guild and build the base together)\n-Protected novice zone to help noobies get started (NEWLY implemented)\n-Can move your entire base from one area to another (I think this is awesome because you can start in the noob zone build a base then move your base as you level up without having to destroy and rebuild)\n\nCONS\n- Cannot repair items? Correct me if i'm wrong but I have not found a way (you can sell broken weapons to the ghost for same price as non broken, kinda odd but whatever)\n- Wish they had a level over monsters to tell if they are gonna kick your butt or not have to walk up and see if they do 1/2 your hp in one hit or do nothing, seems to be a large difference in monsters of the same area\n-Durability of items seems to be relativlely low for my liking\n\n\nOverall it's a pretty awesome game and deserves a try!", "timestamp_created": 1504282028, "timestamp_updated": 1504282028, "voted_up": true, "votes_up": 27, "votes_funny": 2, "weighted_vote_score": "0.702377140522003174", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "34788214": {"recommendationid": "34788214", "author": {"steamid": "76561198140650559", "num_games_owned": 174, "num_reviews": 2, "playtime_forever": 6297, "playtime_last_two_weeks": 0, "playtime_at_review": 6297, "last_played": 1504320673}, "language": "english", "review": "[b]------------------------------------------------------------------------------[/b]\n\nIf you are someone who is willing to grind hard and push past obstacles in order to get value out of their time, buy this game. DO NOT, however, buy this game if you are looking for a peaceful PvE survival experience. You should also make sure that you either:\n\nA. have a well-established group of friends who are willing to all put their fair share of time into the game. \nOR \nB. are willing to join a group of strangers and openly communicate with them.\n\nDoes this apply to you? If so, the review below shouldn't have to influence you anymore. Go ahead and buy it.\n\n[b]------------------------------------------------------------------------------[/b]\n\nTree of Life is a Runescape-esque MMORPG with a heavy emphasis on what sets it apart from its competitors - Clash of Clans style base building and defense in an open factions world. It boasts over 15 different skillpaths, the ability to create \nmassive guilds with up to 30 members, and medieval-style PvP. Overall, my experience with this game has been good, but that doesn't mean I dont have my gripes with it.\n\nThis game is not, will not, and cannot be, without major fundamental changes, a singleplayer PvE game. Though it is technically an option, you're guaranteed to not have fun unless you have less than 80 IQ and enjoy weeks of braindead WORK (not play) plus a hard limit (6 maxed out skills) on what you can do with one character.\n\n[b]IN ORDER FROM BEST ASPECTS TO WORST:[/b]\n\nI experienced this game with a small guild of 4 regular players including me. With each of us taking up different skillpaths and investing similar amounts of time into the game, we had a great deal of fun for about 100 hours, when it got too hardcore even for the few of us seasoned MMORPG players. We were able to organize and participate in a huge raid consisting of players from different guilds, which I consider one of the highlights of my time playing. Moments like these lead me to believe that Tree of Life is a game that strives on large groups / communities. Guilds aren't called guilds for no reason. When you max out yours with 30 people, they feel and work like, well, guilds.\n\nLike every other review on this page says, the game has a great amount of potential. At the moment, I don't see the devs taking any risks while they try to satisfy the community, fresh off the game's 1.0.0 release, but I do believe it's a future possibility. Though many of the people I've talked to have said that the devs are loose cannons, I was able to observe them add guards to the newbie areas after backlash. It seems like a step in the right direction to listen to the playerbase.\n\nSoundtrack is pretty good. It's nutty at times, but it definitely fits the aesthetic and adds positively to the game.\n\nI have no problems with the PvP mechanics. Tree of Life embraces its simplistic, Minecraft-esque combat with just enough aspects to make it interesting. I do have a problem, however, with the weaponskills. Every weapon has a special effect, but in the end they all deal the same damage. Other than that, spears don't even hit enemies and bows do little to no damage at all.\n\nGame progression seems and feels clunky. I can't quite put my finger on why, but I'm guessing it has to do with some skills requiring a disproportionate amount of work compared to others.\n\nConsidering the abnormally high amount of firewood needed to do anything, literally everyone that plays will get their Logging level to 50, which they will, in turn, need. Even after this happens, cutting down trees will still take too long to account for how much wood you require. Logging (and by extension Mining) should simply be removed from the game, instead having trees be affected by how strong your weapon is.\n\nThe game's optimization is terrible. Even though I think the game's graphics are, in their simplicity, refreshing, I do not think that I should be getting 25 FPS in the beginner area with all settings on low on a GTX 765M. The game is not Early Access anymore. There are no excuses.\n\nIf you're an avid MMORPG fan with a good group of friends, or if you're willing to make a few new ones, Tree of Life will definitely pan out to be an interesting and unique experience. Did this game frustrate and bore me at parts? Yes, but they say that negative things impact you two times as much as positive things, and despite that I came out remembering my positive experiences much more vividly.\n\n6/10\n\n[b]------------------------------------------------------------------------------[/b]", "timestamp_created": 1504759676, "timestamp_updated": 1504759687, "voted_up": true, "votes_up": 23, "votes_funny": 2, "weighted_vote_score": "0.700662195682525635", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43414119": {"recommendationid": "43414119", "author": {"steamid": "76561198437731378", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1275, "playtime_last_two_weeks": 0, "playtime_at_review": 1083, "last_played": 1529097194}, "language": "english", "review": "- They lie to players with the video they advertise with.\n- They put the game on sale right before a wipe and have very little info to new players buying the game it will happen.\n- They refuse to communicate.\n- They are trying to replace the current system with one filled with bugs.\n- They have no idea how to plan or prepare for anything.\n- There is no end game content.\n- They led us to believe there would be no wipe while they were working on this \"project\"\n\nRead the reviews and choose wisely if you intend to buy the game.  The wipe is planned for the 16th and if you think its a chance to get on the same footing as players who started in the fall assume you will be disapointed.  They give us no evidence this wont happen again and if you sink 6 months you may just randomly lose it all without notice.", "timestamp_created": 1531103630, "timestamp_updated": 1531103630, "voted_up": false, "votes_up": 24, "votes_funny": 0, "weighted_vote_score": "0.700518608093261719", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "61927043": {"recommendationid": "61927043", "author": {"steamid": "76561198032820142", "num_games_owned": 0, "num_reviews": 48, "playtime_forever": 1196, "playtime_last_two_weeks": 0, "playtime_at_review": 1196, "last_played": 1548742004}, "language": "english", "review": "devs just announced they are going to make a new fucking game instead of updating tree of life, pretty awesome. if you want proof that the game isnt done, you still have a status bar for magic, and the intelligence stat which increases your mana and spell damage, yet THEY NEVER FINISHED ADDING THE MAGIC SYSTEM AND JUST QUIT UPDATING THE GAME AFTER SELLING A MOUNT. THE SHITS BROKEN WHAT THE FUCK BOYS", "timestamp_created": 1579172053, "timestamp_updated": 1579172053, "voted_up": false, "votes_up": 20, "votes_funny": 2, "weighted_vote_score": "0.697672724723815918", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "38477324": {"recommendationid": "38477324", "author": {"steamid": "76561198043954361", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 51298, "playtime_last_two_weeks": 0, "playtime_at_review": 34930, "last_played": 1523464011}, "language": "english", "review": "TL;DR: I would still recommend this game after 500 hours of play. This is not the early access/beta game, alot has changed.  It has a friendly community and requires team play. There are regular bug fixes, patches, and in-game and outside of game events. New content has been slow coming (expected in Jan), but the official release was only 4-5 months ago. There is plenty to do without a new content. \n\nCome join us! There is no monthly subscription, and it is well worth the $14 I paid. \n\n---\n\nThe game is not the same as it was in early access/beta. So don't watch old youtube videos or read wiki articles when deciding to play. I did not play back then, so all of my hours have been since the official release. The game has a very friendly in-game community, which is essential for a game that is so team oriented. \n\nYou must join a guild to succeed in this game or have friends to play with you. The skill system is designed to require team play. This may be a positive or a negative depending on the type of game you are looking to play, but established guilds are always looking for new players to join them. \n\nThere are 3 factions from which to choose, but it has no affect on your character other than where you start the game. You can only master 6-7 skills of the possible 15 main skills and 6 weapons. You start out shipwrecked on an island and begin crafting weapons and building your base/guild - going from stakes and barricades to large castle walls with cannons, arrow towers, and ballistas.  \n\nMany reviews complain about high-level players constantly attacking novice players. It doesn't really happen anymore. It doesn't encourage new players to stay if we beat you down before you get started. If you leave the novice area to build your guild, you will eventually get attacked. PvP is part of this game. If you start out and strategically build you guild in the novice area, you can survive there without being attacked until you are ready to move on.\n\nSome reviews say there have been no game improvements. This just isn't true. Sure there are still lots of things that could be improved upon, but saying we haven't had any fixes is false. Here is a list of things that have occured in the last 2 months:\n\nOctober 25/26: Pumpkin Festival\n     - New skins and festival mount\n     - New permenant mount for purchase\n     - New Game Launcher\n     - New Decorative Crafts using Pieces of Shrubs\n     - Bug fixes.\n\nNov 2: PvP Tournament\n\nNov 9: Patch\n     - Minor changes and bug fixes.\n\nNov 11: Treevia Event\n     - Skin rewards.\n\nNov 23: Patch\n     - Anti-Hack Tool integration \n     - Hidden Tent Event\n\nNov 24: Treevia Event\n     - Skin rewards.\n\nDec 1: Winter Festival\n     - New skins and festival mount\n     - Improved chat features: Whispering and an In-game text translator\n     - Warden Tree system adjustment\n     - Removed undead from novice zones\n     - Fishing, Carpentry, Healing/Bandage adjustments\n     - Increased novice resources\n     - A few new recipes.\n\nDec 9: Robinson’s Odessee Event\n     - Item rewards and a server buff.\n     - A backstory was created through hidden diary entries around the world.\n     - https://drive.google.com/open?id=1NV1ZSqa2SgNSD0cYj1S1NjAT1COm93vn \n\nDec 16: Fishing Contest Event\n\nDec 20/21: Patch\n     - Improved chat features: friend list\n     - Weapon mastery skill adjustments\n     - Bandage/Healing improved\n     - Crops cosmetic change\n     - Bug fixes\n\nI hope this helps some of you decide if the game is for you. It has great potential, and it is steadily getting better every patch. It is a lot of fun building up your guild, mastering your crafts, and exploring the world. Hope to see you exploring Vegonia with us. \n\nCapt Thatch\nAdventure Company\nAmerica Server\n\n\n\n\n\n", "timestamp_created": 1513834723, "timestamp_updated": 1513834723, "voted_up": true, "votes_up": 30, "votes_funny": 1, "weighted_vote_score": "0.695897877216339111", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "16387677": {"recommendationid": "16387677", "author": {"steamid": "76561198120057457", "num_games_owned": 182, "num_reviews": 48, "playtime_forever": 1232, "playtime_last_two_weeks": 0, "playtime_at_review": 1214, "last_played": 1458852197}, "language": "english", "review": "This had overwhelmingly positive reviews, and I was really looking forward to playing. \nIt was a good game. For the first 2 hours. \nThen I realised you have to be online 20 hours of the day to actually make something of yourself.\nThe criminal system is fucked. \nI die randomly by delayed punches from zombies. \nI have to travel across the map to get the one thing i want. \nZombies will destroy whatever fort you've built in just a few hours of not playing. \nThe. Days. Are. Too. Short!\n\n[b]I wouldn't recommend this until they fix.. well, everything. [/b]", "timestamp_created": 1434288359, "timestamp_updated": 1434288359, "voted_up": false, "votes_up": 76, "votes_funny": 5, "weighted_vote_score": "0.69589155912399292", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "36123416": {"recommendationid": "36123416", "author": {"steamid": "76561198106968346", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 22709, "playtime_last_two_weeks": 0, "playtime_at_review": 21843, "last_played": 1583103481}, "language": "english", "review": "too many bugs and exploit the game gets boring and annoying as time passes this game need options for private server or non PVP if they will not try to fix the bugs and exploits", "timestamp_created": 1509309584, "timestamp_updated": 1509309584, "voted_up": false, "votes_up": 34, "votes_funny": 0, "weighted_vote_score": "0.695146262645721436", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43596233": {"recommendationid": "43596233", "author": {"steamid": "76561198042147507", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 19043, "playtime_last_two_weeks": 0, "playtime_at_review": 18764, "last_played": 1535419521}, "language": "english", "review": "Hello World!\n\nMy name is MrBaconaneggs, Known as MadeOutOfBacon, in the realm of Tree of Life. \nI am wonderfully writing this review to save peoples time and hard earned cash.  \nIf you are looking for a game with a Development team with ZERO and I mean ZERO communication then this is the game for you!\n\nIf you are looking for a game with the communication coming from some seperate company that has nothing to do with the Development, and looking to not have your questions answered, then This is the game for you!\n\nIf you are looking at this game because you think this game looks really cool and fun from the Video's and Screenshots, let me save you the time, the videos do not properly display the gameplay, those are back from Alpha around (2 years ago), since then the game has left the Alpha stage, entered the Beta Stage, STILL does not have the features from advert videos, now the game has fully released (almost a year ago?) and now they are doing a complete overhaul and revamp of this game.\n\nBasically TL;DR They fully released the game, and changed every aspect about it so it is no longer the same game, it also only has like 50 players on at the max peak. \n\nThis game has gone from 3000+ active at a time to 50 active at a time in a matter of months, 3 times, over 3 times they have done that, doing relaunches and letting us fall prey to their scheme. \n\nOverall the game was fun back in the day, I had made 5 accounts for the game, 5 Characters, made tons and tons of good friends and people and had fun PvP. But they dun goofed it all, and ruined the game for all the players unfortunately.\n\nStrongly recommend not playing this game unless you are looking to waste time and money.\n\nThe game is a Scheme and a LEMON\n\nThanks!\n\n\nYours Truly,\n\n-MadeOutOfBacon, Breakfast Enthusiast", "timestamp_created": 1531877986, "timestamp_updated": 1602973686, "voted_up": false, "votes_up": 28, "votes_funny": 2, "weighted_vote_score": "0.693019688129425049", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "41387413": {"recommendationid": "41387413", "author": {"steamid": "76561198065311358", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 55981, "playtime_last_two_weeks": 0, "playtime_at_review": 52464, "last_played": 1544638317}, "language": "english", "review": "1. No players/population.\n2. Tapered skill system that requires other skills to master, yet doesnt provide enough skill points to do so. Therefore you cannot have a singular character, but require multiple accounts, in order to master skills.\n3. No game progression, all content that has been added in big updates has been removed due to incompetient conception of the game mechanics, therefore breaking the game, Requiring rollbacks, Wipes. \n4. Zero communication between the developers and the gaming community, they simply want to make \"thier game\".\n5. Countless promises of content, such as magic abilities, and musical which have never been implemented.\n6. Zero PvP aspects other than Zerging and Afk Raiding. \n7. The game focuses on being able to create your own world/content, but rejects any notion of that to players by creating constant barriers to a singular characters development.\n8. The amount of time required to gather resources across a nice and beautiful map, is voided by the fact the items you can make are severely limted and dont provide much use for extended amounts of time. Most people never make it a week, or even get out of the starter zone.\n9. No developer co-operation with developing game content information compilations, such as Wiki's, ect.\n10. Poorly optimized and requires far more PC requirement efficeincy than stated in the description.\n11. Every update breaks something. Sometimes very badly, and it doesnt get fixed. Multiple Exploiters.\n\n\nIn short, only join this game if you have 5-10 People, willing to commit thier lives/time 100% to succeeding in a dead game world, that is full of bugs, dont mind getting farmed by alpha tribe/players and raided. Wasting countless hours of gameplay with very little to show for it, and still loosing it all because you dont play enough. The game was fun at launch, its done now.\n\nIf many of these conditions improve I will alter my review, otherwise the game is in an unplayable state.", "timestamp_created": 1523306214, "timestamp_updated": 1523306388, "voted_up": false, "votes_up": 22, "votes_funny": 0, "weighted_vote_score": "0.692597627639770508", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23415248": {"recommendationid": "23415248", "author": {"steamid": "76561198299262121", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 4624, "playtime_last_two_weeks": 0, "playtime_at_review": 4563, "last_played": 1465684606}, "language": "english", "review": "Been playing this game for a month now.  I started playing this game with some friends.  Our guild camp has been fortunate enough to survive so far but I can't say the same for our neighboring guilds.  We've seen atleast 8 different guilds that started playing around the same time we did and end up quitting as soon as they're base got griefed or destoryed by bully guilds (Mainly some guild called Ironborn).  The entire map is filled with abandoned camps.  Mostly noob camps that ended up quitting after getting griefed.  There are so many abandoned camps it is very difficult to find a large enough open spot to build camp.  \n\nThis game is fun as long as you either play with a large group of friends or you can join a large established guild.  Otherwise, you're just sitting duck basically collecting mats for the big guilds to steal and/or destroy.  It's not a possibility, it's a guarantee.  This game seems to be filled with bullies who enjoy destroying peoples work, just to do it even though there is no benefit whatsoever.\n\nThe game has lots of serious flaws.  When I first started playing I caught several people stealing or killing my animals on my property.  When I attack that person, I'm the one who is awarded a criminal record.  Speaking of criminal records.  When I mentioned that there are no real consequences for griefing, bullying, stealing or destorying other peoples property, criminal records do not last long at all.  Criminal Record debuffs last between 30 seconds to a few hours depending on the severity of the crime.  I dont know why they called it Criminal Record because your crimes are not recorded.  After the debuff wears off, there are no records of any crimes you committed.\n\nOverall, I can't recommend this game.  This is a sandbox game but you are very limited on how or what you build due to available open space or having your buildings destroyed by bullies.  The map is not very big and there are too many abandoned camps.  If you're thinking of purchasing this game, all you have to do is go on their Community Hub Discussions and you'll see what kind of people play this game.", "timestamp_created": 1465204426, "timestamp_updated": 1466120851, "voted_up": false, "votes_up": 51, "votes_funny": 5, "weighted_vote_score": "0.691047251224517822", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "43415149": {"recommendationid": "43415149", "author": {"steamid": "76561198422208142", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 171951, "playtime_last_two_weeks": 0, "playtime_at_review": 134088, "last_played": 1569090457}, "language": "english", "review": "I've been really trying to give the game a chance on the test server, but it is not even the same game I bought 7 accounts so far to play with. That plus bags and mounts have cost me hundreds of dollars. I really love this game and devoted almost all my free time to playing it. The people I have met in game are a great bunch of people. There are large communities elsewhere that are populated with veteran players who have met on this game and enjoy still staying in touch even after the game went dead.\n\nAt first, the thought of losing all I have accomplished in 3400 hours of playing this game made me sick to my stomach, and honestly still does. Months of long term planning and saving items that might take weeks to get even one of, all gone. Grinding for days to complete a few walls for castle, all gone. It's been enough for many people who played with me for 1000's of hours just quit. And still no word how our experience or maybe tree levels or money might stay with us. Some general ideas, but we are all a little weary that it's not going to be in our favor.\n\nThe new houses seem like a good idea, but why not just add them to the current game? They started as an \"April Fools\" joke. On top of that we have been told to the point of ingraining in our brains to convince other players, \"Don't worry, there will be no wipe\" Only for a wipe to occur. I'd rather hear nothing at all than untrue statements from official mouthpieces of the game. It's just felt like appeasement and to a point an insult. Maybe the CM's were also misled, and if that is the case I really feel bad for them. I think they are trying to keep us informed, but really don't get any answers themselves. I don't know how the behind the scenes action takes place, but I think if honest answers were available, they would have no reason not to keep us up to date. It would make their jobs so much easier. I would not want to be in their shoes at all. \n\nThe test server was an absolute mess, to the point of almost nothing functioning correctly. And all the while, running a sale on the game to bring in new players with no idea of the status and untrue videos advertising the game. I stayed logged in to help new people not get blindsided by the supposed upcoming changes that are not even mentioned to players taking advantage of the sale. This is just misleading and unethical in my opinion. \n\nAll this game needed was some high level content. The advertisement video even shows us being able to fight of monster invasions and find hidden treasure. We had exactly one treasure hunt, and it was really fun to those who were able to be online at the time. Even the find the nose and chocolates events for holidays were a nice addition and kept it fun while they lasted. Then the events offered after that, such as the drawing contests, had no winners announced for so long the winners had quit playing. These events and having a large community kept the game moving forward. The lack of content brought about infighting among groups with lack of better options. People constantly raided the same place for lack of anything else to do. Luckily our mutual dislike for the current state of events have brought about a new bond across many veteran players. \n\nI could go on and on about what should be done, but all we all really want is our game that we love so much to come back. A few high level activities have to be easier than re-coding the entire beginning of the game, only to end up right back where we were with no high level content. I am willing to give it a try and have some hope, but at this time playing makes no sense when its all going to be wiped out. So what are we supposed to do right now? Just not play for weeks until something is stable enough to even try to implement? Farm for items that will be wiped? It just doesn't follow any logic at all... Please just give the CM's some good info to pass along to those of us who always stand by the game and keep new players by being the coaches who fill in the blanks and make it fun for all. \n\nIt's truly a shame, this was one awesome game that could totally addict you before you knew it. I hope soon it can be again, or there will be no community left. \n \nEND RANT", "timestamp_created": 1531108935, "timestamp_updated": 1531108935, "voted_up": false, "votes_up": 27, "votes_funny": 0, "weighted_vote_score": "0.690855145454406738", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "16467133": {"recommendationid": "16467133", "author": {"steamid": "76561198117733803", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 11256, "playtime_last_two_weeks": 0, "playtime_at_review": 9861, "last_played": 1435120975}, "language": "english", "review": "After 158 hours in this game, I will say - don't ever think it's a minecraft-stylish game kids. It's a cruel gameworld with people can destory your hard-working in 10 mins. If you love to build your dream house or love to farm/feeding animals etc, please continue with your Minecraft and that's still the best ever sandbox game so far.\n\nPVP system is imbalance in this game at the moment (by the time I wrote this review at least). People with high level gear can destory the stone wall within 1 min. You have to spend at least 1 week (maybe 40 hours) to build your own garrison. Oh yeah, you have to worry when people will rob you too. There is no actual punishment for these crimial unless you could kill a def 640+ red name but no matter what, you need some friends to accompany you if you wanna have fun.\n\nPVE part - well I cant see the PVE part since the PVP system has already destoryed this game. \n\nFrom my experience, I spent like 16 hours a day, even in my working hour to guard the camp and ensure no mobs from the evening will break the wall (oh yeah, they can break your stone wall within 2 nights and arrow towers sometimes cannot hit them even it placed in front of it or there's one next with it lol). I also have to worry when the Russians will come that make my life stressful enough :P (being robbed quite a lot and all Russians so far, soz Russians in EU)\n\nAnyway, it's a game that still developing so I couldn't say it sucks but just take time to be a full game :))", "timestamp_created": 1434535767, "timestamp_updated": 1434535767, "voted_up": false, "votes_up": 36, "votes_funny": 4, "weighted_vote_score": "0.688303589820861816", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "34843103": {"recommendationid": "34843103", "author": {"steamid": "76561197996733982", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 341, "playtime_last_two_weeks": 0, "playtime_at_review": 341, "last_played": 1504979226}, "language": "english", "review": "Bought this game hoping it would be similar to ARK, but with a more friendly vibe. Turns out it is far too harsh with overnight decay timers on most progress. Any progress requires a large active group. This is not a game for a few casual friends to progress in. In addition, most of the chat on the US server is not in English, so help and \"community\" is stuck behind a language barrier. This feels much more like a mobile PVP title that was ported to PC and sold as an MMO.", "timestamp_created": 1504979858, "timestamp_updated": 1504979858, "voted_up": false, "votes_up": 74, "votes_funny": 2, "weighted_vote_score": "0.688068807125091553", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23217620": {"recommendationid": "23217620", "author": {"steamid": "76561198190291349", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 40253, "playtime_last_two_weeks": 0, "playtime_at_review": 21294, "last_played": 1551156169}, "language": "english", "review": "This game is made to only steal and hold people for ransom. I have played 370 hours, to only rebuild our guilds castle 3x, with each time ending in it being destoryed or ransom notes with deadlines that cannot be made possible (have 2 storage units filled with iron and copper ignots in 1 day) There is no help from support, I have left emails, facebook posts, even forums over the whole duration of my gameplay with not one reply. Also to leave a message you have to be proactive in the forums, and the website specifically states \"an eye for an eye\" so instead of not having a lockpicking feature, or deleting accounts from people who want to destory everything, you have to become bad yourself and waste time destorying more things. Don't call a game Tree Of Life if it is about thieft, crime, and destroying. This was supposed to be a building game. I hate this game and I am going to make sure everyone, everywhere knows to not play it. Typical Koreans, destroy everything.", "timestamp_created": 1464268385, "timestamp_updated": 1464268385, "voted_up": false, "votes_up": 139, "votes_funny": 23, "weighted_vote_score": "0.68712085485458374", "comment_count": 9, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "16073298": {"recommendationid": "16073298", "author": {"steamid": "76561198010605687", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 922, "playtime_last_two_weeks": 0, "playtime_at_review": 888, "last_played": 1459812230}, "language": "english", "review": "Tree of Life, the type of sandbox game I enjoy most. Quirky, laid back music, practicing Wing Chun on trees, punching veins, punching Chickens, punching Kobolds, getting punched by Zombies. Makes punching better than Minecraft! \n\n\nOkay, let's get serious.\n\nFor an early access game, I did not expect much. Being a huge fan of sandbox games, Tree of Life holds a lot of promise and the game is already delivering. So far, I have not encountered any bugs and/or glitches in the game, which surprises me. If music is a big deal for you, then this game is just right. Truth be told, if I can get my hands on Tree of Life's soundtrack, I'd buy it. 10/10. It's that good.\n\nAs far as the community in the game goes, I'm fortunate enough to have friends who actually play the game, but I've met some pretty cool people so far and have had little conflict with others. If roleplaying is your thing, there are some villages that encourage roleplay. If you just want to play the game as is, there's always that too. There's already a lot to do in the game, so I'm excited to see what else the devs have in store for us!\n\nThe only thing I don't like is that there's a delay when you're trying to switch to a bandage after swinging a melee weapon. Granted, this isn't much of a big deal and can easily adjust to, but I don't know if it's intentional to make the game semi-realistic or if there's just a delay. Either way, it's just something I was curious about.\n\nOverall:\nIf you enjoy sandbox games, cartoony graphics, amazing music, and using a chicken as a punching bag, Tree of Life is definitely for you.", "timestamp_created": 1432975031, "timestamp_updated": 1432975031, "voted_up": true, "votes_up": 38, "votes_funny": 6, "weighted_vote_score": "0.685282647609710693", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "16110480": {"recommendationid": "16110480", "author": {"steamid": "76561197961421484", "num_games_owned": 590, "num_reviews": 2, "playtime_forever": 12061, "playtime_last_two_weeks": 0, "playtime_at_review": 7974, "last_played": 1455459379}, "language": "english", "review": "Pros:\nNo short of activities\nPlenty of room for those activities\nMost people are friendly\nThe ones that aren't you can kill\n*Game is exceptionally fun with friends\n\nCons:\nNight time is realllllly dark\nZombies scare me\nMy pet cow ran away\nSomeone cut my tree down\n\nStill a good game, but I miss my cow. 10/10 would fish or to spend time useless again\n", "timestamp_created": 1433131275, "timestamp_updated": 1433131275, "voted_up": true, "votes_up": 142, "votes_funny": 269, "weighted_vote_score": "0.685230016708374023", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "16092664": {"recommendationid": "16092664", "author": {"steamid": "76561198192832759", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 11290, "playtime_last_two_weeks": 0, "playtime_at_review": 3784, "last_played": 1438579067}, "language": "english", "review": "This game needs A LOT OF WORK! The night/day turn around is way to fast, ridicously so. You spend ALL your time trying to get food or you get sick and die while fighting wolvev, tree people, skeletons, zombies AND let's not forget the stupid people that camp on you and kill you repeatedly for nothing when you've only been in game for 2 days. \n\nThe speed in which day turns to night is not realistic and you don't have enough time gather food and firewood  to make it through the night unless you have a group of 4 or more. Forget building because as soon as you try, the skeleton crew comes at night to destroy what you attempted to make while you are trying to keep your fires going and eat. \n\nBeing turned into a criminal while defending your camp? What the hell is that? Then the idiots camp there, shouting and laughing and wait till you come back just to kill you again. THEY don't turn red; they didn't turn red, stole all my stuff and trashed the camp. \n\nMakes me not want to play at all. There has to be some ground to gain. When you get beat down constantly it isn't worth even trying.", "timestamp_created": 1433055724, "timestamp_updated": 1433055724, "voted_up": false, "votes_up": 88, "votes_funny": 5, "weighted_vote_score": "0.684125661849975586", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "47160204": {"recommendationid": "47160204", "author": {"steamid": "76561198005585119", "num_games_owned": 50, "num_reviews": 4, "playtime_forever": 303, "playtime_last_two_weeks": 0, "playtime_at_review": 303, "last_played": 1543385725}, "language": "english", "review": "game is dead, devs dont do anything. not multuplayer game when theres no players", "timestamp_created": 1543386049, "timestamp_updated": 1543386049, "voted_up": false, "votes_up": 19, "votes_funny": 1, "weighted_vote_score": "0.681245625019073486", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "45109645": {"recommendationid": "45109645", "author": {"steamid": "76561198842597438", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 9958, "playtime_last_two_weeks": 0, "playtime_at_review": 4108, "last_played": 1551580047}, "language": "english", "review": "DO NOT BUY THIS GAME.  This game has been ruined. They took out all that made the game fun on July 16th. The only thing left is to have a little farm and build an unused and unneccesary guild. The PvP is a joke now. Most of what you see advertised is not available in the game at all. But, no worries they plan to offer them as premium deco items soon! There is absolutely nothing left to do past the first few days of playing. Before the great \"Home Sweet Home\" update, this was the most addictive game I had found for awhile. Met tons of great people and could not wait to play for hours. Since they decided to lie to us and wipe the server and take away a year of work on multiple accounts, I have no desire to play. The servers are EMPTY and the devs just pass on lies and false statements while they figure out how to fix what they broke. They do not care at all what players who have supported them think. Support tickets sometimes take months for them to even respond to. This game used to have potential, now its like a cross between the teletubbies and carebears. I want the game I bought back again. Check out the official TOL Discord server for an accurate picture of how things are going.\n\nEdited to add 12/14/18\nThis game should be removed from Steam\nThe advertisements on the store page is completely full of lies. The video they show here, and the decsription on their facebook pages make it look like a complete game. It is not. I know the CM will probably delete this post, because just like North Korea, truth and dissent is not allowed. No one who interacts on behalf of the developers with the community can even answer questions about the game because none know the game. It is a joke. I truly hope the game either gives us what we all payed for, the full release game or they shut it down. You will maybe see one or two people if you are lucky.. The official answer to this on Facebook is because the map is so vast.. what a bunch of crap. Interactions were common before the July update. You saw people everywhere. Just more lies from the uneducated support team who can't even stand to play the game long enough to learn the mechanics and rely on old players to answer the questions. They should all be fired as they bring nothing to the game, unless you count lies to try and keep people around. No way the numbers of players can even pay for the server cost. They should really thank the government for financially backing their horrible decision making.", "timestamp_created": 1538704326, "timestamp_updated": 1544801047, "voted_up": false, "votes_up": 23, "votes_funny": 2, "weighted_vote_score": "0.675358355045318604", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "42945182": {"recommendationid": "42945182", "author": {"steamid": "76561198052772145", "num_games_owned": 0, "num_reviews": 24, "playtime_forever": 7715, "playtime_last_two_weeks": 0, "playtime_at_review": 7326, "last_played": 1533838457}, "language": "english", "review": "It was fun back in beta.  Since then every update has made the game buggier.  They have removed features, they have gone back on their word about future features, they add more P2W microtransactions, and they have now removed group play in an mmo.", "timestamp_created": 1529705270, "timestamp_updated": 1529705270, "voted_up": false, "votes_up": 18, "votes_funny": 1, "weighted_vote_score": "0.675123035907745361", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "34796303": {"recommendationid": "34796303", "author": {"steamid": "76561198057696611", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 18922, "playtime_last_two_weeks": 0, "playtime_at_review": 3176, "last_played": 1540532221}, "language": "english", "review": "I would have to compare this game of a mix between World of Warcraft and some Runescape, It gives you the the open world 3rd person PoV the the mmo portion of WoW. Also, it gives the grind of different traits as Runescape. This is just my personal opinion of the comparison.\n\nFirst off, this game is not for the loner. You will NOT achieve anything solo. You are not handed anything as well. You must work, you must establish teamwork, and build camradery amongst guild mates. This is a grind heavy game, but this is a rewarding game and the scenery is just beautiful.\n\nAs of now the game has minor bugs but I still give it 10/10\n\nI will play this game until it dies and Im the last player known!", "timestamp_created": 1504797315, "timestamp_updated": 1504797315, "voted_up": true, "votes_up": 19, "votes_funny": 4, "weighted_vote_score": "0.673415005207061768", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "35467747": {"recommendationid": "35467747", "author": {"steamid": "76561198012440706", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 3174, "playtime_last_two_weeks": 0, "playtime_at_review": 3074, "last_played": 1507738471}, "language": "english", "review": "DO NOT BUY THIS GAME.\n\nIt looks good at first but it is boring and there is basically nothing to do. 90% of your time you will be GRINDING for resources just keep up with the weekly rent and constantly deteiorating equipment. I bought it a year ago and quickly stopped playing due to the aforementioned issues. \n\nI decided to try it again two days ago and over the year there was NOTHING changed in the gameplay. No improvements in the progression system. No new mechanics. \n\nAlso the \"build your tree anywhere and explore\" is bullshit as with the current state if you stride away from the novice thione your base will be destroyed by other players.\n\nVery disappointing. Waste of money. I with I could refund it.", "timestamp_created": 1507111761, "timestamp_updated": 1507111761, "voted_up": false, "votes_up": 37, "votes_funny": 1, "weighted_vote_score": "0.667537033557891846", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "47781515": {"recommendationid": "47781515", "author": {"steamid": "76561197989753555", "num_games_owned": 603, "num_reviews": 12, "playtime_forever": 70, "playtime_last_two_weeks": 0, "playtime_at_review": 70, "last_played": 1503015275}, "language": "english", "review": "What I saw on screenshots and videos isn't what I got when purchased this game is not good. Refunded.", "timestamp_created": 1545666785, "timestamp_updated": 1545666785, "voted_up": false, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.665327370166778564", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "45153348": {"recommendationid": "45153348", "author": {"steamid": "76561198030096699", "num_games_owned": 0, "num_reviews": 42, "playtime_forever": 6288, "playtime_last_two_weeks": 0, "playtime_at_review": 6288, "last_played": 1433489569}, "language": "english", "review": "Been a part of this game on an off since pre-beta 2016\nI'm just going to say this now, which i rarely ever say save for extreme circumstances, DO NOT BUY THIS SCAM OF A GAME\n\n1. The DEVS Litteraly do NOT care nor listen to the community\n2. The DEVS refuse to own up to any promises\n3. Any features you may have been told about or see was removed\n4. False Advertisement\n5.  Wasted potential with the simplistic fact that if oddonegames went bankrupt (and honestly they should) there are far more intelligent and experienced people who would flip this failure into something noteworthy.", "timestamp_created": 1538901061, "timestamp_updated": 1538901061, "voted_up": false, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.659858226776123047", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "16023343": {"recommendationid": "16023343", "author": {"steamid": "76561198026315184", "num_games_owned": 274, "num_reviews": 21, "playtime_forever": 7137, "playtime_last_two_weeks": 0, "playtime_at_review": 2728, "last_played": 1489260494}, "language": "english", "review": "OLD REVIEW. Will update in-time.\n--------------------------------------------------\n\n-Short, first time experience review (2 hours played)-\n\nI'll be going through a few quick things I've experienced this far into the game. Both some positive and negative ones.\n\n-------Positive-------\n\n-On the positive side I find the game very charming to it's current surrounding environments. There's a lot of different kind of places in this huge world to explore. Making it interesting to see where and how communities will grow up along the world later on in the long run.\n\n-I haven't progressed too much with the skill system this far. But I see that reaching different professions will take a good while and a lot of time spent on each skill. An interesting way to go about the development of your character.\n\n-Sadly enough I haven't manage to get much further with the game to experience and learn about other positive things, and I'll tell ya why.\n\n-------Negative-------\n\n-Oh boy, here we got a few negative things to worry about. First off, I see that the developers wants the players to figure out pretty much.. everything through their first hour into the game. And yes I know there's a few guides to read to help ya out. But even the help of the guides can still make things seem confusing to understand. Especially when you wanna start out right away. There's no simple way to indicate what you exactly have to do to start making that.. that.. that and that. You get my drill. Once you start experimenting, you eventually start to understand how things works. Tho it's not an easy guess at first and can become a little frustrating for some.\n\n-I found myself at the end of my first game session very frustrated and somewhat disappointed. Throughout my session I found myself constantly being attacked by invisible creatures. Both under day and night time. Most of the time I heard skeleton rumbling noises approaching and then the situation would proceed with me losing tons of health, one hit at the time. Forcing me to leave my current settlement... forever. I experienced this on the EU server and from the little I read in the discussion thread not long after the end of my game session, other people had experienced the same problem. It's a very huge issue that must be dealt with immediately! The game is practically unplayable at this time. As you can't see or attack these invisible creatures! Very disappointed to see an NPC being bugged. Perhaps? Especially at this time at the launch on Steam.\n\n-And of course, just as I spawned in at the very beginning, I were attacked by another player. Not saying it's a complete negative issue. After all, it's a mix of MMO and PVP. Perhaps it's just me who doesn't like being attacked just as I spawn in, into a new game that I've never played before..\n\n-------First experience conclusion-------\n\nSo far the game feels promising and it has potential to improve a lot. Tho, the major issues such as the invisible creatures must be dealt with as soon as possible. 50% of the experience is being ruined due to this problem and making it somewhat unplayable right now. Especially if you wanna settle down somewhere.\nTho, as I have looked forward to this game for some time now, I can't go too harsh on it. It's still in development and I hope the developers fix and update the game often to improve it's current.. minor issues.\n\n-That's all I had to say, hope this little review helped!-", "timestamp_created": 1432722924, "timestamp_updated": 1433300657, "voted_up": true, "votes_up": 43, "votes_funny": 3, "weighted_vote_score": "0.659288525581359863", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "16099884": {"recommendationid": "16099884", "author": {"steamid": "76561198031206725", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 3211, "playtime_last_two_weeks": 0, "playtime_at_review": 2153, "last_played": 1437010156}, "language": "english", "review": "ToL takes me way back to my roots, UO. From the moment I logged in, to my first death and becoming a ghost and finally meeting up with my clan. I got that adrenaline rush while being chased by a PK not 5 mins after logging in, it was awesome.\n\nThis game has great potential, magic system is still missing or being worked on, can't wait for that. Melee Combat is simple but needs some love, I just got my first bow and gotta make some arrows.\n\nPlease for the love of God, open more servers(if you have to for server pop) but don't change the rule set, it will hurt this game way to much. This type of game needs wolves and sheep, and wolves can protect the sheep that are in your clan, if you know what I mean. No need for a PvE only server, you need a mix of both to keep the game alive.", "timestamp_created": 1433084982, "timestamp_updated": 1433084982, "voted_up": true, "votes_up": 21, "votes_funny": 0, "weighted_vote_score": "0.651763021945953369", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}}, "query_summary": {"num_reviews": 100, "review_score": 5, "review_score_desc": "Mixed", "total_positive": 1468, "total_negative": 859, "total_reviews": 2327}, "cursors": {"AoIIPybZ8XyitT0=": "Mon Apr 22 23:48:17 2024"}}
