{"reviews": {"157510718": {"recommendationid": "157510718", "author": {"steamid": "76561198172006449", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 306, "playtime_last_two_weeks": 0, "playtime_at_review": 306, "last_played": 1446386876}, "language": "english", "review": "WARNING: ABANDONED AND UNFINISHED\nBought in Early Access never really got to play,, its abandoned now", "timestamp_created": 1706983914, "timestamp_updated": 1706983914, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.573185861110687256", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160286442": {"recommendationid": "160286442", "author": {"steamid": "76561198004355726", "num_games_owned": 1668, "num_reviews": 64, "playtime_forever": 498, "playtime_last_two_weeks": 0, "playtime_at_review": 498, "last_played": 1447952294}, "language": "english", "review": "Unfinished and abandoned.", "timestamp_created": 1710100127, "timestamp_updated": 1710100127, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.534324347972869873", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160426486": {"recommendationid": "160426486", "author": {"steamid": "76561198025738140", "num_games_owned": 134, "num_reviews": 7, "playtime_forever": 376, "playtime_last_two_weeks": 0, "playtime_at_review": 376, "last_played": 1502403454}, "language": "english", "review": "This is game is absolutely abandoned. Blacklist the developers.", "timestamp_created": 1710298247, "timestamp_updated": 1710298247, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.517981171607971191", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162797495": {"recommendationid": "162797495", "author": {"steamid": "76561198043877202", "num_games_owned": 126, "num_reviews": 18, "playtime_forever": 216, "playtime_last_two_weeks": 0, "playtime_at_review": 216, "last_played": 1495304213}, "language": "english", "review": "abandoned", "timestamp_created": 1713019308, "timestamp_updated": 1713019308, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.507672667503356934", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158939392": {"recommendationid": "158939392", "author": {"steamid": "76561197992812494", "num_games_owned": 497, "num_reviews": 45, "playtime_forever": 18, "playtime_last_two_weeks": 0, "playtime_at_review": 18, "last_played": 1460754251}, "language": "english", "review": "H0|y sh|t! This \"game\" is still in early access? I got this with some bundle early 2016 and played it for less than 20 min and promptly forgot about it. Fast forward to early 2024, scrolling through unplayed/lowplayed games and I see GRAV! Oh! I, vaguely, remember this! *click* to look at the steam store... oh, wow. Boy am I glad this was some random tag along with a bundle I got in 2016. I will not even try installing the game and trying it in 2024. I did the whole leaving windows thing with the death of Windows-7 and jumped into the Linux-verse. ProtonDB says the last update on anyone even TRYING to run this turd was 3 (THREE) years ago on a PC, and a single poor soul tried on their Steam Deck. DO NOT BUY THIS!", "timestamp_created": 1708569215, "timestamp_updated": 1708569446, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501420378684997559", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "38039467": {"recommendationid": "38039467", "author": {"steamid": "76561197978011687", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 16, "playtime_last_two_weeks": 0, "playtime_at_review": 16, "last_played": 1462029150}, "language": "english", "review": "Release the source so the community can finish the game...", "timestamp_created": 1512323899, "timestamp_updated": 1512323899, "voted_up": true, "votes_up": 1190, "votes_funny": 74, "weighted_vote_score": "0.929363012313842773", "comment_count": 15, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "18082232": {"recommendationid": "18082232", "author": {"steamid": "76561198004665169", "num_games_owned": 0, "num_reviews": 28, "playtime_forever": 1019, "playtime_last_two_weeks": 0, "playtime_at_review": 1019, "last_played": 1442334432}, "language": "english", "review": "I am making this post for my guild as well as several other frustrated players on the forums that have been deprived a voice. My hours are not high but many of them were not logged to steam. Consider this a shared experience based on what I have not only experienced directly but witnessed many other players experiencing. The unhelpful votes at the top are most likely going to pile up as the griefer guild and admins find this post. Just look at its contents and decide for yourself.\n\nDon't get this game. It might look ok at first but the melee combat is roughly based on circling around the opponent repeatedly and smacking them in the rear quarters then rinse repeat. The diversity is mostly just reskin of the same character types.\n\nIn addition, PVE is full of griefers which we as well as several other groups on the server were suffering from due to their use of exploits and/or hacks to grief while in PVE. They would hack into bases and destroy generators/shields/etc of every other player that wasn't from their little group. The server in question was EU 9 and the players in question do not attempt to hide their actions even on the forums admitting to it. That is the treatment new players were given once they had set up a protected base that should be protected from destruction. We had plenty of wood for 5+ days in the generator but exploits were used against us and basically every other player on this server. Due to the fact the moons are connected it means other servers were effected as well.\n\nWhat happened when we tried to bring this to admin attention via email and steam correspondence? We were blocked and the players are still doing exploits and destroying peoples protected pve structures to this day.\nWow. Talk about -fantastic- moderation.\n\nAlot of people would say to move to a new server however in this game that would require starting over and this player seems to do this kind of thing on multiple servers and/or moons so that wouldn't really help. If admin action were taken, like it should have been, the problem would be solved.\n\nCurrently, expect to lose your stuff to griefers even in PVE and expect the admins to do nothing about it.\n\nYou might ask WHY it is that noone has done anything about *names omitted due to political red tape in steam TOS*?\n\nBy my research of simply looking at publically available shared friends lists and the fact that I was ignored by the admin as are their griefing posts on the forums.. I'd say they know each other. There you have it. Nepotism. It is the only rational explanation I was able to come up with to explain the ultimately either lazy or malicious lack of action.\n\nA player that uses hacks and/or exploits to glitch into peoples PVE bases and destroy everything including chests and spends 90% of their time bragging in global chat that they are on their \"train\" of destruction then also brags on the forums will get away with it due to poor support for this game.\n\nThe game wasn't really anything to write home about before the fact that exploiting griefers can destroy your chests even in PVE game modes and force your entire guild to start over on a new server that may suffer the same problem.\nThe game looks somewhat flashy but there really isn't anything to do for a sandbox and the building and gameplay are rather limited and poorly balanced. A similar game that is in development that might need support is Planet Explorers. Really, there are several similar games with better support if you toss a stone in a random direction.\n\nIt is grindy and it feels grindy.\nThings are a palette swap if they are any different.\nNo cheat protection that I can discern so enjoy the large amount of hackers/exploiters in pvp OR pve.\nThe graphics really aren't that great and the cartoon polish doesn't fix it.\nThe combat feels kind of basic.\nLarge amount of unnecessary resources which get dropped even in pve which require you to put it in a chest at your protected base and log on frequently otherwise even in pve other players can and will destroy all your things and get rid of all your belongings if you choose to not carry them around into dangerous areas. Even if you do keep your base protected by filling the generator some players will exploit and destroy it anyway. Cements fact 1 that the game is grindy.\nBuilding system uses very limited supply of polished yet uninspired structures.\n\nThere is no end game, people complain about this constantly on the forums. Go check it. Our favorite griefers complain about this as well and had stated that they decided the endgame was griefing other players and use this as an excuse.\n\nWithout the griefers I'd say a 7/10 at best at this point especially when compared to other similar games.\nWith the griefers the game is unplayable unless you plan to deal with your friends and everyone losing their bases to some jerky griefers and have to rebuild every time you log onto the servers. 5 or 6/10 at that point at best. I would like you to simply look at the number of negative vs positive reviews at the time of writing. 500 vs 1500. That is not a good satisfaction rate by any stretch of the imagination. This game might still sound good to you but I request you support one of the other similar games with a friendly community and people who care.\n\nI would consider changing this review if I am given evidence that action is being taken against such players who grief in PVE or hack. I have screenshotted it and am prepared to post it to various other popular websites if it is removed or swept under the rug as I am sure will happen. If this happens I have the resources to go straight to the higherups at steam who will be curious as to why negative opinions of the game are being censored.\n---------------------------------\n\nTLDR;\nEven if you are planning to play this game, I humbly ask that you rate this helpful so that people can at least go into the game knowing about the inner workings and happenings which may ruin their and their friends experiences and so that people know at the very least to avoid EU 9 due to its toxic community that is simply being enabled by the developers. Or avoid the game entirely because you can expect no support by the mods or admins.", "timestamp_created": 1442573650, "timestamp_updated": 1446943968, "voted_up": false, "votes_up": 781, "votes_funny": 27, "weighted_vote_score": "0.921034336090087891", "comment_count": 37, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "37919212": {"recommendationid": "37919212", "author": {"steamid": "76561198009135099", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 350, "playtime_last_two_weeks": 0, "playtime_at_review": 350, "last_played": 1463622092}, "language": "english", "review": "I flagged GRAV as fraudulent, even though I know Valve won't do anything about it, because they're still making money off all us poor schlubs who buy these abandoned trash-heaps and don't find out how bad they are until it's too late to refund.\nBelow is the \"additional information\" I put in my (sure to be ignored) report:\n\n\"GRAV has been abandoned by the developers for nearly a year now, with nothing forthcoming but sale announcements, which also ceased in July. Yet they still claim it is in Early Access, thus defrauding potential customers who buy the game under the assumption that it is still in development and not long-abandoned. This fraudulent behavior by shady developers is rampant in Steam's Early Access program, which Valve seems to be just fine with, judging by their complete inaction against the myriad offenders.\"", "timestamp_created": 1511929963, "timestamp_updated": 1511929963, "voted_up": false, "votes_up": 139, "votes_funny": 3, "weighted_vote_score": "0.913365006446838379", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "13909689": {"recommendationid": "13909689", "author": {"steamid": "76561198026359446", "num_games_owned": 681, "num_reviews": 32, "playtime_forever": 1578, "playtime_last_two_weeks": 0, "playtime_at_review": 1558, "last_played": 1421341116}, "language": "english", "review": "[Strike]This game is tons of fun, devs are active they reply on steam forums and keep on patching bugs.\n\nThe game has vibrant colors. Imagine Rust and Planet Explorers had a baby and named it GRAV.\n\nI have played 5 hours straight, was killed in PvP once, owned by flying bugs, made friends, built a base with them, explored caves. The game has tons of potential, but requires your patience, I believe as more players join, more servers will come up, creating another succesful survival game, but this time with a different feel to it!\n\nTotally recommend the game for those who understand what Early Access Games with tons of potential require.\n\nEdit 1: after playing even more, I've noticed some bugs but they never ruined the fun! the only issue is the lag at times, but the devs are working on it!\n\nEdit2: crowded servers tend to lag a bit more than servers with 8-16 people on is what I noticed from trying out different servers. The game is enjoyable in less crowded servers at current state.\n\nEdit3: as of Patch 4, the lag has been reduced and server performance really improved. Looking forward to future updates.\n\nEdit4: as of the 18th of January, Patch 7 is released, more improvements (CPU/GPU-wise) in bay as well as further graphical enhancements. see the announcments for further info. \n\nI don't know anymore. Still positive though.\n\n21st of May 2016: I miss GRAV.\n\n24th of May 2019: Still miss it. [/Strike]\n\n20th of August 2023: What could've been...", "timestamp_created": 1420816955, "timestamp_updated": 1692557846, "voted_up": true, "votes_up": 306, "votes_funny": 36, "weighted_vote_score": "0.88053131103515625", "comment_count": 19, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "29746617": {"recommendationid": "29746617", "author": {"steamid": "76561198002338993", "num_games_owned": 0, "num_reviews": 186, "playtime_forever": 5365, "playtime_last_two_weeks": 0, "playtime_at_review": 5304, "last_played": 1449684251}, "language": "english", "review": "It started as a fun, buggy Early Access game which was sure to grow... or so we thought 2 years ago - for more than a year the development progress has been a joke, some minor bug fixes (most likely done during half a work-day) and server-fusions were announced as \"great content patches\", while in fact no \"real content\" has been added AT ALL since October 2015. There's also still hundreds of gamebreaking bugs.\n\nIt's abandonware, don't get fooled by the devs poppung up every few months before a steam sale, switching three numbers in their code and acting like somebody was actually working on this.\n\nThis game had soo much potential, but abandonware stays abandonware.\n\nEDIT:\nUpdate - for the first time after 2 years as of today the devs have come out of hybernation and \"real\" new content has been added (22th March '17): new items and a new vehicle. It won't change my review, considering how the last 2 years went - but it wouldn't be fair to ignore these improvements. This game does have potential, let's see whether the devs learned their lesson.\n\nEDIT:\nThey didn't.", "timestamp_created": 1486405829, "timestamp_updated": 1506607112, "voted_up": false, "votes_up": 118, "votes_funny": 3, "weighted_vote_score": "0.875618636608123779", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "16446992": {"recommendationid": "16446992", "author": {"steamid": "76561198042802104", "num_games_owned": 227, "num_reviews": 62, "playtime_forever": 2064, "playtime_last_two_weeks": 0, "playtime_at_review": 2064, "last_played": 1446947948}, "language": "english", "review": "JANUARY REVIEW.\nLoving this game so far, community is great. Most people tend to cooperate and explore with each other and disregard PVP. The potential is very very great in this game, I personally love it. The building, resources. Visuals are stunning. 10/10. The other negative reviews probably are just on the wrong servers and doing the wrong things. I'm having a very smooth time and so far there are no game killing bugs as of now. Respawning is designated with a craftable item and putting away resources is also achieved by making an item. Both that are very easy and cheap to make. See you in game!\n\nUpdate: After an extensive amount of gameplay I quickly grew tired of it, I constantly stuck with the game hoping that an update will fix lag issues and after some few updates it did, but what got me was the leveling and crafting. Grinding was like a Job, you are forced to do it or you won't get anywhere. I'm talking in the sense that building a decent base will take almost half a REAL life day. Then the amount it takes to actually make the item takes away almost half of your resources you spent grinding for about 30 minutes. I am sad to say that I have left this game, it has potential yes it does but the image it's creating now is not the image I saw in my head when I saw this game on greenlight. I expected Borderlands/Minecraft/Terraria. Crazy adventures and fast paced action with some nice base building that is easy and fast. Maybe next time I'll come back to this game but for now it's out of my To Play List.\n\nJUNE REVIEW\nSo I just took a look at the summer trailer and it still displays so much misleading and flashy visuals that can instantly capture a person who takes a big interest in suvival open world games such as me.\n\nDefinitely not Open World, It's just one piece of a huge land with only mobs and resources laying about with a few dungeons, nothing to interact with, just a barren wasteland. The combat is a looping cycle of meleeing and backing off, or with guns it's just unloading bullets on the mobs.Jetpacks take years to make, the fuel it uses is also a pain to get. PVP is still laggy and somewhat broken. Monocycles don't go as fast as you really think they do. Building the \"claim\" in this trailer would take IRL days to make considering all the resource farming you'd have to do. Still waiting for that lovely overhaul to resource gathering and actual things to do in the game rather than just kill mobs, farm dungeons.\n\nNOVEMBER:\nSo I just wanted to jump back on GRAV because of the Reborn update and not much has really changed it's still the GRAV I knew back in early 2015, the UI has improved greatly though so props for that. The environment and the world design has greatly improved too, the world isn't so barren and random anymore. It looks like an actual world and not some dream world. The vehicles look great but I have yet to obtain them. The multitool harvesting has slightly improved with a bar on the bottom indicating your progress during the harvesting. The combat is repetitive as ever and the noises during battle are still so poorly timed a revamp to the combat system is needed to immerse people in a fight, instead of just wacking things then backing off then repeat, the gun's still haven't really changed either, the reload animation is still the guy rubbing his gun \"Sweety refill your clip now\" kind of thing. \nOverall I think the game is slightly improving but not enough to have me recommend it, but they're getting there with these recent updates.\n\nDue to this review being quite popular, it's drawn much attention of course but with that also comes a flood of angry fans and players. Yes I dislike the game you love oh so much. I don't care, this review is meant to give the devs a kick in the head and try to look into a problem that not only me but many others find very horrible. So I please ask you to keep your insults to yourselves, take it to an online message board, and put it there, ideas and suggestions are welcome, however if you really do must write a comment of disagreement be civil and show no hostility to an individual and be humble. Thank you for taking time to read this review! Have a good day. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJust adding this here, completely optional and has nothing to do with the review:::\nGo play Trove, it's just like this game but not sci fi focused, There's base building, a fairly large world to explore and generate. There's exp gains and leveling. Also a loot system. Character customization, wings, mounts, and also guns and exploration. It's free to play but is not broken with Pay to win. Like I said I'm just leaving this here for people looking for games to play with this kind of genre. COMPLETELY IRRELEVANT TO THE REVIEW AND OPTIONAL.\n\nOh right another edit (November) Wouldn't recommend Trove anymore the little innocent sheep has grown into a devil goat, Trove has expanded quite alot and now they're adding a lot more grindy things, PVP is a real thing and eventually people will start building PVP characters and the game will probably feature PVP exclusive gear so GG to those who want to have a good casual time and still maintain good gear.\n\nThe F2P element has also bloated with their cash shop too theres alot of advertising now and almost everything you do in the game will make you think about buying something with IRL cash. Don't bother touching Trove anymore, it's going downhill.\n\nSorry if none of this makes sense to you if you don't understand that's fine I'm just sharing my thoughts and taking no time to revise what I'm saying it's sort of like a free write.", "timestamp_created": 1434470478, "timestamp_updated": 1496277551, "voted_up": false, "votes_up": 1283, "votes_funny": 57, "weighted_vote_score": "0.871883630752563477", "comment_count": 61, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "32338929": {"recommendationid": "32338929", "author": {"steamid": "76561198142476116", "num_games_owned": 804, "num_reviews": 9, "playtime_forever": 3295, "playtime_last_two_weeks": 0, "playtime_at_review": 1766, "last_played": 1640243285}, "language": "english", "review": "Currently, as of June 11th, 2017, GRAV machine broke. Shows no signs of recovery or any work at all so far for the past month, should have waited to buy early access garbage. I'll come back in a year and see what's changed. The mechanics are fine, some small inconvenient glitches, but nothing super as far as gameplay. The servers are a nightmare, and that is what's limiting gameplay. Otherwise it's a lot of fun.", "timestamp_created": 1497175638, "timestamp_updated": 1497175638, "voted_up": false, "votes_up": 104, "votes_funny": 3, "weighted_vote_score": "0.858428776264190674", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "22226556": {"recommendationid": "22226556", "author": {"steamid": "76561198053709558", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 15991, "playtime_last_two_weeks": 0, "playtime_at_review": 15544, "last_played": 1459549104}, "language": "english", "review": "Played this game for around 270 hours, also reached the endgame long time ago. Let's sum it up:\nPROS\n-nice graphics\n-the idea of multiple planets and moons with different hazard conditions\n-official servers divided on PvE and PvP\n-the game has a lot of potential\n-lots of weapons to choose from (also balanced)\n-many different resources to get\n-great community (at least on EUR PvE server, which i played on)\nCONS\n-resources' and monsters' grindfest to the point of extreme boredom\n-more than half of all planets (except homeworlds) look similar or identical\n-only around 11-12 type of monsters\n-building anything more complicated than a simple cube is frustrating\n-there is a single player mode, but use it only for a tutorial to learn basic things - advancement is impossible there (unless You play 1000 hours) because of the way resource nodes spawn (multi is fine)\n\nAnd the last, most important one - LITTLE TO NO UPDATES SINCE HALF A YEAR! There were some small patches, that brought new hats (hooray...) and a few changes in game rules on official servers, but there's a complete lack of new content since October and no major bugs were fixed throughout those few months. The devs' support and contact is also greatly lacking.\n\nWould i recommend this game? Right now - no. As i mentioned - great potential, but squashed by people with no heart to finish their product.\nIf so, then why did I play it for so long? I guess I just like to finish things, also other people on the server made it more fun to play.", "timestamp_created": 1459719572, "timestamp_updated": 1459719572, "voted_up": false, "votes_up": 241, "votes_funny": 9, "weighted_vote_score": "0.847782254219055176", "comment_count": 17, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "14853406": {"recommendationid": "14853406", "author": {"steamid": "76561197978094155", "num_games_owned": 457, "num_reviews": 31, "playtime_forever": 11142, "playtime_last_two_weeks": 0, "playtime_at_review": 6159, "last_played": 1496872704}, "language": "english", "review": "TLDR; another great game abandoned before it's time.  I can no longer reccomend it and it should no longer be sold.  See my Story below for a laugh!\n\nLanded on an alien planet with a knife (now you get a club) and a multitool.  Only hint I got was get wood and fossils to make an armory (they have added a great tutorial that gives you exp and mats as you do basic tasks now).  Saw a giant flying alien bug and poked it with my knife, it expolded with a squish sound.  Repeated several times to hear the squish sound.  Accidentally ran into a bug that made me make a squish sound. \n\nMade an armory and got a rusty gun and killed the bug that squished me.  \n\nFound a cave but there was a big pit in it.  The monsters chased me to the edge of the pit.  I fell in.  Second time I built a bridge over the pit and stood there pointing and laughing at the stupid monsters.  Monsters destroyed the bridge while I was standing on it.  They pointed and laughed as I fell to my death again.\n\nThis game is a blast!  It has survival elements, but no so hard core that you have to count how many M&Ms you have left in your pocket before you die.  It also has RPG elements where you can upgrade some skills (active and passive) and get new jobs that have a new set of skills with them. And you can build.  Building is fairly simpled but lots of fun.  You can also make a variety of weapons, armor and vehicles...like monocyle, jetpacks, tanks and jets.\n\nYou will die...you will laugh...and you will die some more while you learn.  The folks playing are helpful and fun.  This game is more than worth the money right now and is being patched frequently.\n\nMy best advice is to build a little base as soon as you get a shield generator blueprint.  Use it to store your extra mats so if you die you don't loose much.  You DO NOT drop your armor, ammo, or weapons when you die, just a percentage of your mats on hand.  You can also train a skill up to reduce how much you drop.  \n\nThere are PK gankers of course, but there are anti-PKers as well that tend to balance it out.  You will get PKed.  The best thing to do is Don't Panic!  You are much more likely to survive if you keep your head and fight back.  Or run around some cover and pop and invis stim and run away. \n\nUpdated a bit.  There has been much patching and improving recently.  The game is better than ever.  The player base has grown after a recent free weekend.  There is so much to do in this game you shouldn't get bored.  \n\nYes it can be a big grindy at times as some people have asked.  I don't find it bothersome.  You can have about 8 different jobs, which are like classes.  You can level each one seperatly or just focus on one.   Each comes with benefits.  I don't find lvling up other jobs that hard as I gather mats while I level.  You can hot swap any job at any time just in your inventory screen and any passives that you train remain no matter what job you have active.\n\nOpenworld, scifi style sandbox survival and building.  Try it!  You just might like it.", "timestamp_created": 1426182644, "timestamp_updated": 1709335675, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.836234033107757568", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19408476": {"recommendationid": "19408476", "author": {"steamid": "76561198027289654", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 2459, "playtime_last_two_weeks": 0, "playtime_at_review": 2368, "last_played": 1448961086}, "language": "english", "review": "Game is ruled by high level players.  Being there is 0 risk to them they spend most of their time taxing (as in they gain a percentage of all the resources you farm) and killing low level players and destroying anything they want whenever they're bored.  You can't do anything to stop them but watch what you have built be destroyed and you have start over.  Luckily your levels and equipment don't reset on death, but you'll lose most your resources and the people who killed you can take the rest.  At least with other survival games, the risk to them is bigger the more they have.  So you're not always constantly attacked.  \n\nThe combat is also boring.  You have several jobs to try to make the game look like there is a reason to keep grinding.  The jobs offer new passive skills and active skills to use, but don't offer any gameplay differences.  They are there strictly to drain your time.  Because when you start a new job you start with level 0 stats.  Even with your more powerful gear you'll have to go through the same grind as when you first started.  You'll have to do this on all the jobs if you want all the percs.  But unlike a MMO where the classes/jobs would offer unique gameplay, Grav offers no such thing and it's strictly there as a time sink.   \n\nAnd all the monsters of the world are pretty samey as well.  Even as you gain new levels and go to new places you'll fight the same monster over and over.  And most monsters even of different kinds have the same attacks.  Most have some sort of spit attack and those that don't have a small AoE.  That's it for diversity.  Speaking of the worlds.  They’re pretty small.  Those big worlds they show in the trailer?  That’s about the size of em.  Very small.  \n\nSo there you have it.  Grav, a game where you get tortured and picked on by the few high levels, while grinding against the same boring monsters, farming the same resources, so that one day you can be a high level to pick on the low level guys as well, because there is no endgame besides that.   \n\nIt really isn’t worth your time, this game has nowhere to progress.  A cross between a survival game and an MMO and not very good at either.", "timestamp_created": 1448961784, "timestamp_updated": 1448970858, "voted_up": false, "votes_up": 307, "votes_funny": 17, "weighted_vote_score": "0.834828972816467285", "comment_count": 15, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "13978276": {"recommendationid": "13978276", "author": {"steamid": "76561198037289728", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 3102, "playtime_last_two_weeks": 0, "playtime_at_review": 1439, "last_played": 1555121443}, "language": "english", "review": "After loosing hope on Early Access i decided to buy one last game, and holy vodka am i glad i did, this game is AMAZING.\n-Great graphics\n-Great gameplay\n-Dungeon raid mechanics\n-MMO-like gameplay\n-No pay-walls\n-No need to rent servers, you can just open one yourself\n-Frequent updates", "timestamp_created": 1421208228, "timestamp_updated": 1421208228, "voted_up": true, "votes_up": 294, "votes_funny": 75, "weighted_vote_score": "0.832655191421508789", "comment_count": 17, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "18835880": {"recommendationid": "18835880", "author": {"steamid": "76561198032767908", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 3050, "playtime_last_two_weeks": 0, "playtime_at_review": 2659, "last_played": 1448040943}, "language": "english", "review": "Before I review, I do want to mention, this is essentially a BRAND NEW GAME as the Reborn update has dropped.  It's radically different from what the game was, so in my opinion most of the reviews prior to mine are no longer accurate.\n\nI'll keep it short.  This is one of the most unique games I've ever played, it's essentially a dedicated-server based online RPG with some slight survival influences, extensive base building, fun sci-fi, and an awesome resource centric progression system.  It's very much like starbound in this fact.\n\nPros:\n\n-You can travel to other planets as you level up, they rotate on a loop about 3 planets per tier so it never seems to get boring.\n-Very diverse crafting system\n-Persistent vehicle like Dune Buggies, tanks, jets, etc.  Prepare yourself for epic endgame battles over territory.\n-Territory system!  You can conque grids and form mini kingdoms on each individual planet having separate grids.\n-Class system - allows you to specialize or diversify, this game is all about choice\n-This game is very fun with friends\n-Complex PvP and raiding system.  Guys can't just show up with pickaxes and raid your base like some survivals\n-It's a very playable Alpha game, DEFINITELY worth it for the price\n-PvP is balanced, gear is a factor but a dude with a t1 pistol can very realistically challenge a top tier player\n\nCons:\n\n-This could be a pro or a \"meh\" depending on your mindset, 3rd person combat system, can make PvP inconsistent\n-It's grindy, but a very rewarding a fun grind especially if you're with friends\n-Get ready to break your mouse with semi-autos as you crush your LMB!  Haha!\n\nMeh:\n\n-Community, this is server-dependent.  Noob zone is easily camped, sometimes it is sometimes it isn't.  You seem to get the Rust and Ark washouts who couldnt handle a more skill dependent PvP system.\n\nGet the game.", "timestamp_created": 1446465306, "timestamp_updated": 1446465306, "voted_up": true, "votes_up": 544, "votes_funny": 56, "weighted_vote_score": "0.832594871520996094", "comment_count": 29, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "13931818": {"recommendationid": "13931818", "author": {"steamid": "76561197974101197", "num_games_owned": 0, "num_reviews": 17, "playtime_forever": 1115, "playtime_last_two_weeks": 0, "playtime_at_review": 741, "last_played": 1470624506}, "language": "english", "review": "http://youtu.be/Fke62sfmoZ0", "timestamp_created": 1420927771, "timestamp_updated": 1420927771, "voted_up": true, "votes_up": 322, "votes_funny": 16, "weighted_vote_score": "0.830099165439605713", "comment_count": 8, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "25808255": {"recommendationid": "25808255", "author": {"steamid": "76561198069180238", "num_games_owned": 1088, "num_reviews": 10, "playtime_forever": 2404, "playtime_last_two_weeks": 0, "playtime_at_review": 2111, "last_played": 1475362308}, "language": "english", "review": "[h1] TL;DR [/h1]\n\n[b] GENRES: [/b] RPG, exploration, grinding, crafting, action\n[b] RATING: [/b] 73%\n[b] RECOMMENDED RETAIL/PURCHASE PRICE: [/b] €12\n\n[h1] REVIEW [/h1]\n\n GRAV is a good game. I open with that statement as, unfortunately, the game is hanging around the 60% positive review mark, which, in Steam terms, is terrible.\n\n Does the game deserve negative reviews? Yes, of course, every game will have people who dislike it, and that's fine.\nBut does the game deserve THIS MANY negative reviews? No, I wouldn't say so. GRAV isn't a bad game, and you will notice from most of the negative reviews that people who dislike this game are people who have only played the game for a few hours, or people who complain about how the servers aren't fully alive and active all the time. That is because these people do not fit into the target audience.\n\n I will address all of these subjective \"flaws\", but first I will point out to you that GRAV has a LOT of grinding. This is not necessarily a bad thing, even though the general public would assume so. The game is absolutely FULL of things to work for, and many of these things take a very long time to achieve. In my opinion, this is a great thing. You always have something on the horizon to strive for, you'll always be able to try out that new equipment you just earned, and you'll always, [i]always[/i] feel satisfied with the results of a long grind. That is why you should take another perspective on any review with under 10 hours played.\n\n As for server activity, PvP, etcetera, I don't recommend this game if you're looking for a purely player-versus-player experience against random people. GRAV isn't built for that. A few experience levels make a huge imbalance in damage and total health, and so the game doesn't hit the mark as far as public PvP environments go.\nIf PvE isn't your thing, though, don't be strayed away! I think GRAV is great as a team game, where everyone starts at the same time and has a race to the top, in some sort of red vs blue scenario.\n\n But, where this game really shines for me, is with or against friends. Progression is made much sweeter when you have a partner or two by your side, so I recommend this game the most to those who favour PvE or team environments. GRAV has so much to offer in terms of fun player interaction, and memorable moments are a plenty. I've had many epic experiences gliding through the air alongside my small group, riding a futuristic vehicle over plains, or simply dancing around a fire with friends.\n\n So, in conclusion, I can easily recommend GRAV. It is fun and it is good. However, you should take some more time to consider if you are wanting to play the game alone. That can be said for a lot of multiplayer-compatible games, but GRAV in particular shines with friends.\n\n[h1] ------------------------------------------------ [/h1]\n\n[i] Thank you for taking the time to read my review on GRAV! I'd appreciate if you could rate it, and let me know what I could do to make my reviews better. Happy hunting! [/i]", "timestamp_created": 1475355589, "timestamp_updated": 1663715265, "voted_up": true, "votes_up": 130, "votes_funny": 0, "weighted_vote_score": "0.829838216304779053", "comment_count": 13, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "17217150": {"recommendationid": "17217150", "author": {"steamid": "76561198137447785", "num_games_owned": 0, "num_reviews": 57, "playtime_forever": 5393, "playtime_last_two_weeks": 0, "playtime_at_review": 3470, "last_played": 1438586322}, "language": "english", "review": "First of all,note that GRAV doesn't have the 'survival' element in it.The RPG element is the most dominant one in this game.You don't have 'hunger' 'thirst' bar like those true survival games.GRAV is a hybrid between TPS,open world,and RPG.\n\n[b]Pros :[/b]\n+ Beautiful graphics ! Like PlanetSide 2,some places can make quite a scenery and I love it ! Just remember to turn Post Processing ON.\n+ Cool vehicles designs with a wide range of variety,from wingsuits to fighter jets,each with its upgraded version that consume less fuel and have more speed.\n+ Humor element included.Dancing Gangnam Style beside a campfire with a dubstep music will replenish your health and stamina.You can also poop anywhere you want.\n+ Fun building.Bases are some kind of your personal trophy,and designing it is a lot of fun,especially preparing your base to punish griefers.\n+ Your character can do a lot of emotions,it decreases the crude feeling of the game.For example,you can wave,you can clap,you can vomit,you can say hi,you can salute,etc.\n+ Very friendly and supportive community.They will help you level up,they will help you farm,they will give you high level weapons and multitools,they will guide you,and some of them will give you a ride to certain places if you don't have a vehicle yet.(Asia 01 server)\n+ Very active and communicative devs that will help you with any kind of in-game issue\n+ New players won't suffer from high level players,since there's some kind of protection policy on Asia 01 server.High level players who kill new players will get punished by the level 300 guy.Big shoutout to Klipwc for the great guide and his support for new players.\n\n[b]Cons :[/b]\n- Game performance is dreadful.You will experience crashes mid-game,connection interruptions (ur character blinks around the map),fps spikes,ping spikes,endless loading screen,game suddenly not responding after loading,and sometimes,you will have to wait around 25 minutes after loading for the map around you to load.During this wait time,the map around you will refresh constantly and you will get 5 to 20 seconds freeze each time you try to move.The problem is from the game itself.High end gaming PCs won't fix this.\n- Spotlights will drop your fps to 5-10 if you fly near them,despite your strong PC spec\n- Very few players(2-10 players each server).This is due to the high system requirements and the current state of the game.\n- Needs a lot of time to farm.The resources you get from the sources are so low that it makes the majority of time you will spend in the game is for farming.\n- Monster spawning system still require a lot of work.Monsters still spawn behind you,on top of you,or sometimes doesn't spawn at all even if I already waited for 15 minutes.Imagine high level bosses spawn on top of your head.\n- If a lot of people play this game,this game will not be ready for 32 players on each server.I'm sure it will increase the loading time,and your bases will get destroyed everyday.People will attack each other for the resources,since it will take a long time to farm,and they will also try to get the 100 kill hat trophy.\n- You will lose 90% of your resource when you die (50% if you maxed your Astronaut skill).As I said before,this game is not ready for 32 players.Imagine 32 hostile players attack each other for resources and no high level player protect the new players.It will be a total chaos.Bases will be destroyed easily by the players that already has rocket launchers or tanks.Losing 90% of resource is a pretty ridiculous system and it's one of the biggest factor that make this game isn't ready for 32 players.\n- Classic RPG mentality problem.Some high level players are very proud of their bases,vehicles,weapons,etc.They show off their things everyday to the new players and tell them to do stupid things for their amusement.\n-Griefers alert.Griefers are extremely annoying in this game and one of them are very active going around the servers to troll.They will destroy your bases,change your signs,steal your resources,etc.All experienced players are currently hunting griefers even though it's very hard to find and punish them,since they always move from server to server.Beware for M.F Thatherson.He is the infamous griefer that goes around the servers.\n- New player spawn point system is ridiculous.There is a chance for you to spawn inside hostile base even though it's your first time playing.Auto turrets will shred new players that're the victim of this spawning system.I was forced to leave my old base because I accidentaly built it on the noob spawn point.\n- You need 16 gigs of RAM if you want to run your own server,and at least 8 gigs of RAM to play with maximum settings.This requirement really shows that this game isn't optimized well and perform horribly.Note that not all country has cheap access to computer thingies.\n- New guns only means new colors.No new designs from each guns.There's only 1 design for pistol,1 design for shotgun,1 design for SMG,and 1 design for Assault Rifle.The melee already has a lot of designs though.\n- No headshot hitbox,makes combat system very boring and requires a long time.Imagine holding LMB/clicking LMB multiple times for hours on each cave with no variation at all.\n- No new weapon sounds.All weapons have the same sound,except SMG and shotgun.\n- Boring and dreadful soundtrack,except the campfire dubstep music.\n- Building bases maybe fun but the building system is still not perfect.It's pretty complicated and made a lot of my friends frustrated.\n- Bases lack of decorations.They should add chairs,tables,or any other decorations that has actual effect on the game.For example,a daily EXP/resource buff if we use certain furnitures.Today,all bases are only filled with crafting stations,composter,stargates,and their defense systems,which make the bases look horribly empty.\n\n[b]Suggestions[/b]\n1.Fix the performance of the game ASAP.The game's performance today is extremely horrible.It's worse than horrible.There's no word to describe it.It's just a total mess.Imagine losing 90% of your resources only because you disconnected by the game's ping spikes and the game killed you with \"CDT_ForcedSuicide\"\n2.Increase the farming speed.Harvest pets should give twice resources and each resource points should have more resources available.Farming 20 woods from each tree while you need thousands to build a base and craft things is ridiculous.\n3.Ban griefers.I know it's PvP and griefing is technically not an illegal thing.But remember that it hurts the player base because common sane people hate and avoid games with griefers.Griefers are trollers.They are people who have questionable sanity and mentality,that entertain themselves by making other people angry through internet because they feel invincible since people can't do anything to them.\n4.Find permanent teammates.With today's rate of farming,you need at least 1 permanent teammate.The more the merrier.Teammates will decrease the time needed to build a base and craft things,because you can easily trade resources through public/FoF only storage bin.\n5.Play at the most crowded server in your region.More high level guys means more support for new players.Just be patient when they're showing off,and refuse when they told you to do stupid things for their amusement.\n6.Read Klipwc's guide on how to make grief-proof base.There is a way to completely prevent griefers from destroying your base\n\nOverall,this game has a great potential.But it still needs a lot of work (Remember,it's still on early access).I know that today only a few people play this game,but opening the server for 32 players with this current state of the game is ridiculous.If they want to open it for 32 players,they have to be ready for it.Note that I am not stating that there are literally 32 players inside the game today.Even with this current state,I still have a lot of fun playing it with my friends,as long as I ignore the irritating people.", "timestamp_created": 1437811928, "timestamp_updated": 1438743356, "voted_up": true, "votes_up": 127, "votes_funny": 3, "weighted_vote_score": "0.829315483570098877", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "13979325": {"recommendationid": "13979325", "author": {"steamid": "76561198008900618", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 945, "playtime_last_two_weeks": 0, "playtime_at_review": 763, "last_played": 1471251513}, "language": "english", "review": "Well, what to say... From the few videos you see you really want to get it, at least that happened to me. Is it fun? Yeah, but it won't last long.\nI felt attracted to the game mainly because of the looks of it and the fact that it was a survival/crafting game. \n\n:: SURVIVAL ::\n-The only survival aspect if you play singleplayer (hosting your own server to play alone in it) is the fact that you have that hunger bar, that, if you just farm for blueprints, exp, and materials from mobs you'll get plenty. Nothing more, you won't even see it, like, NEVER, going down to half.\n-In multiplayer the survival aspect comes from trying to survive from other players, if you are on a pvp server ofc.\n\n:: ENEMIES ::\nLittle variety. You have slimes, something that resembles a really fat bee, a tick/louse thing that barks, a blue humanoid alien that you really don't want near you and another mob that's called Day killer and Night killer (depends on the time of the day) that runs fast and wants to kill you. The only thing that change with this mobs is that they are elemental based (Icy slime or blaze slime f.e.). Can't remember if you have more enemies.\n\n:: CRAFTING ::\nDon't, just DON'T buy this if you assume the crafting system will be like Minecraft or Don't Starve. You can craft very few things at the beginning, and if you want more, you need to kill everything on sight hoping to get a blueprint. This is easier if the mob or boss you are killing has a few levels more than you (1 or 2). The red crates that drop stuff just gives you materials, not blueprints. A thing devs might add to the crates, at least basic bp's.\n\n:: WEAPONS ::\nYou have the basic item, and the same with an elemental damage type to craft (fire, ice, poison, electric, and maybe one more). U start with a hunting knife, then you might get a club, a wooden sword, pistols, rifles, and even a shotgun.\nFiring weapons sux, really low dmg even with the Pet that buff that. I used a wooden sword, and a wooden sword with fire damage until lvl 14. Remember, if you don't get a blueprint from monster drops, you are gonna have a bad time...\n\nThe \"mining tool\" that you use to get ores, wood, crystals and stuff has like 10 or more upgraded versions to craft (Mark I, Mark II, Mark III, etc.). I crafted the Mark VIII and didn't even noticed a change. Maybe it mined a bit faster, but the same numbers of mats where being mined (1).\n\n:: The World ::\nSmall if you ask me. Even more small if u join a server with lots of ppl. It has a central island, and 1 or 2 more of high lvl mobs and dungeons (from 14 to 29 from what i saw).\nCan't remember if the stuff i read before buying the game said anything about being able to explore other worlds but you can't here, not now at least. Remember it's an EA.\n\n:: FINAL NOTES ::\nIf you like the general idea of the game (watch gameplays) and want to buy it now before it's fully finished (and more expensive maybe), buy it. \nIf not, don't do it. I bought it in 11/01/2015 and today (14/01/2015) am ready to say that maybe when finished, it will be a fun game to play. Not now, but maybe someday.\n\nI really don't know what more to say. I liked the game the time i played it. I still like it, and i think this has much more to offer.\nRight now devs are trying to reduce the lag on their servers, but between yesterday and today i had to download 2 patches, wich is a good thing.", "timestamp_created": 1421218856, "timestamp_updated": 1421219078, "voted_up": true, "votes_up": 107, "votes_funny": 5, "weighted_vote_score": "0.829309165477752686", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "14846992": {"recommendationid": "14846992", "author": {"steamid": "76561198031019823", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 9876, "playtime_last_two_weeks": 0, "playtime_at_review": 7347, "last_played": 1485286178}, "language": "english", "review": "I really can't wait for future updates this game is really fun and already has alot to it.\n\nSo far i've found a pretty active public server with lots of people on it.\nAll the servers have their own home planet but once you head to a other planet by building a stargate, all the servers ( about 12 at the moment ) are on common ground. \n\nYou have the possibility to create building blocks with ladders, doorways, closed rooms, open rooms, teleportal rooms, glass rooms, shields, gun turrets, material factories, armories, spawn uplink points, stargates and alot more. I'm sure ALOT is going to be added in the future.\nThese buildings can all be protected from outsiders or be set to public if you wish to share with others \n\nThe game is heavily material grind and PvE based wich in my opinion is great cause you feel that you have progression but ofcourse that differs for others.\nThat said PvP is also a big part of this game. At the moment when you kill other players you can loot all their resources if they aren't able to pick it up within 15 minutes. The gear will stay after the resources are picked up so you won't be completely useless after you've been killed.\n\nCombat takes abit getting used to i'm hoping to see future improvements since the animation when swinging your melee just swings your arm rather then seeing your body put weight into the swing.\nWould also love to see more diversity in melee weapons as the begin we're able to make a 'club' while the rest of the melee weapons are all knifes ( wich look pretty badass )\n\nFor guns there is a good diversity from what i've seen. Assault rifles, pistols and shotguns at the moment. \nCombat with those also needs improvement since now whenever you shoot you always have to be zoomed in wich is quite annoying since you cant really see what's going on around you and walk into mobs or against walls wich gets me killed most of the time.\n\nAs for teams we're able to set a 'FoF' up at the moment that way you can share structures, portals and other stuff with your buddies.\n\nI've had tons of fun so far and will continue playing this. Already been in a conflict with other players where i got ganked on the moon and retaliated by seeking sweet revenge upon their base ! \n\nBring it on players ! \n\nOh and if you don't like PvP you can always choose a PvE server :)\n\nI hope this review gave you enough information, if you have any questions feel free to ask.\nI always keep steam broadcasting on for everyone so if u want to see gameplay footage you can always check it out too !\n\n\n", "timestamp_created": 1426132581, "timestamp_updated": 1426132581, "voted_up": true, "votes_up": 70, "votes_funny": 8, "weighted_vote_score": "0.826409399509429932", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "36683689": {"recommendationid": "36683689", "author": {"steamid": "76561197983001241", "num_games_owned": 297, "num_reviews": 20, "playtime_forever": 816, "playtime_last_two_weeks": 0, "playtime_at_review": 703, "last_played": 1429967975}, "language": "english", "review": "Dev's gave up on it.\nNot supported, was a good game though.", "timestamp_created": 1511299309, "timestamp_updated": 1511299309, "voted_up": false, "votes_up": 59, "votes_funny": 2, "weighted_vote_score": "0.823450922966003418", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "15245858": {"recommendationid": "15245858", "author": {"steamid": "76561198060061431", "num_games_owned": 0, "num_reviews": 37, "playtime_forever": 4799, "playtime_last_two_weeks": 0, "playtime_at_review": 2348, "last_played": 1640226450}, "language": "english", "review": "HIGHLY RECOMENDED TO THE FOLLOWING: 1. any fan of minecraft, 2. any fan of the forest, 3. any fan of starbound (this game STRONGLY resembles a 3d starbound to me)\n\nPERKS/PROS\n+Sand box\n+Survival\n+Vehicles\n+Guns\n+Swords\n+Buildings\n+Challenging as you must unlock more blueprints\n+Levels\n+Skills\n+Dungeons\n\nBUGS/CONS:\n-Sometimes buildings will disappear after reloading your world (quit/disconect and rejoin)\n-A.I. are incomplete and all are pet vendors as of now (People and robot A.I.)\n-All A.I. seem to be able to No-Clip thru natural structures (Trees, Rocks, (etc.))\n-Some resources (trees, ores, gems, (etc.) trees mostly tho) will sometimes also be clipped thru natural objects such as rocks.\n\nOverall rate = 4.9/5 or 9.8/10\nThis game has a very strong potential outcome to be one of the best on steam (or atleast very close to minecraft equivalent) seeing as whats already here and it still only pre release.", "timestamp_created": 1428383822, "timestamp_updated": 1428383822, "voted_up": true, "votes_up": 65, "votes_funny": 4, "weighted_vote_score": "0.814461767673492432", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "30597734": {"recommendationid": "30597734", "author": {"steamid": "76561198051199581", "num_games_owned": 391, "num_reviews": 1, "playtime_forever": 3262, "playtime_last_two_weeks": 0, "playtime_at_review": 3117, "last_played": 1653231034}, "language": "english", "review": "I played GRAV when it first came out. Servers were active, the game was fun for all, development was smooth and steady bringing great balancing and stuff that the players needed. Dungeons dropped plans frequently, everything didn't cost to much to farm, and we actually went to other worlds. This what GRAV should've been, but all of a sudden the REBORN update hit, changing everything for the worst, making drops more rare, everything needs to be farmed a lot more, and making the beginning strategy useless. If they had never made the REBORN update a thing, I believe the game would still be active and people would be enjoying it.", "timestamp_created": 1489860962, "timestamp_updated": 1489860962, "voted_up": false, "votes_up": 99, "votes_funny": 3, "weighted_vote_score": "0.810508847236633301", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "13936824": {"recommendationid": "13936824", "author": {"steamid": "76561198040421305", "num_games_owned": 281, "num_reviews": 10, "playtime_forever": 5851, "playtime_last_two_weeks": 0, "playtime_at_review": 4490, "last_played": 1444696963}, "language": "english", "review": "Okay from the time I'm writing this I have 36 hours of game time in GRAV. This game has considerably exceeded my expectation from the being as an early access game in a difficult genre. Not only is the game both beautiful and fun to play the community and developers are pretty amazing. From day one yes there has been many bugs but those are expected, in an early access game. Almost immediately they were dealt with in a patch released hours after. If you're willing to contribute and help the game grow and develop buy it. If you want a more finished product wait a little while. My recommendation is to buy it and get in on the GRAV! :3", "timestamp_created": 1420954835, "timestamp_updated": 1420954835, "voted_up": true, "votes_up": 123, "votes_funny": 1, "weighted_vote_score": "0.808961093425750732", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "20278018": {"recommendationid": "20278018", "author": {"steamid": "76561197969584286", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 15418, "playtime_last_two_weeks": 0, "playtime_at_review": 14590, "last_played": 1452959586}, "language": "english", "review": "TL;DR: Should have returned this game instead of looking for the good in it. Does not match advertisement or expectations. Several environments in preview videos do not exist. Previews suggest gameplay that is not present in current stage of development. Gameplay is exceedingly simplistic grinding for numbers. Game is in alpha stages with resource, stability, and memory leak issues. Potential exists, but no amount of quantity makes up for the lack of quality.\n\nWhat follows is a section by section commentary on the \"about this game\" bullet points.\n\nEndless Worlds - Planets are not procedurally generated, counter to advertisement. All planets have a static map. Exoplanets rotate every 3 hours, making some game objects virtually useless. Exoplanets are often either small enough or with rough terrain to render land vehicles near useless. Flying vehicles feature six axis movement but no horizon or flight hud and no tuneable flight controls: expect to roll and tumble wildly for your first dozen flights. Glide suit and jetpack do not work together, you must alternate using one and the other to remain in the air.\n\nGorgeous Visuals - While GRAV can be rather pretty, the visuals are unoptimised. The game itself consumes an inordinate amount of system RAM (4gb+) and leaks memory (consumed 7gb system ram after a few hours). Reducing texture LOD reduces visual quality far faster than system load. I frequently experienced terrible artifacting near the beach area, with each patch to the game slightly altering the location and severity of the artifacting.\n\nFrenzied Combat - Circle strafe while tapping backwards and holding the fire button for up to a minute per enemy. Twelve different palatte swapping enemies advance with the same mindless behavior and ignore collision with most player placed objects, but halt and become confused when the player jumps onto slightly elevated or out of the way platforms. Enemy melee attacks damage the player for ~50% of health in early game and nearly nothing late game. Rare enemies use mild but irritating camera shake inducing ranged attacks alternating with AoE ground pounds and regular melee. One mob has a pushback that deals significant damage if you are pushed into a wall. \"Boss\" type enemies are ~3x the size with ~4x the health and ~2x the XP. Using on-tier equipment against equal-level mobs, players damage enemies for ~1% of health using automatic weapons: expect to carry 10,000 rounds of ammunition and use 75-150 rounds per mob. Grind away for hours as XP gain sharply falls toward 10 when fighting mobs below your level and damage sharply falls toward 1 when fighting mobs above your level. Enjoy becoming stuck on random terrain or ambushed by sudden respawns from behind and dropping 50-90% of your loot.\n\nPlayer vs Player - No easily managed friends list: become friends with people by giving them the numeric passcode to your team's private chat and granting them entry to all your buildings and belongings. No method to determine who is currently using that passcode. Changing your individual passcode does not automatically update your buildings or chests. No such thing as a list of foes for tracking your enemies. No such thing as a neutral list, anyone who isn't your friend is your enemy. Impossible to raid other players bases unless they contain one of two different placeable objects.\n\nPlay With Friends - Most of my friends were bored within 10 hours. Many quit after 60. Due to the nature of the friend passcode, it is very difficult to make friends for fear of major theft. System resource requirement is prohibitive to running a Solo or local server.\n\nPowerful Base Construction - Build cube shaped rooms to make cube shaped bases. No method to control which walls are removed or preserved when building an adjoining room. No method to add walls back to a room after walls have been removed. Destroy the entire room and try again. Sometimes this requires you to destroy an entire quarter of a base and try again. Don't bother trying to build balconies around your base. Turret damage is overpowered at low levels and near worthless at upper levels.\n\nExtensive Crafting - There are ~123 different crafting materials, but the bulk of work is done by 10. The rest are one-off items for specific recipes you may use only once or never at all. You will craft an AR and an SMG because the AR has the best DPS without rapid clicking and the SMG ammo drops are plentiful enough to make it a viable secondary. All other ammunition is a waste of inventory space. By the time you have an automatic weapon, melee is a waste of time and effort. Equipment progresses linearly while costs increase somewhat exponentially. Defensive equipment is the primary progression, but variation is lacking. At least one set of equipment is a palette swap. Defending against an environmental hazard often means using equipment well below the area's difficulty. There is no method to sort, filter, or easily manage your inventory or your storage bins.\n\nDynamic Environmental Events - Enemies spawn more frequently at night. Night is very dark and flashlights are craftable temporary accessories. Large numbers of a single enemy type will spawn occasionally as an \"event\". I have never seen flowers bloom as part of the day/night cycle as advertised. I have never seen meteors fall across the terrain as advertised, let alone regular rain. Sometimes there is fog, and that's about it.\n\nProcedurally Generated Dungeons - Dungeons are procedurally generated from about sixteen different component rooms, but component rooms are static, uninteresting tunnels, often accompanied by invisible clip walls and enemy pathing issues. The same four direct harvestable resources are available on all planets. Three resources require a placeable object to create/harvest. Four resources are exoplanet specific, making them slightly harder to get. Each \"level\" of exoplanet has an \"uncommon\" variation of each of these resources, but you'll soon find yourself throwing out stacks and stacks of the uncommons once you've used them for their one purpose. Sometimes there is a pit in the caves or the procedural generation makes a gap to empty space; I guess those are the advertised environmental obstacles.\n\nHostile Environments - Warping to a planet with a hostile environment without the appropriate equipment begins a countdown. When the countdown is over, you lose 5% of your max health every \"tick\". All water off the home planet is damaging. That's about it.\n\nRoadmap - Several of these features are already or partially implemented. This is not a good track of coming features or completed features.", "timestamp_created": 1451873902, "timestamp_updated": 1451873902, "voted_up": false, "votes_up": 174, "votes_funny": 11, "weighted_vote_score": "0.807779192924499512", "comment_count": 24, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "21490940": {"recommendationid": "21490940", "author": {"steamid": "76561198013101783", "num_games_owned": 0, "num_reviews": 122, "playtime_forever": 17372, "playtime_last_two_weeks": 0, "playtime_at_review": 17140, "last_played": 1500156310}, "language": "english", "review": "Final Review (Half-Year In The Making) DO NOT BUY, AVOID LIKE THE PLAGUE.  GAME IS BEING TREATED LIKE POST-RELEASE IN TERMS OF DEVELOPMENT WHILE IN EARLY ACCESS.\n\nThe developers, in their communication with their customers, make their changes sound wide-ranging and grandiose, like adding entirely new multiplayer mechanics or the like while they tweak small portions of their UI or networking code over the period of a half-year.\nIn the amount of time the game has been in early access (read since the release date on Steam) there has been all of one major update.  This is over YEARS of development. As a customer and reviewer, I cannot stress ENOUGH how little progress has been made on this game and how much of a debaucle this has been over the years.  I've logged far too many hours into this game to demand a refund, but if you've logged anywhere in the single or double-digits, I implore; request a refund and go take pictures of your nearest fault line or glacier, since they'll show just about as much change in the same period of time.\n\nArchive:\nIn the past few months, Grav's playability and players' confidence (evidenced by poor player numbers on servers) with the game has tanked.  The devs pushed out the Reborn Update, which got lots of people into the game, but neglected to fix a number of annoying Quality of Life bugs for weeks on end.  (One of which could have been fixed by a // or /*)  Players hemmoraged as soon as they added \"overflow servers\" to handle the free period players that swarmed in.  Older players left during this period and didn't bother to return.  These overflow servers, or at least the architecture behind them still exist to this day, splitting players up and making it impossible to play with one's friends from the get-go. (Extra step(s) added beyond building a flare launcher: Acquire blueprint for Home Gate, Build Home Gate.)  Two serious mismanagements nearly wiped their active player table to pre-Reborn Update levels.\n\nGRAV's premise is amazing and I watched it for over a year and a half, and have played it extensively, but I took a break (around that free weekend with the annoying sprint bug at its heels), poked back at it and I don't see myself wanting to play this again, since I can't start playing with my friends.  They get thrown onto a different sub-server which is, all-in-all, poorly noted to the player.\n\nThey appear to have gotten lazy, dev updates are nearly nonexistent on Steam.  This game is on life support for the time being.  (Really, what have they been working on for the last six months and why are they so reluctant to tell us about it?)\n\nI'll be checking back periodically, but I have much lower hopes for the future after this debaucle.  Perhaps I'll rope one of my friends in to see if the sprint bug is still there.\n\nUpdate: (Pretty much October)  It appears that there has been about no development on the game since I've made my review.  If I had to estimate, in the past seven months, there's been maybe two to three times that many man-hours put into the game.", "timestamp_created": 1456549729, "timestamp_updated": 1475256726, "voted_up": false, "votes_up": 128, "votes_funny": 2, "weighted_vote_score": "0.807438790798187256", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "15300904": {"recommendationid": "15300904", "author": {"steamid": "76561198033887428", "num_games_owned": 273, "num_reviews": 4, "playtime_forever": 1785, "playtime_last_two_weeks": 0, "playtime_at_review": 954, "last_played": 1447117889}, "language": "english", "review": "At first i didn't think I would like it. Sure I read what it was about and everything but, since its early access i didnt think it had much to offer. Damn I was wrong!\n\nJust bought today and put in a good four hours so read this review with some caution. I'm not fully capeable of giving a in-depth review.\n\nI started out by playing with two of my buddies. Making a server wasn't that hard it's almost like making a vannila Minecraft server. (Need help go to wiki) Then loaded into the world. The first 20 secconds will be a bit laggy because, everything rendering in. We got a house going and started cave hunting. The enemies scale nicely and theres not much of a learning curve. I would also like to add that I absolutly love how the developers of this game update it almost daily! Thats somthing i love to see. It shows they care about their consumers and game! Keep up the good work!\n\nPros~\n-Small learning curve\n-Looks Beautiful (For alpha)\n-Lots of content (Was very surprised)\n-Updates almost everyday!!!\n-Noticed little to none bugs\n-Enemy Scaling system\n-LOTS OF ITEMS! :D\n-Price\n-Much much more\n\n\nCons~\n-I run a r9 290x OC and a i5 2500k and its choppy (56 to 32 FPS) at some points which is disapointing so i find it hard to belive that lower end PC's can run this game well.\n-Better looting system with friends (No loot hog)\n-Same enemies\n-Graphics options!!! <---- That's what really got me\n\nTips~\n-New enemies\n-Extra Vehicles (Gyrocopter?)\n-Optimise\n-Mod support (later on)\n-Space travel instead of portals? (Build your own spaceship)\n-Pets that attack for you\n\nIf you read it down to here i appriciate the time you took! I definitly recommend this game because; The developers update often which you dont see a lot! Lots of content! Low price for a game you can play for hours. And in my opinion i find it actually relaxing building and chopping down trees.\n\n\n", "timestamp_created": 1428727200, "timestamp_updated": 1428727200, "voted_up": true, "votes_up": 47, "votes_funny": 3, "weighted_vote_score": "0.805406093597412109", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "36162793": {"recommendationid": "36162793", "author": {"steamid": "76561198000266844", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 97, "playtime_last_two_weeks": 0, "playtime_at_review": 97, "last_played": 1435109997}, "language": "english", "review": "Dead game. Had potential but has been abandoned by creators. Should be pulled from the store.", "timestamp_created": 1509445955, "timestamp_updated": 1509445955, "voted_up": false, "votes_up": 58, "votes_funny": 0, "weighted_vote_score": "0.793901145458221436", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "74798421": {"recommendationid": "74798421", "author": {"steamid": "76561198067784761", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 291, "playtime_last_two_weeks": 0, "playtime_at_review": 291, "last_played": 1479764220}, "language": "english", "review": "I feel like we should start getting refunds for games the devs abandon after they get our money.", "timestamp_created": 1598210597, "timestamp_updated": 1598210597, "voted_up": false, "votes_up": 44, "votes_funny": 1, "weighted_vote_score": "0.790382146835327148", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "35708836": {"recommendationid": "35708836", "author": {"steamid": "76561198118005728", "num_games_owned": 0, "num_reviews": 567, "playtime_forever": 96, "playtime_last_two_weeks": 0, "playtime_at_review": 96, "last_played": 1507958068}, "language": "english", "review": "I bought this a couple of years ago, played it for about 15 minutes then forgot about it. I decided to check it out again and it's basically the same as it was 2 yrs ago. There has very little progress made by the devs. Really pretty sad, GRAV could have been something special but the devs have abandoned it.", "timestamp_created": 1507958544, "timestamp_updated": 1507958544, "voted_up": false, "votes_up": 56, "votes_funny": 0, "weighted_vote_score": "0.789553523063659668", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "13983531": {"recommendationid": "13983531", "author": {"steamid": "76561197993256650", "num_games_owned": 403, "num_reviews": 8, "playtime_forever": 1313, "playtime_last_two_weeks": 0, "playtime_at_review": 1187, "last_played": 1422694747}, "language": "english", "review": "First off I want to say my Review:Game ratio speaks for itself. I don't review things unless they really make an impression.\n\n\n/Started the game with an open mind, which really means \"Why did I buy this?Well lets see what kinda mess this is..\"\n/I was pleasantly surprised.\n/Picked a server from the extensive server list and joined.\n/After weeping at the view, I start to wander.\n/Met a higher level player, may his benevolence continue to shine, for I was not murdered instantly.\n/I fought some monsters, and surprised at how you need a tad bit of skill for even basic ones.\n/Of course I got hurt. Built a campfire and danced.\n/I could FEEL the music. Someone said 'Hello' and joined the fire-dance, The music got better.\n/I realized after the dance was over the 'someone' was an NPC... OMFG WHAT! NPCSARESOCOOL\n/talked to NPC.  NPCS are ok...\n/Gathered resources and got lost. desperately tried to locate my fire for hours.\n/Gave up, and made a new one, realized how cheap it was...Shame.\n/Crafted a small 2 room 'base'  (hovel) and put assorted crafting structures around it.\n/Lost it all to a walking bomb or two.\n/Rebuilt the base, realized how expensive it was...Shame.\n/Broke some machinery that didn't belong to me, gathered something I didn't understand.\n/Ran far away when high level people started making death threats in chat over the loss, giggled in mischievious glee.\n/Went into dungeon with basic rotted wood armor like a champion.\n/Died horrible death for my hubris.\n/Realized I am back at my first Fire and have no idea where my base is.\n/Gave up on that server, MADE MY OWN!\n/I AM GOD OF THIS LAND\n/INVITED FRIENDS\n/WE ARE GODS\n/contentment\n\n10/10 Would be god again\n\nOk for the real review:\nlike myself, you are reading these reviews for the simple fact that, yes, Early Access has burned you hard, probably 2-3 times and you're torn inside thinking \"why do I do this to myself, here I am, looking at ANOTHER E.A.\"\nThis review is for THAT gamer.\n\nFirst off I've bought my fair share of crap, I don't learn. But this is my first review on an Early Access game for a reason.\nThe game's not finished but that doesn't mean its not working! The game has DOZENS if not HUNDREDS of hours of content. Like a sandbox, you make your own game out of it. Are you going to follow the mold and be a settler? An explorer? A raider? A completionist? GRAV has something for everyone.\n\nThe negatives:\n>Its Early Access: Its not Optimized, Its not Finished, ITS NOT A FULL GAME. please understand this.\n>The UI is slowly being put together, which means its kinda crap, but at least In 2 days I've seen some improvements.\n>Running your own server is an exercise in basic Batch File building. Admining your server is an exercise in commands\n\nThe Positives:\n>Its Early Access: It's being ACTIVELY supported, every indication, like how i've downloaded 3 fixes in 2 days, says so.\n>It's Early Access: If you love the game now, every addition is FREE DLC. If you followed Minecraft for years, you know what to expect.\n>There's tons to do. and the leveling and gear system is well-built. It rides the line between 'quick and easy' (and boring and bored of this game) to 'long and arduous' (and boring and bored of this game) You'll feel like you have a goal that's just around the corner for many hours, which let's be honest is damn near impossible to find in games these days.\n>If you take the time to learn the commands, there's a ton of control you can influence on your gameplay. (check built in Wiki link in-game)\n>You heal by dancing around a fire. that fire makes music when you do. the music gets better the more people dance. THE MUSIC IS DUBSTEP.\n\nOverall I give this game a 9/10 It's amazing and I'll be back to flip that review to a 10/10 if they continue development and finish the game.", "timestamp_created": 1421251263, "timestamp_updated": 1421251423, "voted_up": true, "votes_up": 60, "votes_funny": 72, "weighted_vote_score": "0.782670736312866211", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "15872665": {"recommendationid": "15872665", "author": {"steamid": "76561197972432865", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 3048, "playtime_last_two_weeks": 0, "playtime_at_review": 1956, "last_played": 1448828505}, "language": "english", "review": "Totally worth the bucks. It may play a bit like a MMO as combat is essential to progress, but so far I have almost no con.\n\nPro: \n+gigantic open worlds\n+dungeons \n+already a vast amount of biome variety\n+Campfire!!! (Press X and let the party begin)\n+good crafting system\n+great looks\n\nCon:\nOne downside is that you cannot hunt for specific planets like desert planets or tundra planets, so there might be a little frustration there, but it's not that bad and will hopefully change in the future.", "timestamp_created": 1431875234, "timestamp_updated": 1431875234, "voted_up": true, "votes_up": 66, "votes_funny": 3, "weighted_vote_score": "0.781987607479095459", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "42464017": {"recommendationid": "42464017", "author": {"steamid": "76561198033900957", "num_games_owned": 0, "num_reviews": 34, "playtime_forever": 261, "playtime_last_two_weeks": 0, "playtime_at_review": 261, "last_played": 1439753698}, "language": "english", "review": "I really enjoyed this game.\n\nAll the features it have and the potential that it had.\n\nSadly, the game has been abandoned.\n\nI really do think that Valve needs to have certain policies in place to protect us, the consumers.\n\nEarly Access has been used as an excuse for far too long now.\n\nIt is a good game for what it is and for how far into development it is, but i can't recommend the game because of the developer and how they left without saying anything to the community that supported and backed them through Early Access.", "timestamp_created": 1528010702, "timestamp_updated": 1528010702, "voted_up": false, "votes_up": 37, "votes_funny": 0, "weighted_vote_score": "0.777763783931732178", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "15554122": {"recommendationid": "15554122", "author": {"steamid": "76561197974575672", "num_games_owned": 0, "num_reviews": 50, "playtime_forever": 1690, "playtime_last_two_weeks": 0, "playtime_at_review": 1690, "last_played": 1430032795}, "language": "english", "review": "This game has a good start for a good game.  However, in its current state, it is limited and buggy - as to be expected for early access.  \n\nThe good:\nGraphics\nCombat\nExploration\nSimplified resource gathering\nVehicles\nGuns\nPets\nWide variety of items to craft\nClasses with bonuses\n\nThe bad:\nNo real level progression*\nCollision detection\nRarity of certain common resources*\nLack of base defense options\nLack of harvestable resource types\nLack of monster models\nVery resource intensive\nSmall groups are ineffective*\n\nThe bad will probably be resolved, but a few really stick out.\n*No real level progression: Sure your classes can level up and you can create new weapons and armor.  However, it doesn't matter.  All weapons are level based damage.  This means if you give a level 1 character the max level weaponry, they will still hit mobs that are only one level above them for minimal damage.  This is not apparent at lower levels, but after one reaches level 20 or so, it is an obvious pattern.  Bosses that used to be challenging turn into a huge time and ammo sink instead of being fun.  \n\n*Rarity of certain common resources: There are a ton of resources in this game.  However, you will run into a brick wall for one or two of them that are extremely rare - even though they are marked as common.  These resources will be staples to your progression and will basically stop it until you run around gather the 1 or two around the entire planet for a few hours.  But even then - when you do build that upgraded equipment, it won't have a noticeable change on combat. \n\n*Small groups are ineffective: If you want to play this with 1 or two of your friends, it will be fun for the first few hours.  However, after level 20 or so, the \"no real level progression\" portion kicks in.  If you find a loot chest or an artifact, you're either going to waste all of your ore on ammo or fail to get the artifact.  \n\nAll in all, it is worth a try.  I liked the game for a while.  However, the bad points really ruined it.  Hopefully these get resolved.", "timestamp_created": 1430033609, "timestamp_updated": 1430033609, "voted_up": true, "votes_up": 37, "votes_funny": 1, "weighted_vote_score": "0.775098443031311035", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19065620": {"recommendationid": "19065620", "author": {"steamid": "76561198063114103", "num_games_owned": 0, "num_reviews": 23, "playtime_forever": 499, "playtime_last_two_weeks": 0, "playtime_at_review": 473, "last_played": 1470115594}, "language": "english", "review": "This game crashed my PC\nGave me severe fps drops\nMade me frusterated af when you are getting ganged raped by non stop spawning monsters\nLeft me in complete confusion as a level 0\nDisconnected me from the server multiple times\n\nBUT\n\nI fucking love this game. As I spawned into the game having no idea what I was doing or where I was I was stunned by the almost dream like graphics. As night comes by I build a campfire and around 3-4 other level 0 noobies like myself gathered around and chatted. After one of us found the x button (the dance key) we all went ham. The stunning realization that this dope ass music was implemnted as the main way of healing in the game just adds to my respect of the creators. The amount of hype for 5 level 0 noobies was something I have never experienced before, we exchanged stories and went our seperate ways. As morning one of my fire buddies and I began to finish the objectives until around level 5 where it really started to get interesting. We started to get blueprints for vehicles, assault rifles, wing suits, and frog feet (<-- actually quite helpful). Campfire buddy and I have mics so we can enjoy our adventure togethor as we conquer dungeons, wreck n00bs, and pillage from the rich. I soon invited a friend to play with us, so campfire guy and I tp'ed to his world and proceed to waste all of our wood and fossils searching for this scruberino by shooting flares every 5 seconds, but eventually we found him and pillaged togethor once again. As you can see after only my first day of playing this game I have already logged 5 hours into this game.\n\nSide Note: I was originally only going to play about an hour of this game and go back and play fallout 4 but this game just grabed my attention.", "timestamp_created": 1447483022, "timestamp_updated": 1447483229, "voted_up": true, "votes_up": 83, "votes_funny": 28, "weighted_vote_score": "0.771512985229492188", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "40811042": {"recommendationid": "40811042", "author": {"steamid": "76561198027341515", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 9258, "playtime_last_two_weeks": 0, "playtime_at_review": 9244, "last_played": 1450664146}, "language": "english", "review": "It reflects poorly on Steam that this game is still purchaseable on the store.", "timestamp_created": 1521041456, "timestamp_updated": 1521041456, "voted_up": false, "votes_up": 44, "votes_funny": 2, "weighted_vote_score": "0.770728111267089844", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "77006752": {"recommendationid": "77006752", "author": {"steamid": "76561198076833122", "num_games_owned": 1615, "num_reviews": 63, "playtime_forever": 177, "playtime_last_two_weeks": 0, "playtime_at_review": 177, "last_played": 1486092581}, "language": "english", "review": "\"This game, GRAV Reborn, is Abandonware full of game crashing bugs. Yet it is still marketed and sold by Steam as Early Access, when it has in fact had Zero updates of any kind since 2015 (https://grav.gamepedia.com/Patch_notes).\nThis is fraudulent, and is abuse of the Early Access category, and GRAV Reborn should have been removed from the Steam Store years ago. Do the right thing.\"", "timestamp_created": 1601788751, "timestamp_updated": 1601788751, "voted_up": false, "votes_up": 27, "votes_funny": 0, "weighted_vote_score": "0.767364144325256348", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "41826492": {"recommendationid": "41826492", "author": {"steamid": "76561198050857669", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 42, "playtime_last_two_weeks": 0, "playtime_at_review": 42, "last_played": 1448249605}, "language": "english", "review": "Heads up, games dead. Devs abandoned it.", "timestamp_created": 1525344505, "timestamp_updated": 1525344505, "voted_up": false, "votes_up": 38, "votes_funny": 2, "weighted_vote_score": "0.763492465019226074", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "23705781": {"recommendationid": "23705781", "author": {"steamid": "76561198041945517", "num_games_owned": 727, "num_reviews": 20, "playtime_forever": 2709, "playtime_last_two_weeks": 0, "playtime_at_review": 2680, "last_played": 1469602459}, "language": "english", "review": "I may have been extremely positive about this game in the past. I bought multiple copies of this game and gave many to friends. I am now going to retract my positive statements on this game.\n\nI fell in love with the game when I first played it. The graphics are absolutely spectacular and I seriously just walked around and did nothing but look at scenery. The alien landscape is beautiful. Exploring the world, sending flares up in the sky, having little light-producing robots following me in the dark at night, setting up camp whenever and wherever I felt like it... it was amazing. But now my opinion is different.\n\nThe devs are gone. They've disappeared. They've abandoned the game. The last play session I had in this game, my Doom Buggy clipped through the ground (with me and a friend in it). Players may be familiar with this bug -- do not drive in the desert biome with the Doom Buggy, especially near the crashed spacecraft. That Buggy was expensive and was a mindless waste of resources. Unsurprisingly I also died when I tried to exit the Buggy from under the ground. The bugs are going to stay bugs. No one is fixing them. New updates aren't coming. Even the community updates have stopped. I am so disappointed. It seems doubtful that this game will ever leave Early Access.", "timestamp_created": 1466602265, "timestamp_updated": 1466602265, "voted_up": false, "votes_up": 87, "votes_funny": 4, "weighted_vote_score": "0.761634588241577148", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "18814691": {"recommendationid": "18814691", "author": {"steamid": "76561197981455795", "num_games_owned": 413, "num_reviews": 4, "playtime_forever": 3045, "playtime_last_two_weeks": 0, "playtime_at_review": 2920, "last_played": 1475767621}, "language": "english", "review": "Really enjoying this game. I find myself to be easily distracted due to the urge to explore and find new blueprints. Whether you're playing on your own, with friends, or with strangers, it's always a lot of fun. There's PVE and PVP servers to suit the experience you're wanting from the game as well as Official and Unoffical servers. Like I said, it's incredibly easy to become distracted in GRAV. I often find myself gathering resources, then spotting a dungeon and being drawn to the idea of killing mobs and finding them precious blueprints. GRAV [i] can [/i] be a very unforgiving world, you'll have to watch your back whilst gathering, ensure there's enough wood in your generator to power your base and be very cautious on new planets you travel to. All in all, it's a fantastic game, despite some optimisation issues and bugs (remember people, this [b] is [/b] an Early Access game run by an Indie Dev). With a recent major update and an enthusiastic and active dev team, this is a game that is sure to have a great future ahead of itself.", "timestamp_created": 1446382152, "timestamp_updated": 1446729632, "voted_up": true, "votes_up": 114, "votes_funny": 5, "weighted_vote_score": "0.760831832885742188", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "13899311": {"recommendationid": "13899311", "author": {"steamid": "76561198001748570", "num_games_owned": 1500, "num_reviews": 182, "playtime_forever": 1095, "playtime_last_two_weeks": 0, "playtime_at_review": 72, "last_played": 1422300265}, "language": "english", "review": "So I'm writing as of the current state of the game now, by date of its launch ( 8/1/2015 )\n\nEven though I'm giving it a 'thumbs up' it's not recommemed for anybody aside from the people who label themselves as bug finders, as it's not playable to be enjoyable for the average consumer right now. The issue(s) that plague the game at the moment is lag, lots and lots of lag, to the point where it's unplayable to check out the other parts of the game to decide on its quality and whether it's good or bad, but from the parts I've played and managed to look into it is as follows..\n\nThe graphics are decent, with the art style being really colorful and good looking, same goes for the level design of the game with how nice the landscape looks, kind of reminds of No Man's Sky, but it definitely has its own unique fun look.\n\nThe controls are nice and responsive but a bit floaty/boaty, and the UI/Interface of the game are really basic, you can see that it's sort of a place holder. Crafting and building structures and objects/items are easy, but not that convenient/enjoyable with how basic the UI is at the moment. Also, there isn't much to do at the moment aside from crafting, building structures and items, exploring and killing monsters, there may be a lot more stuff to do but it's hard to tell right now, since there is no offline mode too (at the moment, not sure if it will come later on)\n\nSo yea, that's what I got from playing the game at the moment, with how massive the lag is right now. The game has great potential to be a lot of fun, looking at the videos, and getting a quick play session of it now. I don't recomemend it right now, but will definitely check the game constantly to check if it's an ok purchase or not, because I do have really high hopes for this one.", "timestamp_created": 1420750123, "timestamp_updated": 1420751677, "voted_up": true, "votes_up": 99, "votes_funny": 2, "weighted_vote_score": "0.760727167129516602", "comment_count": 22, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "41641288": {"recommendationid": "41641288", "author": {"steamid": "76561198056713586", "num_games_owned": 268, "num_reviews": 31, "playtime_forever": 1248, "playtime_last_two_weeks": 0, "playtime_at_review": 1248, "last_played": 1481645683}, "language": "english", "review": "Bought this game years ago, when it was still updated, The devs were neat, TALKING WITH THE COMMUNITY ABOUT FIXES AND IDEAS.\n\nYet they've abandoned such a neat puppy. Monsters.\n\nDO NOT BUY!\n\nOy valve, please. Take that game off already....", "timestamp_created": 1524481351, "timestamp_updated": 1524481351, "voted_up": false, "votes_up": 36, "votes_funny": 3, "weighted_vote_score": "0.760632753372192383", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "20093843": {"recommendationid": "20093843", "author": {"steamid": "76561198071894016", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 4197, "playtime_last_two_weeks": 0, "playtime_at_review": 3769, "last_played": 1483319326}, "language": "english", "review": "playing GRAV on a server with friends is hilarious. I really enjoyed exploring the world and the blueprints, getting slapped by a \"Fantastic Kevin the Snorter\" , finding that first vehicle blueprint and going to new planets...\nThere are lots of flaws, sure\nBut with the right attention and love Grav deserves it could turn out into such a great game with lots of potential.\n\nPROS:\n-fun gameplay\n-beautifull places to explore\n-lots of dancing and pooping in other peoples houses\n-lots of random moments and places u just want to capture a screenshot\n-devs very active on forums \n-Can't stop playing once you start\n\nCONS:\n- Can't stop playing once you start :)\n- daily grind if playing on official servers\n- not that much variety in the game\n- still lots of bugs (is expected of early acces)\n- monsters can get repetitive ( f.e. killing 100 frogs in and around an area gets kinda boring)\n- pvp system might need some kind of rework/ update ( f.e. adding a punishment system where u lose resources based on the amount of crimes u commited like killing other players. instead of leveling a certain job to reduce the amount of recources lost. So high level players think twice before killing noobs)\n\nSuggestions:(most are obvious ^^): more mobs, more places to explore, more variety in dungeons. more blueprints. rework current pvp system. decay needs to be way longer. i still have lots more but this isn't really the place to go over all this :D\n\nAnd i'm to lazy to go to much into detail ;)\nBut GRAV is a great game and it pains me to see so much negative reviews.\nIf the game can get some more love from both players and devs, i'm sure it will turn into such a great game\n\nSo to wrap this up !\nIs GRAV worth spending 8€ /$ (in sale)?\nYES\ni spend almost 20€ yet don't regret buying it back then\n\n\nUPDATE*: 12 june 2016\nStill waiting on some bigger updates.\nafter seeing GRAV on sale for such ridiculously low prices and the lack of consistent new content i'm starting to worry. The only updates are community updates and balance changes.\nReally hope devs get it together but out of experience... i find this hard to still believe in.\nCan't recommend GRAV for full price anymore but if u don't have it yet and you see it on sale = just grab it. But don't expect big changes. (Still hoping for a change but yeah gotta be real about it, what you see is probably what you get )", "timestamp_created": 1451427144, "timestamp_updated": 1465693811, "voted_up": true, "votes_up": 63, "votes_funny": 8, "weighted_vote_score": "0.757709801197052002", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "16741443": {"recommendationid": "16741443", "author": {"steamid": "76561197993308126", "num_games_owned": 1004, "num_reviews": 18, "playtime_forever": 40505, "playtime_last_two_weeks": 0, "playtime_at_review": 33762, "last_played": 1520609979}, "language": "english", "review": "EDIT\nGame is incomplete and dead\n\n\nWith over a 160 hours on Grav as of the time this review was written. I did like to believe I can at least write a decent one. \nI now clock over 400 hours as of build 20.\n\nI have also written a guide for this game. Reading it will help you address the common annoyances people have with the game and also further influence your decision to get it.\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=470854662\nThe review has had stuff added due to patch 19. Nothing was removed though.\nThis review has been re-written for build 20 due to the large amount of stuff and improvments added to the game. New players have a much easier time starting the game now due to the new damage curve, area level re-rolls and tutorial objectives.\n\nFirstly, Grav is a sandbox open world, much like the other sandboxes on the market, you farm for resources, craft stuff, build bases and consume stuff to survive. It also belongs in the Sci-fi theme. The game does start out alittle boring, but once you get to around level 13 and make your first trip to the moon, the game becomes infinitely more fun then. I would suggest trying the game till this point before asking for a refund.\n\nWhat sets this game apart from the others? Honestly I cant give a definite answer to this yet, and I am not gonna mention dancing. The game is still in development and community suggestions on stuff to be added to the game are conflicting. [ e.g building decay ] But still I am recommending it  based on several factors. \n\nPros:\nLarge maps\nGame is gorgeous\nThey got the basics right\nAll basic resources are always useful\nGreat developers\nEarly access, updates come hard and fast, a new build every 2 weeks\nVehicles, jetpacks, wingsuits\nProblems are solved fast\nBuilding stuff is great if you are innovative\n\nCons:\n8GB RAM requirement\nRepetitive combat [or rather, non existent combat changes across levels]\nRepetitive dungeons [see a few and you see it all]\nNo end game content [yet]\nInsufficient playerbase\nResource farming requires some knowledge of where to get the fastest amount\nSome lag is present\nGriefers. Like almost every sandbox game? Griefers is a problem.\nBuilding stuff is horrible if you dont excatly excell at doing stuff like that\nEarly access\n\nSo allow me to elaborate on the pros.\nThe maps are pretty large maps. The starter world for example is consisted of 2 - 3 Islands and each Island is serval kilometers wide. By basics I mean, combat, movement, UI and stuff are all decently done, there are some problems and room for improvements but updates are comming in fast for them. \n\nThe game is gorgeous? A picture says a thousand words.\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=482330205\n\nComments saying the game did not ship with graphics shown in the store screenshots? Rubbish... They didnt turn on post proccessing, obviously it wont look the same.\n\nAll resources have a use for them, you wont, lets say... have no need for wood when you reach max level. Far from it, wood becomes more important than ever. This applies to every single resource. Something which you thought useless at the start, for example, I thought plasma was useless after I got off the moon, little did I know my vehicles and drill platfolm required plasma to run... until I got them that is. \n\nThe developers are great, they are actively talking with the community, suggestions made by the community have even been added into the experimental build within hours. \n\nhttp://steamcommunity.com/app/332500/discussions/3/530645446313592491/\n\nProof that I aint just pulling your leg. \nThere is a normal build, and an experimental one. Roughly every two weeks, all the patches added to experimental is released to the normal build and the build number goes up by one. Currently waiting on build 21.\n\nWhat I mean by building stuff is great if you are innovative? Well... \n\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=470288120\n\nA building project I did alone dubbed Project Racer. This was completed in less than 4 days inclusive of resource gathering.\nThe full thing can be viewed here\n\nhttp://steamcommunity.com/app/332500/discussions/0/530645446305634897/\n\nAlso my base\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=487241226\n\nYou may check my guide under section 7. for building projects I have completed and am in the midst of making. Hopefully they might give you some ideas if you do intend to buy GRAV\n\n\nNow for the cons.\n\nThe ultimate killer for this game IMO, the game requires at least 8GB RAM to play properly at the moment. You can disable all the graphic options to enable GRAV to run at 4GB but thats the very bottomline it can go for now. This basically means unless you are using a custom laptop / high end one. You will not be able to play GRAV on a laptop.\n\nLike a few other reviews have mentioned. There isnt much variety, Once you see a level 1 slime, you have seen the attack patterns for a level 60 slime as well. There are also NO headshot hitboxes in the game YET. I have personally confirmed with the developers they are adding this in, but no ETA on it yet. So what does all these mean? Basically PvE combat in this game boils down to kiting over and over again. But considering its early access and they are planning to release more content for combat its excusable... at least for me. \n\nCurrently the game has basically non-existent replayable end game content. But as you can probably see, the devs are starting to prepare and release stuff for that. Vehicles for upcomming warzones like the build 20 released hammerhead [ VTOL Jet ]. New monsters, stuff like that.\n\nInsufficient playerbase is related to its somewhat bad start and also the lack of end game content. When more content is released, I do believe the playerbase will increase substainally. This game has alot of potiential and the devs are living up to it.\n\nResource farming on the other hand isnt as bad as some people made it sound. As with a majority of the cons, I have covered ways to make your life easier in the guide above. \n\n\nThe game is horribly optimised for large scale building projects atm. Patch 19 is supposed to fix quite alot of it but we will see.\nEDIT\nAs of patch 19, Building large scale projects no longer lags the game to kingdom come. I now run at a pretty smooth 20 fps around my base. Previous was 9 - 15 FPS along with severe lag spikes. Do note that my base is HUGE and filled with dymanic base items like laser fences. I play with 30 - 60 FPS on other planets. This is with a custom laptop.\nAnother EDIT\nPatch 20 further improves on building with serval optimizations and also introduces building decay into the game.\n\nAnd.... griefers. This one is a major blow to the game. I will be upfront and say this. The PvE servers are even worse for griefing than the PvP ones. This is because a griefer can shoot your buildings and you cant even damage them while they are doing so on the PvE ones. They are planning fixes for this but I did not ask for an ETA for this [because there are ways to grief proof your buildings]. Also there are alot of stupid things that are done [e.g new player killing] by a small minority of jerk players... well you get my point. If you do intend to get this game I recommend you head to the offical server in your region with 01 in their name. For example, I am based in ASIA PvP 01. These servers normally have an active community that will help and look out for each other to keep the griefers away.\n\nBuilding stuff, this one took me hours to learn. Once you learn how to utilise the system its easy, but before that its a pain in the *ahem* to do so. Just building a simple house with a single door to a balcony can drive you nuts when you are first starting to build stuff. I have covered how to use the system in the guide.\n\nAnd so yeah, do I recommend this game? \nIf its on sales? Of course\nAt full price? Sure, I gotten more than my money back already.", "timestamp_created": 1435417245, "timestamp_updated": 1605512842, "voted_up": true, "votes_up": 104, "votes_funny": 11, "weighted_vote_score": "0.757151365280151367", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "29951443": {"recommendationid": "29951443", "author": {"steamid": "76561197966020783", "num_games_owned": 252, "num_reviews": 8, "playtime_forever": 17337, "playtime_last_two_weeks": 0, "playtime_at_review": 17103, "last_played": 1515190793}, "language": "english", "review": "So much wasted potential in this game.  There is a great framework for the dev's to actually do something...however they have basically abandonded it.  Dont waste your money on it.", "timestamp_created": 1487200561, "timestamp_updated": 1487200561, "voted_up": false, "votes_up": 49, "votes_funny": 0, "weighted_vote_score": "0.750647068023681641", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "32145348": {"recommendationid": "32145348", "author": {"steamid": "76561198065758195", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 354, "playtime_last_two_weeks": 0, "playtime_at_review": 354, "last_played": 1496267869}, "language": "english", "review": "Very meh game, with a decent amount of potential. \n\nPros: \n\n- Really cool enviroments, very appealing to look at. \n- Good art assets\n-Housing system, is pretty cool, and works well, although basic, There are not too many objects you can make, even when you unlock them all. But that not really is that surprising, usually housing systems in these typs of games don't have many options, so it is forgiveable.\n- Can't really say, there could be a lot of awsome stuff or bad stuff, that I will never know, since this game turned me off since I got really really bored.\n\nCons:\n- Its boring gameplay, I played alot of early access games, that I enjoyed much more, I wish I played this game for 2 hours then returned it. \n-Enemies are boring to fight, just attack, dodge, attack dodge, every enemy is the same, in a different body.\n- Dungeons, which are the main attraction on planets, are boring, nothing new. Just walk in, kill everything with the boring combat, repeat. Or die, because enemies keep on spawing through the walls.\n\nIn summary, the game was just plain boring for me, its a cool game, don't get me wrong, but I can't reccomend it. I usually avoid giving negative reviews, because I love supporting dev's from all types of games, since it takes alot of effort to make them. Regardless, hope this game continues making progress, who knows, I might come back a few years from now and have some fun, or not, since many games fail to become finished products. We shall see. We shall see.\n\n", "timestamp_created": 1496470743, "timestamp_updated": 1496470743, "voted_up": false, "votes_up": 55, "votes_funny": 1, "weighted_vote_score": "0.748447239398956299", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "40842982": {"recommendationid": "40842982", "author": {"steamid": "76561198044116013", "num_games_owned": 973, "num_reviews": 8, "playtime_forever": 814, "playtime_last_two_weeks": 0, "playtime_at_review": 808, "last_played": 1648431873}, "language": "english", "review": "Was extremely unfinished back when I played it, but now doing my research turns out this game has been completely abandoned. Remove from the Steam Store, please, so nobody makes the mistake of purchasing a game that will never be finished.", "timestamp_created": 1521181900, "timestamp_updated": 1521181900, "voted_up": false, "votes_up": 47, "votes_funny": 0, "weighted_vote_score": "0.745801925659179688", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "41805897": {"recommendationid": "41805897", "author": {"steamid": "76561197961082245", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 1227, "playtime_last_two_weeks": 0, "playtime_at_review": 1119, "last_played": 1470073176}, "language": "english", "review": "remove this game from steam don't buy it", "timestamp_created": 1525231395, "timestamp_updated": 1525231395, "voted_up": false, "votes_up": 34, "votes_funny": 0, "weighted_vote_score": "0.742952346801757813", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "23415512": {"recommendationid": "23415512", "author": {"steamid": "76561198074745112", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 96017, "playtime_last_two_weeks": 0, "playtime_at_review": 86689, "last_played": 1668799630}, "language": "english", "review": "Absoloute Shit Team making this game, they could not care less about anyone, they have abandonded the game without a doubt i have over 1500 hrs in this game and had very high hopes , the delevopers will not deliever, for example, about 6 months ago they released an update that broke some guns,,, still have those useless guns in my inventory and no fix in sight , they are the worst game developers i have EVER seen\n\n\nGuess i was right, shout out to all the haters below", "timestamp_created": 1465206314, "timestamp_updated": 1668715959, "voted_up": false, "votes_up": 202, "votes_funny": 26, "weighted_vote_score": "0.742501497268676758", "comment_count": 12, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44350559": {"recommendationid": "44350559", "author": {"steamid": "76561198040049883", "num_games_owned": 0, "num_reviews": 37, "playtime_forever": 436, "playtime_last_two_weeks": 0, "playtime_at_review": 436, "last_played": 1421344714}, "language": "english", "review": "Step 1. Release game as early alpha\nStep 2. Go dark never to be heard again.\nStep 3. Profit.", "timestamp_created": 1535118138, "timestamp_updated": 1535118138, "voted_up": false, "votes_up": 30, "votes_funny": 4, "weighted_vote_score": "0.742422938346862793", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "40148977": {"recommendationid": "40148977", "author": {"steamid": "76561198022018110", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 25335, "playtime_last_two_weeks": 0, "playtime_at_review": 24612, "last_played": 1587420633}, "language": "english", "review": "Dead game, Official servers arent up. It's dead. breaks my heart. was a good game...", "timestamp_created": 1518854208, "timestamp_updated": 1518854208, "voted_up": false, "votes_up": 31, "votes_funny": 0, "weighted_vote_score": "0.742302358150482178", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "23237455": {"recommendationid": "23237455", "author": {"steamid": "76561198003518952", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 8086, "playtime_last_two_weeks": 0, "playtime_at_review": 7912, "last_played": 1464368410}, "language": "english", "review": "An extremely clunky execution, Grav takes up way more computer resources than it should, making it run poorly on all but the newest machines.\n\nThe game itself is trite. Most of the game is harvesting resources and grinding mobs. There are only like 7-8 different mob models that can be fought. They all behave the same way and are just recolored for different areas.\n\nPVP is not well balanced or implemented, and the game is completely lacking without it.\n\nDeveloper support is slow coming as their team is very small. \nMinor, pointless, bug fixes are constantly pushed out, while major issues are put on the backburner.\n\nAll things considered, this game has potential. In the current state, I certainly cannot recommend anyone purchase or play it.", "timestamp_created": 1464368747, "timestamp_updated": 1464368747, "voted_up": false, "votes_up": 43, "votes_funny": 1, "weighted_vote_score": "0.741829216480255127", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "13974874": {"recommendationid": "13974874", "author": {"steamid": "76561197965249531", "num_games_owned": 1925, "num_reviews": 64, "playtime_forever": 5879, "playtime_last_two_weeks": 0, "playtime_at_review": 3036, "last_played": 1483657992}, "language": "english", "review": "EARLY ACCESS REVIEW\n\n22 hours was played thus far on a PVE server\n\nI will start off with the negatives, if you don't like the look of any of these, stay away and come back later. If not keep on reading. \nLag issues: \n-Lag is still an issue right as of now but the dev is working on it and commited to fixing it right now. A special test server is up and a patch has already helped part of the issue but there is still a way to go.\n\nSomewhat barebones: \n-You can't take down the stuff you build at the moment (well in PVE, I havn't played on a PVP server so I can't tell if it's PVE related only). \n-No clear friendslist you have to make parties with custom codes and key commands.\n-Inventory system is minimal and missing features like displaying the look/picture of an item when selected.\n\nThe Positives!\nAlright still here? Good because what is there is really enjoyable. Did you see all the stuff in the trailer? You can do all of it (well ok 90%) at this very moment! (unlike StarForge *angryface*) You can level up to max level (30) and gear up accordingly. You can play co-op with friends and run dungeons and fight bosses together (or alone you Einzelganger you). You can build really neat bases, craft armor, weapons and yes working vehicles and jetpacks. The graphics are bright and the colorscheme is nice. The aesthetic has it's very unique, silly and somewhat cutesy personality. \n\nAll in all it's impressive how complete the game already feels for a 6 month old project and there is a lot of fun to be had already. If the developers keep this up this will be a fantastic game. But you do have to realise there is still work to be done. You must understand this is still an Early Access game (in alpha). So things will break, bugs will annoy you (and I'm not only talking about the enemies)  and stuff will be missing.\n\nGive the trailer another go! Does it look apealing? Yes? Don't you mind alpha/beta testing? And do you want to add to the development of the game? Join in have a blast. (playing with friends recommended, game may be addicting)", "timestamp_created": 1421185395, "timestamp_updated": 1421185395, "voted_up": true, "votes_up": 35, "votes_funny": 1, "weighted_vote_score": "0.741580605506896973", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19447059": {"recommendationid": "19447059", "author": {"steamid": "76561198022750486", "num_games_owned": 0, "num_reviews": 34, "playtime_forever": 1611, "playtime_last_two_weeks": 0, "playtime_at_review": 1611, "last_played": 1448907509}, "language": "english", "review": "I had high hopes for this game and realised quite quickly this game is nothing but a daily grind.\n\nThe setting is quite interesting and I quite like the graphics. Though after a while it gets quite boring as everything just looks the same.\nThere is no manipulation of the surroundings, no landscaping. All you can do is build certain devices and pre-factured containers. Wooden containers, stone containers, glass and metal (which you can't build unless you level a certain profession up, which takes forever...). No free building as you would be used to from other survival/mincraft genre-like games. \nAnd these pre-factured blocks are the main problem. All items have a certain amount of degrading time (unfortunately usually quite short, something like 2 days). If you don't login over the weekend, you'll suddenly stand there without your house. The only way to keep them from degrading is to build a certain type of shield. This shield needs a generator. This generator needs wood. So what you basically do is logging in every day, grind wood to keep the generator and your shield going to keep the house from degrading. And this is literally your own purpose in this game.\nApparently there are more features, like claiming land which then makes you be able to claim tax from other players. But unfortunately, as blueprints need to drop from bosses, after 2 weeks of playing this game and basically mainly logging in, gathering wood for the generator and killing endless mobs outside and inside of caverns I didn't get anywhere. \n\nAs it is bad enough already, I played this game with my brother, so technically there was twice the manpower, twice the chance of dropping blueprints and you would suggest twice the fun. But it wasn't. We just both got annoyed really quick and as you might be able to see in my playing time in other games, I am usually not giving up that easily.\n\nNo quests, same monsters over and over again, random NPCs called \"Wei Wei the Wanderer\" appearing wandering about and being killed by the monsters. Same with Vending Machine robots. \n\nUnless you're an old-fashioned WoW grinding lover... you should avoid this game.", "timestamp_created": 1449094712, "timestamp_updated": 1449094728, "voted_up": false, "votes_up": 109, "votes_funny": 4, "weighted_vote_score": "0.740622520446777344", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "14070831": {"recommendationid": "14070831", "author": {"steamid": "76561198053135037", "num_games_owned": 0, "num_reviews": 66, "playtime_forever": 1613, "playtime_last_two_weeks": 0, "playtime_at_review": 1439, "last_played": 1446907521}, "language": "english", "review": "This game might be one of the best games on early access, I would recommend this to anyone who likes survival games as it's not like the other generic survival games you'll see here, no, this one is special.\nThis one has a bigger potential than my dick, literally! I've got this game yesterday and I have already spent 7 hours playing it and it actually got me off my Counter Strike - Global Offensive addiction which is pretty impressive considering I haven't tried a different game for months, but let's get to the point:\nWhat this game has:\n-Great graphics (for an early access)\n-No pay to win \n-Great combat system (atleast in my opinion)\n-Very fun to play, especially with friends\n-Great crafting system (Basically, you gotta get blueprints to get certain items which keeps the pump to play, I've been trying to get this cool motorcycle at the picutre for my entire playtime so far)\n-Regular content update\nNow this is a list of what this game has to fix (keep in note that it's in alpha/prealpha so I suppose this list will get fixed after my review has been posted):\n-Optimization\n-Single Player\n-Lag fixes\n-Add an option to crouch\n-Implementing more ideas into the game (as I've mentiond it's still in early access and I'm 100% sure the developers will add great content to it)\nIn my opinion this game is fun for whoever likes survival games as it might be a bit repetitive it's not as boring as the other generic survival games which wont be fun to play after 1 hour of playing.", "timestamp_created": 1421695043, "timestamp_updated": 1422100861, "voted_up": true, "votes_up": 79, "votes_funny": 21, "weighted_vote_score": "0.739954829216003418", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "26820801": {"recommendationid": "26820801", "author": {"steamid": "76561197985463471", "num_games_owned": 0, "num_reviews": 17, "playtime_forever": 7665, "playtime_last_two_weeks": 0, "playtime_at_review": 6812, "last_played": 1623524433}, "language": "english", "review": "Pros:\n-Beautiful graphics, good music, decent sound design.\n-Large and varied worlds to explore.\n-Solid, meaningful progression.\n-Deep crafting system.\n-Wide range of armors to craft.\n-Very wide range of weapons to craft, including various rarities/qualities.\n-Decent building mechanics allow pretty deep creative expression.\n-Basic tower defense capabilities can be built on your base.\n-Very fun to play with friends.\n\nCons:\n-Pretty buggy still. It's early access so that's not unexpected.\n-Although the different biomes have decent variation, there's not a ton of different mob types.\n-Although I did not have regular lag problems, occasionally things would slow down if there was a lot of activity.\n-Dungeons get pretty repetitious. And the crazy fast spawn rates make them sometimes frustrating.\n-Inventory management gets pretty overwhelming and it could definitely use some love.\n\nPro or con depending on the person:\n-It gets pretty grindy as you start to craft higher end items. It's no worse than any MMO though. I personally found collecting resources relaxing.\n-PVP seems to attract griefer types. I played on a private server with IRL friends, so this had zero impact on us.\n\nSo, yeah, overall I love the game. It's got an MMO-like scale to it. There's lots to do and it's a fun challenge to try to survive on hostile worlds (until you get the proper armor sets to mitigate the various planets' environment). Most of the negative reviews I see seem to stem from people encountering cheating griefers on public servers. It's understandable that that would impact their perception of the overall game. But I run a private dedicated server for friends, and of course everyone worked together and we built some pretty amazing stuff. So if you do buy the game I strongly suggest running your own world.\n\nThere aren't a lot of games that allow you to run your own massive and customizable MMO-scale world. Grav is one of them. And I enjoy the game immensely.", "timestamp_created": 1479929570, "timestamp_updated": 1479929728, "voted_up": true, "votes_up": 33, "votes_funny": 3, "weighted_vote_score": "0.736088335514068604", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "41496416": {"recommendationid": "41496416", "author": {"steamid": "76561198056646120", "num_games_owned": 245, "num_reviews": 10, "playtime_forever": 131, "playtime_last_two_weeks": 0, "playtime_at_review": 131, "last_played": 1448059959}, "language": "english", "review": "I don't remember buying this game but I regret it anyway", "timestamp_created": 1523773155, "timestamp_updated": 1523773155, "voted_up": false, "votes_up": 36, "votes_funny": 27, "weighted_vote_score": "0.735992848873138428", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "47466145": {"recommendationid": "47466145", "author": {"steamid": "76561198008789344", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 3458, "playtime_last_two_weeks": 0, "playtime_at_review": 3427, "last_played": 1422314967}, "language": "english", "review": "Another game the Devs took the money and ran. DO NOT BUY!! They have no intention of finishing this. Steam needs to punish devs that do this by backing the community and filing a law suit against them and give us back part of the money for this abandoned POS.", "timestamp_created": 1544551194, "timestamp_updated": 1544551194, "voted_up": false, "votes_up": 32, "votes_funny": 1, "weighted_vote_score": "0.735022783279418945", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "48559261": {"recommendationid": "48559261", "author": {"steamid": "76561197968568482", "num_games_owned": 0, "num_reviews": 102, "playtime_forever": 9986, "playtime_last_two_weeks": 0, "playtime_at_review": 9789, "last_played": 1548625923}, "language": "english", "review": "Its fun for wasting time, but there really isnt that much to do besides craft loads of mostly useless gear and completely useless structures. Combat gets tedious very quickly, exploring mostly empty worlds is pointless and depressing, and since the devs have officially stated they wont be working on this game anymore, I really wish Steam would not sell it. kind of unfair to say its Early Access when we know for a fact nothing is coming later.", "timestamp_created": 1548486867, "timestamp_updated": 1548486867, "voted_up": false, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.734399020671844482", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "86178235": {"recommendationid": "86178235", "author": {"steamid": "76561198023555368", "num_games_owned": 3346, "num_reviews": 171, "playtime_forever": 31, "playtime_last_two_weeks": 0, "playtime_at_review": 31, "last_played": 1612751947}, "language": "english", "review": "[b]GRAV[/b] is far from finished but hasn't been updated since at LEAST 2016. I'm not sure why they are allowed to sell this.\n\nPlease don't buy this game, developers should be more transparent than this.", "timestamp_created": 1612752328, "timestamp_updated": 1612752328, "voted_up": false, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.734288871288299561", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "18070951": {"recommendationid": "18070951", "author": {"steamid": "76561197970866695", "num_games_owned": 0, "num_reviews": 40, "playtime_forever": 2398, "playtime_last_two_weeks": 0, "playtime_at_review": 2398, "last_played": 1441735538}, "language": "english", "review": "If you have played ARK like me you will be disappointed about what GRAV has to offer. As much a grinding game as any of these types, but it fails in being attractive. It get repetitive easily, the amount of content is disappointing, the state of the UI, the absence of a dev / progress tree, etc.\nAnd then there is soo little support from the devs. ARK has updates daily and they almost alway offers something for everyone, with at least one content update per week. This game hasn't been updated for weeks!\nI tried it, convinced some friends in doing so too. I really shouldn't have done that. Nor should you. This is early access at its worst.", "timestamp_created": 1442499106, "timestamp_updated": 1442499106, "voted_up": false, "votes_up": 73, "votes_funny": 2, "weighted_vote_score": "0.732646763324737549", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "75467337": {"recommendationid": "75467337", "author": {"steamid": "76561198076033989", "num_games_owned": 1841, "num_reviews": 33, "playtime_forever": 4512, "playtime_last_two_weeks": 0, "playtime_at_review": 4512, "last_played": 1599284901}, "language": "english", "review": "Had potential but long gone forgotten by the dev itself\nBe wary in the future if the dev (BitMonster, Inc) try to pull out another early access games\n\nGood game, bad dev\n\nIf you like heavy grind survival/crafting game I can only recommend this game if it's cheap and on sale", "timestamp_created": 1599285354, "timestamp_updated": 1599285354, "voted_up": true, "votes_up": 35, "votes_funny": 1, "weighted_vote_score": "0.731990158557891846", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "41453818": {"recommendationid": "41453818", "author": {"steamid": "76561198072660519", "num_games_owned": 3717, "num_reviews": 27, "playtime_forever": 3182, "playtime_last_two_weeks": 0, "playtime_at_review": 3153, "last_played": 1516142302}, "language": "english", "review": "Abandoned, no updates in years.\nThe class system sucks, have to level up each profession in order to unlock things to build.\nThe enemies sucks and are repetitive, the spawn rate sucks, the Dungeons sucks, all are uninspired.\nLots of wasted potential.", "timestamp_created": 1523585391, "timestamp_updated": 1680160932, "voted_up": false, "votes_up": 30, "votes_funny": 1, "weighted_vote_score": "0.730157136917114258", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44774419": {"recommendationid": "44774419", "author": {"steamid": "76561198062789959", "num_games_owned": 362, "num_reviews": 33, "playtime_forever": 1951, "playtime_last_two_weeks": 0, "playtime_at_review": 1796, "last_played": 1526069916}, "language": "english", "review": "dead games should not be sold on steam.this game is not being worked on anymore and hasnt been for a very long time.please remove it from sale.", "timestamp_created": 1537138585, "timestamp_updated": 1537138585, "voted_up": false, "votes_up": 31, "votes_funny": 0, "weighted_vote_score": "0.729189932346343994", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "65245101": {"recommendationid": "65245101", "author": {"steamid": "76561197962683383", "num_games_owned": 0, "num_reviews": 96, "playtime_forever": 3556, "playtime_last_two_weeks": 0, "playtime_at_review": 3556, "last_played": 1448329985}, "language": "english", "review": "Why does this even have a page anymore? Steam needs to refund all of us our money for this purchase as It is a developer confirmed abandoned project.", "timestamp_created": 1584502201, "timestamp_updated": 1584502201, "voted_up": false, "votes_up": 27, "votes_funny": 0, "weighted_vote_score": "0.728765964508056641", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "43958727": {"recommendationid": "43958727", "author": {"steamid": "76561197969749884", "num_games_owned": 2459, "num_reviews": 1422, "playtime_forever": 9048, "playtime_last_two_weeks": 0, "playtime_at_review": 2914, "last_played": 1533469974}, "language": "english", "review": "GRAV had more promise than No Man's Sky, a visual acuity far superior than ARK, freedom greater than in pretty much any other game I've played which had jetpacks, art design absolutely unique, fantastic gameplay and then it all went to shit when it became abandonware.\n\nIt really breaks my heart, but this rough gem has shattered to a million pieces.", "timestamp_created": 1533528913, "timestamp_updated": 1533528913, "voted_up": false, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.727836489677429199", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "34297862": {"recommendationid": "34297862", "author": {"steamid": "76561198047609043", "num_games_owned": 743, "num_reviews": 192, "playtime_forever": 22, "playtime_last_two_weeks": 0, "playtime_at_review": 22, "last_played": 1435549157}, "language": "english", "review": "At least No Man's Sky still gets updates.", "timestamp_created": 1502934664, "timestamp_updated": 1502934664, "voted_up": false, "votes_up": 54, "votes_funny": 15, "weighted_vote_score": "0.727796494960784912", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "55942260": {"recommendationid": "55942260", "author": {"steamid": "76561198006573232", "num_games_owned": 0, "num_reviews": 54, "playtime_forever": 1135, "playtime_last_two_weeks": 0, "playtime_at_review": 1135, "last_played": 1457129064}, "language": "english", "review": "!!! Abandonware !!!\n\nLast updated 2017 - Incomplete - Should be removed from the Steam store. The positive \"most helpful\" reviews are from 2017.", "timestamp_created": 1572493492, "timestamp_updated": 1572493492, "voted_up": false, "votes_up": 27, "votes_funny": 1, "weighted_vote_score": "0.727514207363128662", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "38673451": {"recommendationid": "38673451", "author": {"steamid": "76561198034196059", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 668, "playtime_last_two_weeks": 0, "playtime_at_review": 668, "last_played": 1490608094}, "language": "english", "review": "Dead Game Dont Buy, Why is it still on steam?????..\n\ni wish steam would force the developers to inform them when the game is dead so it can be removed, it should be part of the of the early access rules.", "timestamp_created": 1514237551, "timestamp_updated": 1514237551, "voted_up": false, "votes_up": 35, "votes_funny": 1, "weighted_vote_score": "0.727130532264709473", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "43032454": {"recommendationid": "43032454", "author": {"steamid": "76561198003419075", "num_games_owned": 0, "num_reviews": 49, "playtime_forever": 138, "playtime_last_two_weeks": 0, "playtime_at_review": 138, "last_played": 1478938623}, "language": "english", "review": "Abandoned game.", "timestamp_created": 1529924692, "timestamp_updated": 1529924692, "voted_up": false, "votes_up": 24, "votes_funny": 1, "weighted_vote_score": "0.726761102676391602", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "35822537": {"recommendationid": "35822537", "author": {"steamid": "76561198056860843", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 4375, "playtime_last_two_weeks": 0, "playtime_at_review": 4356, "last_played": 1546737415}, "language": "english", "review": "When it was fresh and newly released, updates were often and decent, took a short break and came back after 6ish months and nothing changed. This was a couple years ago. Now? It's more or less dead. The only server that has a measly population has 200+ ping on a good day. Waste of a promising game. \n\nFind another game, don't waste the money.", "timestamp_created": 1508346335, "timestamp_updated": 1508346335, "voted_up": false, "votes_up": 30, "votes_funny": 0, "weighted_vote_score": "0.722705841064453125", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "49527362": {"recommendationid": "49527362", "author": {"steamid": "76561198008763472", "num_games_owned": 921, "num_reviews": 24, "playtime_forever": 3078, "playtime_last_two_weeks": 0, "playtime_at_review": 2875, "last_played": 1688866695}, "language": "english", "review": "The game has been abandoned that is true. I only played 50 hours but i was able to get 50 quality hours out of playing without any issues that would impair my ability to play the game. I had a blast playing with friends and wish the development would have continued. My thumbs up is for getting more than my moneys worth with this game considering the cost of some things for a few hours ie theater etc. I found it a novelty when the game came out that dancing around the fire created a special music and the more people that joined in the louder it got, more instruments etc. was a cool concept. anyhow, me and my friends had a blast. I just wish they would have finished it.", "timestamp_created": 1552454321, "timestamp_updated": 1552454321, "voted_up": true, "votes_up": 39, "votes_funny": 2, "weighted_vote_score": "0.721795618534088135", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "13959826": {"recommendationid": "13959826", "author": {"steamid": "76561197968450654", "num_games_owned": 462, "num_reviews": 9, "playtime_forever": 594, "playtime_last_two_weeks": 0, "playtime_at_review": 594, "last_played": 1421142937}, "language": "english", "review": "[h1] GRAV - A Surprisingly Well Polished Early Access Game[/h1]\n\ntl;dr ? Goto the [b]Summary[/b]\n\n[b]Survival. Sandbox. Procedural.[/b]\nSure, its a common trend these days with so many similar titles coming out on a weekly basis. You get resources, you build stuff, you craft stuff, you kill stuff. Repeat.\n\nTo me progression in these games is the hardest thing to nail. \"To what end!?\" I always find myself yelling... that is, not so much this time.\n\n[i]Lets start with the basics[/i]  - this is an early access game. This means that [b]at times it simply may not work[b] because as developers patch it, it can break. It is the nature of these beasts, so please do not spam forums because you are too stupid to identify that prior to buying the game. Additionally, use the forums to search for information, instead of reposting the same questions.\n\n[i]Graphics 3.5/5[/i]\nIn line with other titles, this game has a slightly cartoonish feel, based (i think) on the Unreal engine, it has some pretty good features. Currently though customisation of the options is minimal.\n\n[i]Interface 2.5/5[/i]\nThe main menu is minimal however the ingame HUD works fairly well. An upside is the inclusion of item descriptions in the HUD, making learning the game a bit easier.\n\n[i]Gameplay 4/5[/i]\nGameplay is comprised of multiple components:\n[list]\n[*]The Gather\n[*]The Grind\n[*]The Build\n[*]The Reward\n[/list]\n\n[u]The Gather[/u]\nResource gathering is primarily done through the use of a 'multitool'. This device allows you to effectively deconstruct resources into nuggets. Currently the primary resouces are: Ore, Wood, Fossil, Food, Element-X.\nThe first 3 spawn in random locations on the map, dependant on the biome. Food is available via a 'Farm' which requires wood for 'fuel'. Element-X however is a little trickier, it requires a harvester to be built and placed on to a deposit. This must then be checked and emptied. All resources are available as drops from mobs/lootboxes, aswell as materials.\n\n[u]The Grind[/u]\nLove it or hate it, the Grind is a key component of any levelling game. Thats right, GRAV has levels. Firstly, lets look at the way the world is layed out. There are multiple 'biomes' which are all assigned with a 'state' and a mob level. For example, you may start in a lush forest, where the 'state' is freezing and the level is 1-2. This means that there is tonnes of wood at your disposal, the mobs do freezing damage and are of course level 1-2.\nAs per any levelling scheme, low level creatures only give good experience until you equal their level, then you are best to chase bigger prey.\nWhat I like about the levelling system in GRAV is that the mobs are genuinely brutal. At level 6, if you try and take on a medium bugdog of level 8 - its practically a deathwish. Unless you have decent gear and lots of health packs.\nLootwise, grinding is the only way you will get blueprints - required to further your knowledge, build more stuff and win at life.\n[b]sidenote-[/b] I forgot to mention the excellently done combat system. Although simple, for an Alpha game, it is smooth and well polished whilst maintaining fast paced combat.\n\n[u]The Build[/u]\nBy grinding and gathering, you are able to get materials and resources. As you would expect from any sandbox game, these are used to build/craft things.\nBuilding is simple, there are a number of predetermined layouts, which allow you to build in a modular fashion. The interface is decent and the skill required is minimal. In terms of craft items and machines, there is a natural progression here which allows you to build bigger and better things. However, the most vital component is blueprints, which once aquired allow you to build items such as Generators and Automated Turrets.\n\n[u]The Reward[/u]\nThis is where it all ties together and SOMEHOW GRAV has kept a very balanced gameplay. In order to build decent items, you need decent mats which can only be found on decent foes. And thus the circle is born. Although not disimilar to the multitudes of sandbox games available, GRAV just seems right. There is just enough annoying resource gathering wihtout it becoming a bore.\n\n\n[b]Summary 10/15[/b]\nAt the end of the day, its an Alpha. There are issues, bugs and bugdogs. There is no single player, besides running your own lonely server. The netcode is laggy and and the system requirements are pretty brutal.\n\nHowever,\nIts fun, exciting, progressive, rich and adventurous. The combat is great, grinding is fun and with a blueprint system, you need to keep searching for your next leap of knowledge.\n\nMy tips to starting with GRAV : \nCheck your system specs before purchase.\nEnsure you have friends to play with, or at least plan on playing with other people.\nIf the game bunks out when you run it for the first time - dont panic. goto the discussion boards and search.\n\nHope you enjoy GRAV!", "timestamp_created": 1421086691, "timestamp_updated": 1421086788, "voted_up": true, "votes_up": 27, "votes_funny": 0, "weighted_vote_score": "0.716312766075134277", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "39270118": {"recommendationid": "39270118", "author": {"steamid": "76561197997294458", "num_games_owned": 538, "num_reviews": 46, "playtime_forever": 221, "playtime_last_two_weeks": 0, "playtime_at_review": 221, "last_played": 1489124995}, "language": "english", "review": "G.et\nR.ich\nA.nd\nV.anish", "timestamp_created": 1515721154, "timestamp_updated": 1515721154, "voted_up": false, "votes_up": 47, "votes_funny": 65, "weighted_vote_score": "0.716113686561584473", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "30679383": {"recommendationid": "30679383", "author": {"steamid": "76561198035091859", "num_games_owned": 207, "num_reviews": 5, "playtime_forever": 2805, "playtime_last_two_weeks": 0, "playtime_at_review": 2399, "last_played": 1492480079}, "language": "english", "review": "Pro's\n\n-beutiful graphics\n-lot of leveling,  skill unlocking, character building etc\n-lots of blueprints to collect, things to build\n-endless terrian,caves, towers to explore\n-ways to get around terrian in timely fashion\n-online community is friendly\n-all grinding aspects of the game have tech's to increase effienciently\n-the game seems very fair,  giving you refunds for things destroyed etc\n\nCons\n\n-can be glitchy at times\n-public server is averaging 30 players at the time of this writing ( feels empty with all that space )\n-house building can be an exercise in pateince at times\n\nOverall i've had lots of fun playing this game,  though they're aren't a lot people playing you can often find people to dungeon crawl with.  Defiently worth the price.  I bought \"no mans sky\", and while that game is better all around as far as gameplay it lacks MULTIPLAYER, and i've had more laughable moments playing this game.\n\nbuy it,  play multiplayer,  make friends,  explore, kill, gather, build, repeat  :)", "timestamp_created": 1490239976, "timestamp_updated": 1490244513, "voted_up": true, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.714170515537261963", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "39940003": {"recommendationid": "39940003", "author": {"steamid": "76561197980300004", "num_games_owned": 593, "num_reviews": 100, "playtime_forever": 2303, "playtime_last_two_weeks": 0, "playtime_at_review": 2172, "last_played": 1703006689}, "language": "english", "review": "*Copy and paste from the BEST review by Midi SoundCaster*\n\n\nG.et\nR.ich\nA.nd\nV.anish", "timestamp_created": 1518126701, "timestamp_updated": 1518126701, "voted_up": false, "votes_up": 23, "votes_funny": 15, "weighted_vote_score": "0.713471412658691406", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "113998639": {"recommendationid": "113998639", "author": {"steamid": "76561197964145909", "num_games_owned": 677, "num_reviews": 64, "playtime_forever": 162, "playtime_last_two_weeks": 0, "playtime_at_review": 162, "last_played": 1446208438}, "language": "english", "review": "How is this allowed on Steam? Game was abandoned years ago during Early Access and is still for sale on Steam? Absolutely ridiculous! Steam needs to get its act together and start curating again. But we're way beyond that point I guess. We're all just breathing wallets in the eyes of Valve.", "timestamp_created": 1650189314, "timestamp_updated": 1650189314, "voted_up": false, "votes_up": 23, "votes_funny": 1, "weighted_vote_score": "0.712928175926208496", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "136368003": {"recommendationid": "136368003", "author": {"steamid": "76561197993930034", "num_games_owned": 469, "num_reviews": 14, "playtime_forever": 9, "playtime_last_two_weeks": 0, "playtime_at_review": 9, "last_played": 1483210736}, "language": "english", "review": "Abandonware - buyer beware.", "timestamp_created": 1680984550, "timestamp_updated": 1680984550, "voted_up": false, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.71256786584854126", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "21661209": {"recommendationid": "21661209", "author": {"steamid": "76561198154547741", "num_games_owned": 0, "num_reviews": 42, "playtime_forever": 16228, "playtime_last_two_weeks": 0, "playtime_at_review": 15903, "last_played": 1510520403}, "language": "english", "review": "I played over 270+ hours of this game and met some very nice people in game.   But...\n\nforums:  \n\nWithin two weeks so many things have happened in this game, The PVE East server US IOTA starting world was completely destroyed after the new 9.2 patch! Nothing at all was responded by the devs even after multiple bumps in the thread keeping it utop the forums for over a week nor the other posts by other members had any responses. People quit becuase of this. On Desolate moon I made a Drill high up utop one of the rocks and it does not work at all, it just stays blue and takes plasma decreasing it over time but always says 2+ hours, once again, wrote on forums - no response from the devs. Recently after upgrading myself to having 4 drills on one planet I tried that and after over half a week of me collecting over 100s of thousands of materials to upgrade these drills THREE of the four of them this morning are completely GONE! This also happened to a friend of mine on the same server earlier this week. One drill said INF time on it the other three said 12+ days till decay well they decayed within a few hours and I lost a weeks worth of mats. I went to a PVP server and the exploits are ridiculous, everytime we make a home it gets destroyed (shields are up and everything, we know how to fortify). The composters do not work properly and take 50 of your wood before you can even start putting wood in them cheaing you out of your gathered resources. The list goes on. \n\nYou couldn't even fix something as easy as the Chinese New year hat, that was bugged nobody got it, if thats the extent of this game I can tell the future of this product is very bleak.\n\n-- I actually did get a response back from the Bitmonster devs, saying they do care and to contact bitmonster support through an email in which myself and and some other friends did to urgently let them know the issues with the game.  Over a week later we recieved emails from the Bitmonster email with an automated message (no fooling) and it said to register with another site and send an email through that way...... .are you kidding me....\n\nI find it funny the moderator said they do care, but then deleted the post.  How hypocritical.", "timestamp_created": 1457256814, "timestamp_updated": 1457256814, "voted_up": false, "votes_up": 91, "votes_funny": 6, "weighted_vote_score": "0.71120154857635498", "comment_count": 15, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1457450385, "developer_response": "Hi Saturn4ce,\n\nGRAV is in early access. I cannot say this enough. There will be game breaking bugs, glitches etc.. In fact, there could be future server wipes. This comes with a game that is in active development. We are truly sorry to hear about the problems you and other players have faced. We especially understand the outrage from players with 100+ hours in our game.\n\nWe are appreciative of our community and players that invest a lot of time in our game. However, you can't expect to play an early access game that doesn't have massive issues at some time or another. \n\nAlso, we DO care about everyone who takes time out of their lives to play our game. Keep in mind that we are an indie team that is smaller than other indie teams (like the huge team behind Ark). When we get messages to our support email, we see them. We see all of them. However, we are actively working on huge changes and upgrades and when we get emails about issues with the current build, this means someone on the team has to stop what they're doing and fix something that might not be there in the next build.\n\nIt's like taking a step forward and then having to take multiple steps back. We understand the issues and we work on them the moment we get a chance. However, we can't respond to every person that has an issue. If we did, GRAV would stay where it is and never be updated."}, "44112204": {"recommendationid": "44112204", "author": {"steamid": "76561198049285642", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1037, "playtime_last_two_weeks": 0, "playtime_at_review": 1037, "last_played": 1530081940}, "language": "english", "review": "This game is dead. SO dead that I am a little angry at Valve for not putting a warning sign on it: Stay away . . . this game will never be finished. Weither this is negligence, cowardice or a downright scam . . . AVOID THIS GAME!\n\nit was a promising game at first.", "timestamp_created": 1534141028, "timestamp_updated": 1534141028, "voted_up": false, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.709671497344970703", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "101852853": {"recommendationid": "101852853", "author": {"steamid": "76561197962038510", "num_games_owned": 721, "num_reviews": 41, "playtime_forever": 5761, "playtime_last_two_weeks": 0, "playtime_at_review": 5761, "last_played": 1493862066}, "language": "english", "review": "Probably the most heartbroken I've been over a game being abandoned. Such promise and zero closure. Hope maybe one day the source code will become available and the community can take it over.", "timestamp_created": 1635558877, "timestamp_updated": 1635558877, "voted_up": false, "votes_up": 24, "votes_funny": 0, "weighted_vote_score": "0.708765327930450439", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "14233305": {"recommendationid": "14233305", "author": {"steamid": "76561197991524318", "num_games_owned": 0, "num_reviews": 52, "playtime_forever": 12167, "playtime_last_two_weeks": 0, "playtime_at_review": 7700, "last_played": 1447020960}, "language": "english", "review": "This game is one of the most satisfying early access games I have ever bought.\n\nI was kind of hesitant on buying another alpha, but I was not let down by this game. One of the things that really sold me was how much the Developers have done to the game in just 5 months. So I thought to myself \"The Developers seem really active and hard working. Plus they really want community ideas. Plus this game has an amazing concept. Okay! I'll buy it!\" I was not let down. Game was pretty bad in the beginning due to lag and other issues. In about a week they released 3 patches fixing pretty much all the lag issues. They Developers are also working on a lot of balancing for everyone to be happy right away.\n\nThis game is extremely grindy, but in the new patch coming out soon (9.0) they are going to reduce the grinding to make it even better!\n\nI have put so much time into this game I have gotten nearly the best of everything you can get so far, and I still hop on to play.\n\nAll in all, if you want a game where you can build structures, join factions/group up, wage war, keep peace, level up, gain skills, and venture to many unexplored areas to just enjoy the scenery and find new things. This sounds like a game for you.\n\nRemember, this game is alpha, and the Developers have a lot planned for it. I can't wait to see how much more amazing this game can be!\n\nThe most important factor is: We shape the game.", "timestamp_created": 1422579345, "timestamp_updated": 1422579345, "voted_up": true, "votes_up": 27, "votes_funny": 1, "weighted_vote_score": "0.70843130350112915", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44555808": {"recommendationid": "44555808", "author": {"steamid": "76561197975078043", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 286, "playtime_last_two_weeks": 0, "playtime_at_review": 286, "last_played": 1490512147}, "language": "english", "review": "This is abandonware.  Dev had given up on it.", "timestamp_created": 1536005586, "timestamp_updated": 1536005586, "voted_up": false, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.707410156726837158", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "60055886": {"recommendationid": "60055886", "author": {"steamid": "76561198065880565", "num_games_owned": 129, "num_reviews": 1, "playtime_forever": 105, "playtime_last_two_weeks": 0, "playtime_at_review": 105, "last_played": 1481007172}, "language": "english", "review": "DO NOT PURCHASE GRAV. THE DEVELOPERS ABANDONED THE PROJECT YEARS AGO (2017) AND IT SHOULD NOT STILL BE ON THE STEAM STORE. The game had great potential, but never even reached an official release - not even close. Such a let down..", "timestamp_created": 1576652150, "timestamp_updated": 1576652150, "voted_up": false, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.707393348217010498", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "38531094": {"recommendationid": "38531094", "author": {"steamid": "76561198025102386", "num_games_owned": 0, "num_reviews": 259, "playtime_forever": 166, "playtime_last_two_weeks": 0, "playtime_at_review": 166, "last_played": 1513945843}, "language": "english", "review": "TLDR? Don't do it, unfinished and will likely be unfinished; Feels like they pushed out the prototype, took the money and ran... They call that a scam, as such... Flagged.\n\nIt took them 5 months to push out most of the content to Early Access and then it just ebbed off... The official server browser is dead, completely empty and what unofficial servers remain are just dead/empty (there are currently 3 people playing unofficial servers). There is some official server up at the moment, but alas, I see no one on it. The last seasonal event was easter (value tweaks, again, no real event/changes or effort).\n\nThe roadmap has not been delivered (still), we've not seen any updates for 8 months and even then, they were not content updates, the last \"content\" update was Halloween(?) 2016, they added Zombies... And a hat. I **** you not.\n\nThe game as it stands?\nYou can run around, cut down a tree, build a base, fight monsters, visit other planets via portals... The nice spaceship in the advertisement, is a plane, by the way, you won't be flying to other planets. The setup of the worlds is very predictable, I'm not on about foliage and all that, but the difficulty as you go further out etc. It gets very old very fast, as much as there are procedurally generated worlds, the AI is predictable, there's no real challenge to anything unless you fight a player, but... If you do manage to actually find a player, there's also plenty of hacks they can deploy to make you ragequit, not limited to; Aimbotting, Invincibility, SuuuppperSpeeeeeed... And if you get one of these unsightly players on your server, those door locks that aren't set to public?\n Will magically be public soon enough.\n\nStill a plethora of bugs in the game, tons of unpolished game mechanics here and there. Not really very balanced. Performance is ok if you have a decent rig, if not... You'll be tweaking down some settings.\nWouldn't exactly call the graphics gorgeous either, no matter how much I tweak my gaming rig, my game doesn't look like those videos, everything is very rough (even with AA and all that), some of the textures in the game aren't stretching right.\n\nCharacters do have customization, very limited, but let's face it, the game is an absolute sausage-fest. Want to customize your character? Hmm... I suggest you put on a zombie hat if you can find a zombie to kill.\n\nHate to say it, even No Man's Sky is better than this nonsense. -*Shudder*-", "timestamp_created": 1513947676, "timestamp_updated": 1513948056, "voted_up": false, "votes_up": 29, "votes_funny": 4, "weighted_vote_score": "0.704190909862518311", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "21349423": {"recommendationid": "21349423", "author": {"steamid": "76561197993894393", "num_games_owned": 334, "num_reviews": 20, "playtime_forever": 2696, "playtime_last_two_weeks": 0, "playtime_at_review": 689, "last_played": 1680310464}, "language": "english", "review": "Had a lot of potential, too bad it didn't get enough funding and exposure.", "timestamp_created": 1456002807, "timestamp_updated": 1663361385, "voted_up": false, "votes_up": 54, "votes_funny": 3, "weighted_vote_score": "0.701889157295227051", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "40213023": {"recommendationid": "40213023", "author": {"steamid": "76561198122346578", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 533, "playtime_last_two_weeks": 0, "playtime_at_review": 533, "last_played": 1475877210}, "language": "english", "review": "Whatever you do, don't buy this game. It's completely dead...and that's a shame...so much potential....down the drain", "timestamp_created": 1519013208, "timestamp_updated": 1519013208, "voted_up": false, "votes_up": 21, "votes_funny": 0, "weighted_vote_score": "0.699675798416137695", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "34367638": {"recommendationid": "34367638", "author": {"steamid": "76561198030673609", "num_games_owned": 1929, "num_reviews": 54, "playtime_forever": 192, "playtime_last_two_weeks": 0, "playtime_at_review": 192, "last_played": 1477283513}, "language": "english", "review": "abandoned dont buy", "timestamp_created": 1503214904, "timestamp_updated": 1503214904, "voted_up": false, "votes_up": 37, "votes_funny": 1, "weighted_vote_score": "0.69837641716003418", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "47882367": {"recommendationid": "47882367", "author": {"steamid": "76561198087551647", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 1021, "playtime_last_two_weeks": 0, "playtime_at_review": 1014, "last_played": 1527397804}, "language": "english", "review": "STAY CLEAR! This game was abandoned by its developers! They left it as a buggy, contentless, lagging mess that barely runs on fairly beefy computer. I've kept track of this game since its release back in 2015, and progress slowed down exponentially. Since then, the devs have gone silent and rarely update or even communicate with players. One update even had a developer mocking those who believed an update would come by claiming that the \"updates are taking their sweet time\". No one has heard from BitMonster in months. It's safe to say that the game will never get updated which is a real shame. \n\nThis game used to have life. It seemed like it had passionated developers that cared about players and the game. Updates were monthly, with new and refreshing content being added. For a while, it looked like the game was on track. Then they went silent, released a new major update, and destroyed the what made the game good. This is what the game is now. Unplayable and souless. I highly doubt it will leave early access, but if it does, it will be a shell of its former self. This game is a prime reason to be cautious when investing in a early access title. \n\nI strongly reccomend you do not buy this game.", "timestamp_created": 1545959786, "timestamp_updated": 1545959786, "voted_up": false, "votes_up": 24, "votes_funny": 0, "weighted_vote_score": "0.697579801082611084", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44435540": {"recommendationid": "44435540", "author": {"steamid": "76561197970361109", "num_games_owned": 1635, "num_reviews": 160, "playtime_forever": 3128, "playtime_last_two_weeks": 0, "playtime_at_review": 3117, "last_played": 1459303912}, "language": "english", "review": "No update then more then a year.\nall devs were not online or write in forum since 2 or more years.\n\nand you can buy the game... not ok", "timestamp_created": 1535508140, "timestamp_updated": 1535508265, "voted_up": false, "votes_up": 29, "votes_funny": 0, "weighted_vote_score": "0.696422755718231201", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "155427652": {"recommendationid": "155427652", "author": {"steamid": "76561198103485877", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 197, "playtime_last_two_weeks": 0, "playtime_at_review": 197, "last_played": 1487628512}, "language": "english", "review": "Dead and unfinished game for years , DO NOT BUY . Honestly steam should close that store page or at least warn people .", "timestamp_created": 1704579926, "timestamp_updated": 1704579926, "voted_up": false, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.694519400596618652", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "34764528": {"recommendationid": "34764528", "author": {"steamid": "76561197994225718", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 7428, "playtime_last_two_weeks": 0, "playtime_at_review": 6643, "last_played": 1448950225}, "language": "english", "review": "Abandonware. Yet no release of the source code for community to continue with mods and improvements. Lame.", "timestamp_created": 1504645097, "timestamp_updated": 1504645097, "voted_up": false, "votes_up": 36, "votes_funny": 1, "weighted_vote_score": "0.69365614652633667", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "54287691": {"recommendationid": "54287691", "author": {"steamid": "76561197971368404", "num_games_owned": 810, "num_reviews": 55, "playtime_forever": 78, "playtime_last_two_weeks": 0, "playtime_at_review": 78, "last_played": 1436311314}, "language": "english", "review": "Over 4 years of early access. Should be removed and people refunded for a game that never came out", "timestamp_created": 1564065998, "timestamp_updated": 1564065998, "voted_up": false, "votes_up": 18, "votes_funny": 1, "weighted_vote_score": "0.693350374698638916", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "38812721": {"recommendationid": "38812721", "author": {"steamid": "76561198051613075", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 1958, "playtime_last_two_weeks": 0, "playtime_at_review": 1958, "last_played": 1509441265}, "language": "english", "review": "Don't buy this game, the developers haven't spoken a word in a very long time. No updates at all............stay away from this company.", "timestamp_created": 1514541077, "timestamp_updated": 1514541077, "voted_up": false, "votes_up": 23, "votes_funny": 1, "weighted_vote_score": "0.693200051784515381", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "13910197": {"recommendationid": "13910197", "author": {"steamid": "76561197979720191", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 3214, "playtime_last_two_weeks": 0, "playtime_at_review": 638, "last_played": 1640723318}, "language": "english", "review": "[h1] - 09/01/2015 - Grav (early days) Alpha Review - [/h1]\n\n[b] (If you don't want to read the full review, feel free to go to the bottom of this and check out the bulleted \n[ Positives + & Negatives - ] Most information is given in that.) [/b]\n\nGrav at this moment in time is a game that needs a hell of a lot of work doing to it, especially before it becomes an actual enjoyable, playable experience. \n\nSo, why the upvote?\n\nThis game has a lot of promise and looks to be a great game as time goes on, and i am going to keep this review as simple as i can for the time being. \n\n[A lot of things will be put into a bullet list at the bottom].\n\nThe one thing that sets this game aside from other survival games in my opinion is the Art style and use of vibrant and contrasting colours.\n\nThe idea of combining a survival game with that sort of 'MMO' leveling and gear aspect is quite a good concept. Since there is a leveling system in the game, it gives to think that there will be a lot more to do than just surviving against other players and the wilderness. Although at this early in the game, the leveling system could be a slight problem as there is a level 1 starting zone and PvP is usually turned on.\n\nDungeons and Quests seem to be the main thing that will keep a lot of players busy, as well as building your base or house, especially those running around in groups. Hopefully item drops and loot spawns will be evenly distributed but we will see.\n\nThere is currently no Singleplayer at this moment in time, only a Multiplayer. And with it, are a lot of lag issues.\n\nThe game as a whole at this moment in time should only really be given a shot by those who want to go out and scout for bugs and breaks in the game. Since it has only been out for around a day and a half, there is really no propper way to pass judgement on how good or bad this game is or will be, we can only wait and see.\n\n[h1] + Positives & - Negatives [In a bulleted list] [/h1]\n\n[list]\n\n[*] + Art Style & Visuals\n[*] + Leveling System\n[*] + Dungeons & (Raids?)\n[*] + items (weapons, Armor, Building Material)\n[*] + Building system\n[*] + Open World\n[*] + Probably Vehicles & Mounts\n[*] + Soundtrack [ Seems to have a great Psy/Ambient style]\n[*] - Extensive Lag issues\n[*] - Quest system isn't quite there. [Alot of the givers just get killed.]\n[*] - No Singleplayer\n[*] - Constant PvP toggle [ Especially in starting zones & Even in groups]\n[*] - Quite a few graphical glitches\n[*] - Getting stuck in the most unlikely places is likely [E.G While jumping in an open field.]\n[*] - Not a lot to do at this stage in the game [Not everything mentioned so far is implemented]\n[*] - Combat system is quite fiddley and broken.\n[*] - No map or Minimap feature\n[*] - GUI is quite broken at this moment in time\n\n[/list]", "timestamp_created": 1420819461, "timestamp_updated": 1420819654, "voted_up": true, "votes_up": 35, "votes_funny": 1, "weighted_vote_score": "0.692565441131591797", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "39902306": {"recommendationid": "39902306", "author": {"steamid": "76561197995427764", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 980, "playtime_last_two_weeks": 0, "playtime_at_review": 980, "last_played": 1486621791}, "language": "english", "review": "Fuckhead devs abandoned this game without a word, giant cunts!\n\nGame is not early access its abandoned.\n\nTake it off of steam for sale.", "timestamp_created": 1517983000, "timestamp_updated": 1517983000, "voted_up": false, "votes_up": 17, "votes_funny": 1, "weighted_vote_score": "0.688708186149597168", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "47447633": {"recommendationid": "47447633", "author": {"steamid": "76561198041030581", "num_games_owned": 180, "num_reviews": 4, "playtime_forever": 52, "playtime_last_two_weeks": 0, "playtime_at_review": 52, "last_played": 1449815020}, "language": "english", "review": "dead game. another slimy company making money selling a game they'll never finish. disgusting. I can't believe steam still allows people to purchase this garbage", "timestamp_created": 1544477073, "timestamp_updated": 1544477073, "voted_up": false, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.688453853130340576", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "22645738": {"recommendationid": "22645738", "author": {"steamid": "76561198137422939", "num_games_owned": 577, "num_reviews": 15, "playtime_forever": 4982, "playtime_last_two_weeks": 0, "playtime_at_review": 4982, "last_played": 1458370218}, "language": "english", "review": "It was pretty fun for awhile, but then got super grindy and then it just died out again. No updates, no nothing.", "timestamp_created": 1461677645, "timestamp_updated": 1461677645, "voted_up": false, "votes_up": 39, "votes_funny": 4, "weighted_vote_score": "0.688095986843109131", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "17275139": {"recommendationid": "17275139", "author": {"steamid": "76561198087066156", "num_games_owned": 3813, "num_reviews": 42, "playtime_forever": 13119, "playtime_last_two_weeks": 0, "playtime_at_review": 1885, "last_played": 1500525039}, "language": "english", "review": "9/10\nsandbox, weapon, planets, monster, stargate, cave/dungeon, level-based-monster on grid/location", "timestamp_created": 1438133471, "timestamp_updated": 1438133471, "voted_up": true, "votes_up": 17, "votes_funny": 4, "weighted_vote_score": "0.687287867069244385", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "46501635": {"recommendationid": "46501635", "author": {"steamid": "76561198080870575", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 491, "playtime_last_two_weeks": 0, "playtime_at_review": 491, "last_played": 1475370048}, "language": "english", "review": "Seriously I want a refund, it's been over a year since this game's servers have been shut down", "timestamp_created": 1542942246, "timestamp_updated": 1542942246, "voted_up": false, "votes_up": 31, "votes_funny": 0, "weighted_vote_score": "0.686581313610076904", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "14628319": {"recommendationid": "14628319", "author": {"steamid": "76561198030786574", "num_games_owned": 220, "num_reviews": 27, "playtime_forever": 4020, "playtime_last_two_weeks": 0, "playtime_at_review": 4004, "last_played": 1437262538}, "language": "english", "review": "Let me preface this by saying this game does have a lot of potential.  I have put quite a few hours in it, and in the beginning it was quite enjoyable.   Lets look at the good AND the bad.\n\nGood\n1. Graphics are quite nice.  The style is unique and pretty.\n2. The crafting system is fairly robust.  \n3. Good music and sounds when they aren't bugged.\n4. The IDEA behind the game is sound, if realized I may recommend this game.\n\nBad\n1.  This has improved slightly, but this is still the most poorly optimized game I've ever seen.\n2.  The sound is bugged badly since release, hasn't improved at all.  Random sounds and music at random times.\n3.  This is FALSELY advertised as both Single-Player AND Survival.  It is neither of those.\n4.  A better name for the game could be Grindy McGrinderson lands on the planet Grind and builds Grindytown.\n5.  It literally seems to get worse with each patch.  Sounds have gotten worse, the events are no more than large groups of random mobs (unless you get slimes, then you might see some bosses), the resource placement is appallingly bad right now, and the instances are scarce and nearly useless.\n6.  To call combat rudimentary would be generous. Imagine Minecraft combat, only not as intricate. \n\nThe game IS an EA title as some will surely point out.  This MAY all get ironed out by release, but I don't recommend games on what they might be.  At this state is not really worth $10, much less $20.     Do yourself a favor and let them sort out this mess, don't toss your money away just yet.", "timestamp_created": 1424740193, "timestamp_updated": 1424740193, "voted_up": false, "votes_up": 75, "votes_funny": 11, "weighted_vote_score": "0.685913264751434326", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "33578062": {"recommendationid": "33578062", "author": {"steamid": "76561198096925075", "num_games_owned": 146, "num_reviews": 2, "playtime_forever": 1101, "playtime_last_two_weeks": 0, "playtime_at_review": 1090, "last_played": 1478791853}, "language": "english", "review": "The game just disappeared, no more servers, no more updates... Really sad looking back at the fun I was having with this game :(", "timestamp_created": 1500186482, "timestamp_updated": 1500186482, "voted_up": false, "votes_up": 21, "votes_funny": 0, "weighted_vote_score": "0.684590280055999756", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "14050724": {"recommendationid": "14050724", "author": {"steamid": "76561198015539882", "num_games_owned": 3128, "num_reviews": 142, "playtime_forever": 228, "playtime_last_two_weeks": 0, "playtime_at_review": 127, "last_played": 1482012067}, "language": "english", "review": "GRAV is a sci-fi themed survival game with action combat.\nIt feels kinda like a mix of World of Warcraft and Minecraft with a solid third-person combat thrown in.\nThe game is build using Unreal Engine and looks absolutely gorgeous.\nAnd there's plenty of procedurally generated content to explore.\nOn top of that you can build your own base, which will undoubtedly be attacked at some point, so don't forget the defences.\nJetpacks, monocycles and pets are included.\nOh, and dancing around campfire to increase healing rate is there too! :D\nPlus, developers are pushing out updates like crazy (just look at those build notes).\n\nOn the downside:\n- Game in general is not very well optimized at the moment (and there are no options to tweak, only ini files). So, unless your machine meets min reqs (have at least 8GB of RAM, this game loves it), you probably shouldn't get it.\n- Net code seems to be unoptimized at all - having any latency and lags to local server is a bit strange (although that might be related to fact that server as well eats tons of RAM and 8GB is just not enough for running both - server and client)\n- Current (v7) progression is limited to getting all blueprints from monster and leveling your character does not do much.\n\nOh, and it's definitely more fun to play with you friends.\nIf that sounds like your thing - you'll probably enjoy playing GRAV!\n\nWatch overview of the currently available things in the video below:\nhttp://youtu.be/YYvj-3RsJpU", "timestamp_created": 1421590976, "timestamp_updated": 1421590976, "voted_up": true, "votes_up": 30, "votes_funny": 6, "weighted_vote_score": "0.684583604335784912", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}}, "query_summary": {"num_reviews": 5, "review_score": 5, "review_score_desc": "Mixed", "total_positive": 1808, "total_negative": 2338, "total_reviews": 4146}, "cursors": {"AoIIPwBdEHCQp94E": "Mon Apr 22 23:47:40 2024"}}
