{"reviews": {"157208648": {"recommendationid": "157208648", "author": {"steamid": "76561198098839133", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 37, "playtime_last_two_weeks": 0, "playtime_at_review": 37, "last_played": 1438833423}, "language": "english", "review": "It is never a good thing to wish failure on someone. After 9 years, and basically no development after many angry promises from the dev team, I feel oddly validated by this games failure.\n\nI tried playing Savage Lands back in 2015. It wasn't for me. Unfinished, ugly, punishing game with no real reason to do anything but die. I moved on.\n\nMy friend posted a review, just honest feedback, nothing scathing, just his experience. He was responded to by a dev, who basically just retorted with, \"No! Your opinion is wrong and you did it wrong!\"\n\nOpinions can be wrong, If your opinion is \"I believe the Earth is flat,\" or, \"I think Lizard people have replaced the President,\" your opinion is not founded in reality and is wrong.\n\nIf your opinion is, \"This game wasn't very fun, it was anti-fun to play,\" there is no counter-argument. It is a subjective opinion not everyone will agree with. If you disagree because you made a bad game and want to fool people into buying it, you will never convince someone to give you a try because you are a delicate baby who can't handle criticism relevant to your unfinished game. Some people enjoy putting adult toys in their urethra. Are they wrong to think so? Of course not, but you can never convince me it is a universal joy, and anyone who doesn't enjoy it must be doing something wrong.\n\nI would never have thought about this game again had the dev not reacted the way they had. It's some real Starfield Bethesda energy to respond to valid and calm criticism with: \"Nah, you must be the problem, surely it isnt this boring heap we threw together using all 50 shades of gray for the color spectrum.\"\n\nI hope the devs have grown in the past 9 years, both in skills for developing games as well as interacting with a civilized society. Your bad game doesn't deserve a scathing review, but your interactions with your customers does.", "timestamp_created": 1706641861, "timestamp_updated": 1706641967, "voted_up": false, "votes_up": 9, "votes_funny": 3, "weighted_vote_score": "0.627991139888763428", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "157704633": {"recommendationid": "157704633", "author": {"steamid": "76561198141032629", "num_games_owned": 1245, "num_reviews": 21, "playtime_forever": 171, "playtime_last_two_weeks": 0, "playtime_at_review": 133, "last_played": 1707219632}, "language": "english", "review": "Valheim that wasn't released in his time", "timestamp_created": 1707213897, "timestamp_updated": 1707213897, "voted_up": false, "votes_up": 8, "votes_funny": 3, "weighted_vote_score": "0.607935309410095215", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "157693927": {"recommendationid": "157693927", "author": {"steamid": "76561198113049016", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 447, "playtime_last_two_weeks": 0, "playtime_at_review": 26, "last_played": 1707844072}, "language": "english", "review": "I refunded this game awhile ago and want to buy it again, but it seems like its been abandoned, it has potential and I hope the devs grew up over the past 9 years and continue development (I know basically zero chance) if not then I hope another developer could get the rights to it because it could be a very good game, for only four dollars even if its kinda bare could be a good time killer, so please could someone pick up this game and continue it!", "timestamp_created": 1707195200, "timestamp_updated": 1707195200, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.570474624633789063", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159527309": {"recommendationid": "159527309", "author": {"steamid": "76561197987056554", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 701, "playtime_last_two_weeks": 0, "playtime_at_review": 701, "last_played": 1707344306}, "language": "english", "review": "EARLY ACCESS REVIEW\n\nThis game has a solid foundation and the core gameplay loop is engaging. The combat is a little lackluster as I found there wasn't much depth to it but for an early access game it is acceptable.\n\nI am interested to see where the development of this game goes but at the time of this review, it hasn't been updated since September 2022 and because of this, I cannot recommend this game at this time.", "timestamp_created": 1709200860, "timestamp_updated": 1709200860, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.533759951591491699", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161616233": {"recommendationid": "161616233", "author": {"steamid": "76561198081829358", "num_games_owned": 55, "num_reviews": 17, "playtime_forever": 13176, "playtime_last_two_weeks": 0, "playtime_at_review": 13060, "last_played": 1711649536}, "language": "english", "review": "I used to love this game, and trust me, it used to be much better then it is now. But its still good fun today. Its been abandoned by 2 dev teams, and alot isnt finished. Itll probably forever be in early access.\n\nMan... How I miss the good old days", "timestamp_created": 1711582236, "timestamp_updated": 1711582236, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.532081782817840576", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "162007699": {"recommendationid": "162007699", "author": {"steamid": "76561197963925447", "num_games_owned": 0, "num_reviews": 30, "playtime_forever": 1422, "playtime_last_two_weeks": 0, "playtime_at_review": 1422, "last_played": 1527821130}, "language": "english", "review": "The game was created, got abandoned, another person (group? company?) took over it and it got abandoned again.", "timestamp_created": 1712041155, "timestamp_updated": 1712041155, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.522631525993347168", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161969804": {"recommendationid": "161969804", "author": {"steamid": "76561198205567837", "num_games_owned": 193, "num_reviews": 5, "playtime_forever": 206, "playtime_last_two_weeks": 0, "playtime_at_review": 206, "last_played": 1484600601}, "language": "english", "review": "Abandonware", "timestamp_created": 1711996724, "timestamp_updated": 1711996724, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.51095890998840332", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160382920": {"recommendationid": "160382920", "author": {"steamid": "76561198063609676", "num_games_owned": 364, "num_reviews": 209, "playtime_forever": 1074, "playtime_last_two_weeks": 0, "playtime_at_review": 1074, "last_played": 1710244343}, "language": "english", "review": "Lots of people whine about this game but I have already gotten 20$ worth of play out of it and there is at least another 20 in it. DO NOT like the whole dying and losing everything bit, but you can hunt down your old corpse and get it back. WHY? I dont know. Either take the stuff away permanently in which case I would not play it, or just LET US KEEP IT when we die. It IS a game all about PROGRESSION and one does NOT want to grind over and over for stuff they had but lost. LOSING PLAYERS THIS WAY. Or add an option to keep stuff after death. And cheats for SOLO mode. But otherwise a tidy little game.", "timestamp_created": 1710244536, "timestamp_updated": 1710244536, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.507565796375274658", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "32293750": {"recommendationid": "32293750", "author": {"steamid": "76561197999817058", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 158, "playtime_last_two_weeks": 0, "playtime_at_review": 158, "last_played": 1476468562}, "language": "english", "review": "I think Steam should remove games and penalize the developer if an early access game never sees final release. Otherwise this will encourage developers to make money on an alpha and abandon the project. I think this is highly fraudulent.", "timestamp_created": 1497020392, "timestamp_updated": 1497020392, "voted_up": false, "votes_up": 317, "votes_funny": 4, "weighted_vote_score": "0.921211302280426025", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1541208477, "developer_response": "Hello SeDo,\n\nThanks for posting up your thoughts some time back. We do apologize for the previous developer putting Savage Lands on pause. If we [url=https://steamcommunity.com/app/307880/discussions/1/1694923613854143166/] (Last Bastion Studios) [/url] were around earlier, we might have been able to prevent the long delays between updates.\n\nIn case you were not aware, we [url=https://steamcommunity.com/app/307880/discussions/1/1694923613854143166/] (Last Bastion Studios) [/url] took over the development of Savage Lands from the previous developer (Signal Studios) back in May 2018. Since that time our team has released a series of constant updates (over 20) that include over 800+ bug fixes, we resolved several major game crashes, improved performance (FPS) by over 50% on most machines, revamped the AI and general content flow, fixed the networking code so players can co-op again, overhauled much of the artwork, rebalanced the entire game, and have added new content (creatures/items/etc.). Much of these changes came at the request of our community. We also have plans to add a new playable area to the game in the coming months complete with new creatures and items. \n\nFor a full list of all Game Updates and patch notes we have released since taking over the development of Savage [url= https://steamcommunity.com/games/307880/announcements/] CLICK HERE[/url].\n\nTo find out what is currently being worked on for the game check out our latest [url= https://steamcommunity.com/app/307880/discussions/1/1734343065613854175/]Developer Update[/url].\n\nWe'd love to get your feedback on the most current version of Savage as it has changed considerably from when you last played; it will go a long way in helping us better the game for all players. Please feel free to post it here in our [url= https://steamcommunity.com/app/307880/discussions/7] Suggestions & Feedback Forum [/url] or message us directly. =)\n\nThanks again for the time you put into the game, hopefully we’ll hear from you.  =)\n\nRegards,\n-Last Bastion"}, "32099791": {"recommendationid": "32099791", "author": {"steamid": "76561198117547705", "num_games_owned": 0, "num_reviews": 44, "playtime_forever": 96, "playtime_last_two_weeks": 0, "playtime_at_review": 96, "last_played": 1463707129}, "language": "english", "review": "if games stop being developed after we put into early access to support the game, then the game should be removed from steam \n\ni do not understand business practice these days, this is bullshit and fraud.\nDO NOT SUPPORT THIS GAME IN ITS CURRENT STATE\n\nit has negative reviews for a reason.", "timestamp_created": 1496290273, "timestamp_updated": 1498442840, "voted_up": false, "votes_up": 318, "votes_funny": 5, "weighted_vote_score": "0.917021632194519043", "comment_count": 31, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "30154516": {"recommendationid": "30154516", "author": {"steamid": "76561198125747901", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 16077, "playtime_last_two_weeks": 0, "playtime_at_review": 15051, "last_played": 1624110094}, "language": "english", "review": "24 February 2017\n\nWARNING: Potential Abandonware\n\nMy original review is at the bottom of the page. I was going to wait a year to update this review, but the developers are spitting in the face of the community. I no longer feel comfortable recommending this game as they have managed to break the game to the point were the vast majority cannot play it. I have gotten my moneys worth out of this game. This review update is for those who are on the fence about buying it for the first time, to make an informed decision. I will update if the developers fix the game enough to make it playable before they abandon it \"temporarily\" to finish thier other project.\n\nQuotes are from a developers response to the community in the linked thread.\nhttp://steamcommunity.com/app/307880/discussions/1/135509823662604357/\n\n\n[quote]Now, moving on to the game. I agree the state that project is in not a disired one. I understand there is always frustration when \"Your game\" (aka Savage Lands) is not the priority.[/quote] \nThis is the second time they are abandoning Savage Lands to make a completely unrelated game\n\n\n[quote] \"Fury Road\" which has been named by the community as a specific build will not be a roll back option. Currently, we are also not planning on supporting the \"live version\" with more content.[/quote]\n.....and refuse to rollback Savage Lands to a version that wasnt tottally broken, that the community as a whole requested because it was fun to play. I will think twice before even looking at another Signal Studios game in the future.\n\n\n[quote]Moving forward I will be spending more of my person time in the forums to either respond to or close and lock topics. The forum has rules and in this post only about 60% of you are following them.[/quote]\n The developers are now entering the phase of comming into the steam forum page, and threatening to ban people/delete threads and posts that criticize the game \"to harshly\". \n\n\n07 April 2016\n\nGame keeps improving with the move to unity 5 in both gameplay and visual appeal.  Almost to the point in the dev cycle of being worth the asking price as content is added and bugs are squashed on a weekly basis. The crafting system is really starting to get fleshed out and game progression is gear/ location centric. No levels in this game. You live by  fighting through to the next best metal ore nodes, to make the next set of armor/weapons. Food and heat are very important as you can and will starve/freeze to death if you dont watch the feedback meter. \n\nNeeds balancing so combat isn't so extreme from on level of gear to the next  as you get one shoted in tin gear by the plague wovles when moving from the first to second islands, but overall good balance between risk/reward during fights. The one game breaker for me is the fact that you can escape any threat by just jumping up onto a rock. The AI pathing will have them running around said rock allowing you to stand in place and bow kite till dead.", "timestamp_created": 1487984047, "timestamp_updated": 1487984363, "voted_up": false, "votes_up": 214, "votes_funny": 1, "weighted_vote_score": "0.910419762134552002", "comment_count": 12, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1547537469, "developer_response": "Potentate,\n\nThanks for posting up your thoughts some time back. We do apologize for the previous developer putting Savage Lands on pause. If we [url=https://steamcommunity.com/app/307880/discussions/1/1694923613854143166/] (Last Bastion Studios) [/url] were around earlier, we might have been able to prevent the long delays between updates.\n\nIn case you were not aware, we [url=https://steamcommunity.com/app/307880/discussions/1/1694923613854143166/] (Last Bastion Studios) [/url] took over the development of Savage Lands from the previous developer (Signal Studios) back in May 2018. Since that time our team has released a series of constant updates (over 20) that include over 890+ bug fixes, we resolved several major game crashes, improved performance (FPS) by over 50% on most machines, revamped the AI and general content flow, fixed the networking code so players can co-op again, overhauled much of the artwork, rebalanced the entire game, and have added new content (creatures/items/etc.). Much of these changes came at the request of our community. We also have plans to add a new playable area to the game in the coming months complete with new creatures and items. \n\nFor a full list of all Game Updates and patch notes we have released since taking over the development of Savage [url= https://steamcommunity.com/games/307880/announcements/] CLICK HERE[/url].\n\nTo find out what is currently being worked on for the game check out our latest [url= https://steamcommunity.com/app/307880/discussions/1/1734343065613854175/]Developer Update[/url].\n\nWe'd love to get your thoughts on the most current version of Savage as it has changed considerably from when you last played. This feedback will go a long way in helping us better the game for all players. Please feel free to post it here in our [url= https://steamcommunity.com/app/307880/discussions/7] Suggestions & Feedback Forum [/url] or message us directly. =)\n\nThanks again for the 250+ hours you put into the game, hopefully we’ll hear from you.  =)\n\nRegards,\n-Last Bastion"}, "24637541": {"recommendationid": "24637541", "author": {"steamid": "76561198062573636", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 1383, "playtime_last_two_weeks": 0, "playtime_at_review": 1016, "last_played": 1470626455}, "language": "english", "review": "Well im not sure how to start this since this is my first review of the game. I purchased this game prolly about a year ago with a few of my friends the game was fun and hard, like just finding enough food to stay alive hard. but it was very early in the games career. we played for a bit and then for whatever reason we stopped playing.\n\nLast night we were having a hard time firguring out what game we wanted to play and came back accross this game and were curious to see how things have progressed. took us a few minutes to recapture our bearings on how the game works and before you can make your first bags and boxes inventory management is huge.\n\nDay 1: We run around franticly trying to figure out how to build a shelter and such and start to realize we are not going to get one done before night falls. Night hits and we are huddled around a campfire trying not to freeze to death. get warm enough and tired of staying put so i figure i will go get some more stone to work on things. walk towards a rock and i hear them before i notice them. It's a pack of wolves, so i quickly retreat to the fire hoping like real wild animals they will want to stay away from the campfire. we also manage to encounter a few skelletons which we just dodge the easily choreographed moves and club them down. \n\nDay 2: notice something about making some bigger bags, so i spend the day chasing down and clubbing boars for food and supplies. wandering around the woods i hear wierd noises i attribute to the pigs. Then i hear the flapping and realize as the trees around me burst into flame that it was not a simple boar after all. Panic sets in as i glance up at the sky trying to see what the heck is trying to burn me to a crisp. so i start running inbetween trees and rocks hoping to lose him. after what i assume to be a few more strafing runs looking for me he must have left cause the sounds vanished.\n\nDay 3: By now we have got some decent supplies gathered and have learned how to fight the various beasts in the area: Boars, Wolves and Skeletons. We find a ruined town of sorts with a glowing red skeleton in the center of it. decide we are going to see what hes made of. i go in first to see if i can figure out his attack patter without being murdered. He lunges at me, I sidestep in what i feel is just in time and give him a smack with my stone sword and notice his heath bar barely moves. At that moment we knew we were in for a long fight of hit and run tactics. After what felt like was about 10 minutes we brought him down. Soon after we are making our way back to our base and i hear it again. this time the dragon has now set its sights on my friend. he uses a giant boulder to dodge the dragons 3 strafing runs before the beast appears to have lost interest with him and left.\n\nThat was our couple day experience in the game, needless to say we are going to be making another trip into the Savage Lands to see what other adventures we have in store.\n\nPros:\nDangerous enemies.\nWhile some of the moves they have are somewhat easy to dodge. that one time you don't you will pay for it.\nI have read some of the other reviews complaining about the dragon, as long as you stay out of the open and away from his tower he appears to leave you alone for the most part. but just that fear that settles in when hes coming after you is worth it every time.\n\nFairly In depth crafting system:\nMe and my friend have only appeared to scratch the surface of it, but so far so good\n\nSense of Survival:\nFrom the aspect of staying warm to starving to death, you do get that feeling like there is more than just monsters that threaten your life.\n\nNo gamebreaking bugs so far:\nYeah no bugs we have found so far have made the game unplayable.\n\nCons:\n\nSharp learning curve:\nnot sure if its a pro or a con, but the game is a little overwhelming at first if you are not very accustomed to survival games.\n\nNot sure how well this game works solo:\nAs i stated i played this game with a friend, i can see the world and lack of inventory room at the begining very harsh for someone playing by themselves.\n\nConclusion:\n\nThumbs up!\nIt has enough going good for me to recommend this game to others with what ive seen. It also has enough different with it to justify getting it with the large amount of survival games on the market at the moment. I would buy this game again just for the few experiences i have had with it. I look forward to seeing whats coming next from the devs. they seem to update this game pretty frequently.\n\n*Edit* it is clear this game has been abandoned. wish it had not been as it was truly fun when i did play it with friends.", "timestamp_created": 1469985257, "timestamp_updated": 1675105819, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.874711513519287109", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "38871286": {"recommendationid": "38871286", "author": {"steamid": "76561198167634260", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 60, "playtime_last_two_weeks": 0, "playtime_at_review": 60, "last_played": 1427598426}, "language": "english", "review": "DO NOT BUY!  Game is not being worked on anymore.  The last 2 update announcements have come and gone without the update. The lead dev https://twitter.com/LoganDeMelt must have better things to do with our money besides finishing Savage Lands.  In his FREE time he likes to play and stream PUBG instead of working on Savage Lands.\n\nUpdate, just ban from Savage Lands forums:\n\nSean 29 minutes ago \nYou can have your point of view, but you were repeatedly arguing over moderation and attempting to rile people up. Regardless if that was your intent, that is the tone given by your comments in the forums.", "timestamp_created": 1514659373, "timestamp_updated": 1515543770, "voted_up": false, "votes_up": 155, "votes_funny": 12, "weighted_vote_score": "0.872936904430389404", "comment_count": 9, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "15663873": {"recommendationid": "15663873", "author": {"steamid": "76561198099841240", "num_games_owned": 2347, "num_reviews": 27, "playtime_forever": 9613, "playtime_last_two_weeks": 0, "playtime_at_review": 5305, "last_played": 1679255640}, "language": "english", "review": "[i]This is an EARLY ACCESS Review and I'll change it after the game is finished.  This is what I think of the game as it sits.[/i]\n\n[h1]Pros[/h1] \n\n [*] The game runs great on my system.   Around 60fps on max settings (Specs on my [url=http://steamcommunity.com/id/CK81]Profile[/url])\n\n [*] There's a decent amount to do.  A few different types of wildlife to kill and several different baddies as well as a dragon (Though I'm not sure you can kill the dragon yet, never tried)\n\n [*] The game in my opinion is beautiful.\n\n [*] It seems to be pretty solid at the moment.  I have yet to have a game crash with it and had very few bugs.  Only bugs I've had so far are invisible items when playing on others servers and trees glitching out when chopping, the tree would fall but there'd be another in its place that can't be chopped (Think both these bugs were fixed).\n\n [*] Crafting is really easy and getting the materials needed takes no time at all.  You can get in the game quick, build more tools, weapons and armor in no time.  \n\n [*] Crafting buildings is easy as well.  Some are really quick, can build a basic house and fire pit in minutes.  The larger ones can take a little bit longer, like the townhall.\n\n [*] It has multi-player.  This type of game is fun for a while in single player and can keep some people content just playing single, but it also offers multi player with PvP and Non PvP servers (Hostile/Friendly) which just adds to the fun.  Having extra players (Up to 8 as of this review) helping you build towns and survive or to kill make this game well worth it.\n\n[h1]Cons[/h1] \n\n [*] The game runs pretty good on my system, but sometimes I get fps drops.  Not terrible or unplayable, but noticable.  I think it happens when there seems to be a lot of loot on the ground when it snows.  That's when I've noticed it.  Mostly the game runs great though so a few times of it dropping like that doesn't really ruin the experience for me.\n\n [*] The combat is OK, real time, but still needs a decent amount of tweaking.  Some things you can circle and barely get hit while attacking it and others can still hit you when you aren't nearly close enough for a hit yourself.  Skeles and I believe a few others need to be tweaked a bit, they can be pretty far from you and as long as they attempt to swing at you, you get hit.\n\n [*] Doesn't have dedicated servers yet (Maybe never) so when the host decides to leave, everything you did on  his server is gone, except the loot you have on you when he does.  Who knows if he plans on coming back either, so basically when you join someones server, you're mainly helping them build their buildings, unless you're there to be a dick and steal their items or just harvest materials and leave.   I don't mind joining others servers though, I like helping out and I've met some great people doing so.\n\n [*] Has a max of 8 players. IMO  I think this game should at least offer 16 players or more.\n\n [*] Needs to have more buildings to craft.  There's really not that many to craft and they bug out easily, meaning that you  have to be on perfectly flat ground, otherwise half your building is floating.  This could be solved by allowing players to terraform or by putting a decent sized foundation on them,  so when the building is on a hill, theres a bottom still.  As we speak, there's no foundation.\n\n [*] Really needs a map, or at least offer a way to craft one or something similar.  The compass doesn't really help as much as I thought it would (Could be I'm just an idiot though)\n\n [*] There's a decent amount of gear to craft at the moment, but couldn't hurt to have a little more.  For those of you who think there's only a few items, you unlock a lot more after playing a while.  This really isn't a bad thing, I just think it could use a bit more.\n\n[i] When I think of more items I think should be here, I'll add them.  But for my experience with the game so far, this is all I have.  The game is pretty solid and offers a decent amount of fun so really, I don't have much to complain about.[/i]\n\nI'll be adding some gameplay videos in a while as well.", "timestamp_created": 1430625884, "timestamp_updated": 1433970525, "voted_up": true, "votes_up": 275, "votes_funny": 10, "weighted_vote_score": "0.868226230144500732", "comment_count": 12, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "16021800": {"recommendationid": "16021800", "author": {"steamid": "76561197965396869", "num_games_owned": 0, "num_reviews": 237, "playtime_forever": 2132, "playtime_last_two_weeks": 0, "playtime_at_review": 563, "last_played": 1686717077}, "language": "english", "review": "The potential in this game is staggering but beware because death comes in many ways.  Freezing to death, wolves, starving to death, wolves, drowning, wolves, lack of shelter, wolves.  Yup.  It's awesome!  No, it is AWESOME - that wasn't sarcasm at all.\n\nI didn't read the forums, read.me file, or anything that would give me the slightest hint on how to play.  I looked only at the controls so I'd know how to move around then I started a game.  I ran around like a moron trying to figure out what to do.  Nearly starved to death, nearly froze to death.  That didn't happen only because I encountered some less-than-friendly wolves.  They didn't starve to death, I can tell you that much.\n\nI started again.  Ran around like a moron trying to figure out what to do.  Froze to death after nearly starving to death.\n\nI started over again.  Got a few things together but ran into two wolves who decided that I looked like I wasn't close enough to both freezing and starving to death.  Those wolves also did not starve to death.\n\nI started again.  I looked around the starter area and scavenged for loot.  I got a lean-to and a fire going, then built a house.  I found out where to get food without hunting so I wouldn't starve once my starting food was gone.  I figured out how to hunt deer.  Then I started to make better gear and keep up on the repairs of what I was carrying.  Now I have three houses (Small, regular, stone), a forge, several lean-to structures, several fire pits and a tonne of ore, logs, blue plants, bandages and gear.  I've got enough food for several days and now that I've finally made a longbow and 30-40 arrows hunting is much easier.\n\nThe game got a bit dull after I go to the point where I had everything I needed to survive for a few days.  The character moves so slowly I don't feel like exploring too far yet, but as I build structures farther from my initial town/house I'm sure I will explore a lot more of the island - the size of which is still a mystery as are several other things I've seen so far.\n\nStill in early access - as of 2015-05-27, so keep that in mind if you decide to try it.  That and I had to turn down several settings so it would run fairly well - and I have a decent system.  Pretty sure once it's out of the EA stages it will run better.", "timestamp_created": 1432710680, "timestamp_updated": 1644439692, "voted_up": true, "votes_up": 252, "votes_funny": 286, "weighted_vote_score": "0.866727292537689209", "comment_count": 12, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "32293303": {"recommendationid": "32293303", "author": {"steamid": "76561198042978720", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 2137, "playtime_last_two_weeks": 0, "playtime_at_review": 2137, "last_played": 1496656324}, "language": "english", "review": "Thought that the game had an interesting premise, so I bought it for myslef and my wife. We got a to play it on a few occasions, but then an update made it unplayable on my wifes system. No info on how to fix it or how to get it playing again. \nLast info that we got was that the game is no longer developed. I have purchased a game that became unplayable during development. \nAll and all I think we got our moneys worth with the time we had exploring that game, but since it no longer works I cannot recommend it. \nI think this is the last early access I will ever support.", "timestamp_created": 1497019185, "timestamp_updated": 1497019185, "voted_up": false, "votes_up": 92, "votes_funny": 1, "weighted_vote_score": "0.856083571910858154", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1541316937, "developer_response": "Hello Marcuse,\n\nA lot has changed with Savage over the last few months. In case you were not aware, we [url=https://steamcommunity.com/app/307880/discussions/1/1694923613854143166/] (Last Bastion Studios) [/url] took over the development of Savage Lands from the previous developer (Signal Studios) back in May 2018. Since that time our team has released a series of constant updates (over 20) that include over 800+ bug fixes, we resolved several major game crashes, improved performance (FPS) by over 50% on most machines, revamped the AI and general content flow, fixed the networking code so players can co-op again, overhauled much of the artwork, rebalanced the entire game, and have added new content (creatures/items/etc.). Much of these changes came at the request of our community. We also have plans to add a new playable area to the game in the coming months complete with new creatures and items. \n\nFor a full list of all Game Updates and patch notes we have released since taking over the development of Savage [url= https://steamcommunity.com/games/307880/announcements/] CLICK HERE[/url].\n\nTo find out what is currently being worked on for the game check out our latest [url= https://steamcommunity.com/app/307880/discussions/1/1734343065613854175/]Developer Update[/url].\n\nTime permitting we'd love to get feedback on the latest version. Please feel free to post it here in our [url= https://steamcommunity.com/app/307880/discussions/7] Suggestions & Feedback Forum [/url] or message us directly. =)\nThanks again and hopefully we’ll hear from you.  =)\n\nRegards,\n-Last Bastion\n"}, "15939249": {"recommendationid": "15939249", "author": {"steamid": "76561198046461242", "num_games_owned": 563, "num_reviews": 38, "playtime_forever": 545, "playtime_last_two_weeks": 0, "playtime_at_review": 342, "last_played": 1534512241}, "language": "english", "review": "Let's just say, you don't need to worry about people killing you, like in other games that turned strictly into PvP games. \nStart looking for resources as soon as you spawn.\n\nDefinitely needs more work, and that's why it's in early access. The devs are very active with updates and lives streams, and seem eager to make a great game. They seem like they love their job, take it seriously and want to make a good product. Just the kind of dev who makes a good game.", "timestamp_created": 1432295668, "timestamp_updated": 1432323650, "voted_up": true, "votes_up": 99, "votes_funny": 5, "weighted_vote_score": "0.856043398380279541", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19965545": {"recommendationid": "19965545", "author": {"steamid": "76561198005757129", "num_games_owned": 432, "num_reviews": 23, "playtime_forever": 1301, "playtime_last_two_weeks": 0, "playtime_at_review": 1301, "last_played": 1451254518}, "language": "english", "review": "Sometimes I feel like I am adrift in a sea of early access survival games, getting suckered into one after another always hoping the next one will have some magic to it. Well, I'm happy to say this is one of those rare games in the genre that manages to distinguish itself. I've been having a great time with this title exploring and surviving, it has that magic I'm always looking for. \n\nForemost I have to talk about the high visibility of the devs. When I say high visbility, I mean the highest I've ever seen. I see them all over the forums, live streams where they show what they're working on and answer questions, heck the in game menu even says when the next update is going to be. These guys really know what being accountable is and they do everything early access devs should be doing. Come what may I'm really glad to have supported this crew, they should be the example other devs look to when doing an early access game. \n\nThe topic I'd like to weigh in on most is crafting. I see curators and other reviewers tout the crafting in this game so I think it's worth a minute of my review to talk about what crafting is and is not here. If you're looking at this game from the view point of a craftaholic this game isn't going to scratch that itch. You won't be building massive creative works here, it's not a creative outlet. Crafting is somewhat streamlined and is essentially your means of progression. As you create better gear you can venture to more dangerous areas to get better materials to make even better gear. You could consider this a \"gear grind\" though I found it doesn't feel like much of a grind and really isn't that much of a time sink once you know where to go and what to get. \n\nBeyond that there isn't much I can say that isn't said in most other reviews. Great title I'm proud to support.", "timestamp_created": 1451142977, "timestamp_updated": 1451142977, "voted_up": true, "votes_up": 83, "votes_funny": 4, "weighted_vote_score": "0.854130387306213379", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "15762202": {"recommendationid": "15762202", "author": {"steamid": "76561197995450336", "num_games_owned": 0, "num_reviews": 33, "playtime_forever": 1788, "playtime_last_two_weeks": 0, "playtime_at_review": 1562, "last_played": 1670617173}, "language": "english", "review": "I've played enough to build a 500 log central building and a forge, Craft the most powerful current weapon, Craft several 15 slot bags, craft both the most cold protection (Fur set of armor)and the most physical protection (Plate set of Armor).\n\nPros: \nCreepy music and atmosphere\nCrafting system\nAbility to take what you can carry to other servers when you join.\nAbility to craft a Compass\nJust the right amount of things to kill to make you work for your survival.\n\nCons\nNo way to lock your cabin so other can't loot. Or at the very least the ability to Lock your storage chest.\nAI is not terrible, but not good either...just OK\nPlaying solo on my computer which is pretty fast, lags a little when I fight a pack of wolves (6).\nDurability sucks.. I don't mind repairing my items, but they need CONSTANT repairs. I'd say they need to tripple the Armor and Weapon durability. Axe and Hammer are fine.\nI got booted from a server and it almost auto killed me. Took me down to very little health and bleeding.\nIt would suck to die on a hosted server, go to retrieve your items and they kick you with no way to get your items back.\n\n\nThings to improve game:\nDeveloper hosted servers 24/7\nAbility to lock doors or storage containers\nAI improvement\nDurability increase\nIf you die, you don't loose your items on hosted games, only on local games.\nAbility to see other players on a map and where they are in relation to you.\n2 or 3 story structures or the ability to custom build your own.\n\nKeep up the good work Developers!!\n\n", "timestamp_created": 1431203660, "timestamp_updated": 1431203660, "voted_up": true, "votes_up": 155, "votes_funny": 7, "weighted_vote_score": "0.852219760417938232", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "97277852": {"recommendationid": "97277852", "author": {"steamid": "76561197989581268", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 1299, "playtime_last_two_weeks": 0, "playtime_at_review": 1299, "last_played": 1552756896}, "language": "english", "review": "An unpolished piece of development hell abandoned by its original creators and taken over by a single snarky dev who seems to spend more time trash talking reviewers than creating content. Don't let the copious amount of \"updates\" listed in the news section fool you, this game is definitely going nowhere.", "timestamp_created": 1628578922, "timestamp_updated": 1628578922, "voted_up": false, "votes_up": 89, "votes_funny": 4, "weighted_vote_score": "0.852082431316375732", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1630168045, "developer_response": "Thanks for the post! We do enjoy commenting for sure, especially to dig in and get more actionable feedback based on current builds vs. a version that was played say several years ago.\n\nIf you do get a chance to play the current build, we'd love to get the feedback. Thanks for posting!\n\nFor more indepth details about our updates highlighted in the news section, check out this thread:  https://steamcommunity.com/app/307880/discussions/1/1640915206442322063/\n\nWe are working hard, changing engines is chewing up a bit more time than anticipated. \n\n-LBS"}, "17367049": {"recommendationid": "17367049", "author": {"steamid": "76561198114362241", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 48483, "playtime_last_two_weeks": 0, "playtime_at_review": 31187, "last_played": 1641568845}, "language": "english", "review": "After almost 500 hours of playing this game i can say its been a great ride from the beginning till now, i had a lot of fun times and what i find even more awesome is i am not bored with it one bit. Reason for that is devs are making a great effort, working very close with the community, in upgrading it and improving, making it better and better on a weekly basis.\nAnd i think now we should all just be a bit more patient, and like devs have said many times already, they are working as fast as they can on fixing bugs and issues and adding more content which will in the end, i am sure, make this game more fun and more difficult for everyone (like for example adding new creatures, new enemies like idk forest gremlins; tweaking existing ones so they pose a bigger threat; adding combat with Kur the dragon, and a lot of other stuff that is planned).\nI dont think this game should only be based on basic survival..never ending cicle of gathering food and wood and not moving away from the safety of your cabin on the beach. It didnt make much sense how it was in the beginnings, when cooked deer meat recuperated only 10-15% of your hunger if i remember right, you needed to eat probably over 100 deer meat per day in order to survive one day/night cicle, dont even remember anymore :P not to mention not being able to re-use firepits after they burn out. It also doesnt make much sense to me and its a bit annoying if hunger meter drops that quickly that you need to eat a piece of meat every minute, or cold meter dropping that quickly that you need to \"sit\" by the fire entire day. I think hunger and cold meter are working just fine now and since then there has been a lot of progress made and game is constantly getting better in all fields .\nI think it is not easy to find the perfect balance between easy and hard, but i am sure that with our help they will do it right in the end :) \nWhat i believe will make it more fun and challenging is them adding stuff mentioned above.\nI am looking forward to new updates :)\n", "timestamp_created": 1438610359, "timestamp_updated": 1438610359, "voted_up": true, "votes_up": 203, "votes_funny": 23, "weighted_vote_score": "0.849521100521087646", "comment_count": 20, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "24976565": {"recommendationid": "24976565", "author": {"steamid": "76561197970314107", "num_games_owned": 2306, "num_reviews": 917, "playtime_forever": 139, "playtime_last_two_weeks": 0, "playtime_at_review": 139, "last_played": 1472184800}, "language": "english", "review": "The explosion of survival games in recent years has been fascinating to watch, because everyone has a different idea about what makes them appealing. There are some like Subnautica that go light on the survival elements to emphasize exploration and building in a vibrant world. Then there are others like The Long Dark that push you to learn and master the mechanics to survive in brutal conditions. Savage Lands appears to go in a third way, opposite the ones I just mentioned, and I'm not really sure that's the best direction to strike out in.\n\nSavage Lands casts you as an outcast, sent to the frozen reaches of not-Skyrim presumably to die. You can customize your waxy, lumpy character with mohawks and tribal tattoos before embarking upon your exile, but harbor no illusions of making Goku or Kanye West with the handful of options present. Once you arrive in the arctic wasteland you're given a laundry list of survival tasks that act as a tutorial, directing you to chop wood, gather stones, and hunt animals. It doesn't actually tell you HOW to do these things or WHERE to find them, but I was able to puzzle them all out in fifteen minutes or so.\n\nFrom there you're on your own. The landscape is helpfully dotted with ruins of shacks, cabins, and villages which you can repair with the right resources. This makes a good first goal once you find your footing, working your way up the extensive structure tree from workbenches to smelters in order to patch up your new home. In the meantime you'll have to attend to your survival, represented by two bisected gauges. The top one is health/temperature, restored with bandages and fire, and the bottom is stamina/hunger, restored by eating and not running around all willy-nilly. It's arranged in this way so that hunger and temperature can eat into your other resources if left unchecked, which becomes a major consideration in blizzards or on long treks.\n\nAs you scavenge across the land you'll find notes scattered about that give bits of lore or hints at how features like armor work. You'll also find quite a few points of interest like ruined forts and towers that usually contain some loose tools to appropriate. The other thing you'll find are monsters, and in no short supply. Your starting area is mostly populated with rabbits, deer, and the occasional brittle skeleton that needs to be smashed. Travel more than a hundred meters in any direction, though, and you'll have wolves tearing your throat out. Preparation is a must for longer journeys, as just one tough foe getting the drop on you can spell disaster. They won't give up once they spot you, either, a fact I was distressed to learn after leading a wolf back to my camp.\n\nThere's plenty more to be distressed about, too. Creatures in the world have some of the worst collision and hit detection I've ever seen, vibrating through rocks and walls and hitting you from a yard away. If you're not beating on monsters you'll probably be beating on mineral deposits, because mining is key to progression and takes a ridiculously long time to dig out anything more valuable than coal. Other resources like clay are bound to be a complete mystery unless you try literally everything or consult a wiki. And in a perfect example of how little quality-of-life there is here, a basic container to place in the world takes fairly advanced materials to make, meaning all your junk is going to be sitting in a pile in the snow for a few hours until you can finally craft a fucking wooden chest.\n\nI would be more willing to stick out the rough gameplay if the game had some other appeal, but it really, really does not. You may have noticed that the screenshots on the store page have a lot of similar daytime scenes. That's because this is probably the grayest game I've ever played, and that's counting stuff like LIMBO. The world is almost completely devoid of color; the snowfields are gray, the foliage is brownish-gray, the stonework is blueish-gray, even the monsters are all grays and browns. There's not much detail to the models either, and the animations tend to be slower and stiffer than you'd expect.\n\nThere's certainly potential in Savage Lands, but it won't be realized without some major overhauls that probably aren't within the scope of the project. The visuals are a dreary mess and the progression is needlessly tedious and complicated. And even if you come to grips with that, you're likely to be eaten by a wolf or a dragon and spat out to the main menu. I get the appeal of open-world survival Skyrim but this is missing so many simple balance and accessibility elements that I don't know how you get there from here. If this game ever shapes up I'll revisit the frozen hells therein, but until then I have little interest in sticking it out.\n\n\n\nDid you enjoy this review? I certainly hope so, and I certainly hope you'll check out more of them at https://goldplatedgames.com/ or on my [url=http://steamcommunity.com/groups/audish#curation]curation page[/url]!", "timestamp_created": 1471452083, "timestamp_updated": 1501822107, "voted_up": false, "votes_up": 533, "votes_funny": 42, "weighted_vote_score": "0.848654747009277344", "comment_count": 40, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "30764263": {"recommendationid": "30764263", "author": {"steamid": "76561197995454756", "num_games_owned": 0, "num_reviews": 28, "playtime_forever": 2963, "playtime_last_two_weeks": 0, "playtime_at_review": 2830, "last_played": 1630118860}, "language": "english", "review": "**Update**  10/31/2019\n\nI saw that the game was taken over by Last Bastion Studios.  So with \"new\" developers (because I think they're partially made up by people from Signal Studios) we'll see how development progresses.  I am not holding my breath, but I believe in redemption, so we'll see what happens.\n\nPlayed today for about an hour, and didn't do much.  Just rebuilt the campfire, leanto and house of the old burned out farm, built a crafting table and a smelter.  Killed one deer, 5 rabbits, and 5 skeletons.  Died once due to freezing while trying to find flint.  I will keep my \"NO\" recommendation at this time, but am willing to change it if game play has improved as I play a bit more.\n___________________________________\n\n**Review from 2017**\n\nAscend:  Hand of Kul.  Coop gameplay coming soon!  ...  Server shut down.\n\nSavage Lands.  Development is awesome!  Watch us make this game!  More coming soon!  ...  Abandonware.\n\nToy Soldiers.  Play as your old, beloved toys!  More coming soon!  ...  Cash grab.\n\n\nWhat I've learned:  If it's by Signal Studios, don't you dare touch it, unless you like to give people money for broken promises.", "timestamp_created": 1490580303, "timestamp_updated": 1572549808, "voted_up": false, "votes_up": 72, "votes_funny": 1, "weighted_vote_score": "0.841343462467193604", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1572579336, "developer_response": "Thanks for the post! We appreciate you coming back and spending a few minutes checking out the latest version of the game.\n\nCurious how did you die looking for flint? It's all over the place on the tutorial island (nodes and rocks). Was it just not apparent?\n\nSince so much has changed from the last time you played, allow us to update you on the current state of affairs. Since Last Bastion Studios has taken over the game, over the last year we have released more than 45+ updates that have fixed over 1500+ bugs, resolved major game crashes, improved performance (FPS) by over 60% on most machines, revamped the AI to offer more challenge and fluid gameplay, fixed the networking code so players can actually co-op again, re-balanced all of the gameplay, overhauled the visuals and added tons of new content. So we've been busy, and thanks to the community there was a long list of tweaks we were more than happy to make once we took the game over from Signal Studios.\n\nFor a list of major updates please visit our new section: https://steamcommunity.com/games/307880/announcements/\n\nFor a list of our most recent updates and important instructions for returning players please visit this thread: https://steamcommunity.com/app/307880/discussions/1/1640915206442322063/\n\nWe very much appreciate the post, so if you get a chance to play the current version of the game a bit longer and have additional gameplay feedback you think we can use to make the game better, please feel free to post in our Suggestions & Feedback Forum or message us directly. =)\n\n-Last Bastion"}, "20359265": {"recommendationid": "20359265", "author": {"steamid": "76561198125545519", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 39492, "playtime_last_two_weeks": 0, "playtime_at_review": 2054, "last_played": 1705288111}, "language": "english", "review": "Savage Lands is a cold and ominous experience. The atmosphere is excellent and can be very creepy. I really did feel like I was alone in a hostile land, and at first it took me a long time to feel secure enough to wander into unsafe areas.\n\nYou have a health bar, of course. The other two are hunger and cold. Cold is your first enemy in this game. There's no thirst bar, which makes sense as there is snow practically everywhere so you could easily melt some down; it's fair to assume you have enough water.\n\nYou're limited to pre-designed buildings, and rather few designs. I don't see a problem with basic shacks and such because you'll probably be building a lot of them to give yourself safe harbor as you explore. This isn't a \"design and build a beautiful and complex base from the ground up\" style of game, this is a \"pile some sticks together before you freeze to death and the wolves gnaw upon your frostbitten corpse\" game and I enjoy the roughness of it.\n\nI'm coming at this from a slightly unusual angle because this was the first survival game I ever played. I didn't have any expectations of what building should be like, or crafting, or any of the mainstays of the genre. Since playing Savage Lands I have been hooked on survival games and have been branching out, but I feel it's an excellent introduction, partially because of the limits in buildings; it's less likely to overwhelm a new player. I don't know what the devs' plans are for expanding the building system, but I do hope they keep the prefabs in there as an option for when you just need to get a shack up as fast as possible before the sun goes down and the nasties come out.\n\nThis game also seems to have broken me from my reliance on minimaps. You are forced to navigate with only a compass and landmarks, and this actually becomes surprisingly second-nature. (Side note: there are a lot of people who are confused about how the compass works— the point of the needle always points to the north. That's it. It's no more complicated than that.)\n\nBeing Early Access there are some features missing, for example there are no female characters yet. However, they are confirmed to be in development and they will have realistic armor. The devs listen to the community (you can even vote on features), are extremely active and give information constantly. Frequent updates are made and I have no doubt the devs will deliver on their promises. This game has a bright future.", "timestamp_created": 1452111499, "timestamp_updated": 1452111499, "voted_up": true, "votes_up": 93, "votes_funny": 9, "weighted_vote_score": "0.837210357189178467", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "30449413": {"recommendationid": "30449413", "author": {"steamid": "76561198001258255", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 692, "playtime_last_two_weeks": 0, "playtime_at_review": 692, "last_played": 1441993836}, "language": "english", "review": "This is abandonware.\n\nThe game is impossible to play in its current state. The developers refuse to roll it back to a playable state. Steam refuses to respond to requests for a refund or to address this situation with anything more than an automated response. \n\nhttp://www.savagelandsgame.com/ leads to a broken link, and any inquiries to the email(s) for Signal Studios go without answer. DO NOT WASTE YOUR MONEY", "timestamp_created": 1489245564, "timestamp_updated": 1489245564, "voted_up": false, "votes_up": 83, "votes_funny": 0, "weighted_vote_score": "0.836808919906616211", "comment_count": 15, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "15107012": {"recommendationid": "15107012", "author": {"steamid": "76561198069959842", "num_games_owned": 0, "num_reviews": 46, "playtime_forever": 723, "playtime_last_two_weeks": 0, "playtime_at_review": 686, "last_played": 1467947631}, "language": "english", "review": "I love this game, its a perfect blend of Minecraft, Don't Starve, and with a little bit of Skyrim. I would recommend this game to anyone with the stones big enough to face a challenge bigger than blocky faces and manipulated difficulty. Below are some of the things that stood out as good, bad, and some things I believe would make the game perfect.\n9/10\n\n(ABOVE IS JUST FOR PEOPLE SKIMMING THE REVIEWS, BELOW IS FOR THOSE WISHING FOR INDEPTH REVIEWS!)\n\nIt should be noted that I am at day 4, so some of the ideas covered below are about those 4 days and what was recorded during the process of survival.\n\n\nThe Good:\n\n- Beautiful landscape, I am left breathless at the sheer beauty the land reveals upon each morning.\n- Tenacious wildlife, I am often left speechless at the stubborn force of the wolves and wargs.\n- Unique resource gathering, I cannot help but grin as my axe fells a towering monument of wood.\n- Unique crafting, I am in awe each time I get to craft a new item.\n- Unique building, each time I finish a structure, I can't decide what to focus on constructing next!\n- Harsh environment, I am always in a state of alert as I prowl the wilderness for food, resources, or game.\n- The scary @$$ dragon, actually I find myself running in fear each time I hear that thing roar.\n\n\nThe Bad: \n\n- Sometimes when you drop an item bag (like the Tattered one you start with) it stays with you. Not exactly a bad thing, but when you gather resources, the items sometimes go to the dropped bag.\n- Sometimes when you cut a tree down, the tree will stay up, duplicating a fallen tree unto the ground. While you cannot harvest the tree infinately, it becomes a visual nucience and impairs your building spaces.\n- Sometimes the Warg-like beasts come out during the day near the tower, they didn't attack me, but I found it to be odd that I couldn't even hit them, as they drifted between underground and overground rapidly.\n- I'm not sure if you can, but I can't seem to reignite torches after they get snuffed out.\n- Armor durability, I understand some of the armors aren't exactly ment for combat, and thus obviously would have low durability, but I'm far more sure that they should last at least a day and a half for each set.\n\n\nSuggestions:\n\n- Potion brewing would be a nice touch. Gathering berries, herbs, and various items to mix. Maybe as a potion bottle, a reusable metal container?\n- Going along with the idea of the land being a harsh environment featuring wolves, dragons, wargs and bears, how about witchcraft? Drawing runes on swords or armor to augment them or imbuing a stick to be used as an offencive fire spouting staff/ wand?\n- Farming? Seeing as how you can build a house, a fire, a forge, and a townhall. Why not a garden as well? You could take unspoiled fruits and vegatables and gather their seeds, plant them, and gather them?\n- Rain? Even though the biggest fear in the game is not the cold, why not push the fact that it SHOULD be something to worry about?\n- Fences? Wood walls and doors are good, but to push the idea of building a safe residence, utilizing fences would help some people cope with the night.\n\n(Written 3/29/15 at 3:52 AM with 8.9 Hours of play.)", "timestamp_created": 1427626374, "timestamp_updated": 1427626472, "voted_up": true, "votes_up": 105, "votes_funny": 2, "weighted_vote_score": "0.831402897834777832", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "18344727": {"recommendationid": "18344727", "author": {"steamid": "76561198023307252", "num_games_owned": 112, "num_reviews": 21, "playtime_forever": 2155, "playtime_last_two_weeks": 0, "playtime_at_review": 918, "last_played": 1529820271}, "language": "english", "review": "As of right now I'm only at 90 minutes of play time but that has been enough to inspire this review for three main reasons.\n\n1. The atmosphere of the game is amazing.\n\n2. Playing with other people and helping each other out in such a well done atmospheric setting is an experience that leaves a very good impact on the feels.\n\n3. None of the reviews I've seen so far seem to have touched on the atmosphere of the game much.\n\nMy time in this game so far was spent in an online hosted game where I started out knowing little but was quickly brought up to speed from asking questions to the other people in the game. They helped me figure out some things I needed to complete the tasks assigned by the game when you first start. At the same time I helped collect resources to continue the development of our little village that was forming and scouting any nearby enemies, mainly wolves and skeletons. Once I finished all my tasks initially assigned by the game (basic ones I'm assuming to help you get into the game and to know what you're doing) I thanked my fellow adventurers for the assistance and logged off.\n\nDuring the above in game actions I encountered a few more things that honestly helped me to fall in love with this game's atmosphere rather quickly. Here is a short list of things I enjoyed:\n\n- Standing next to the other players near a fire to keep warm.\n- Hearing the fire crackling and popping.\n- Hearing the cold winds howling around and sounds of nearby animals/creatures.\n- Hearing my character breathing heavily in the cold air as well as almost a sniffling sound during this process.\n- Witnessing the scenery during the different times of day, especially in the evening/during sun set.\n\nHonestly, if you play games for their immersion and emotional interactions, this game is priceless (Especially with a good pair of headphones, as well as a headset as you can hold Tab to talk to other players). Content and basically everything else will come in time and can be added in the future but the atmosphere is something that has to be done right early on. In this game, it is, and the developers seem loyal to producing more content and considering good feedback and suggestions from the community.\n\nOn another note (and I'm sure this is because the game is in early access) I can see where you can run out of things to do in the game currently, however I have obviously not made it there yet due to my 90 minutes of actual play time. I don't think this will be much of a problem for me though, because I've already found great enjoyment in doing simple things such as the events described above.\n\nI look forward to playing this game a lot in the future and as of right now I'm hooked on it!", "timestamp_created": 1444070575, "timestamp_updated": 1444070737, "voted_up": true, "votes_up": 190, "votes_funny": 10, "weighted_vote_score": "0.828827202320098877", "comment_count": 20, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "15025389": {"recommendationid": "15025389", "author": {"steamid": "76561198050930653", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 20023, "playtime_last_two_weeks": 0, "playtime_at_review": 9098, "last_played": 1567752358}, "language": "english", "review": "             I want to take the time and recommend Savage Lands. I have enjoyed over 100 hours of adventure in the game. At some point you will come to a pass and ask yourself, What next. \n\n            The sand box is big. Just with the limited amount of items in the game I have clear cut a path from each tower to the center of the map lined it with torches, buildings and campfires. I have set up camps at each ruin area and made a path to Vek. \n\n            The game is what you make it. I have had fun and the little bit of money I have paid, I have got out of the current content. If I never played another day of the game, I would not be disappointed in what I have spent. \n\n\n            The down side is that the game has such great potential. Yes you are hearing me right. When this happens to a game peoples mines go crazy. It could be this, it could be that. Purple flying pigs that poop loot. The game is great just simple. Survive the cold harsh land. Our imaginations set us up for disappointment if we let it. I hope the community aiding in the direction of this game keep it true to its nature. \n\n\n", "timestamp_created": 1427144514, "timestamp_updated": 1427144514, "voted_up": true, "votes_up": 135, "votes_funny": 22, "weighted_vote_score": "0.826315641403198242", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "106600267": {"recommendationid": "106600267", "author": {"steamid": "76561198014832304", "num_games_owned": 273, "num_reviews": 5, "playtime_forever": 676, "playtime_last_two_weeks": 0, "playtime_at_review": 672, "last_played": 1641671887}, "language": "english", "review": "I bought this game back in Jan 2016. It was a fun stupid game to play with friends... wasn't a serious game at all. Seeing it being re-released 5 years later is a disgrace. How can you 're-release' the same game with no changes. Just merely trying to make a quick buck out of this title. \n\nNo company profile of any sorts, just some random developer most likely.", "timestamp_created": 1640547121, "timestamp_updated": 1640547121, "voted_up": false, "votes_up": 70, "votes_funny": 0, "weighted_vote_score": "0.825331270694732666", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1640618134, "developer_response": "Thanks for the post, we appreciate players like yourself returning to comment. The version you last played more than 5 years ago (Legacy) was well before our time. Much has changed, even the engine we use.\n\nIt's been years since your last playthrough, let us update you on some of the changes. First, our mission has always been to improve Savage for the players that love it, nothing more. Fixing all the issues players encountered in the build we took over was our goal. \n\nWith that, we (Last Bastion Studios) took over the development of Savage Lands from the previous developer (Signal Studios) back in May 2018. In that time our team has released a series of constant updates (over 150) that as of the latest release includes over 2700+ bug fixes, resolved several major game crashes across a variety of system configurations, improved performance (FPS) by over 60% on most machines, revamped the AI and general content flow, fixed the networking code so players can co-op again, overhauled much of the artwork, rebalanced the entire game, and have added new content (creatures/items/islands/etc.). \n\nIt was with the help of our dedicated community that all this came to be. For the most loyal players we added a monument ingame with their names as a way to thank them for hours played and contributions. \n\nWe greatly appreciate your post. Since the version you played last was a legacy build, you will need to create a new character and world if you decide to fire up the game. Please refer to our patch notes page if you have any questions or decide to play the most current version. If you don’t follow the instructions found below and used an old save, your data will be out of sync and cause a bad session.\n\nhttps://steamcommunity.com/app/307880/discussions/1/1640915206442322063/\n\n-LBS\n"}, "24920408": {"recommendationid": "24920408", "author": {"steamid": "76561198015197107", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 1846, "playtime_last_two_weeks": 0, "playtime_at_review": 1697, "last_played": 1473261572}, "language": "english", "review": "This is a really tough review to write because I'm torn between saying Savage Lands is good/fun and it is \"bad\"/not fun.\n\nAfter doing some reading I see that the primary issue my husband and I were trying to work around, namely food scarcity/no spawns, is a recently introduced bug that is already being looked at.  However it really soured our introduction to the game and our play experience.  We spent the day scrambling around desperately trying not to starve to death due to a technical glitch.  That's not fun.\n\nConversely we did actually have a lot of fun.  Cooperating and coordinating our efforts to survive, explore, and get our bearings was hilarious and entertaining.  We even had a surprise adventure or two with some other players on the multiplayer public servers.  \n\nThis game has a *lot* of potenial- and even though it seems to be trying to squander that potential it can't quite snuff out the promise of a good game.  There is a lot of work that needs to be done- bugs to be squashed, performance issues to be hammered into shape, and for the love of God could I please get a female avatar so I can stop playing Trognara the homely crossdresser.\n\nAfter really considering my feelings I have to give this game a \"more positive than negative\" thumbs up.", "timestamp_created": 1471208709, "timestamp_updated": 1471208709, "voted_up": true, "votes_up": 59, "votes_funny": 16, "weighted_vote_score": "0.823272287845611572", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "98117806": {"recommendationid": "98117806", "author": {"steamid": "76561198052167986", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 168, "playtime_last_two_weeks": 0, "playtime_at_review": 168, "last_played": 1466759639}, "language": "english", "review": "There is a 2 step process to work around the game's bugs and flaws.\n\n1. Uninstall game\n2. Buy Valheim", "timestamp_created": 1629758622, "timestamp_updated": 1629758622, "voted_up": true, "votes_up": 301, "votes_funny": 180, "weighted_vote_score": "0.822478711605072021", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1629931255, "developer_response": "Velleim is a great game! It's awesome to see the team take all the great learnings from survival games created over the last 5 years and incorporate them into a solid modern  package.\n\n We do agree that Savage could benefit from some modern tweaks.  :)\n\n-LBS"}, "31736153": {"recommendationid": "31736153", "author": {"steamid": "76561198055898516", "num_games_owned": 377, "num_reviews": 11, "playtime_forever": 5743, "playtime_last_two_weeks": 0, "playtime_at_review": 2485, "last_played": 1637147982}, "language": "english", "review": "The game and concept was really interesting, and was going in a good direction. Now, the last communication from the DEVs is, to  paraphrase : \"We stopped working on this because we are working on something else now. Not sure when/if we will start working on this again.\" \n\nWhen people buy EA games, it's to help supprt the development of a game they think has merit, and they want to see it to the end. When you ( Signal Stuidios) burn those people by taking thier money and abandoning the project, you get added to the list. To be honest, I don't think STEAM should charge more than 5 or 10 bucks for anything EA. The vast majority of it now is barely Beta quality, and it more likely than not, it gets dropped after the Devs get some cash out of the initial interest.", "timestamp_created": 1494721271, "timestamp_updated": 1494721271, "voted_up": false, "votes_up": 66, "votes_funny": 0, "weighted_vote_score": "0.82116234302520752", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "17408611": {"recommendationid": "17408611", "author": {"steamid": "76561198034315837", "num_games_owned": 7785, "num_reviews": 766, "playtime_forever": 152, "playtime_last_two_weeks": 0, "playtime_at_review": 152, "last_played": 1438921971}, "language": "english", "review": "Definitely a work in progress but if they add the persistent server option and keep expanding on the enemies and crafting options (which so far they are doing just that),,... this game is definitely a fun survival and monster fighting experience in the making.", "timestamp_created": 1438829226, "timestamp_updated": 1438829226, "voted_up": true, "votes_up": 58, "votes_funny": 5, "weighted_vote_score": "0.82078021764755249", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "17004813": {"recommendationid": "17004813", "author": {"steamid": "76561197970675079", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 2676, "playtime_last_two_weeks": 0, "playtime_at_review": 1536, "last_played": 1438725460}, "language": "english", "review": "I have been looking for the right survival game for a while now. I tried many and some were solid. Savage Lands is on track to be something special, it has a new update coming this week and is already addictive as hell. I have stayed up late quite a few nights always wanting to craft the next item. All the time having to constantly plan the next meal, keep every item in good shape, manage inventory, stop bleeding, etc. etc. Lose focus for a bit or chase that deer too far and death is the consequence. Oh and there's a resident dragon on the Sundered Isle that will be happy to light the unwary traveler's arse on fire.  It's far from perfect but there's meat on this bone, some more work and they are going to have something special and very commercially viable.", "timestamp_created": 1436681258, "timestamp_updated": 1436681258, "voted_up": true, "votes_up": 96, "votes_funny": 12, "weighted_vote_score": "0.814667105674743652", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "18667707": {"recommendationid": "18667707", "author": {"steamid": "76561198151105358", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 20917, "playtime_last_two_weeks": 0, "playtime_at_review": 9404, "last_played": 1694983001}, "language": "english", "review": "Savage Lands is a really fun open world survival game with a great theme going on.\nI enjoyed every minute I have spent discovering the secrets of the Sundered Isle and trying to map out all of it's glory.\n\nThe developers are quite involved and open to the feedback they receive. I truly feel this game is improving all of the time.\n\nThe community is really great and I have never met such friendly people online as I have on the servers of Savage Lands.\n\nTruly a fun game to splurge for a four pack to get the friends in on.\n\nI have a gripe with the optimization as it seems like the more that you clear and build on the map, it seems like the world becomes much more demanding to load, but I hold out hope this will only improve as development continues.\nI also think it will be much nicer as further incarnations of the dedicated server come out, as right now it is very limited due to several technical constraints.\n\nDefinitely recommending this game...", "timestamp_created": 1445731693, "timestamp_updated": 1445731693, "voted_up": true, "votes_up": 73, "votes_funny": 11, "weighted_vote_score": "0.813667178153991699", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "21465684": {"recommendationid": "21465684", "author": {"steamid": "76561198204669256", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 772, "playtime_last_two_weeks": 0, "playtime_at_review": 670, "last_played": 1469888944}, "language": "english", "review": "If I was giving advice to my past self, I'd want to wait until this game is finished- or at least a sale.\n\nThere's a lot of potential here. On the other hand, there was a lot of potential when I got the game three months ago, and the progress since then has been... disappointing. I've had this in my library beside The Long Dark, Stranded Deep, The Forest, and Who's Your Daddy, and out of them all Savage Lands has changed the least, even though I've only had TLD longer.\n\nIn terms of playability, the features that are present are nice. The mixture of construction, combat, and survival means that you're constantly switching tasks to stay on top of everything. On the other hand, individually, each aspect is very grindy and the balance is too straightforward. \n\nThe starting monsters are ridiculously easy, even with the most basic weapon, and yet until you get advanced weapons the very second tier are almost impossible. The hit boxes for the targets are sometimes awwkard, and the archery system is a joke. On the other hand, there's a decent selection of monsters and the drop rates are very well balanced, so once combat mechanics are refined this aspect should be above par.\n\nBuilding is also above par, with a decent number of structures and an excellent placement system. HOWEVER, having to build an entire smithy just to have a forge feels like overkill and gathering the resources for a new base takes forever. In addition, for noncooperative multiplayer, defensive capabilities could be much improved.\n\nSurvival is very basic. Don't get cold, hungry, or injured and you'll be good to go. Some sort of meat vs. plant nutritional balance or a more in-depth breakdown of clothing's effect on the cold stat would tremendously improve this option.\n\nThe UI is... interesting. It's toeing the line between retro and just plain dated, but it isn't difficult to understand, though without information on weather or stamina its use is limited. In addition, colored boxes with the health conditions spelled out and visible percentages seem to be conflicting with the minimalist feel.\n\nOn the whole, I look forward to changing my recommendation when the game improves. Hopefully the pace will pick up and that day won't be years away.", "timestamp_created": 1456449634, "timestamp_updated": 1456449634, "voted_up": false, "votes_up": 96, "votes_funny": 5, "weighted_vote_score": "0.81159663200378418", "comment_count": 63, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "17610767": {"recommendationid": "17610767", "author": {"steamid": "76561198241847162", "num_games_owned": 0, "num_reviews": 51, "playtime_forever": 2771, "playtime_last_two_weeks": 0, "playtime_at_review": 2500, "last_played": 1552630468}, "language": "english", "review": "EDIT:3/13/19 edit\nMuch improved. A very solid game.\nBeen awhile since I had been playing it and am very impressed at the visual and gameplay improvements, UI, etc. (Life has had me busy for awhile...) A big recommend from me. It has lived up to MY expectations.\nHas more of everything now.\nRuns flawless at highest settings !!!\n\n>ORIGINAL REVIEW<\n\nI love this game. You really have to work hard to stay alive. I only wish the hunger meter was slower. You get hungry way to fast.\nThings I would like to see added:\n1) More deer.\n2) More things to build, like walls, pits, shelves etc.\n3) crouch\n4) spears to use in hand or throw\n5) beds for resting\n6) blankets ( lol. why it so cold all the time? )\n7) more biomes. not just snow.\n8) Also, when you build a home, away to designate a marker so you can find it by looking for floaty symbol. Currently been lost 2 days trying to find my home.\n9) Better collision and clipping (deer aint supposed to walk thru boulders, is this Rust? lol)\n10) just more, more, more...I love this game\n\nLove the AI of enemies. Really cool enemies I might say. The Forest Giants scared the sh!t outta me when I 1st encountered it. All still, motionless. Thought it was some kinda statue build, then it got up. That Fu##er can move fast.\n\nThe dragons are beautiful and can breathe fire really far. Nice. The fire FX are really nice to.\n\nAll in all, I think this game is amazing as is but I am greedy and want more of it.\n\nI give this game a 9.9/10 (no game is perfect, regardless of what some 'game reviewers' say. Thank you.", "timestamp_created": 1439968761, "timestamp_updated": 1552485746, "voted_up": true, "votes_up": 129, "votes_funny": 23, "weighted_vote_score": "0.811555385589599609", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1552709918, "developer_response": "Glad to hear you are liking the changes. Feedback is very important us, we thank you for the support.  =)\n\nStay Savage!\n\n-Euryidium"}, "20534451": {"recommendationid": "20534451", "author": {"steamid": "76561198024819041", "num_games_owned": 0, "num_reviews": 34, "playtime_forever": 31577, "playtime_last_two_weeks": 0, "playtime_at_review": 11667, "last_played": 1546821250}, "language": "english", "review": "OK, I love this game and my first few weeks of owning it I could not play anything else. It has its own unique storyline and lore, The AI can be very challenging at first but you learn how to fight each type of mob you face as you progress to tougher mobs further inland on the island. You are shipwrecked on an old ancient island filled with ghost towns (not ghost) undead, mystical creatures and even Dragons. You hunt for food, deer, goats bear etc. and besides meat you need to farm skins and other things used for crafting. \n\nCrafting is fairly detailed, You can make better weapons and clothing, prepare food and even build structures to get you through the cold winter nights. Crafting is a key feature to this game and to get some of the better wapons and armor to craft you need rare ingredients from tougher AI to craft certain things. The game does a good job at building up to be able to kill the more tougher AI and so on.  As you build better armor and weapons you can fight tougher mobs and get better and more rare ingredients so you can build even better things to fight even tougher mobs and so on and so on. The balance in this respect is very good indeed.\n\nThe game is going through a change right now, and it is for the better. The game is in the middle of an engine upgrade that touts a brand new map and a much better layout that improves the progression from being a noob to a full outfitted badass ready to slay some dragons.  The new map is a beta op-in and as a new player you will get the relativly bug free old map to start with until the conversion is complete. The devs have gone out of their way to ensure old toons can be carried over to the new map if this is something you want. (and I did) The old map is fairly bug free and very enjoyable the new opt in beta map, although MUCH better still hosts a lot of bugs and this is why it is opt in only. It is meant for veteran players who know the game and can give good bug reports.\n\nNow this review would be incomplete without makeing a point that I have never had the privledge to make in any other steam game. This game BY FAR has the best Devs around. They are here everyday. helping, answering, listening to feed back. If you ask a question you will often get more then one dev answering to it. They will go out of their way to listen to you, help you and listen to your feedback both good and bad. I want to give you two examples off the top of my head.\n\n1st, Someone had a bug that made him loose all his gear, Put it in the bug section. and was probably ok with laving it at that. Not for the Devs, They started an MP server gave him the info and replaced EVERYTHING he lost.\n\n2nd, My family went away for xmas and I was home alone and decided to get into the firewater and light myself up while I played some savage lands. I ran into a prob or question (do not remember which) at 2 am Xmas eve. and guess what, there was a dev there to help me out within 10 minutes. They should have been sleeeping or with family and friends for Xmas but they CARE so much about this game that even on Xmas eve they were there to support their customers.\n\nI can not tell you enough about the commitment to this game these devs have, it shows in the forums and in the love they have for this game itself.  If there was a reward for the best Devs in steam forums these guys would win hands down. We all know how toxic steam forums can get when customers are not happy and they are not getting answers and the devs are know where to be found. I have yet to find a toxic or even negative post in the forums for this game and it all starts from the top down. The game itself is great but the commitment and openess of these devs makes the atmoshpere around here second to none. \n\nUpdates are very frequent. Every 5-10 days or so. The old map is no longer being updated and it is all on the new map. Of course this makes sence as the old map will be gone once the final switch to the new engine and map are complete. It is fair to say that if you are new and get the old map you are still getting a very complete game even for it being an early access title.  Starting on the old map is still a great play and in no means a lessor experience do to the fact it is no longer being supported. Of course there is nothing stopping you from opting in and starting off on the new map but I would not reccomend it yet. The old map is solid and complete and is a great way to learn the game in a relativley bug free enviroment. \n\nThe game has great replayability and I expect great things from it for no other reason then how much the devs love this game. These guys are building a game for the love of seeing a game they made and to make it great, not for money or any of the other things some dev teams do to get their name out there or whatever. \n\nIt is a SP and MP survival game that has been a great add to my collection of survival games I love. It has been a good 2 years for EA survival games for me with other titles like, The Forest, The Long Dark 7D2D and of course Savage Lands and just like the others I am happy to own this title in my collection. It is unique in its own way and well worth the price for an EA title and would be worth full retail of a finished game, if you get it on sale (like I did) it is a downright steal. If you enjoy survival games then I reccomend it, If you like supporting small EA dev teams then this is by far the most worthy team I have ever seen. \n\nMost of the EA titles I own I do not worry about, they will see the light of day and full release. But this one, I have never even considered anything otherwise. This dev team loves this game so much they would finish it in a coffee shop stealing free wi-fi whilst living on the street and panhandling for food money in order to see this game finished.\n\nGame 8.5-10\nDevs 11-10\n", "timestamp_created": 1452833354, "timestamp_updated": 1452833354, "voted_up": true, "votes_up": 44, "votes_funny": 6, "weighted_vote_score": "0.808156192302703857", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "96523944": {"recommendationid": "96523944", "author": {"steamid": "76561198055822133", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 3568, "playtime_last_two_weeks": 0, "playtime_at_review": 3568, "last_played": 1627248767}, "language": "english", "review": "Yes, let's get the unpleasantries out of the way first:\nThe game was abandoned by original devs, it's stuck as an early access for about 6 years now. It lacks in many aspects: Graphics are dated, enemies have poor AI, slow attack animations, and only 1-2 sounds that they make. Also there are only few models of them, many are just re-textured models (like apparitions looking and behaving like the stock skeletons, just glowing and half-transparent). Game have almost no soundtrack. There are some ambient tracks that play in specific areas (like in close proximity to dragon towers) but for most of the time you'll be hearing only wind and your character footsteps (and panting if you sprint a lot). Besides craftig stations, fireplace, torch stand and stick fence, there is no point in building anything. There are several types of walls, but all of them stops the enemies equally good (enemies don't attack buildings, only player) so a stick fence can keep a massive direwolf out of your base as good as stone wall. Houses only provide warmth, and that can be achieved as well as with fireplace. You can't sleep in this game to advance time and say, skip nights. I can go on for quite a while...\n\nSo why recommended?\nBecause now game is owned by another dev team, who actually care about it. The game is crap to the most of the players, it generates probably no revenue, yet Last Bastion Studio has been patching it with determination for quite some time. And every now and then, when I check if anything changed.. it does. Small steps, yeah, but it does. The terrain and enemies extures look way better then back in 2016. They added new, and expanded the existing dungeons, patched loads upon loads of bugs, the ambient music that plays near towers that I mentioned before? Also their work! So if you see this game on sale or part of a bundle somewhere, try it - Maybe you'll find it relaxing strolling around the snowy island, maybe it will be fun for you for few hours to explore dungeons and whack stiffly moving skeletons. Plus you can crank up your global achievement score a little, because there is only few of 'em here (most of them are pretty easy)\n\nOverall I believe in the current devs - that they will make something out of this mess.", "timestamp_created": 1627487456, "timestamp_updated": 1627487456, "voted_up": true, "votes_up": 68, "votes_funny": 3, "weighted_vote_score": "0.807597696781158447", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "122923249": {"recommendationid": "122923249", "author": {"steamid": "76561197972676567", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 186, "playtime_last_two_weeks": 0, "playtime_at_review": 141, "last_played": 1674869789}, "language": "english", "review": "    Reinstalled this years later and played the most current version, I can safely say its no longer a buggy atrocious mess. Everything feels a bit more refined then when it was under the previous owners. Why on earth a new studio would take it upon themselves to try and resurrect this title is beyond me but I've seen redemption stories in the past, so its not unheard of. Unfortunately unless this game receives a complete overhaul in visuals and combat, I don't see this game ever crawling its way out of such a horrid past. Is it worth two dollars on sale?, sure, but don't expect anything beyond what was already created initially. Compared to survival games that have been around for years as well as new ones in development, this one feels like its been lost to time. Dated and dull by today's standards.", "timestamp_created": 1664297561, "timestamp_updated": 1664297561, "voted_up": false, "votes_up": 75, "votes_funny": 2, "weighted_vote_score": "0.807342529296875", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1664328767, "developer_response": "We greatly appreciate the post and feedback. We agree that it is awesome seeing the survival genre continue to expand with many great games. While Savage might not be the newest arrival, LBS is thrilled Savage was one of the early games in the genre to help pave the way.\n\nThanks!"}, "62516086": {"recommendationid": "62516086", "author": {"steamid": "76561198248599584", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 80757, "playtime_last_two_weeks": 0, "playtime_at_review": 54053, "last_played": 1672850884}, "language": "english", "review": "We all seem to have lost hope in the past but New\ndevelopers have revived the game again! They are doing a good job for now, keep going and never Stop!\nFor all of US who have Waited so long, make a Good game!\n\nNew updates are coming and I Hope the game goes in the direction Fans are Hoping for ! so Developers listen to the fans to the Maximum and there won't be much trouble ! I can't wait to see what the future holds for this game...\n\nWhen the developers finish the game I hope it will be interesting, innovative and fun and will attract a lot of new players !", "timestamp_created": 1580136091, "timestamp_updated": 1638114915, "voted_up": true, "votes_up": 56, "votes_funny": 3, "weighted_vote_score": "0.806319117546081543", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1582733185, "developer_response": "Thanks for the support and 900+ hours played!  Your feedback has been awesome in helping to shape the game. Our door is always open.  =)\n\nHave fun and Stay Savage!\n\n-Euryidium"}, "14825974": {"recommendationid": "14825974", "author": {"steamid": "76561198021907071", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 20, "playtime_last_two_weeks": 0, "playtime_at_review": 20, "last_played": 1426013838}, "language": "english", "review": "PLEASE READ THIS BEFORE EVEN CONSIDERING BUYING THIS GAME!!!! So basically this is a warning about the game developer digital DNA game, DigitalDNA LLC, or whatever they like to call themselves on different games/projects. (By the way, I will not waste a lot of time doing this review so don't expect it to be long). But I am here to say that these guys are full of shit (you could use the word \"scammers\" if you prefer that word). If you take a look their website, you will find all of their games. Here is the link: https://www.digitaldnagames.com/ they seem to have a lot of games, one of them is called \"Castleminers Z\". And you can find a lot of negative reviews/comments about this game in steam, some is about how they just abandonded their game and stopped developing it. And the biggest thing is that; they are using different names for their company on steam! So let's say you would want to take a look at what games does this \"digital dna games\" have on steam. The result will show that they have nothing at all... And there is where the scam lies. Doing that will show you nothing, and by searching that that name on steam will not tell you, that they have developed some shitty unfinished Early Access games. So my point is, you should take a look at these things before even considering buying this game. If you still want to buy this game after all what I've mentioned then it is up to you. And if you decide to get it, then I wish you luck and I hope you'll have fun time playing it. But I must say, I do not recommend you to buy this game, unless you really enjoy playing unfinished games what will never be made complete properly. That's all I have to say, cheers!", "timestamp_created": 1426014652, "timestamp_updated": 1479220381, "voted_up": false, "votes_up": 1975, "votes_funny": 126, "weighted_vote_score": "0.806036651134490967", "comment_count": 155, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1426431135, "developer_response": "Savage Lands is a collaborative partnership between Signal Studios and DigitalDNA Games. As a team we have nothing but intent to finish the game and are actively involved in the community. \n\nWe greatly value feedback from our fans and as a commitment to our supporters we have created a Game Update plan that allows us to deliver bug fixes, new content and community requests to the fans weekly. Feel free to check out the links below for info on updates just released and what is currently in the works:\n\nGame Update #1: http://steamcommunity.com/games/307880/announcements/detail/129815567536514009\n\nGame Update #2: http://steamcommunity.com/app/307880/discussions/1/617330406647500604/\n\nGame Update #3 (Preview) - http://steamcommunity.com/app/307880/discussions/1/617330406649913935/#p4\n\nIf you have any questions please seek me out on the forums or check out our weekly live streams. I’ll be more than happy to provide answers and ease your concerns.\n\nThank you! =)"}, "38037164": {"recommendationid": "38037164", "author": {"steamid": "76561197982828130", "num_games_owned": 369, "num_reviews": 22, "playtime_forever": 3127, "playtime_last_two_weeks": 0, "playtime_at_review": 3127, "last_played": 1512792714}, "language": "english", "review": "Bought this game when it first popped up on early access and, while it did not have much content, was a fun game to play given all the promises of additional features that were promised to be added. Well, over 2 years later, the game has had one substanative patch and the devs have essentially gone dark for the past 18 months. Sadly, the devs have moved onto other games and left this utterly abandoned. Sad as this game had great potential and I really liked the feel of the game, hence my many hours. Unfortunately I cannot recommend anyone throw money at this given the unfinished state that this game will forever remain.", "timestamp_created": 1512318060, "timestamp_updated": 1512318060, "voted_up": false, "votes_up": 75, "votes_funny": 1, "weighted_vote_score": "0.802751243114471436", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "15989408": {"recommendationid": "15989408", "author": {"steamid": "76561197973003787", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 786, "playtime_last_two_weeks": 0, "playtime_at_review": 701, "last_played": 1473535442}, "language": "english", "review": "I went ahead and bought a 4 pack for me and the minions. After playing it for 2 days, I am ready to recommend it as an ongoing project. I am happy to support the devs with my purchase, but do not suggest this is a 'complete' game experience. It is a solid foundation to be built on and should be pursued.\n\nSavage Lands.\n\nIt's a survival fantasy world. You are on a Skyrim looking island with just the clothes on your back and must survive the elements, starvation and the various baddies. \n\nThe content is not as heavy as I'd hoped. At this stage of the game, they have put more energy into weapon and armor crafting than most anything else, leaving some holes in the overall game experience that should be filled as soon as possible. SL is dying for a dynamic questing or dungeon system... with about 3 times the monster mobs. It definitely needs more stuff. MOre active POI destinations .But... it is an early access game and the devs appear to be very responsive.\n\nHere is my first game experience before restarting with a hosted game for me and my son.\n\nGame starts with my on the shores. Cheap clothes, a tiny sack of starter food and a few little sundries lying on the beach. There is a checklist of things to do to get started, including gathering and building the first camp fire and leanto.\n\nStone axe to chop trees(which fall nicely). Must craft a stone hammer to mine rocks for stone, flint, ore, coal, etc...(this needs to be developed into caves and proper mining). Cotton for cloth to make bandages(wolves cause bleeds).\n\nIt is dangerous and cold our there. You NEED a campfire and a home. Night time is frigid... and a blizzard at night will kill you in minutes with just the starter clothes. \n\nThere are pre-mades. They are god. I found a couple of small ones to move into... and created another one to make a settlement. I started working on a blacksmith house to get the critical forge.\n\nI figured I had a handle on it enough to get my son going, so I abandoned that game to host one for the family.\n\nIt went very well, and my son and I had a great time. We found another settlement to claim and started work, but I didn't get the items to make a hammer... and ran out of flint. I froze to death on night number 2. Because we had not finished the respawn totem, I had to run naked and unarmed in the dawn's early light.\n\nAnd I cam across an abandoned village with 5 buildings... including a working forge!!!\n\nIt was an exciting surprise and we moved right away to the new homestead. Unfortunately, these structures are not procedurally generated, so there really is no reason to build one once you know where they are. This takes away the need for the intriguing structure crafting system. It literally invalidates it. They only think I HAVE to build...is the respawn point. AN entire path of advancement... POOF!!!\n\nMy hope is that the devs nerf their usefulness... perhaps by halving the heat protection and requiring constant repair to eat resources and time, making a player structure desirable. My preference would be to also have viking like mobs that already live there that need to be conquered.\n\nStill... there is a good game here with much potential... and the impression I get is that the devs WANT that potential and are very active with the community of players to get guidance on what the priorities should be.\n\nIn the meantime, my kids and I enjoy the coop experience.", "timestamp_created": 1432502206, "timestamp_updated": 1432502206, "voted_up": true, "votes_up": 59, "votes_funny": 2, "weighted_vote_score": "0.801155030727386475", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "20734878": {"recommendationid": "20734878", "author": {"steamid": "76561198023662032", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 5369, "playtime_last_two_weeks": 0, "playtime_at_review": 2778, "last_played": 1630238366}, "language": "english", "review": "Normally I wouldn't write full in-depth review for an early access game. It would be kind of unfair to do so considering the full experience of the game has yet to come. However there are things I would like to talk about and address to both new players and the developers.\n\nThe best way to describe Savage Lands, it's like a combination between The Forest and Elder Scrolls.\n\nKeeping in mind that this game is early access, it does have its problems. Unlike the typical early access game where you usually experience connection issues, lag, glitches, etc. this game is actually pretty well built without these issues. Loads times are actually pretty phenomenal and there are little issue involving bugs/ glitches, at least from what I have experienced. A couple de-syncs every so often, however that is most likely becuase we had three players connected to a private hosted server via the same local connection. The main issue with the game is the lack in overall content however that is to be expected. \n\nIn the feature list under the game description, there are two 'features' I would like to address.\nRobust Item Crafting and Intuitive Build System.\n\nBefore I delve into the issues with these features, I would like to state that I am fully aware and understand that Signal Studios has not released all the content yet, hence 'early access', however at this time, the descriptions of these features are not accurate. Mind you, these are listed as \"Early Release Features\", which means that they were intentionally listed as features being currently in the game. I disagree.\n\nRobust Item Crafting\nCrafting works and it's not bad, however in the description for this feature it states \"Limitless Options\". There is a lot of potential with the crafting, so I have no doubt that the developers are going to be progressing the possibilities making this description more accurate, currently however, it's just to far from limitless for this description to be accurate. There are only a handful of craftable weapons/ tools and armor, and a good portion of them require harder to get and rarer materials. \n\nIntuitive Building System\nIf you have ever played The Forest, the building system is exactly the same. Its simple, but there isn't really much you can build other than a few structures. I would really like to see more structures added as well as customization, decoration, and more function added for the structures as well. As of right now, other than getting a couple of achievements  it's really not worth the time and effort to build anything. Find a pre-existing city on the map and make base, it will have everything you need already minus strong boxes.\n\n\nAs for the rest of the listed current features, the descriptions are fairly accurate. The world is anything but forgiving and you never know when an enemy is going to charge at you out of nowhere unless you are in an open area and even then, if you aren't paying attention to your surroundings, you will find trouble pretty quick, or rather trouble will find you. The AI system is spot on and the combat is indeed brutal and can get pretty intense. Perhaps a little too intense. One minute you are chasing a deer, then suddenly you are fighting a Dire Wolf that popped out from the bushes. Next minute you are fighting a whole pack of them. But hey, what fun would the game be if the combat were too easy? The game certainly teaches you to stay aware of your surroundings. The game is more fun in multiplayer, albeit if you want more of a challenge, play solo. \n\n\nOverall, the game is very fun and addicting. I would even go as far to say it is the best early access game I have played to date, even with its limited content. With that said, there is still plenty to do while the developers are working hard to bring us more content. I actually would not mind collaborating with the developers and sharing ideas for future content, as this game has some great potential to be one of the best open world survival games to date and I would love to see this game succeed. So if any developers are reading this, feel free to add and/or message me. I would gladly share some ideas and options. Nonetheless, keep up the great work.", "timestamp_created": 1453670165, "timestamp_updated": 1453670603, "voted_up": true, "votes_up": 43, "votes_funny": 1, "weighted_vote_score": "0.798441529273986816", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "16517248": {"recommendationid": "16517248", "author": {"steamid": "76561198038422432", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1011, "playtime_last_two_weeks": 0, "playtime_at_review": 789, "last_played": 1465451967}, "language": "english", "review": "Rating: 10/10 (For an early access game)\n\n[h1] Pros: [/h1]\n-A sizeable island to explore including abandoned towns, small camps, large ominus towers, etc.\n-Enough weapon/armor sets to have a sense of progression (Currently 7 armor sets and 20+ tools/weapons along with uniques)\n-Enough mobs for diversity (Also, with uniques)\n-Constantly evolving lore\n-Nice looking textures and models for everything\n[b]-One of the most active and \"in-touch\" developers (They have a timer for the next update on the title screen and wonderful livestreams) [/b]\n-Developers look at suggestions from players\n-Ability to construct buildings\n-Host/join games and play with up to 8 other people\n\n[h1] Cons: [/h1]\n-Issues you see in any other early access game (AI Issues, occasional lagging, lack of many features)\n-Servers disappear when full/ no dedicated servers(yet)\n-Quick progression (I have end-game equipment after roughly 13 hours of play)\n\nIn, short this is a great survival game that has a nice balance of brutality and playability but it isn't for those who want to go strait into the action. It stands out compared to other games like it with it's backstory/lore and most of all its developers. I'm looking forward to seeing the future updates with new content.", "timestamp_created": 1434695977, "timestamp_updated": 1434762038, "voted_up": true, "votes_up": 37, "votes_funny": 1, "weighted_vote_score": "0.797421693801879883", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "24385828": {"recommendationid": "24385828", "author": {"steamid": "76561198061954870", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 964, "playtime_last_two_weeks": 0, "playtime_at_review": 964, "last_played": 1471140420}, "language": "english", "review": "Updated!  I really wish there was a neutral recommendation.\n\nThe TL;DR:  I still can't really suggest buying at the moment, but they're moving in the right direction on some things.  Check up on it in 6mo to a year and see how it's coming or just wait for it to come out of EA.  I love the concept, the setting isn't bad (decently made, just not my preference), I think it will eventually be worth buying, just not yet.  \n\nAlright, so life relented long enough to spend a little more time in-game and check out the last few weeks of updates.  Here's the report:\n\nFirst off, the dragon.  Because who liked \"flaming death from above every 3min\" as a tutorial?  I'm happy to report that he is no longer a spawn-camping douchebag.  I'm actually not sure how to get his attention now since he ignored me on the first and second island both.  Tsunderagon?  Thankfully, this means players have to chance to get established and figure out what they're doing.\n\nThey've added some new books laying around that discuss weapon and armor factors, though the books are somewhat widely scattered and don't address some of the missing information about weapons (range and speed, most notably).  There are also a number of new loot items laying around near the starting area.  An extra axe, some basic armor, and more flint help get things rolling; a compass and fur armor (which both require metals from the second island to make); and a tin battle axe rounds out the lot.  Some of them are in odd locations, so I probably missed others.  All together, this helps ease new players in (honestly, the Fur armor might be a bit much, but I can't complain), though it is still a good idea to start a character in a completely new world to pick things up before joining a friend's world for coop since the loot takes quite a while to respawn.\n\nThere's still a lot of other issues to note, though.  Gathering anything mineral-related is still quite tedious.  Maybe some people like it, but it strikes me as time padding.  12 hits with a tin hammer (the best you can get early) to get a 1 piece of copper ore (of which you need a dozen or so along with more tin and coal to make something useful).  It adds up very quickly into lots of time standing around hitting rocks.  Put another way, some people have found it worthwhile to devise farming runs for the nodes to reduce time spent gathering minerals.  It just doesn't feel right here.\n\nThe crafting menu is still very annoying to use, especially when you aren't completely sure what something in the miscellaneous section is named (great example is when you go looking for nails because you see they are needed to repair a building, but they are actually named \"Bag of Nails\" in the rather long, alphabetized list).  Not being able to scroll a list when the mouse is over an item is frustrating, likewise the same issue when you have an item picked up in the poor inventory system.  Speaking of the inventory, I hate it.  I get what the intent is, but the implementation is very clumsy and makes finding anything an unnecessary chore.  Buildings/crafting stations are still all together in a 4-per-page list that would really be better served by a section in the crafting menu, though perhaps there is an issue with the coding (since they go to outline-placement mode instead of producing an item) preventing this.\n\nSome bugs/design issues:  It looks like they're in the middle of some terrain changes on the islands.  Especially on the second island, there are a lot of rocks and other objects floating a few feet off the ground in many places.\n\nWith regards to the warmth mechanics, it still feels odd to me that it not only reduces your max health but also your actual health.  I get that it's supposed to be another layer of the survival gameplay, but it's really annoying to need to bandage myself just because I went outside for a few minutes before coming back to warm up.\n\nCombat is... dull, I suppose is the correct work.  Yeah, your life is on the line with vicious monsters, but you just trudge around swinging mechanically.  There's no real intensity to it.  \"Strafe around it in a circle while swinging\" seems to be almost a one-size-fits-all tactic, and survival is more about whether you've farmed materials long enough to make the best available equipment than learning the enemies and playing well.\n\nOverall, it seems like there is a desire to avoid out-of-character tutorial information, but I'm not sure whether that is appropriate to a game demanding you make survival choices.  If the character has the know-how to make a leanto, it seems reasonable to inform players of how to do so within the system.  Likewise with the fact that some mineral resources are found in discrete nodes while others are randomly generated by bashing any rock.  If they want to keep it completely in-world, a few more books in the starter area mentioning the basics would be great for new players.\n\nThere needs to be a decision on which direction to focus on for the moment:  Either improve the crafting side of things with better interface and more options (particularly with regards to structures) or emphasize the exploration and combat side with improved enemies (at the moment they seem mechanical, have 1 or 2 attacks that frequently have janky hit ranges, and depend mostly on huge health pools and damage compared to the player).  Right now it feels like the game is trying to do too many things at once, but I think some focused attention in each area one at a time will really help.  My personal preference would be the combat system since the game doesn't really fit the builder/crafter mold.\n\nI still think this will eventually be a great game.  While I'm about to have even less time available, I'll try to check in every month or two and see what's changed as long as the devs keep pushing steady updates.", "timestamp_created": 1468828383, "timestamp_updated": 1471141221, "voted_up": false, "votes_up": 223, "votes_funny": 48, "weighted_vote_score": "0.792642951011657715", "comment_count": 25, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "22850334": {"recommendationid": "22850334", "author": {"steamid": "76561197966391335", "num_games_owned": 914, "num_reviews": 48, "playtime_forever": 812, "playtime_last_two_weeks": 0, "playtime_at_review": 812, "last_played": 1462650193}, "language": "english", "review": "The game was interesting over a year ago, not so much anymore.\nThere's been very little progress and the games systems have not improved at all, in fact some of them have become worse.\nThere's now very little hope for this game as it does nothing new or nothing better than the other much more polished survival games out there, most which too are still in early access.\nI'm sure it will be completed at some point in some years, but I very much doubt the result will be satisfactory.", "timestamp_created": 1462650544, "timestamp_updated": 1462650544, "voted_up": false, "votes_up": 136, "votes_funny": 11, "weighted_vote_score": "0.791776597499847412", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "23658257": {"recommendationid": "23658257", "author": {"steamid": "76561197988441268", "num_games_owned": 0, "num_reviews": 24, "playtime_forever": 5326, "playtime_last_two_weeks": 0, "playtime_at_review": 4849, "last_played": 1529636341}, "language": "english", "review": "If you tracked your gameplay, you'd find maybe ... 70 - 80% of your time in the game is spent watching your hammer hit rocks for mining ore, or your axe hitting trees. The rest of the time is spent scrabbling for food, hiding from things, and running from things. And trying not to freeze. Not freezing is a theme in this game.\n\nAfter hours of that, you've hit enough rocks to get enough things to make a better hammer, so you can hit fewer rocks. This takes the pressure off a bit, and not long later you'll have a leather vest, a tin hat, a tin axe, a backpack full of food and bandages, and you'll be ready to cross the ice to the next island. Where you will be one-hit. Tin hats aren't very good.\n\nThis should be really boring. It sounds really boring. But after lots of rock-hitting and pig stabbing, you build a shack and step inside. You feel funny. It's quiet. There's no wind. You're not scanning the area for things that one-hit you, or edible meat creatures. You're not eyeing your freezeometer. You feel safe. That's when you see you've been tense since you fired up the game. Something's always coming to kill you, if only hunger and cold, and if you're not paying attention, they'll get you. You've been a hunted animal. But now you have shelter, and some stuff, and you can think about turning the tables. Carefully.\n\nIn short, it's got the things I look for in a good survival game.\n\nIt's not perfect. It feels like it hasn't really gelled into a coherent game yet, but what it does so far ( survival ) it does well.\n\np.s. When you are just starting out, you'll usually encounter a giant boar and maybe a wolf or two. You will die if you wail on them with your stick. Don't panic. You have more time than you think. That giant boar will run towards you and stop. Then it will do some yoga, which apparently is what pigs do when they want to kill you. Then it will leap at where you were standing when they started their attack yoga dance. Just step to one side ... and wale on them with your stick. And repeat. Then you eat them.", "timestamp_created": 1466367700, "timestamp_updated": 1466372335, "voted_up": true, "votes_up": 58, "votes_funny": 46, "weighted_vote_score": "0.791723728179931641", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "32663266": {"recommendationid": "32663266", "author": {"steamid": "76561198030871859", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 4904, "playtime_last_two_weeks": 0, "playtime_at_review": 4131, "last_played": 1583289723}, "language": "english", "review": "If you are looking for a finished product...Do not buy, game will not likely be finished.\n\n\nUnfortunately that is the reality.  I really enjoyed exploring the islands and finding different dangerous encounters.  The devs were updating on a regular basis and often laid out the future  plans for players.  Was really looking forward to playing the finished game as every update seemed to add to the emersion level.\n\nIf games are abandoned, players should be refunded.  Unless future early access notes that we are investors, then we should recieve % of sales after we invest, otherwise as consumers we were promised a product that was never delivered.", "timestamp_created": 1498189359, "timestamp_updated": 1499960078, "voted_up": false, "votes_up": 100, "votes_funny": 4, "weighted_vote_score": "0.78934931755065918", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "30908253": {"recommendationid": "30908253", "author": {"steamid": "76561198061827859", "num_games_owned": 384, "num_reviews": 8, "playtime_forever": 4395, "playtime_last_two_weeks": 0, "playtime_at_review": 3588, "last_played": 1664130761}, "language": "english", "review": "Will not be buying Early Access Games from steam anymore, too many games become abandonware and steam does not support its customers on this, they even leave the game up to get more of your money. Developers took down the website for Savage Lands and no word in several months, going to assume this one is yet another get your money and run game.", "timestamp_created": 1491159677, "timestamp_updated": 1491159677, "voted_up": false, "votes_up": 56, "votes_funny": 0, "weighted_vote_score": "0.787652790546417236", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "23314857": {"recommendationid": "23314857", "author": {"steamid": "76561198010247967", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 4846, "playtime_last_two_weeks": 0, "playtime_at_review": 1280, "last_played": 1545708482}, "language": "english", "review": "This game has been on my wishlist for a loooong time. I finally bought it a few days ago, despite all the recent negative reviews about it on steam. So far, I'm not dissapointed that I bought it, but yes it does have negatives which should be mentioned.\n\nPros and what [b]I[/b] really like about it: \n+[b]Sounds[/b]: The creepy factor is really well executed. You'll [b] never[/b] feel safe when exploring or gathering resources. \n+[b]Atmosphere[/b]: Snowstorms are surprisingly \"nothing-you-can-do-about-it\" but sit and wait for it to pass. Also the night is definitely a hindrance to exploring, and brings a risk vs reward factor.\n+[b]Creatures[/b]: I can't emphasize enough how this game will wash away any past RPG experience where you play as warrior and just run into the battle no matter what. Let me tell you my experience so far. A couple of times in the beginning I was running for my life from 4 wolves, and if I didn't have like 10 bandages which I thankfully prepared I would've died for sure. Even 1 wolf can do massive damage if you don't dodge properly. Today, I finally made it to the second island, only to get my first taste of death at the sword of a undead warrior skeleton. His blade effortlessly sliced through my tin armor in just 1 hit and I was dead. \n+[b]Crafting/Building[/b]: I like the interface, and how you can place anything even if you don't have materials for it. It's the first game I played where the buildings are premade, but surprisingly I don't mind. Before I bought this game I thought it would be a minus because I'm used to building my own structures (like in ROK)\n+[b]HUD[/b]: The health depends on cold, and stamina depends on hunger. I think it's tough, but enjoyable, especially when you are lost after being chased and then you realise you don't have any logs to make fire :)  \n\nCons which I'm sure will be fixed or improved:\n-[b]Lack of bow and arrow variety[/b]: At the moment there only seems to be 1 type of arrow and bow in this game, which is what you can make in the beginning. \n-[b]Glitches[/b]: Animals walking through rocks or going underground is a bit of an issue on the second island.\n-[b]Lag/Performance[/b]: I lowered everything to low, turned off most things but anyway I get temporary freezes, low FPS. \n\nOverall, I give this game 8/10. This game would be excellent, but performance issues right now is why I can't give it higher rating.", "timestamp_created": 1464724145, "timestamp_updated": 1464724145, "voted_up": true, "votes_up": 50, "votes_funny": 1, "weighted_vote_score": "0.78232872486114502", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "38681921": {"recommendationid": "38681921", "author": {"steamid": "76561198078226308", "num_games_owned": 228, "num_reviews": 24, "playtime_forever": 1344, "playtime_last_two_weeks": 0, "playtime_at_review": 923, "last_played": 1566843436}, "language": "english", "review": "abandoned, don't waste your time/money", "timestamp_created": 1514258372, "timestamp_updated": 1514258372, "voted_up": false, "votes_up": 61, "votes_funny": 0, "weighted_vote_score": "0.782006263732910156", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "34893071": {"recommendationid": "34893071", "author": {"steamid": "76561198056676772", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 322, "playtime_last_two_weeks": 0, "playtime_at_review": 249, "last_played": 1431998316}, "language": "english", "review": "A development team can't take peoples money to finish a game and then change their priorities without delivering really anything. They need to own up to critisism and not use the cop out that people are being harsh or \"savage\" to excuse them dropping the ball. I'd change my review if the company decides to do the right thing and prioritize making their paying customers and supporters happy instead of taking a holier-than-thou stance and doing what ever they think can make them the quickest buck. Fun concept, terrible lack of commitment.", "timestamp_created": 1505178679, "timestamp_updated": 1505178679, "voted_up": false, "votes_up": 57, "votes_funny": 0, "weighted_vote_score": "0.777107834815979004", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "61393970": {"recommendationid": "61393970", "author": {"steamid": "76561197977325659", "num_games_owned": 0, "num_reviews": 29, "playtime_forever": 188, "playtime_last_two_weeks": 0, "playtime_at_review": 188, "last_played": 1578276670}, "language": "english", "review": "Just dull and unrewarding. I've heard it's good multiplayer, but as a single survivor, just dull.\n\n(Below: feedback at dev's request)\n\nHey LBS. Well, you wanted feedback, here ya go.\n\nHonestly I wrote the above not to be an ass, but because I've tried to like SL - I know I haven't played a long time but, if a game doesn't hook me inside 3 hours, I don't necessarily want to grind longer to get to the 'good bit'. I play a LOT of survival/crafting titles and I've put in my hours, so there are very, very basic areas I think need improvement:\n\n- Resource gathering is unintuitive. While the tutorial tasks help, a little, beyond the initial tasks you're left with several destroyed structures and no indication as to how to fix them. The idea of 'adding resources' isn't normal; I did appreciate it once I 'got' it, but it's not obvious. It might be better to frame it through a 'repair' mechanic.\n\n- The grind - especially for a tutorial island - is extreme. For example it's not obvious that you get stones from rocks. I know that sounds stupid, but for example the rocks that generate coal highlight when you look at them; the others don't. So it was only out of desperation that I started hitting rocks, and when I did, had to hit them so many times (five or more?) to get stone that I started to think it was a bug. Upgrading from flint to stone didn't seriously lessen the time. I'd suggest either visual feedback that it's 'working' or some sort of UI element to show progress, otherwise it feels pointless and random.\n\n- Stone in general needs work; it should be made clear that you can make stone blocks (Somehow) by combining clay and stone, as blocks are needed to renovate the two houses you sit by.\n\n- Why sticks AND logs and planks? What purpose do sticks even serve? Why do you get 'frost berries' or something similar from trees, that serve little purpose? In general you end up with lots of random 'stuff' in your inventory early on that seems to do nothing except take up space.\n\n- All of your UI needs a pass. For example when I interact with something - why do I press 'K' to access the crafting table? (I know it's the hotkey when you're away from the table - which is also odd, btw.) Most games use 'E'. If I can interact with an item in the world (like a door) with 'E' why make it 'K' for the table?\n\n- Your icons are generally not great. Flint looks like... pebbles? Snow? Bandages look similar to each other, only differentiated by color. There are several kinds of 'dust' that seem to do different things but look very similar.\n\n- Minor point but annoying: the scrolls/lore pieces should disappear from the world after they're read. Otherwise there's just a bunch of sparkling stuff doing nothing all over the place.\n\n- Inventory management is bad. In most survival games - heck most games - double clicking or shift clicking a stack of items moves it from one inventory to another. Also there's no 'organize' button, for example, auto-stack everything. It makes inventory management super tedious - dragging and dropping, manually stacking things together, etc.\n\n- While I like the IDEA of 'bags within bags', again it's not obvious, and the fact that (for example) you might pick up an item and it might go into a bag that's way down in the inventory, in a bag 'within a bag', ergo requiring scrolling to get to... not obvious or intuitive.\n\n- And as you brought it up... the monsters are... not good. The skeletons walk in slow motion, have an attack that's so exaggerated it's laughable (it looks camp to me) and take two hits to die. They're not a threat, they're an annoyance - that's not good.\n\nLast but not least. If this is the whole tutorial island, how do I get off? There's no indication of what to DO beyond 'fix the houses sitting next to your starting point', and no indication of what doing that will even help with. Will it give me access to better gear? Will I survive easier? The large, obvious dragon seems to be the only thing I need to go after, but that's only because of the sound effects and the animation. It's just not clear what's next, and if this island isn't even the main game... yeah, that's not good.\n\nI venture to say I'm not alone in quitting early, either. According to the achievement I got yesterday 'Brittle Bones', less than 40% of players have killed more than 5 skeletons. Either that means they're avoiding the skeletons (and they're so easy to kill, I don't know why) or they get bored enough that they stop playing.\n\nYour concept is good. You have - excuse the pun - the barest bones. But there are large hurdles to overcome early in the game. You can have the best endgame in the world but if the opening is boring, the rest isn't going to be experienced.", "timestamp_created": 1578276710, "timestamp_updated": 1578356713, "voted_up": false, "votes_up": 42, "votes_funny": 1, "weighted_vote_score": "0.772874176502227783", "comment_count": 9, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1578328661, "developer_response": "Thanks for the post! With only a couple hours in, you are still on the tutorial/starter island, what exactly would you like to see added/changed? Keep in mind the creatures are tuned for new players in this area, so in many ways are easier to kill than those found later in the game. Was the crafting to complicated/not complicated enough? Creatures such as rabbits, dear and basic skeletons felt too basic? Lore/story was not easy to find? \n\nEvery little bit helps.\n\n-LBS"}, "17515863": {"recommendationid": "17515863", "author": {"steamid": "76561198110686814", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 490, "playtime_last_two_weeks": 0, "playtime_at_review": 490, "last_played": 1464136027}, "language": "english", "review": "I have played this game for less then 10 Hours and bought it when it was on sale, so take that into consideration when readying this review.\n\nPro:\n-Has a Nice dynamic and graphically appealing environment.\n- The Sense of dying at any moment keeps you interested in the game.\n- Has so much potential and can become a very interesting game once completed or near completion.\n- The interface is easy to use.\n- The combat is pretty fluent.\n\nCon:\n-Limited diversity in weapons (most weapons are melee) One Ranged weapon style.\n- Limited ways of obtaining food.  ( Should be able to fish or harvest fruits from trees).\n- Very little objectives besides staying alive and completing day one task.\n- Should have some quest or other clear and defined objectives.\n- Limited Amount of structures that can be built. (only Hut style buildings, no armories or food storages)\n\nThe game overall is fun and i would recommend playing with friends makes the game much more enjoyable. The developers are constantly releasing updates.", "timestamp_created": 1439445144, "timestamp_updated": 1439445144, "voted_up": true, "votes_up": 32, "votes_funny": 2, "weighted_vote_score": "0.77246558666229248", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "55127534": {"recommendationid": "55127534", "author": {"steamid": "76561198354755966", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 10972, "playtime_last_two_weeks": 0, "playtime_at_review": 7136, "last_played": 1681245441}, "language": "english", "review": "I’ve been playing Savage Lands off and on for well over a year now with over 100 hours played. A lot has changed and so much has been fixed since the new team has taken over.\n\nFor me the Savage is pure fun. I really love the exploration and fantasy aspects of the game. The fact that it is open world with no NPCs telling you what to do next was very refreshing for me. So, you have to basically figure things out mostly on your own to progress forward. There are bits of lore to guide, so it is important to read these as you find them.\n\nAnother thing I find unique is that the game has bosses and epic monsters like an MMORPG. These things drop rare weapons and armor that you can’t get anywhere else in the game. While you can craft traditional armor and weapons these drops tend to be epic, so it makes killing these bosses even sweeter. Unlike traditional MMO’s and some survival games where you get XP, Savage player progression is purely based on gear. So the further you explore into the world, the better things you’ll find and be able to craft to help you go even further. The balance of the game is very unique and works well. Also, one you get past the first island the balance starts to spike upwards so if you are not geared you will die. There is a final boss (dragon) that drops a variety of high end gear and items, so good luck. I've killed it twice now.\n\nVisually the game is solid, and you should have no issues being immersed in the world. There are multiple islands to explore, dungeons, and tons of unique creatures. Savage runs great (75+FPS) on my new windows machine on extreme detail so I can’t complain.\n\nLastly, I like the fact you can play with your friend’s co-op or play offline and your character progress is saved. Definitely a cool feature for me.\n\nSummary [b](from someone that’s played the game a decent amount of time)[/b] for $9.99 you get:\n\n*Gameplay – 8.5 (easily 100+ hours)\n*Story/Immersion – 8\n*Visuals – 7.5\n*Performance (FPS)/Stability – 8.5 (game runs great on my machines)\n*Dev team Support – 10 (constant game updates and interaction with the community)\n\nIf you managed to pick up the game on sale, than you’ll definitely get your money’s worth.\n \nFinal note, kudos to the dev team for continuing to support this game. Not many developers would have. \n\nThank you!", "timestamp_created": 1568565357, "timestamp_updated": 1568565357, "voted_up": true, "votes_up": 42, "votes_funny": 0, "weighted_vote_score": "0.770150542259216309", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1568566912, "developer_response": "Thank you for the support 100+ hours played. We are very glad to hear that you’ve been enjoying all the work/updates we’ve been providing to players.\n\nIf there is anything else you want to see or run into issues, please feel free to post in our forums or send me a PM.\n\nGood luck on your next dragon kill and Stay Savage!\n\n-Euryidium"}, "70338378": {"recommendationid": "70338378", "author": {"steamid": "76561197963447232", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 2107, "playtime_last_two_weeks": 0, "playtime_at_review": 1321, "last_played": 1627222859}, "language": "english", "review": "So - saw the game was on sale today, haven't played since 2016 - thought I'd check more recent reviews and update info.  I knew the original developer left it and Bastion took over, but I neglected to follow the game's progress.  I'm glad I checked it out - some recent reviews are very negative but most of them seem to be quite uneducated.  Let me explain:  The devs are very active right now, and have made a LOT of changes and upgrades.  I played for an hour or two today just to check it out.  Not only does it look different, but there are definitely a lot of new features and quite a few more things to craft/build.  They added more areas and spawn points.  The game play also seems to be more forgiving than I remember, but not super easy.  Skeletons, for one, seem to be a little easier to kill.  Overall I thoroughly enjoyed checking out the new stuff, and had fun exploring.  I'm definitely going to be playing this more today and/or this weekend!\nThis is not abandoned, for sure - but I do see room for some more advances (which is why it's still in early access, I'm sure) and I'm hoping a Dev would kindly respond to the following things I found and would like to see changes with:\n1) Lighting - seems to be a little bit off.  One thing in particular that I noticed was if I sidestep behind a fire at night time, the light from it (when looking \"through\" it) lights up dark areas in the distance.  I could fully see trees and other items that I otherwise couldn't have seen at night from that distance.\n2) Inventory - if there's a way to quickly move inventory I haven't figured it out.  It appears that you still need to grab and drag everything, and I would love to see an auto-stacking feature so I don't have to take so much time to manipulate inventory.  Shift-click lets you resize a stack, but that appears to be the one and only inventory feature available.\n3) Hover Info on Resources:  I can go up to a brown mass against a pile of boulders and not know what I'm going to get until I hit it.  Would be great if I could hover over resources like that and see that I'm going to get tin, clay, flint, salt or whatever.  A lot of the models seem to be be the same or at least very similar to each other.  I can see where (because there are so many types of resources) it could be annoying to see everything, so maybe assign a key to it like holding alt while hovering over a resource will show you what it is?\n4) Moving Crafted Items:  So a couple things here.  First, it would be nice to be able to move a camp fire or crafting table once it's been built - or to cancel the creation of one that you've laid down (and receive the resources you've put into it so far).  Also, I created a wooden chest and couldn't figure out how to place it properly - only thing I found I could do was drop it, and it did not put it into the right spot that I would have liked it to go - and again I couldn't pick it back up to move it after it was placed this way.  \n5) Craft from other inventory:  Man it would be awesome if my crafting table could pull inventory from a nearby chest, or I could stand near a chest and repair my clothes from scraps within it.  Again back to making inventory less cumbersome, this would be an awesome feature to include.\n6) Tokyo Drift - I THINK I had this problem show up years back in this game - but it happened today.  For whatever reason my character started drifting toward the right, just slowly sliding that way when I wasn't even touching the keyboard or mouse.  Eventually it stopped, but it went on for about 20 minutes straight.\n7) General Game Info - some general info in the game would help give it a little polish, like the explanation that the game saves as your character and when you quit it saves your progress, for example.  I didn't die while playing, but I couldn't tell you if there's any sort of death penalty in the game.  Do I lose items and have to pick them up at my corpse?  Do my items degrade?  Do I come back at full health?  Things like that would be good info to give up front, I feel.\n\nAll in all, I really like what you've done so far!\n\n-Drake", "timestamp_created": 1591371451, "timestamp_updated": 1591371451, "voted_up": true, "votes_up": 35, "votes_funny": 0, "weighted_vote_score": "0.768771231174468994", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1593101048, "developer_response": "Thanks for posting this great feedback! Glad to hear you have been enjoying the game so far. Some comments below:\n\n1.\tLighting - What are your detail settings for draw distance current set at?\n\n2.\tInventory – You can double click on items to move them from a corpse or on the ground to your inventory.\n\n3.\tResources – Great feedback\n\n4.\tCrafted items – For buildables you can simply hit the outline to destroy it, the draw back is that only a portion of the items will be returned.\n\n5.\tCrafting Table – Great idea!\n\n6.\tDrifting – Yes, this is a known bug. There is simple fix on the player side that involves going into your journal click on a crafting component found on a buildable. Not ideal by  any means, but does fix the issue short term.\n\n7.\tAll great feedback here that we’ll take note of.\n\nThanks again for feedback, always helpful to us. Please feel free to update your post if you have more. =)\n\nStay Savage!\n\n-Euryidium"}, "105269328": {"recommendationid": "105269328", "author": {"steamid": "76561198114881502", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 4781, "playtime_last_two_weeks": 0, "playtime_at_review": 3338, "last_played": 1640149984}, "language": "english", "review": "Despite many flaws, I really like the game. The graphics are rather dated, but these aren't \"bad\" by any means. Makes one think of some oldschool games. The exploration it offers is really decent. A large map with each location different from another. Even though there hardly are any POI's with loot, it's still interesting to explore them. Co-op experience is great and I had fun with my friend... while it lasted.\n\n\n\nWhy not recommended then? The current state of the game is hardly playable sadly. As much as I like the game, it constantly tests your patience with its clunky design, and crashes from time to time on top of that. Let me mention things I didn't like:\n\n\n\n[h1]Tons of bugs and random crashing[/h1]\n\nI had a run with almost 30 hours in it and the game suddenly crashed without any information whatsoever, it just kicked me out to Desktop. It happened two times during this playthrough. The second time... when I loaded the game back, my entire inventory was wiped out. The problem is, that I carried absolutely everything with me, didn't have anything stored in chests, so that means, that the game literally destroyed 30 hours of my progress with a single crash. There's no character level, nor anything like this that would stay, so all the \"progress\" was gone. I'd have to start everything from scratch. This is beyond unacceptable, it was a definite \"enough\" for me. I abandoned this ship.\n\n\n\n[h1]Terrible Interface & Inventory Management[/h1]\n\nIt's been years and the interface is still insanely obnoxious. Inventory management is such a pain. There's no way to quickly store items in the chest, no shift-clicking nor anything, every single item has to be dragged manually. Stacking items in chests often leads to them being dropped instead. Even just scrolling through the inventory is poorly programmed. Mouse wheel stops scrolling when the cursor is on any of the inventory slots, works when it's precisely put on the grid in-between the slots. Swapping two items is also tragic. Even in toolbelt (that has not enough slots by the way), when trying to swap two items, the other one ends up being moved to first free slot in inventory. Nothing works properly and I have no idea how that system managed to survive through these years.\n\n\n\n[h1]Slow, Clunky And Unbalanced Combat[/h1]\n\nThe combat is wonky in general. Enemies hit hard and you can't dodge majority of attacks, due to unfair hitboxes of their attacks. There are 2H weapons with longer reach, but even these are nothing compared to some enemies' reach range, as they can hit you from far away. Some enemies also have AoE attacks while they shouldn't. A skeleton with bare hands punching towards one direction may still score a hit on you when you're standing BEHIND him, literally. So many times you'll be asking \"How did he hit me?\" in this game, because I and my friend were constantly asking that question. Some enemies work normally, can be dodged when knowing how and when, and are balanced well, especially those on the first island. But after that, it's just circus, you are supposed to get hit and deal with it. Majority of combat afterwards relies mostly on holding left mouse button and seeing who dies first, while drinking some potions once in a while. One could use a shield to try to achieve something, but you'll have to repair it too often. Those enemies don't really drop anything useful, and fixing your equipment will cost you ores you used to craft them (for Silver tier and above), which makes it absolutely not worth fighting anyone in late game. The time (and suffering) required to mine these ores is much greater than the time you'll be fighting in equipment made with it, especially for Gold tier, as gold ores spawn ONLY in few, poorly chosen locations. These ores are hidden in mountains without clear paths, so you'll end up having to suffer from terrible jumping mechanics to get to them... and cycle around these few spots or maybe just afk and wait for them to respawn.\n\n\n\nYes, enemies do drop best equipment in game, but it's pretty much only true for end-game bosses, otherwise it's best to skip combat and focus on mining ores and fight only the bosses required to progress further. I've been to dungeons, where everyone were hitting hard, especially mini-bosses that steal like 50% of HP per hit in the best-to-that-point armor. I manage to kill them by abusing their galaxy intelligence and what do I get? Some random weapon that maybe is better than the current one I have, but is worse than the weapon I'd craft with the ores of 1-higher tier, so conclusion is simple - instead of wasting resources and struggling with clunky combat, just sneak around mountains and mine ores - not only you'll be able to craft a better weapon, you'll also craft a better armor while you're at it. The only time I was actually happy with enemy loot was when I killed the mini-boss in the very-first dungeon (Meltok) and got the green skull for off-hand slot that increased movement speed and stamina recovery - and it also didn't require any mindblowing materials to repair, as it didn't require fixing at all, so I was truly able to enjoy the loot. Another loot from boss I enjoyed was that ice sword that generated heat when held, which was great too, especially because items rarely have such special effects. There is some good loot that is true, but out of so many enemies and 30h of gameplay, only these two items were worthwile.\n\n\n\nThere definitely could be some more loot, that preferably would not require materials, that can be found in one specific spot only to fix.\n\n\n\n[h1]Rather Boring Resource Gathering[/h1]\n\nAt first it's not bad to be honest. You can easily find various ores as you go and cutting trees is satisfying enough... Maybe except some bushes that have odd hitbox and are hard to hit.\n\nGenerally at the beginning it all appears to be pretty promising, but some time later you will get tired of that. Ores \"grow\" only in specific spots, so there are no surprises. The same ore will regrow in the same spot endlessly. First tiers are all over the place, so you can gather them while exploring, but later, it requires you to go to specific locations. It gets worse with each ore tier, because they get rarer. As I mentioned earlier, there are only few spots with gold ore, and they are shamelessly placed in hardly reachable places, effectively making it a pain. Seeing how fast the durability of your equipment depletes is really discouraging, because that means more wonky jumping around mountains. It will take bunch of ingots to repair the armor, and all the loot you get from enemies is maybe few ores if you're lucky enough. Not stonks. If there was a level system or something, that alone would make it more worthwhile, but there's nothing like this, so you can literally lose resources and have absolutely nothing from it.\n\nIf the game is designed to mine often, they should make it more satisfying, rather than being forced to backtrack to very specific spots. Some caves with random ores could be a good start. That, or make all equipment repairable with common materials, like early weapons require whetstones, that aren't hard to make.\n\n\n\n[h1]=== Conclusion ===[/h1]\n\nThese are my main issues with the game. I often felt like the invested time wasn't worth that. It's more punishing than rewarding. I went through combat mostly by abusing enemies' AI, as they can be easily cheesed with structures, but that just isn't how it should be.\n\nI really like the game (it surely has potential) and I'm looking forward to future updates, but there are still things that need to be addressed first before I'll be able to recommend it to others. Patience is required to play this game, and a friend to play with. I absolutely don't recommend tackling it solo. With friends you can at least laugh at poor mechanics, playing solo will only make you suffer, as the game is very slow-paced.", "timestamp_created": 1638684843, "timestamp_updated": 1640019883, "voted_up": false, "votes_up": 36, "votes_funny": 0, "weighted_vote_score": "0.767949938774108887", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1638741879, "developer_response": "Thanks for coming back, we appreciate your time and feedback. \n\nOne note, as a returning Early Access player if you did not follow the instructions found at the link below you can run into a variety of issues with world saves including: outdated item/creature balance data, drop tables, raw material distribution around the world and creature spawner issues.\n\nhttps://steamcommunity.com/app/307880/discussions/1/1640915206442322063/\n\n[quote] There's no way to quickly store items in the chest, no shift-clicking nor anything, every single item has to be dragged manually...[/quote]\n\nLBS - Moving items to chests via a function button is something we are looking at. That said,  you can still  Shit+click to split items and double click on items via the item window or on a corpse window to quickly move the item to your characters inventory.\n\n[quote] It's not like enemies have epic drops worth breaking your equipment anyway.[/quote]\n\nLBS - Actually they do, some of the best weapons and armor in the game are loot drops from bosses.\n\n[quote] It takes ages of going back and forth to gather enough ores to craft equipment, and it only lasts for a while, then repairing requires the same resources they were crafted with, creating a not really interesting loop. Like, two monsters are enough to destroy hours of farming and make you go back camping for ores.[/quote]\n\nLBS - If you fight multiple monsters in lower tier armor, the gear will take more damage. By design really. The better the gear. the better it will hold up. With each new island you'll want to advance your gear and have multiple sets for different types of creatures. For example spirit armor is great at deflecting damage from spectral entities throughout the world, but is less effective vs those creatures found in the physical realm.\n\nAs for changes, it all depends on the last time played. We (Last Bastion Studios) took over the development of Savage Lands from the previous developer (Signal Studios) back in May 2018. In that time our team has released a series of constant Early Access updates (over 147) that as of the latest release includes over 2700+ bug fixes, resolved several major game crashes across a variety of system configurations, improved performance (FPS) by over 60% on most machines, revamped the AI and general content flow, fixed the networking code so players can co-op again, overhauled much of the artwork, rebalanced the entire game, and have added new content (creatures/items/islands/etc.). Our mission has always been to improve Savage for the players that love it. \n\nThat said, there are a few areas we are working on cleaning up for future versions and your comments hit on the areas of focus.\n\nIf you have any additional feedback, please let us know.\n\nThanks,\n\n-LBS"}, "16409121": {"recommendationid": "16409121", "author": {"steamid": "76561198039805069", "num_games_owned": 0, "num_reviews": 148, "playtime_forever": 1662, "playtime_last_two_weeks": 0, "playtime_at_review": 852, "last_played": 1589154624}, "language": "english", "review": "After a long time of not playing, I decided to re-install this after my husband surprised me with a new computer.  Game looks ok, but I never really liked it for the graphics anyways.  Although the silver water is awful to look at.  \n\nMy problem are the game killing glitches.  The first guy I made, Jerry, has problems breathing.  He huffs and puffs like I'm sprinting everywhere and it only intensified as I played.  Eventually I tried restarting the game, then Steam itself, but Jerry couldn't be cured.  I stayed near a fire and stuffed him full of deer meat, he just couldn't stop hyperventilating.  \n\nSo I made a new guy, Man-Bear; in a new world named Big PP.  This guy has no breathing problems.  But when I hit J to look at things to make and pick something out to place down, my UI just goes away.  The stupid chat thing stays there even though I always play solo.  So I can't see enemy health, my health, cold, hunger, etc.  I tried restarting the game and Steam yet again and it was still gone.  I tried un-checking the settings that take some of this stuff off and applying it, then re-applying them in the settings to see if they would come back and nothing.\n\nThis game has had so much potential for so long.  It's changed hands, been abandoned then picked up and polished slightly then abandoned.  I just don't understand what the problem is with the people that work on this game.  It can be a great game, but it has game-breaking bugs.  I can take regular bugs, they don't bother me and sometimes they are so funny it makes me sad when they are fixed.  But when the key functions of the game break over and over again, it's beyond frustrating.  \n\nI've had this game since it was in early development on here and I've been cheering for it all the way, but it just gets worse and worse.  I don't understand how you can doom a game like this.  It's really such a sad waste.", "timestamp_created": 1434346776, "timestamp_updated": 1589155773, "voted_up": false, "votes_up": 545, "votes_funny": 29, "weighted_vote_score": "0.767692208290100098", "comment_count": 36, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1589757434, "developer_response": "Thanks for coming back after a long period of time to check out the game. We are assuming as a returning player you followed the instructions found here: https://steamcommunity.com/app/307880/discussions/1/1640915206442322063/\n\n[quote]But when I hit J to look at things to make and pick something out to place down, my UI just goes away. The stupid chat thing stays there even though I always play solo. So I can't see enemy health, my health, cold, hunger, etc. I tried restarting the game and Steam yet again and it was still gone. [/quote]\n\nLBS – Sorry to hear that. The issue sounds like you also hit the “H” key, which will hide the UI. You can change this under Key Bindings. If that is not the case can you provide us with your machine specs? A screen shot posted in our bug forum of your settings screen will suffice.\n\n[quote]This game has had so much potential for so long. It's changed hands, been abandoned then picked up and polished slightly then abandoned. [/quote]\n\nLBS – Savage has not been abandoned. Matter of fact we (Last Bastion) just released another hotfix this weekend (5/16/2020) bringing us to a total of 113 updates since we took it over.\n\nWe do apologize if this has been repeated, apparently a lot of players like yourself were/are not aware of all the work that’s been done. Since we (Last Bastion Studios) took over Savage Lands, as of this week, we have released over 80+ updates that have fixed over 1,928+ bugs (Build 112), resolved major game crashes, improved performance (FPS) by over 60% on most machines, revamped the AI to offer more challenge and fluid gameplay, fixed the networking code so players can actually co-op again (unity 5 version), re-balanced all of the gameplay, overhauled the visuals and added tons of new content. In short, a lot has been fixed and new content has indeed been added. Note, you will need to play beyond the tutorial area your character is currently in to really experience the breadth of changes that have taken place.\n\nMost of these changes (if not all) came at the request of our dedicated community base (99% from the forums). Their feedback has been instrumental in reshaping gameplay, which if you played prior to LBS taking over was in a horrible/neglected state. We will continue to make the game better and give Savage fans more of what they want.\n\n[quote]I just don't understand what the problem is with the people that work on this game. It can be a great game, but it has game-breaking bugs. I can take regular bugs, they don't bother me and sometimes they are so funny it makes me sad when they are fixed. But when the key functions of the game break ovr and over again, it's beyond frustrating.[/quote]\n\nLBS - Do you have additional bugs you would like to bring to our attention? We’d love to know so that we can fix. Please post them here in this forum: https://steamcommunity.com/app/307880/discussions/3/\n\nThanks again for the update, if there is anything else we can help with, just let us know.\n\n-LBS"}, "33659222": {"recommendationid": "33659222", "author": {"steamid": "76561198007665656", "num_games_owned": 0, "num_reviews": 236, "playtime_forever": 340, "playtime_last_two_weeks": 0, "playtime_at_review": 340, "last_played": 1471680939}, "language": "english", "review": "Terrible game, terrible developers, who are now abusing moderation and banning posts about the game they don't like. \n\nStay away, stay far away. Game will never amount to anything good now.", "timestamp_created": 1500497232, "timestamp_updated": 1500497613, "voted_up": false, "votes_up": 77, "votes_funny": 2, "weighted_vote_score": "0.767503082752227783", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "32096312": {"recommendationid": "32096312", "author": {"steamid": "76561198021167906", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1711, "playtime_last_two_weeks": 0, "playtime_at_review": 1711, "last_played": 1452897700}, "language": "english", "review": "I could have bought groceries with this money....   or paid my bills .....      \nThank you for teaching me a valuable lesson against throwing away my money on early access titles  ...\n\nThat is the only positive thing that I can say about this ...", "timestamp_created": 1496272872, "timestamp_updated": 1496272872, "voted_up": false, "votes_up": 87, "votes_funny": 15, "weighted_vote_score": "0.763247191905975342", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "18690440": {"recommendationid": "18690440", "author": {"steamid": "76561198149881474", "num_games_owned": 0, "num_reviews": 90, "playtime_forever": 2526, "playtime_last_two_weeks": 0, "playtime_at_review": 838, "last_played": 1597617963}, "language": "english", "review": "I absolutely love this game. \nThe atmosphere is what does it for me. You really feel isolated and alone (I mainly just play single player.) Every single thing you do and decision you make is based solely on your continued survival, and it's so much fun. \n\nI explored an (in-game) day and a half away from my main base, and getting back (srsly make a compass and trust it) was an adventure. I questioned myself, I wondered how long the night would last... and I was elated when my compass led me back to the ocean and the landmarks I built to get me back home.\n\nYou can max out stuff to do fast enough, but the devs always seem to be adding more. I'm very much looking forward to what comes next.\n\nI can't stress the importance of a compass enough.", "timestamp_created": 1445832922, "timestamp_updated": 1445832922, "voted_up": true, "votes_up": 53, "votes_funny": 8, "weighted_vote_score": "0.761884868144989014", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "20469673": {"recommendationid": "20469673", "author": {"steamid": "76561198094901158", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 4046, "playtime_last_two_weeks": 0, "playtime_at_review": 2536, "last_played": 1542560763}, "language": "english", "review": "Critics, commends and suggestions:\nOkay, there are many things I have to say about this. Firstly, the game is amazing. My friends and I basically described it as „Minecraft meets Skyrim“ game, which, to be honest, is amazing. The whole progressing aspect of the game is very pleasing. The whole story of the game is nice (at least the story that's made for now), enemies are great (but I'd personally like to see many different types of animals and a whole ton of enemies to fight). Weapons and tools are cool and I expect more of the same sort. Overall, game is great and I hope that there will be many more things added.\nCommends:\n-Weapons are great, different types. You've taken attack speed in count, damage, building damage and special item effects (soul storm)\n-Many different enemies with different attacks and item drops \n-Overall graphics of the game are amazing!\n-Progressively advancing through the game\n-Amazing with friends\n-Structure building\n-Survival aspect (game can be harsh which, in this case, is good)\n-Weather aspect (snowstorms), maybe add in some other.\n\nCritics:\n-No fall damage (at least what I've witnessed)\n-Enemies should have more animations (attack, death, running, etc.)\n-Animations for certain actions (for example that you cannot simply take animal skin from inventory but rather skin the animal for it)\n-Not being able to place chests yourself (they basically just drop once you remove them from inventory and that's where they'll stay). Should be placable like structures, campfires.\n-No information to tell you when you armor is broken (which may be important in some fights)\n-Stacking of some items is low (I'm not having a problem with that but when you can't place chests the way you want and the amount of items you can collect, this, sort of, becomes a problem)\n-Getting more than plenty of some items that are required in only one or few recipes (Bear claws, pelts, bones (well, this isn't a problem because logically is that every animal has them but just put it as an example), blood of the brood, etc.)\n\nSuggestions:\n- I would like to see the \"Thirst bar\" which would be another variable that you'd have to take care of (I don't know much about developers' plans for the future, but if there ever will be something like a desert type area this could come in handy; also this is just a personal suggestion which would fulfill me personally but others may hate it... it's a situational thing).\n-Many more weapons with different effects (elemental weapons (fire, ice, poison, etc.), more types of ranged weapons (throwable axes, daggers, more bows, crossbows, etc.)\n-Many more different armors (light, medium and heavy category)\n-Shields (same as armors, light, medium and heavy, also from different materials, etc.)\n-Collectable herbs to make something like potions (maybe something to give some buffs like increased staming, strenght (more damage and ability to wear harder armor without penalties)\n-Speed penalty while overburdened (this would make game much more realistic)\n-Many more creatures that can spawn both during day and night which will add variety and much more droppable items that can be used to craft new and different things (humanoid, beast, animal, undead, lizard, etc. Types)\n-Mounts that can ease your travel (whatever that may be)\n-Dungeons of some sort (Caves, temples, ruins, etc.)\n-This may not be taken well because some games have added this and had problems because of it, and I myself am also sceptic about this, but you should consider adding some type of skill factor based on the amount of time using some tool or weapons (sort of like adjusting to your weapons, armor, and anything else) that can make farming easier for you.\n-Agriculture, growing your own plants (whatever that may be) could add variety to the game.\n-More tools (such as pickaxes, hoes and so on)\n-More special creatures (such as Kur, Helion, Lycor) that have their stories and that can be a challenge\n-add some sort of guideline structure (road signs) and maybe some sort of a blank map that you can draw yourself (with some sort of ink maybe)\n-Not sure how you feel about this but it may be nice to, along with complete blueprints for structures, add something like walls that you can place in a way to build a bigger house with more room and some inner decorations (something like a tavern or a guard post).\n-Smelting would be nice since you could smelt all the things you don't use anymore and get some extra from them\n\nI usually don't rank things that are in alpha, beta state or pre release but just for the sake, subjectively I'd rate it (on a scale from 1 to 100) a solid 90+ because of not so many things in the current state, so not a big deal. Haven't experienced any specific bugs or glitches. Game is running solid and the graphic settings are various and on max settings the game is beautiful. I'd definitely recommend this game to anyone who likes survival games.\n\nI know that you may be annoyed with all the „add more stuff“ and I know it's gonna be added but I had to say my word. I can't think of anything else at this moment but I'll be playing the game in the future and will see the further development. I also see that Developers are very interested in their community and listen to our suggestion, critics and commends. You guys do an amazing job and it has been my pleasure playing this game for more than 30 hours now and continuing into the future. Keep up the good work and if you want any more suggestion that I may think of in the future, I can always help you out. This game is an amazing jewel of survival games and I hope to see much more blossoming  for this seed you've planted.", "timestamp_created": 1452524579, "timestamp_updated": 1452543097, "voted_up": true, "votes_up": 47, "votes_funny": 2, "weighted_vote_score": "0.761080801486968994", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "18257285": {"recommendationid": "18257285", "author": {"steamid": "76561197972720910", "num_games_owned": 683, "num_reviews": 66, "playtime_forever": 2555, "playtime_last_two_weeks": 0, "playtime_at_review": 2558, "last_played": 1443815868}, "language": "english", "review": "40 enjoyable hours in and I think Ive tapped out most of what can be done.  Only thing left is to grind for gear.  Played this both solo and multi and enjoyed both!  I did find the balance for resources was good until I had to start getting more High Quality ore.  That became the only turn off I had with this game.  Hell, this game had fewer bug and issues then the majority of the released games out now.  \n\nThe world is massive, there is plenty to do and explore, and the Giants are a nightmare to solo.  Made me think of my Dark Souls playing days.  All in all this was worth the pick up even in early access.  Great job with this one and I look forward to returning to it in the future!", "timestamp_created": 1443577202, "timestamp_updated": 1443577202, "voted_up": true, "votes_up": 42, "votes_funny": 3, "weighted_vote_score": "0.75948631763458252", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "49059745": {"recommendationid": "49059745", "author": {"steamid": "76561198185043647", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 335, "playtime_last_two_weeks": 0, "playtime_at_review": 335, "last_played": 1550432176}, "language": "english", "review": "So my brother and I was playing on our open server (and yes we closed it to private due to grieving) when suddenly this guy pops in... A dev... THE Dev... Himself, in the bits and binaries. Just making sure we are having fun and everything is working.\nThere are some minor movement bugs (getting stuck, probably my fault due to exploring like the Dragonborn). Hopefully we will see more content (arrows, bows and enemies) soon.\nThis game is being taken good care of and the moonwalk bug has been fixed. Fully recommend it for some great (private) fun.", "timestamp_created": 1550432569, "timestamp_updated": 1550432828, "voted_up": true, "votes_up": 32, "votes_funny": 3, "weighted_vote_score": "0.756587386131286621", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1550464826, "developer_response": "Thanks for the post! I do enjoy jumping into public games on occasion; just want to make sure our players are having fun.  =) \n\nIf you find any specific areas where you get stuck, please take a screen shot and let us know, we’ll take a look and make adjustments. Also, more arrow types and bows are in the works .\n\nThanks again for playing!\n\nStay Savage!\n\n-Euryidium"}, "38353323": {"recommendationid": "38353323", "author": {"steamid": "76561198010218592", "num_games_owned": 904, "num_reviews": 37, "playtime_forever": 658, "playtime_last_two_weeks": 0, "playtime_at_review": 519, "last_played": 1526583742}, "language": "english", "review": "This game seems to never get out of Early Access.\nAnother year passes and there is slight / no major updates on a game, despite the promises. \n\nI got this game in some kind of bundle and still regret paying for it.", "timestamp_created": 1513439005, "timestamp_updated": 1513439005, "voted_up": false, "votes_up": 39, "votes_funny": 0, "weighted_vote_score": "0.754373252391815186", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "24588137": {"recommendationid": "24588137", "author": {"steamid": "76561198023022660", "num_games_owned": 176, "num_reviews": 12, "playtime_forever": 1004, "playtime_last_two_weeks": 0, "playtime_at_review": 824, "last_played": 1657058091}, "language": "english", "review": "This game is one of the few that captures almost everything I want in a survival-style game. I don't really see why people say it's SO difficult though. It's not easy, but it won't kick your ass if you play conservatively and don't run around in your underwear swinging a hatchet at a dragon. Focus on survival, and you'll find a rewarding game filled with crafting, building and exploration.\n\nAlso deserving a special mention is the amount of work the devs continue to put into this game. There is a counter on the main menu telling you when the next update is coming... There have been a huge number of updates since I've owned this game. It's not perfect, there are still some rough edges but it's getting better every day.", "timestamp_created": 1469760235, "timestamp_updated": 1469760235, "voted_up": true, "votes_up": 47, "votes_funny": 3, "weighted_vote_score": "0.751007735729217529", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "92101967": {"recommendationid": "92101967", "author": {"steamid": "76561198049678196", "num_games_owned": 689, "num_reviews": 90, "playtime_forever": 71, "playtime_last_two_weeks": 0, "playtime_at_review": 13, "last_played": 1688807495}, "language": "english", "review": "Game seems fine, the person handling the comments (and representing the company) should probably be assigned to something else. Personally attacking people because they don't like the game is just sad and unprofessional, devs with this attitude shouldn't be supported.", "timestamp_created": 1621172937, "timestamp_updated": 1621172937, "voted_up": false, "votes_up": 57, "votes_funny": 0, "weighted_vote_score": "0.750129163265228271", "comment_count": 12, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "36048164": {"recommendationid": "36048164", "author": {"steamid": "76561198011321879", "num_games_owned": 0, "num_reviews": 74, "playtime_forever": 390, "playtime_last_two_weeks": 0, "playtime_at_review": 390, "last_played": 1466339725}, "language": "english", "review": "A good example of Early Access... (The game wasn't bad; for it's limited content) And a better example of abaondonware, the Dev's \"paused development\".\n\nSuch acts from developers should see penalties imposed... It is not okay!", "timestamp_created": 1509119125, "timestamp_updated": 1509119125, "voted_up": false, "votes_up": 57, "votes_funny": 3, "weighted_vote_score": "0.747273743152618408", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "32123821": {"recommendationid": "32123821", "author": {"steamid": "76561197999459739", "num_games_owned": 1131, "num_reviews": 549, "playtime_forever": 29, "playtime_last_two_weeks": 0, "playtime_at_review": 29, "last_played": 1496389998}, "language": "english", "review": "There is a stigma on Steam around the vast community regarding Early Access games, and this is one of the reasons why. What we have here is a game with a pretty good idea and a development team who clearly thought they could do more than they can. Some of the games representatives say this game is not abandoned, but it is pretty obvious that even if it is not abandoned, it is forsaken. It would be nearly impossible to recover from leaving as-is for so long and then trying to make up for the vast negative reviews this game earned, and earn them they did. This is a very unfinished shell with many bugs.", "timestamp_created": 1496390028, "timestamp_updated": 1502082020, "voted_up": false, "votes_up": 57, "votes_funny": 2, "weighted_vote_score": "0.74677962064743042", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19491123": {"recommendationid": "19491123", "author": {"steamid": "76561198043426483", "num_games_owned": 682, "num_reviews": 20, "playtime_forever": 624, "playtime_last_two_weeks": 0, "playtime_at_review": 294, "last_played": 1610603227}, "language": "english", "review": "Rust meets Skyrim. And its awesome. Its been updating a lot and has new content rather frequently. I cant wait to see where this game goes.", "timestamp_created": 1449284112, "timestamp_updated": 1449284112, "voted_up": true, "votes_up": 51, "votes_funny": 12, "weighted_vote_score": "0.742502689361572266", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "39785789": {"recommendationid": "39785789", "author": {"steamid": "76561198055404271", "num_games_owned": 714, "num_reviews": 13, "playtime_forever": 457, "playtime_last_two_weeks": 0, "playtime_at_review": 423, "last_played": 1546680978}, "language": "english", "review": "A lot of people keep saying this game has been abandoned by the developer, but this is not true at all. Unfortunately, the update cycle is so slow that it's impossible to say when new content will arrive.\nSavage Lands is, however, an enjoyable game for a while. Exploring the world, working through the tech tree and fighting enemies is great the first time around, but it lacks any replayability because of the limited scope of the game at the moment. I would recommend keeping an eye on it, but I can't say buying it now is a good idea.", "timestamp_created": 1517559430, "timestamp_updated": 1517559430, "voted_up": false, "votes_up": 31, "votes_funny": 0, "weighted_vote_score": "0.74244081974029541", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "21378121": {"recommendationid": "21378121", "author": {"steamid": "76561198012639182", "num_games_owned": 603, "num_reviews": 22, "playtime_forever": 2029, "playtime_last_two_weeks": 0, "playtime_at_review": 1728, "last_played": 1610034242}, "language": "english", "review": "As of right now, developers seem to be advancing the game quickly and improving it in the right direction.  Their updates balance improving performance, graphics and content which is great to see.  Many early access games i have bought fail to keep such a balance so i have high hopes for this game.  \n\nThe only thing that i have a problem with the game which i dont know if the developers can do much about, besides more marketing is the fact that i can never find an avalible public server to play on.  To me, this really takes away from the appeal.  Just somthing about playing with others, even if i am just going out on my own and having side conversations with others makes the game more fun.  \n\nSince this is early access and the pros way outweigh the cons, i would still definately reccomend this game, it definately stands out among all of the other \"survival crafting RPG\" like games that i have played or seen come out.", "timestamp_created": 1456107633, "timestamp_updated": 1456107633, "voted_up": true, "votes_up": 50, "votes_funny": 3, "weighted_vote_score": "0.741439700126647949", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "31423287": {"recommendationid": "31423287", "author": {"steamid": "76561197980868205", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 2562, "playtime_last_two_weeks": 0, "playtime_at_review": 2381, "last_played": 1599526424}, "language": "english", "review": "Steam needs to start outright banning developers entirely that fail to complete a game in Early Access. You've sold a ton of copies, using Early Access. Either finish this game, or stop developing entirely.", "timestamp_created": 1493407591, "timestamp_updated": 1493407591, "voted_up": false, "votes_up": 46, "votes_funny": 1, "weighted_vote_score": "0.740836977958679199", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "40798837": {"recommendationid": "40798837", "author": {"steamid": "76561198017749376", "num_games_owned": 470, "num_reviews": 83, "playtime_forever": 1043, "playtime_last_two_weeks": 0, "playtime_at_review": 1040, "last_played": 1551213003}, "language": "english", "review": "jank", "timestamp_created": 1520986455, "timestamp_updated": 1691376319, "voted_up": false, "votes_up": 43, "votes_funny": 3, "weighted_vote_score": "0.738379836082458496", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1551197361, "developer_response": "Great post! Out of curiosity have you had a chance to check out the most current version of the game? We ask because much has changed from the last time you played.  =)\n\nFor starters, we [url=https://steamcommunity.com/app/307880/discussions/1/1694923613854143166/] (Last Bastion Studios) [/url] took over the development of Savage Lands from the previous developer (Signal Studios) back in May 2018. Since that time our team has released a series of constant updates (over 20) that as of the latest release includes over 900+ bug fixes, we have resolved several major game crashes, improved performance (FPS) by over 58% on most machines, revamped the AI and general content flow, fixed the networking code so players can co-op again, overhauled much of the artwork, rebalanced the entire game, and have added new content (creatures/items/etc.).  We have plans to add a new playable area to the game in the coming months complete with new creatures and items.  \n\nAs of our last update (Build 47, Savage is the most playable it has been since the Unity 4 version was moved to a legacy state 2 years ago.\n\nFor a full list of Game Updates please check out our news section: https://steamcommunity.com/games/307880/announcements/\n\nIf you get a chance to play the latest version and have any gameplay feedback, please feel free to post here in our [url= https://steamcommunity.com/app/307880/discussions/7] Suggestions & Feedback Forum [/url] or message us directly.  Also, as a returning player be sure to follow the instructions mentioned in the patch notes, very important: https://steamcommunity.com/app/307880/discussions/1/1777136225012321349/\n\nRegards,\n-Last Bastion\n\n"}, "35610925": {"recommendationid": "35610925", "author": {"steamid": "76561198079061928", "num_games_owned": 593, "num_reviews": 47, "playtime_forever": 151, "playtime_last_two_weeks": 0, "playtime_at_review": 151, "last_played": 1439061214}, "language": "english", "review": "The game is dead. Developers have left.", "timestamp_created": 1507614162, "timestamp_updated": 1507614162, "voted_up": false, "votes_up": 58, "votes_funny": 0, "weighted_vote_score": "0.735252320766448975", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "17940147": {"recommendationid": "17940147", "author": {"steamid": "76561198068519572", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 448, "playtime_last_two_weeks": 0, "playtime_at_review": 448, "last_played": 1441933750}, "language": "english", "review": "Loving the game so far, finding the gameplay rather enjoyable. *Warning to new Players* You start the game without a tutorial, take your time to learn  the controls and the gameplay and you should have fun. =)", "timestamp_created": 1441702974, "timestamp_updated": 1441702974, "voted_up": true, "votes_up": 48, "votes_funny": 5, "weighted_vote_score": "0.734994888305664063", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "55882835": {"recommendationid": "55882835", "author": {"steamid": "76561197983558083", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 14751, "playtime_last_two_weeks": 0, "playtime_at_review": 4998, "last_played": 1577288410}, "language": "english", "review": "[h1]A game I struggled with, learned, and now love.[/h1]\n\nI first played Savage Lands around three years ago, and couldn't get to grips with it. \n\nComing back in June, I found huge, huge improvements and really enjoyed the game - the first few nights terrified me, but slowly I got my bearings and began to grow braver, eventually moving to the second island - where I got myself completely stuck by building a house in a very silly place (in the middle of a difficult spawn point), which effectively kept me trapped inside my house, wolves and tree-thingies circling almost endlessly until I ran out of food and made a break for it. I was squished by wolves and died. Respawning as a naked dude, I couldn't get close enough to my body to retrieve my stuff, so I got a little downhearted and didn't play for a few months.\n\n[b]However[/b] - Last week I decided to give it a fresh go with a new character and new game, and discovered (quite by accident) that you can actually play with any character you've in any game you have, and their equipment/inventory travels with them. I was quickly able to send my new character into the old game and 'rescue' my old body - hurrah! - and take advantage of all of the bits and bobs I'd collected in that game. I can help my out my friends in online games, and that help can be carried back to their own solo games if desired. I love the idea of being able to help people out by just giving them a little bit of a leg up - not dumping gamebreaking gear on them the instant they arrive on the first island, but just the odd thing here and there to make it all a bit easier. A slightly more durable axe. Some planks. Some tin ore for those tricky first hammers. Perhaps stand there and take the damage from Lord Kruul while they whack him with whatever they have, moving away from time to time so that they can get an idea of the damage he does to them and whether they want to retreat and improve their gear or not. \n\n[h1]The realisation that both the characters and the world are completely fluid has completely changed my view of the game.[/h1] \nBefore, it was [i]that slightly scary game[/i] which was very much all or nothing, feeling like a proper permadeath unless you happen to leave stashes of gear tucked away for emergencies. Now, it's a game I can enjoy either on my own or with friends, and any progress we make can be carried across to our own games. The game dev is very active, and the game is updated regularly. I'm still not hugely far into the game - still only on the second island - but I feel comfortable with the game at last, and am happy to recommend it.\n\nNight time is still scary, but now I've got a big pointy stick. Rahhh.", "timestamp_created": 1572363467, "timestamp_updated": 1572363652, "voted_up": true, "votes_up": 30, "votes_funny": 3, "weighted_vote_score": "0.733498811721801758", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "82797019": {"recommendationid": "82797019", "author": {"steamid": "76561198016046767", "num_games_owned": 0, "num_reviews": 1614, "playtime_forever": 594, "playtime_last_two_weeks": 0, "playtime_at_review": 94, "last_played": 1608651030}, "language": "english", "review": "Another generic survival experience from the mid twenty teens wave of early access games. This one has not yet been abandoned nor completed by the developer, but it has long since been abandoned by any sort of player base. Graphics are rough and dated, every mechanic feels basic and underwhelming, and it offers nothing new or interesting to the genre. Currently there are 2 people online so you can forget about multiplayer, you'll be exploring this empty world on your own.", "timestamp_created": 1608515682, "timestamp_updated": 1608515682, "voted_up": false, "votes_up": 51, "votes_funny": 4, "weighted_vote_score": "0.732832252979278564", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1609311771, "developer_response": "Dev Update 12/29.2020 - Thanks for coming back and spending more time with the game after we posted. Much appreciated.\n----------------------------------------------------\nThanks for spending time in the tutorial, the very short amount of time is appreciated.  \n\nWe are always working to improve the game and have great stuff planned for 2021, including visual updates to a lot of our assets and systems. Here is a small sample of the changes,\n\nhttps://steamcommunity.com/app/307880/discussions/1/3007801544752213749/\n\nLastly, the majority of  our community plays offline since the save system in Savage does not require to have either or, meaning you can use 1 character and world in either mode and go between other players games.\n\nWe do understand Savage is not for everyone and for now we highly encourage you to refund the game since your time played falls well withing the requirements. Why hold on to a game if you are not satisfied? We don't...\n\n-LBS"}, "20950160": {"recommendationid": "20950160", "author": {"steamid": "76561197981151676", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 2664, "playtime_last_two_weeks": 0, "playtime_at_review": 1976, "last_played": 1514071957}, "language": "english", "review": "first review ive written. its beause i really like this game. i really like the genre.\n\nthis is for game update #26 i played the unpatched #25 and then moved to beta.\n\ngood for the money if you dont mind waiting for new content. waiting for new content means you may have to start over but thats okay. thats the fun of the game, starting with nothing and working your way to sustainability.\n\nthings about the beta patch that i like.\n-Land is easier to navigate.\n-dual weild is amazing but maybe over powered?\n-we got more rocks with a pretty decent amount of ores.\n-i like how theres more enemies but the first island is nearly harmless.\n-theres a stamina bar lets me know when i can run again.\n\nthings that need some work\n-the interface, i like the old one thats in the top left corner. \ni do not like that cold and health are integrated. pre patch was better.\ncold shouldnt affect max hp and i think you should make the cold stronger\nagain. imo this is about survival make the player choose over defense or warmth.\n-i want this game to be HARD, i want to thank god that i have a friend to help\nbut worried cause we need MORE food. right now i can walk around all day long.\nand most of the night. cause im munching on the countless wolf meats i got.\n-making wolves drop less meat would be nice. or make them stronger and less\nabundant. that would make me worried when i hear a howl at night.\n-i cant fight the dragons besides shooting a thousand arrows at them.\n-fall damage, i can skyrim my way up anywhere and jump off freely.\n-the strongboxes suck cause i cant place them\n-sprint isnt long enough.\n\nthings i would like to see added.\n-theres not enough content such as weapons and armor, everything feels very\ncondensed, you need more low level items, bone tools and such. it should take \na while to become \"civilized\" i can do this within an hour or so.\n-i want to choice between warmer armor or higher defense. or possibly the option\nto customize my armor by lining it with wolf pelts cause i have like 100 of them.\n-quests\n-enemies that are rare that build structures that create more mobs.\n-trapping would be neat, get nice furs and such that provide more heat and traps for bigger creatures or humans.\n-herbalism, i need remedies man. poisons. buffs like stimulants that make you harder to tire.\nrun faster. or eat less.\n-maybe a metabolism, the higher fat % you are you get cold slower but move slower. keeps the player\nfrom relying on food as a source of health.\n-sleep. we all need it.\n-hardcore mode?\n-i need something to kill deer more efficiently. like, if i hit them in the shoulder area or the head its a 1 hit.\nmaybe arrows can cause bleeding on animals and a chance on humans. following a blood trail\nwould be cool. but there is a high population of deer.\n-wolves are working with skeletons to kill me, they dont eat deer.\n\nthese are just a few of the things i would like to see. keep up the great work. hopefully i will get some feedback from the devs they seem pretty interested in what we have to say.", "timestamp_created": 1454595750, "timestamp_updated": 1454595750, "voted_up": true, "votes_up": 33, "votes_funny": 4, "weighted_vote_score": "0.732272446155548096", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "102817843": {"recommendationid": "102817843", "author": {"steamid": "76561198088781244", "num_games_owned": 247, "num_reviews": 115, "playtime_forever": 2335, "playtime_last_two_weeks": 0, "playtime_at_review": 2335, "last_played": 1612782642}, "language": "english", "review": "Game came out in 2015, it's still in early access, i recommend buying this game at high discount.", "timestamp_created": 1636972406, "timestamp_updated": 1636972406, "voted_up": true, "votes_up": 31, "votes_funny": 1, "weighted_vote_score": "0.729397296905517578", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "106457861": {"recommendationid": "106457861", "author": {"steamid": "76561197985078154", "num_games_owned": 416, "num_reviews": 32, "playtime_forever": 34, "playtime_last_two_weeks": 0, "playtime_at_review": 34, "last_played": 1640389220}, "language": "english", "review": "It is a good game...... in 2001", "timestamp_created": 1640389362, "timestamp_updated": 1640389362, "voted_up": false, "votes_up": 40, "votes_funny": 9, "weighted_vote_score": "0.728693246841430664", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1640437888, "developer_response": "Thanks for the post! The few minutes you spent creating your character and walking around the tutorial/start area is very much appreciated. Since it sounds like you did not enjoy your time playing, we highly encourage you to put in for a refund, why keep a game you don't like... we don't.\n\n-LBS"}, "87983705": {"recommendationid": "87983705", "author": {"steamid": "76561198012399963", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 635, "playtime_last_two_weeks": 0, "playtime_at_review": 635, "last_played": 1512374578}, "language": "english", "review": "This review has nothing to do with the game and all to do with the devs.\n\n I've not played this game in years, found it enjoyable at the time but nothing really special. I thought it was dead but when it popped up on my news feed i thought I'd see how it's going. My god, developers ought to be banned from responding to negative reviews for their own sake. Just take a look at some of their responses, incredibly petulant. There is zero upside to responding devs, absorb or ignore the criticism, like an adult.\n\nDon't buy this game, spend that money on supporting developers who actually give a shit about the consumer. \n\n", "timestamp_created": 1615071534, "timestamp_updated": 1615071534, "voted_up": false, "votes_up": 74, "votes_funny": 4, "weighted_vote_score": "0.728238105773925781", "comment_count": 8, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1622090922, "developer_response": "Thanks for the post! \n\nSounds like you're unaware of many changes that have taken place within the world of Savage, so allow us to give a quick recap. Like we have mentioned to many others that have posted but not played in a very long while, we (Last Bastion Studios) took over the development of Savage Lands from the previous developer (Signal Studios) back in May 2018. In that time our team has released a series of constant updates (over 135) that as of the latest release includes over 2500+ bug fixes, resolved several major game crashes across a variety of system configurations, improved performance (FPS) by over 60% on most machines, revamped the AI and general content flow, fixed the networking code so players can co-op again, overhauled much of the artwork, rebalanced the entire game, and have added new content (creatures/items/islands/etc.). Currently we have another overhaul in progress that will touch everything from art to improving UI/gameplay systems. \n\nWhat is important to note is that all these changes came from our team working closely with our community. If it weren’t for our player base, we wouldn’t have the game we have today. Based on the version you last played years ago, Savage was in a terrible place, and we are sorry we didn’t take it over sooner. \n\nIn appreciation for all the hard work from our players, we created an ingame monument that lists out all the individuals that have contributed to our efforts (500+ hours played and feedback). So we without a doubt appreciate every player new and old. \n\nFor a full list of Game Updates please check out our news section: https://steamcommunity.com/games/307880/announcements/\n\nHere is a quick look at one of the many asset updates currently in progress: https://steamcommunity.com/app/307880/discussions/1/3007801544752213749/\n\nLastly, if you decide to fire up the game, be sure to follow the instructions mentioned in the patch notes, very important: https://steamcommunity.com/app/307880/discussions/1/1640915206442322063/.\n\n-LBS"}, "39245779": {"recommendationid": "39245779", "author": {"steamid": "76561198010333017", "num_games_owned": 419, "num_reviews": 88, "playtime_forever": 1472, "playtime_last_two_weeks": 0, "playtime_at_review": 1263, "last_played": 1567649440}, "language": "english", "review": "I've been pretty hard on this game. It's been through a rough life. Last Bastion has put some blood sweat and tears into this. For how cheap it is nowadays, and with the improvements they've put into it since they took over, I think you can get your money's worth. Some day it might be as good as I had hoped when I bought this years ago. Maybe it won't be. One can hope. Get it on sale and maybe, you might just like it. \n\n\nold review 1/10/18\n---\nI want to recommend this to you. I want to love this game. But it's unfinished and the chances of that ever happening just don't seem likely. The framework here for something great exists. I don't give a thumbs up for potential, though. \n\nDisappointing.", "timestamp_created": 1515637066, "timestamp_updated": 1568599402, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.727697134017944336", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1568610149, "developer_response": "Thanks for the update! We will continue to push to make the game better. Tons of stuff needed fixed, more than anticipated so these changes chewed up a lot of time. Still much more to do!\n\nPlease PM me or post in our forums if you have anymore feedback you'd like to share.\n\nStay Savage!\n\n-Euryidium"}, "30202445": {"recommendationid": "30202445", "author": {"steamid": "76561197990621832", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 452, "playtime_last_two_weeks": 0, "playtime_at_review": 446, "last_played": 1562147345}, "language": "english", "review": "Development has stopped so Developers could start working on other game. \n\nDevelopers cracking down on community with negative responses to their actions. \n\nThe game is currently broken, save your money.", "timestamp_created": 1488132460, "timestamp_updated": 1488132460, "voted_up": false, "votes_up": 50, "votes_funny": 0, "weighted_vote_score": "0.72729569673538208", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "18496530": {"recommendationid": "18496530", "author": {"steamid": "76561198059966565", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 2866, "playtime_last_two_weeks": 0, "playtime_at_review": 1218, "last_played": 1458178191}, "language": "english", "review": "DONT LET THE GRAPHICS THROW YOU OFF.\ntldr\nCons- \nStarting off is really bleak \nGraphics can be much better\nSome mobs are ridiculously hard to kill, and do lots of damage\n\nPros-\nOne of the funnest multiplayers i have ever played\nOnce you have a small base set up, then things start to get really fun\nMap is huge\nTons of different gear, and crafting\nFighting in groups on tough mobs is supa fun\n\n\nThis game is actually really fun, it does start off very pale and bleak though. For the first 15 minutes of gameplay, i was pretty unimpressed; mediocre graphics, basically just the forest but worse, etc... But theni found a village, started having serious events happen, like a couple dark skeletons attacking and dark wolves, that was pretty fun but alright. Then i had to do something so i stopped, got back on, but this time i joined multiplayer. That was where its at. This game peaks during multiplayer, i had so much fun, co-oping with others to take down a forest giant or even the dragon. Best thing too, is that your inventory transfers. (from single player to multiplayer and vice versa) Got enough resources by teaming up with other guys that i was able to make a nice base on my single player world where i could store all my things. \n", "timestamp_created": 1444968952, "timestamp_updated": 1444968952, "voted_up": true, "votes_up": 90, "votes_funny": 9, "weighted_vote_score": "0.726877093315124512", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "106445264": {"recommendationid": "106445264", "author": {"steamid": "76561198087750744", "num_games_owned": 0, "num_reviews": 30, "playtime_forever": 1436, "playtime_last_two_weeks": 0, "playtime_at_review": 1436, "last_played": 1640374655}, "language": "english", "review": "Got the game a few years back when it was a clunky Early Access mess and decided to put a hold on it till it went full release.\nSaw that it was a \"new release\" on the Christmas Sale tab and decided to reinstall and give it another look.\n\nSame God awful graphics from launch, clunky interface, and buggy gameplay. Enemies clipping through solid walls, running in air or in place.\n\nI hope the dev continues to work on the game as time goes on but with as little change as has been implemented over the last 3 years I can't say I'm holding my breath.", "timestamp_created": 1640374922, "timestamp_updated": 1640374922, "voted_up": false, "votes_up": 25, "votes_funny": 1, "weighted_vote_score": "0.723906099796295166", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "51368921": {"recommendationid": "51368921", "author": {"steamid": "76561198184897393", "num_games_owned": 0, "num_reviews": 653, "playtime_forever": 533, "playtime_last_two_weeks": 0, "playtime_at_review": 413, "last_played": 1562892719}, "language": "english", "review": "This game has been in EA for quite a long time.  I tried it first about 3 years ago, and even accounting for a long hiatus, I do not see any new content or goals.  Some achievements are working again, but still buggy.  \n\nThere is a lot of potential and if performance were more stable, goals were communicated (or even existed beyond “the first day”), and acquiring resources was less grindy, I could see myself sinking a lot of time into this game.  \n\nThe main reason I cannot recommend this game at this time is that FPS varies greatly between 60 at first to launch to about 0.  Sometimes it bounces back up to the 30 FPS range, other times it remains unplayable, even with low resolution and graphics settings (which, of course, are not persistent).\n\n[h1]Additional Details[/h1]\n[table]\n   [tr]\n        [td]Operating System[/td]\n        [td]Ubuntu Linux 14.04 | 18.04 x64[/td]\n    [/tr]\n    [tr]\n        [td]CPU[/td]\n        [td]AMD FX-8350 | Ryzen 5 1500x[/td]\n    [/tr]\n    [tr]\n        [td]GPU[/td]\n        [td]GTX 750 | GTX 1050, nvidia-410.78[/td]\n    [/tr]\n    [tr]\n        [td]Game Saves[/td]\n        [td]Automatically[/td]\n    [/tr]\n    [tr]\n        [td]Notes[/td]\n        [td]Achievement counters do not seem to trigger properly – I probably killed a dozen deer before getting credit for killing 5[/td]\n    [/tr]\n    [tr]\n        [td]Technical Notes[/td]\n        [td]Unity game engine[/td]\n    [/tr]\n[/table]", "timestamp_created": 1561163056, "timestamp_updated": 1561163056, "voted_up": false, "votes_up": 92, "votes_funny": 5, "weighted_vote_score": "0.723605930805206299", "comment_count": 24, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1561219405, "developer_response": "Thanks for the post. Can you provide more detail of exactly what you were doing to see those spikes? What were your video settings? Did you try this test on the BETA build? Where in the game world were you?\n\nWith those specs you might be able to push 50+FPS on medium/high settings. Shadows can  also be a big hit on high running on a lower end card.\n\nLastly, did you follow these instructions for returning players? If not, you can see performance spikes as well due to changes that have taken place over the last 20 updates.\n\n[h1][b]Video Settings Update[/b][/h1]\n[b]RETURNING PLAYERS[/b] Due to some player/physics updates we made in Update 47 we do recommend taking the following steps to refresh your video settings:\n[list][*]Go into Options\n[*]Click Settings\n[*]Click Default\n[*]Click Apply[/list]\n\nPerformance is one of those areas we rarely have issues with or receive feedback on so additional information would be very helpful.  =)\n\nThanks!\n\n-Euryidium"}, "76016804": {"recommendationid": "76016804", "author": {"steamid": "76561198002011607", "num_games_owned": 641, "num_reviews": 48, "playtime_forever": 492, "playtime_last_two_weeks": 0, "playtime_at_review": 492, "last_played": 1600175178}, "language": "english", "review": "this game is about as dead as the dragon you see on the first tower. Bought this game back in 2015, can't say I see much if any improvements. Can however see that there's been a lot of updates. Just can't actually see them ingame.", "timestamp_created": 1600175251, "timestamp_updated": 1600175251, "voted_up": false, "votes_up": 49, "votes_funny": 5, "weighted_vote_score": "0.72139275074005127", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1600182881, "developer_response": "Thanks for post! We appreciate players returning to check out the game even if it was only for a few minutes. \n\n[quote] can't say I see much if any improvements.[/quote]\n\nOdd, a lot has changed from the legacy version you put a lot of time into back in 2015, everything from the assets in the world, 2X the content, layout of the world (4 islands not 1) UI and balance to the overall game engine and lastly a new developer. Do you have some more specifics? More details would really help us in our efforts to improve the game for our community.\n\nLet us know!\n\n-LBS\n"}, "25126995": {"recommendationid": "25126995", "author": {"steamid": "76561198117389999", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 329, "playtime_last_two_weeks": 0, "playtime_at_review": 208, "last_played": 1474915350}, "language": "english", "review": "First off I just want to say this game would have a better overall rating if people did two things.\n\n1) Got into character. You're a hardened outcast on an unforgiving, icy and hostile excuse for an island. The game is not going to hold your hand or tell you how to play. You'll struggle. It'll be hard. That's an ongoing theme for this game. Don't buy if you're weak of heart.\n\n2) Used Google (other search engines are available). There are a plethora of people who have posted negative reviews based on performance issues. I encountered a solitary hiccup that was easily fixed, and there is a host of info outh there for dealing with other issues. Not to mention the devs update the game on a bi-monthly/monthly basis. The bottom line is thzt this isn't No Man's Sky, the game works, just work with it.\n\nOn to the review: My pasty criminal scumbag by the name of WolfBait has yet to die. He has been bitten, stabbed, cursed bludgeoned, starved, frozen, poisoned and very nearly burnt alive by a grumpy dragon; but the poor bastard just won't die. How you might ask? He's not your average cutpurse. No, WolfBait is smart. He knows his enemies attack patterns, he brings plenty of healing for when he is sloppy and he balances his gear around mobility and DPS. He also runs away a lot. No one said he wasn't a coward. But when you play this game, you aren't a hero, you're the garbage society has tossed away, come to thrive in the dumpster. And I love every second of it. If you think you can make it, I recommend you give this game a try. \n\n8/10 Would be a dirtbag trash warrior again.", "timestamp_created": 1472107290, "timestamp_updated": 1472107290, "voted_up": true, "votes_up": 33, "votes_funny": 12, "weighted_vote_score": "0.719850242137908936", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "51110191": {"recommendationid": "51110191", "author": {"steamid": "76561198172424007", "num_games_owned": 3654, "num_reviews": 19, "playtime_forever": 4708, "playtime_last_two_weeks": 0, "playtime_at_review": 1915, "last_played": 1669328254}, "language": "english", "review": "Okay first off I do not see why this has gotten so many Mixed reviews, I've had this game for a while now  close to 3 years got it in a Humble bundle in October 2016. \n\nBut with so many games in my Library on Steam and at that time no one to Play with I put it away until a few days ago, don't get me \nwrong this game still needs work and can do with a few more Features.\n\nBut in its current Stage it has allot to do, and its fun to play but I would really suggest to play it with a Friend or two.\n\nI know people are going to say but it still has bugs, sure it does what do you expect from a game in Early Access. \n\nMe and a Friend happen to find a weird bug where he went through the bottom of the world and could not retrieve his stuff so he\nposted the bug on the Discussions here on Steam. \n\nAn in no time the Dev wrote back and asked to join our game to checkout the bug and retrieved all the items, so my point here is if people think this game is Dead or the Dev does not care about the player base then your wrong.\n\nSo do I recommend this game the Answer is yes.\n\nDo I think there are things that could be added or that need Fixed the Answer to that question is Yes too.\n\nFinally remember the Game is still in EA and still needs work but the Price is cheap at $9.99 US and you get allot of Game for that price.", "timestamp_created": 1559965581, "timestamp_updated": 1559965581, "voted_up": true, "votes_up": 40, "votes_funny": 3, "weighted_vote_score": "0.719261348247528076", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1560263416, "developer_response": "Thanks for the support and 35+ hours played! Glad I could resolve your issue and thanks again for your time and patience as I worked through it. \n\nIf you find any other unique issues or have feedback, just ping me.  =)\n\nStay Savage!\n\n-Euryidium"}, "21122653": {"recommendationid": "21122653", "author": {"steamid": "76561198047904881", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 31140, "playtime_last_two_weeks": 0, "playtime_at_review": 9571, "last_played": 1533224305}, "language": "english", "review": "Aight - Savage Lands, 130 hrs 1st 2 weeks = Freakin awsm. Moved to the beta branch around the 90 hr mark an havn't looked back. New content every time I load a map. This is one game that actually has good ninja updates with large and pre-announced weeklyish on the main loading screen. NPC's - Everything attacks on sight with a decent detection radius, blinding whiteout snowstorms, great graphic's, scaling enemies from pigs, bears, wolf packs, skellies, night furies, giants to a dragon [not implemented in beta yet] and really user friendly UI. There's no questline as of yet but just staying alive here keeps you on your toes, health, cold, stamina and hunger all need constant monitoring. Yea it's EA and beta so there's bugs but hey , what game doesn't have glitches here an there. and the thing is you can see them disappear on a daily basis, I have an old i5 and gtx560 which runs this fine. Map loading is vry fast, with player an map saves usable in SP or MP. I have been nothing but impressed with this game from the get go. Jumping in with no knowledge whatsoever of how things worked I starved, froze and was eaten to death in quick succession many times. so funny. Now I roam the lands in armor and weaponry looted from once feared adversaries that I spent the 1st night cowering from in a chanced upon hut - lol. The communities great, Dev's are obviously involved an keeping a close eye on things. There's a lot more I hav'nt touched on, you can find out for yourself. So yeah, no complaint's or regret's whatsoever here. I absolutely recommend this game", "timestamp_created": 1455181147, "timestamp_updated": 1455181147, "voted_up": true, "votes_up": 33, "votes_funny": 2, "weighted_vote_score": "0.718484640121459961", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "113675527": {"recommendationid": "113675527", "author": {"steamid": "76561197973620408", "num_games_owned": 564, "num_reviews": 51, "playtime_forever": 491, "playtime_last_two_weeks": 0, "playtime_at_review": 491, "last_played": 1446624766}, "language": "english", "review": "This looked familiar but I couldn't tell why.  it's a new game, right?\n\nWhy is it in my library?\n\n\"last played Nov 15th, 2015\"\n\nOh!  This is that broken unfinished game that the developers abandoned years ago.   Funny how it looks exactly the same as it did then.    It had potential from the start but they wasted it and left it to die.   Save your money and go play Valhiem or something else.", "timestamp_created": 1649656234, "timestamp_updated": 1649656234, "voted_up": false, "votes_up": 22, "votes_funny": 1, "weighted_vote_score": "0.717094480991363525", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "41989469": {"recommendationid": "41989469", "author": {"steamid": "76561198031530121", "num_games_owned": 1754, "num_reviews": 193, "playtime_forever": 295, "playtime_last_two_weeks": 0, "playtime_at_review": 280, "last_played": 1539822721}, "language": "english", "review": "As of May 11, 2018...\"Last Bastion Studios takes on the Savage Lands\"\n\nI was just about to uninstall this game fearing that it had been abandoned.  But, it has not.  The new team is hard at work fixing bugs.  Looking forward to future updates.\n\nhttps://steamcommunity.com/games/307880/announcements/", "timestamp_created": 1526093204, "timestamp_updated": 1531172448, "voted_up": true, "votes_up": 43, "votes_funny": 1, "weighted_vote_score": "0.715791285037994385", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1527437558, "developer_response": "Thank you!  We look forward to crafting Savage into a better game for all players. \n\nTime permitting check out the latest [url=https://steamcommunity.com/app/307880/discussions/1/1693795812291611946/]Game Update[/url] we recently released to the community. We’d greatly appreciate your feedback.  =)\n\nRegards,\n\nEuryidium"}, "18871432": {"recommendationid": "18871432", "author": {"steamid": "76561197962915256", "num_games_owned": 373, "num_reviews": 28, "playtime_forever": 1279, "playtime_last_two_weeks": 0, "playtime_at_review": 1229, "last_played": 1473673295}, "language": "english", "review": "It is a survival game, uh? Don't we have already bunch of those?\n\nCompared to other survival games that have shown up recently, this is only survival game that does not feel like a joke.\n\nPros:\n- First time playing, it is hard to stay alive, even if you try really hard.\n- Day night cycle is just right length.\n- You have to plan ahead, when to build shelter, when to get firewood, when to hunt etc... if you don't, well... lets say that the adrenaline I get from almost dying... is rewarding.\n- Crafting system is intuitive, no outside documentation needed.\n- Item repairing costs seems mostly balanced.\n- You never know how though the monster is that you are facing for the first time, until you win/die.\n- Savefiles are automatically saved in steam cloud\n- Community management of this company is 10 / 10 (not kidding)\n- I haven't found bugs in this game\n\nCons:\n- Combat system is too simple\n- No possibility to create dedicated servers\n- Work in progress (well duh, its early access, don't expect it to be a complete game just yet)\n- Game is based on older version of Unity game engine, thus performance is lower on Linux than on Windows, but game is still playable on \"fast\" graphics setting. (engine will be upgraded in far future)\n\n\nFirst time I played this game I was just happily running around until I froze to death.\nI once went mining for some ore at night. . . . ONCE.\n\n8 / 10\nAnd I want to believe it gets even better than that :3", "timestamp_created": 1446630100, "timestamp_updated": 1446630100, "voted_up": true, "votes_up": 39, "votes_funny": 6, "weighted_vote_score": "0.715637028217315674", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "17391666": {"recommendationid": "17391666", "author": {"steamid": "76561197960826568", "num_games_owned": 888, "num_reviews": 142, "playtime_forever": 107, "playtime_last_two_weeks": 0, "playtime_at_review": 86, "last_played": 1458056733}, "language": "english", "review": "[h1][u]The Good[/u][/h1]\nSavage Lands is an early access game that has a lot of potential, just as many games in EA do.  The game is already playable and enjoyable to some extent if you like a great challenge. The crafting system is well implemented giving you a wide variety of items to craft such as food, clothing, armor, weapons, and enough building designs for a small town if you can live long enough to gather all of the materials. The graphics look decent, not great.  The hands and the animation for eating need some attention. The gameplay is smooth for the most part and I did not run into any bugs during my time in game which hasn't been much.  The enemy AI also seems decent from what I have experienced so far. \n\n[h1][u]The Bad[/u][/h1]\nHowever, the game is plagued with the same faults that plague many survival games.  Savage Lands currently requires that you gather items at such a high rate due to hunger, cold, sickness, & injury that neither your desire to explore nor build is satisfied due to you ultimately meeting your doom if you choose to do anything other than search for supplies. Did I mention that you start naked so as you can imagine, inventory management is also an issue.  \n\n[h1][u]Note to the Devs[/u][/h1]\nThis game has a lot of potential. Howevr, I would like to see the following changes so people have a chance to explore, craft and enjoy this game as pve or pvp without the constant grind of resources being so vital. If the game presents itself as to much of a grind, people will be less like to play it after initially burning out on the contant grind for supplies. So making small changes could improve the gameplay experience while keeping the survival element in place to present a challenge other than the enemy AI and other players. \n\nFirst, the need to eat greatly reduced. People can go several days without food and water.  You should not need to eat every few mins to stay at peek stats. Every 30 mins to an hour would be more reasonable. Keep the need to eat more in line with other survival titles so people have more to do than just focusing on eating or building fires which leads to my next area for improvement. \n\nNext, the element of the cold environment which truely makes this game challenging, needs to be less harsh. For example, you become susceptible to illness which deteriorates your health at a slower rate, lets say 10-20 mins, rather than dying a few mins after hitting 0 on your cold meter if you can't get to or build a fire in time and get rest. Also, the torch should provide some warmth and so far as I can tell at the moment, it either does not or does very little.  If the cold is so severe in this environment, I would think we would have been better equipped upon being ship wrecked there.  Granted, so long as you have a hammer and an axe, building a fire is not too difficult, but my point is the current design is a bit much to truly enjoy the experience I believe is hinding in plain sight. \n\nLast, servers period.  I did not see any servers in the menu when I started my game so I hosted my own.  This may have been a bug but during my hour and a half of gameplay I did not have anyone join me.  This could have been due to firewalls, but honestly I do not know it the current build even allows one to join others accross the net.  Servers are needed for people to enjoy this game for co-op and pvp. \n\n[h1][u]Final Verdict[/u][/h1]\nI do recommend this game if you want a challenge and  understand this game is in EA and may turn out to be great or a great disappointment. Otherwise wait for the game to go on sale as I did or for the finished game prior to buying.", "timestamp_created": 1438733028, "timestamp_updated": 1443569293, "voted_up": true, "votes_up": 32, "votes_funny": 4, "weighted_vote_score": "0.714882314205169678", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "66816037": {"recommendationid": "66816037", "author": {"steamid": "76561198133261221", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 1062, "playtime_last_two_weeks": 0, "playtime_at_review": 1062, "last_played": 1585828819}, "language": "english", "review": "This game is the perfect example of a developer who hooks people on the line for cash and releases a broken game then strings them along for years not delivering any content.  Each \"update\" is really just inconsequential  like, \"improved armor texture\" woo hoo thanks how about fixing the actual game play? \n\n1, Game is tedious grind fest to rush through levels of armor and tools just to kill a boss then move on to new area only to do it all over again.  No NPCs or quests or any real exploring. \n2.Nothing you build has any sort of permanence. Why build anything permanent when you are just moving to new area in an hour anyway?\n3. Enemies vary wildly in difficulty. Some are ridiculously weak and under-powered with terrible AI. Others are so completely over-powered even with maxed (for each area) armor and weapons they are \"Dark Souls\" level of impossible to solo.\n4. Character customization is extremely limited .  Where are the women? \n5. Repairing other buildings gives very little if any remuneration.  You may restore a building but all the crafting tables needed for said repair are now scattered around the OUTSIDE of the building you just repaired.  Are we supposed to grind further make these crafting stations again to put them inside of the buildings?\n6. Too many crafting tables. I think I counted 7 different ones. Crafting needs to be more streamlined. \n7. Updating just to keep game relevant and tricking people into buying a game they have no intentions of finishing. \n\nI wish I hadn't given this game as much time as I did so I could get my money back. Unfortunately my friends and I tried again and again to like this game wishing this update would be the one that made the game sing.", "timestamp_created": 1586259714, "timestamp_updated": 1586259714, "voted_up": false, "votes_up": 60, "votes_funny": 5, "weighted_vote_score": "0.713164329528808594", "comment_count": 12, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1586276787, "developer_response": "If we were the original developers for Savage Lands your opening statement would be correct. But we are not. Sounds like you were not aware of the change that happened. No worries, we’ll give you the quick and dirty update.\n\nSince we (Last Bastion Studios) took over Savage Lands, as of this week, we have released over 75+ updates that have fixed over 1,833+ bugs, resolved major game crashes, improved performance (FPS) by over 60% on most machines, revamped the AI to offer more challenge and fluid gameplay, fixed the networking code so players can actually co-op again, re-balanced all of the gameplay, overhauled the visuals and added tons of new content. In short, a lot has been fixed and new content has indeed been added. Sorry if this has been repeated, apparently a lot of players did not know.\n\nMost of these changes came at the request of our dedicated community base (99% from the forums). Their feedback has been instrumental in reshaping gameplay, which if you played prior to LBS taking over was in a horrible/neglected state. We will continue to make the game better and give them more of what they want.\n\n[quote] 1, Game is tedious grind fest to rush through levels of armor and tools just to kill a boss then move on to new area only to do it all over again. No NPCs or quests or any real exploring.[/quote]\n\nLBS – The game is all about exploring, if you don’t you will not find the resources you need and you will die. There are no NPC’s because it’s not an RPG. Open world survival built around death and decay.\n\n[quote]2.Nothing you build has any sort of permanence. Why build anything permanent when you are just moving to new area in an hour anyway?[/quote]\n\nLBS – Everything has permanence, how you play Savage is entirely up to you. Rebuild or not. Fast travel has been added to the game (via new portals), making it easier to get around the various islands.\n\n[quote]3. Enemies vary wildly in difficulty. Some are ridiculously weak and under-powered with terrible AI. Others are so completely over-powered even with maxed (for each area) armor and weapons they are \"Dark Souls\" level of impossible to solo.[/quote]\n\nLBS – Difficulty ramps up with each new area. If difficulty seems wildly off, then chances are you are using armor not really designed for the new mobs in that location.\n\n[quote]4. Character customization is extremely limited . Where are the women?[/quote]\n\nLBS – With regards to female characters. Our focus (Last Bastion) has and will continue to be improving gameplay, tech, squashing bugs. These are the areas that matter most to the majority of players as they impact the core experience. Once the game is in a good place, we'll re-evaluate.\n\n[quote]5. Repairing other buildings gives very little if any remuneration. You may restore a building but all the crafting tables needed for said repair are now scattered around the OUTSIDE of the building you just repaired. Are we supposed to grind further make these crafting stations again to put them inside of the buildings?[/quote]\n\nLBS – I’m sure there are tweaks here. But this is the first complaint we have heard.\n[quote]6. Too many crafting tables. I think I counted 7 different ones. Crafting needs to be more streamlined.[/quote]\n\nLBS – Technically there are only 5. Each with a specific function important to the crafting process. These have been streamlined over time based on community feedback, there were more at one point.\n\n[quote]7. Updating just to keep game relevant and tricking people into buying a game they have no intentions of finishing.[/quote]\n\nLBS – If we had no intentions of finishing why even update it? We wouldn’t have spent 100s of hours fixing the game, just to let it die off. We took on the game so we could get it fixed and up running for players because we saw the potential. We are guessing you didn’t play the version of the game prior to our first update. It was a hot mess.\n\nThanks again for posting and sorry to hear you can’t get a refund. We do always highly encourage players to refund the game if dissatisfied.\n\n-LBS"}, "16431985": {"recommendationid": "16431985", "author": {"steamid": "76561198068329619", "num_games_owned": 719, "num_reviews": 357, "playtime_forever": 745, "playtime_last_two_weeks": 0, "playtime_at_review": 745, "last_played": 1454198559}, "language": "english", "review": "*Warning this is an early access game*\n\nSavage Lands is the more fantasy counterpart to Hitherland Studio's \"The Long Dark\".\n\nThe main goal like that game is to survive either by yourself or with a group of people. The only notable difference is you can team up with other players as you carve out a living in this world. The only negative issue about this game is the framerate. Unless you have a great PC rig, prepare yourself for a lot of lag and a lot of studdering about. I would like to add that the save system in this game is like the Long Dark, where there is none it is relied upon certain actions or exiting to the main menu, possibly when the days go by as well. (Now this part about the \"save\" feature, might change as well. If the developers decide to add a save feature).\n\nThe game also gives you a supplies list. For what you need in order to craft that particular object. (Now i say this now, but maybe the developers will get rid of this aspect in a future update. So this part of the review will probably change). This game isn't brutal like the Long Dark where every minute, second, hour could be your doom. But finding things in this world could take a while to find. So consider that to be your \"every x could be your doom\".\n\nThis game has modding potential. But in my opinion, if this game is tuned just right. You won't probably need mods for this game. Maybe translation mods, but not actual mods.\n\nThe developers like Hitherland Studios. Are very active and supportive of their fanbase. If you have any suggestions, issues, etc. Ask them and they will answers\n\n\nIf you love Hardcore survival games particuarly taking place in a fantasy setting. This game is a recommend.", "timestamp_created": 1434415244, "timestamp_updated": 1531115035, "voted_up": true, "votes_up": 30, "votes_funny": 2, "weighted_vote_score": "0.712968528270721436", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "14806846": {"recommendationid": "14806846", "author": {"steamid": "76561197970611380", "num_games_owned": 694, "num_reviews": 19, "playtime_forever": 217, "playtime_last_two_weeks": 0, "playtime_at_review": 209, "last_played": 1452367243}, "language": "english", "review": "If you buy this game, make sure you do while it's on sale. In its current state, $25 is going to feel like a bit of a stretch. \n\nHere's the concept - It's Elderscrolls meets Rust. I think this is a good thing. \n\nWhile it's early access, most of the visuals are pretty good, with the exception of a few things that I would consider placeholders. \n\nThe combat is a bit wonky and clunky; the mobs have a melee range that is crazy. Overall, the system needs some work and that should be expected in a lot of these games. \n\nMy friend and I were having a good time and progressing until we ran into a bug with the storage box and that basically put an end to the session. I'm usually extremely cynical about Early Access games and think that is how most consumers should be, but I've already gotten my investment down to ~ $5 per hour of entertainment so far could probably get more. \n\nSo there you go; in it's current state I wouldn't pay more than $15, but picking it up cheaper than that would be worthwhile. \n\n", "timestamp_created": 1425899235, "timestamp_updated": 1425899235, "voted_up": true, "votes_up": 119, "votes_funny": 10, "weighted_vote_score": "0.711133480072021484", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "19399629": {"recommendationid": "19399629", "author": {"steamid": "76561198082242940", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 2428, "playtime_last_two_weeks": 0, "playtime_at_review": 1355, "last_played": 1544683422}, "language": "english", "review": "I don't have a lot of experience with these kinds of game, but this one got me hooked. I was at the 10-hour mark and I was feeling good. I had built a couple of houses and had 6 boxes filled with goods. I thought I was in good shape and I was very confident. I had a weapon that did 24 damage and some leather armor. So thinking I could take on everything I went exploring. Well a chase from a dragon fighting a pack of dire wolves at the same time as a dire bear, dying to have to run so far to get my body. It dawned on me that I was not so ready. I have played this game for about 15 hours and I can say I want  to play many more. \nPros \naddicting \nbig world\ngathering resources is fun\ndifficulty seems fair\ncons \nnothing really because this is still in alpha\nthings I would like to see\nI would love NPCs that you can recruit and have them help you gather or follow and help fight\nI would like to see some sort of crops that can be farmed\nI also would like a lot more customization to building. I would like to clear areas and make my own little village.\nOver all \nthis is a great game that seems to be on the right path. I have not seen too many bugs just a few animals seem to jump. but other than that nothing really. the developers seem to care about the game with regular updates", "timestamp_created": 1448924011, "timestamp_updated": 1448924011, "voted_up": true, "votes_up": 67, "votes_funny": 11, "weighted_vote_score": "0.710295617580413818", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "35198622": {"recommendationid": "35198622", "author": {"steamid": "76561198041733106", "num_games_owned": 498, "num_reviews": 19, "playtime_forever": 19, "playtime_last_two_weeks": 0, "playtime_at_review": 19, "last_played": 1472284677}, "language": "english", "review": "Devs left this game, and so should you. DO NOT BUY IT PLEASE", "timestamp_created": 1506327621, "timestamp_updated": 1506327621, "voted_up": false, "votes_up": 44, "votes_funny": 0, "weighted_vote_score": "0.709845960140228271", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "16092176": {"recommendationid": "16092176", "author": {"steamid": "76561198042365091", "num_games_owned": 219, "num_reviews": 26, "playtime_forever": 4511, "playtime_last_two_weeks": 0, "playtime_at_review": 3965, "last_played": 1572768716}, "language": "english", "review": "This game had so much promise...\nThe setting was nice, it was a neat, grim twist to the entire \"oooh you're in the big beautiful wilds\" idea.\nBut then they pulled the move that stigmatized early access overall and abandoned the game without any sign of return.\nShame on you, developers.\nYou tossed away a wonderful opportunity to make a great game.", "timestamp_created": 1433052880, "timestamp_updated": 1517395845, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.709275960922241211", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "22908270": {"recommendationid": "22908270", "author": {"steamid": "76561198113989174", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 21088, "playtime_last_two_weeks": 0, "playtime_at_review": 16716, "last_played": 1568608094}, "language": "english", "review": "Savage Lands, What a Huge Dissapointment. I've played for almost three hundred hours and have accomplished nothing except waisting my time on a bad build. Animals still glitch out sinking into the mountains. Still cannot kill KUR. Love the concept and would love the game, but there has to be a resolve. It was a great game with a great concept. I'm not fully understanding the updating when the updates are making this great game worse. Weapons suck compared to enemies, Armor sucks compared to enemies damage. How can you build dragon scale armor if you can't kill the dragon. The hunger aspect sucks. It's hard to enjoy the game when you spend two hours hunting for food to run out in 10 minutes. I have to hunt for the game host since they can't hunt on there own, due to the animals running from the  host. Animals kick wooden chest all over the place even inside a building. Can't build where I want or need to. Way to much sinew and hide. trash been is working better, but takes too long to empty and you can't get rid of your heads off your dead bodies. I could list alot more... I don't cheat on games. Is that what I have to resolve to just to play this game. What a joke.", "timestamp_created": 1462958307, "timestamp_updated": 1462958307, "voted_up": false, "votes_up": 81, "votes_funny": 3, "weighted_vote_score": "0.707590579986572266", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "14798120": {"recommendationid": "14798120", "author": {"steamid": "76561198033057945", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 1186, "playtime_last_two_weeks": 0, "playtime_at_review": 985, "last_played": 1664180445}, "language": "english", "review": "Game Review for Savage Lands early Release 0.2.6\n\nCons\n    -Random spawning without admin controls to bypass\n    -Difficult \"if you dont like that kind of thing\"\n    -Graphics are a bit dated (vegetation wise) \"the art for the sky and sunset is balls to the walls amazing though\"\n    -Running up hills causes you to collide with environment \"worst bug in game IMHO, And obiously will be fixed by release\"\n    -Not quite optimized yet \"bust out your good videocard\"\n    -No clear purpose or story element \"your marooned on an island... cool, now what?\"\n\nPros \n    -Hit boxes are solid \"no guessing where you need to attack or dodge when fighting\"\n    -Crafting is satisfying \"large list of craftable armors, weapons, and buildings with stuff still being added\"\n    -Aweasome environment, \"captures the feel of an island off the coast of Scottland or something awesome\"\n    -RPG element.\n    -Craftable spawn points \"for when the dragon kills you\"\n    -Persistant character save over different servers\n    -Dragon!\n    -Undead Stuff (wolves, skeletons)\n    -Dragon!!\n\n     The game has the look and feel of an Elderscrolls game, it needs magic and projectiles but we have been promised this and more. The graphics aren't top of the line (minecraft anyone) but with this kind of solid gameplay from a game that updated already with countdowns to next release, I cant help but indorse it. 15 hours into this game and i've already had adventure after adventure with strangers from the web and friends i know in RL. There is currently a lack of any questing other than a page of to-do's that one should try when first arriving, but this only leads to the assumption that the devs are going to install some sort of purpose for the character for being on the island other than a marooning. most likely this will be a quest line and series of bosses. I definitley indorse this game for merging RPG elements with the craft/survive genre, and I cant wait for the release of the dev promised bow and arrow! :DD\n\n     Buy this game if you like the Survival crafting games like Rust, and H1Z1 but are looking for a more fantastic theme like Skyrim. $25 for the game seems a bit steep for how much content is offered so far but it is alpha early access and if the devs put half as much content in this as bethesda did skyrim i would shell out a full price $60, but there just isn't that kind of content yet. craft, survive, and fight monsters is as far as the devs have really gotten. Nailing down a solid game before gorging it with content seems to be the path Digital DNA is taking.", "timestamp_created": 1425841086, "timestamp_updated": 1426252710, "voted_up": true, "votes_up": 58, "votes_funny": 3, "weighted_vote_score": "0.706187665462493896", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "20049314": {"recommendationid": "20049314", "author": {"steamid": "76561198186187835", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 21082, "playtime_last_two_weeks": 0, "playtime_at_review": 1692, "last_played": 1693763137}, "language": "english", "review": "Right from the beginning I was hooked. Love the atmosphere, the sounds and feel of it are great. The building and survival aspects are just what I was looking for, coupled with the combat and co-op games even make it better. Yes, there are a few things that need to be tweaked, but it's an early access, so give them time.\n\nA couple of things I hope they might consider.....the food intake doesn't seem that even, I seem to be needing to eat way too often and yes I know it's cold, but I took winter survival training in the Army and never ate that much. Would love to maybe add a sleep option at night, the chance to build outer walls or mini palisades with a gate and for a few of my female gaming friends the option to have a female character seems to be on their minds. I'm sure they have a great many things they are working on and I am looking forward to each and everyone. \n\nAll in all, a great game to explore, build in and share with friends or just visit other peoples worlds. Keep up the great work.", "timestamp_created": 1451343845, "timestamp_updated": 1451343845, "voted_up": true, "votes_up": 30, "votes_funny": 0, "weighted_vote_score": "0.703471839427947998", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "30141071": {"recommendationid": "30141071", "author": {"steamid": "76561197989438558", "num_games_owned": 291, "num_reviews": 5, "playtime_forever": 14819, "playtime_last_two_weeks": 0, "playtime_at_review": 6232, "last_played": 1545340363}, "language": "english", "review": "[h1] Still needs alot of work. [/h1]", "timestamp_created": 1487943122, "timestamp_updated": 1516983131, "voted_up": false, "votes_up": 48, "votes_funny": 1, "weighted_vote_score": "0.702893733978271484", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "31851138": {"recommendationid": "31851138", "author": {"steamid": "76561198054791023", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 176, "playtime_last_two_weeks": 0, "playtime_at_review": 176, "last_played": 1454633913}, "language": "english", "review": "Devs, You took our money, and went and made Toy Soldiers with it. Now that nobody's buying this game, you \"Pause\" developement on this, abandon Toy Soldiers which is still a huge buggy mess, and say you have other obligations.  Your Obligations are to finish a game first, before moving on.   Not only have you harmed your reputation for future products with not one, but two **** you's you have harmed the reputation of Every EA developer, even those who are doing EA right.", "timestamp_created": 1495244768, "timestamp_updated": 1495244768, "voted_up": false, "votes_up": 39, "votes_funny": 0, "weighted_vote_score": "0.700090110301971436", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}}, "query_summary": {"num_reviews": 8, "review_score": 5, "review_score_desc": "Mixed", "total_positive": 2342, "total_negative": 2061, "total_reviews": 4403}, "cursors": {"AoIIPwHv2Hj85+ME": "Mon Apr 22 23:49:14 2024"}}
