{"reviews": {"161813013": {"recommendationid": "161813013", "author": {"steamid": "76561197984696531", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 1155, "playtime_last_two_weeks": 0, "playtime_at_review": 1155, "last_played": 1684535131}, "language": "english", "review": "Devs lied about keeping WU in lockstep with development of WO.\r\nDevs abandoned this game years ago.\r\nDevs still have this up for full price.\r\n\r\nI fail to understand how copy-pasting files from WO to WU is such an exhausting undertaking, but thats neither here nor there.\r\nDevs know that monthly subscriptions far outpace single purchases, therefore WO gets \"updates,\" and WU gets thrown aside.\r\nThis is the singular reason for abandoning WU, there are no others.\r\nDo not buy this game, and do not sub to WO.", "timestamp_created": 1711814102, "timestamp_updated": 1711814102, "voted_up": false, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.580677688121795654", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158402211": {"recommendationid": "158402211", "author": {"steamid": "76561198007517088", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 12152, "playtime_last_two_weeks": 0, "playtime_at_review": 9743, "last_played": 1709400627}, "language": "english", "review": "Great game.  Like Advanced Minecraft.", "timestamp_created": 1708032818, "timestamp_updated": 1708032818, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.54988783597946167", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161015492": {"recommendationid": "161015492", "author": {"steamid": "76561198284145888", "num_games_owned": 155, "num_reviews": 25, "playtime_forever": 4181, "playtime_last_two_weeks": 0, "playtime_at_review": 2694, "last_played": 1711760004}, "language": "english", "review": "Overall, I like Wurm Unlimited, but it's got enough issues that'll make it a pass for a lot of people.\r\n\r\nIt's gameplay is something similar to what I've seen described as 'peasant simulators' - other members of this category would be 'Vintage Story' or 'TerraFirmaCraft'. It's characterized by slow-based, gradual progress - it makes it feel rewarding when you finally manage to set up a shed after three hours, but those three hours are pretty grueling, especially if you're playing alone.\r\n\r\nIt gives off huge 'dead game from 2001' vibes, and it is if you explore some of the empty servers, but there's a handful (5-ish?) of servers that have 20-50 people on at any given time. You can also make a singleplayer world and do that if you don't want to build in the ruins of a dead server/town on an active server. I think the game would be a lot of fun to play with a crew of friends.\r\n\r\nThe game isn't quite abandoned - the developers are still around - but they've been focusing on Wurm Online (the MMO that Wurm Unlimited is based off) and have openly stated that they're done releasing updates for Unlimited. In other words; as far as features go, what you see is what you get unless you play on a server with mods.\r\n\r\nTL:DR; High-effort, slow-pace game. Not dead, but no longer actively updated. Feels like 2001 game. Best played with friends. Try to buy it on sale, or if your friends are willing to buy with you; it can be worth-full price if you're a fan of the 'peasant simulator' genre.", "timestamp_created": 1710962032, "timestamp_updated": 1710962032, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "157708401": {"recommendationid": "157708401", "author": {"steamid": "76561198159847514", "num_games_owned": 24, "num_reviews": 5, "playtime_forever": 177682, "playtime_last_two_weeks": 0, "playtime_at_review": 177659, "last_played": 1707221471}, "language": "english", "review": "This game is fun for everyone. It may be a little behind in graphics, but it has everything for the casual minded, and the adventurous folk!", "timestamp_created": 1707219729, "timestamp_updated": 1707219729, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.508928596973419189", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158888500": {"recommendationid": "158888500", "author": {"steamid": "76561198052265528", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 2541, "playtime_last_two_weeks": 0, "playtime_at_review": 2541, "last_played": 1708520744}, "language": "english", "review": "I can't recommend a game this grindy to anyone.  I used to be an old Ultima Online player, but even this is too far.  I'm sure my character is still trying to kill a chicken with a sword for the first time, and it's already been 15 minutes while I watched tutorials on youtube, of which left me further discouraged.  I would highly recommend you check online videos to see if it's something you truly want to waste your time on.  There are so many options out there, I'd hate to see you give your soul to this.", "timestamp_created": 1708520952, "timestamp_updated": 1708520952, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.507264673709869385", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "162177471": {"recommendationid": "162177471", "author": {"steamid": "76561198015076176", "num_games_owned": 4073, "num_reviews": 27, "playtime_forever": 2764, "playtime_last_two_weeks": 0, "playtime_at_review": 2764, "last_played": 1504894206}, "language": "english", "review": "This is almost closer to an ugly art piece than a game. The grind is truly extreme and the crafting of even simple items is very complex. I spent more than 24 hours working on a ship before the village I joined outed themselves as a bunch of racists so I packed my belongings into a cart and wandered off to start a new life elsewhere. Still, it's somehow compelling enough to recommend it.\n\nIf you get this, get this from somewhere cheap. The price they're charging is obscene.", "timestamp_created": 1712227913, "timestamp_updated": 1712227913, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502074718475341797", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "162439831": {"recommendationid": "162439831", "author": {"steamid": "76561198036792088", "num_games_owned": 0, "num_reviews": 27, "playtime_forever": 2124, "playtime_last_two_weeks": 0, "playtime_at_review": 2124, "last_played": 1712520800}, "language": "english", "review": "There is no reason at all to buy this game since its no longer being updated and some of these are pretty significant. \r\n\r\nI advise to try other games like medieval dynasty or 7d2d.", "timestamp_created": 1712522455, "timestamp_updated": 1712522455, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "28174542": {"recommendationid": "28174542", "author": {"steamid": "76561198042627636", "num_games_owned": 168, "num_reviews": 4, "playtime_forever": 148155, "playtime_last_two_weeks": 0, "playtime_at_review": 46892, "last_played": 1708884403}, "language": "english", "review": "I really wanted to make this review, because it seems that people aren't actually playing the game enough and taking it at face value... When i first started the game, i spawned into a somewhat populated server. I wandered around wondering what the game was about and how to even begin to play. I was seriously considering refunding the game. But i didn't. And you know what? It's one of the best decisions I have ever made.\n\n      This game is incredibly deep and fun when you get the hang of it. Want to build a city with an npc trader and hire npc guards to defend it? You can do that. Want to Become a king and found your own kingdom while slaughtering your enemies? You can do that. Want to fight a dragon or a giant cyclops? You can do that. Want to sail the oceans and ascend to godhood? You can do that. There are over 50 different skills from which to base a profession on and perfect your craft, and nearly every skill has a couple or more sub-skills branching off from it.\n\nThere are so many things you can do in this game and I challenge ANYONE to show me a game that has more depth and variety than this one does. Yes it's old, yes it's clunky. It's a dated game but it has survived for over 10 years, surely there's a reason for that. It still recieves frequent updates as well. A new cooking update is even coming out that adds over 500 recipes!\n\nIf this game has piqued your curiosity at all, Please please please look past the graphics and join the community. There are servers with more than 50+ players. Or, if you're looking for a smaller server that will take the time to teach you the basics, please dont hesitate to ask me.\n", "timestamp_created": 1480818590, "timestamp_updated": 1480818590, "voted_up": true, "votes_up": 187, "votes_funny": 1, "weighted_vote_score": "0.943671822547912598", "comment_count": 36, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "19554024": {"recommendationid": "19554024", "author": {"steamid": "76561198020557953", "num_games_owned": 0, "num_reviews": 24, "playtime_forever": 6756, "playtime_last_two_weeks": 0, "playtime_at_review": 1795, "last_played": 1634084951}, "language": "english", "review": "So I have played a lot fo survival games. This is one of my favorites now. Life is Feudal has a lot of ideas that are similar. \nI played Wurm Online a bit, but hated all the griefers. It felt more like a second job with a bad boss and co-workers who thought you needed a good backstab for doing your job properly.  LOL\n\nThis allows me to play with people I can trust. I even found a couple of decent community servers. It is quite fun, if not \"all your time\" consuming. \n\nPeople getting crashes, 99% likely you need to go to your LaughConfig.ini and make these changes:\n[spoiler] \n[Runtime]\nOverrideDefaultJavaPath=false\nJavaPath=\n[Memory]\nInitialHeap=1024m\nMaxHeapSize=4096m\n[VMParams]\nJvmParam0=-XX:+AggressiveOpts\n[/spoiler]\n:Or whatever amount of RAM you (want to/can) assign. \n\nSome of the features I like are : \n[list]\n[*]Weather, including Seasons\n[*]Too many skills to master\n[*]Customizable dedicated servers\n[*]Voxel landscapes\n[*]Combat can be hard without decent gear\n[*]Building my own place\n[*]You build everything, which makes it feel real, IMHO\n[*]You can get lost in the wilderness and it FEELS like you are lost\n[*]The Long Game\n[*]Community is openm and mostly not condescending, but are slow to respond because they are PLAYING\n[/list]\n\nThings I don't care for:\n[list]\n[*]Next to no documentation, even with strong google-fu\n[*]When there IS documentation, it becomes educated guesswork, because it is written by people who know how already\n[*]IF your not educated in map making, SQL, and/or server maintanence, you'll likely be lost\n[*]Textures can be a bit dated \n[*]Mods are just coming along, wish we were 9-12 months into the mod cycle already, LOL\n[/list]\n\nI seriously recommend this game to survival players. The learning curve is steep, but makes sense in most cases. \nWhich means it is closer to reality than most of the games I've played.  \n\n", "timestamp_created": 1449521331, "timestamp_updated": 1449521331, "voted_up": true, "votes_up": 271, "votes_funny": 29, "weighted_vote_score": "0.91862642765045166", "comment_count": 26, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "18653572": {"recommendationid": "18653572", "author": {"steamid": "76561198040144298", "num_games_owned": 420, "num_reviews": 7, "playtime_forever": 27265, "playtime_last_two_weeks": 0, "playtime_at_review": 5403, "last_played": 1590951524}, "language": "english", "review": "Basically I have played Wurm for years and this being here on steam is a big step. With a larger community and limitless sandbox configuration this game doesn't have promises, it gives you EXACTLY what you are looking for if you can work for it.\n\nPros\n* Completely FREE to PLAY after the initial purchase now!\n* Build ANYWHERE you can see.\n* VERY in depth crafting and leveling system\n* Like I said I have played WO(wurm online) for years before WU(Wurm Unlimited) and I still haven't ran out of things to do\n* Hardcore loot(drop everything upon death)\n* Very in depth religous system\n* Completely stat based\n* PvP (Ive got better stats and lets hope higher quality gear than you)(Or friends)\n* Now you can alter skill gain modifiers!\n* Very quick hotfixs and updates OFTEN throughout 12 years, yes 12 YEARS\n* Very social based, in game currency to upkeep deeds and trade(\"free currency\" you need to trade host made npc's for it)\n\nCons\n* VERY DIFFICULT\n* Steep learning curve(Mount Everest)\n* Lacking Combat system(All automated skill based)\n* Graphics(The gameplay for most to all makes up for this)\n* Current bugs both client and serverside with release\n* greifers\n* addicting\n* Very Addicting\n* Easy to get lost(both physically and mentally)\n* Requires self devotion to figure things out on your own.\n\nI can go on and on, but honestly all you need to know is that it is stat based, a very hard game to get at first but with experience you learn to love it, and master the land. you'll read reviews about how people spent 5 minutes to kill a chicken 1 hr played total... or how bad the graphics are... look if you judge this game too early youre going to hate it. It is HARD FOR A REASON, these people want easy and their hands held every moment of their gameplay experience and compare this game to things that have absolutely NO comparison, ex ARK, Rust, or any \"new\" survival game that comes out. I just want to get this point across, these games are a fad just like Dayz, a WoW expansion, where you move on and may or may not go back to those games. Wurm has been out for 12 years and its here on steam? Its staying strong and with a larger community on steam you can immagion how great that is to not only me but you as well to enjoy, in my opinion one of the best games ever made in history. also use wurmpedia...(all questions forever answered)\nThis has been the most honest thing I've ever written on steam thanks for reading though!", "timestamp_created": 1445676684, "timestamp_updated": 1445676684, "voted_up": true, "votes_up": 205, "votes_funny": 13, "weighted_vote_score": "0.915464937686920166", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "35263670": {"recommendationid": "35263670", "author": {"steamid": "76561198044544701", "num_games_owned": 0, "num_reviews": 33, "playtime_forever": 437874, "playtime_last_two_weeks": 0, "playtime_at_review": 129349, "last_played": 1607283640}, "language": "english", "review": "Welcome to a game older than Minecraft, built by the same person at some point.\n\nThats a huge generalization to make, but it describes it aptly.  In Wurm Unlimited, you can build, fish, cook, fight, do whatever you wanted to do in Minecraft, except more fleshed out.  You can do more.  It takes more time.  This is a game that feels realistic in its approach to the medieval sandbox, and makes that its staple drawer.  It will not attract casuals by any chance, however this game tends to breed gamers who are generally more down to earth and patient than most.\n\nYou may make some trusted friends.  You may enjoy relaxing here after a long, hard day of work.  Who cares you only cut down a few treees and sawed em up today?  You can get it done tomorrow.  And its that kind of relaxing game ethic that really makes Wurm Unlimited shine in a way that I never really got to see other sandboxes do.\n\nWurm Unlimited.  Beyond the price tag, there is nothing more to pay than whatever time you wish to throw into it. :)", "timestamp_created": 1506609887, "timestamp_updated": 1506609887, "voted_up": true, "votes_up": 247, "votes_funny": 5, "weighted_vote_score": "0.902297556400299072", "comment_count": 21, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "59846606": {"recommendationid": "59846606", "author": {"steamid": "76561198069052257", "num_games_owned": 204, "num_reviews": 4, "playtime_forever": 584807, "playtime_last_two_weeks": 4584, "playtime_at_review": 309701, "last_played": 1713029617}, "language": "english", "review": "Wurm used to be my favourite game 100% for years. It's probably my most played game currently on steam. \nLots of people aren't going to like this game. This isn't a game that gives you immediate results- you have to work for them depending on the server you're on. If you want fast results, go to a server with faster skill and action timers. \nI've had many deeds, I've bred many animals, planted many forests, flowers and hedges, built many houses and fought many dragons as well as made quite a few friends along the way (along with owning my own server and teaming up with several other servers for long bouts as admin)-- wurm is just one of those games that give you something other games can't-- this different sense of community. \n\nBut this is why I'm not playing wurm right now and possibly ever again. \nWurm online has been taken on by another team that has swayed the original (what's left of them) team to shaft Wurm Unlimited and put a stop to ever updating it again. They have literally put it into the hands of modders and refused to give them a workshop. Instead they're going to \"make it easier to mod\". Mods were already scarce as it was in comparison to other games with workshops. Checking the forums once a month- it was rare to ever see a new mod let alone an update on one. With that line of update flow this game is destined to die. \n\nThere are only a few servers left that the actual server owners make their own modded content actively and if you don't approve of how staff runs things (server owners faking their server population in order to get more traffic, server owners not caring about their players, server owners allowing their staff to grief their players, server owners banning people unreasonably, server owners abusing their staff, server owners who have loads of old content that wurm online doesn't have but never sign on or update anymore, etc ) or like playing on those exact settings-- you really don't have a place here. \n\nI can't in good faith recommend this game until I see results with the team at this point. They wont be fixing the terrible server list UI, any fixes with the game after the big fix will have to be done by modders, and the heavy optimization that wurm online just had-- wurm unlimited will never see that. It'll always ALWAYS be terrible performance (yes, your pc will groan from how much memory this game eventually starts to take up after running it for a while)\n\nTo boot they're doing all of this because they want wurm online to be exclusively played. From a developers standpoint that seems fair but so many people have already invested time and money into this game. Not everyone wants the even slower more painful vanilla experience grind- 'specially if they don't have the entire day to waste away in order to do it. (yes, the vanilla version of this game is painful from both an experience and wallet point)\n\nFeel free to play if you don't mind never seeing the new content that wurm online is getting. Buying after now-ish will seem confusing if you're switching from wurm online to wurm unlimited. 'Specially if you've experienced the updates from in between now to whatever date it is. But I don't have high hopes for this game anymore. I've switched my attention to modded Conan Exiles until I can see staff holds up to their promise but it all looks like sh*t show from here. \n\nAnd yes, if I see results I'll update my post.", "timestamp_created": 1576343086, "timestamp_updated": 1576343086, "voted_up": false, "votes_up": 130, "votes_funny": 5, "weighted_vote_score": "0.899619400501251221", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "32171183": {"recommendationid": "32171183", "author": {"steamid": "76561198101435692", "num_games_owned": 0, "num_reviews": 44, "playtime_forever": 6627, "playtime_last_two_weeks": 0, "playtime_at_review": 6351, "last_played": 1470942970}, "language": "english", "review": "TL;DR: This game caters to a very specific group and, at no fault of the game or creators, you don't fit in that group, you won't like this game. If you are a part of this group, expect to get thousands of hours of gameplay out of this game.\n\nAfter a hundred hours of this, unfortunatly, i had to give up. As I started, I had grand dreams of building a nice little house by the lake. Perhaps it's still there, but I doubt it's stood the test of time (things degrade if you don't take care of them). As I sat by my campfire and my tent, leveling the side of the hill next to the water, molding wet balls of dirt into bowls and pots for water, I developed a dream. I dreamed that I could make it big as a potter. \n\nI would work and work and work, walking down the road to the nearest clay deposit, only a five minute walk away, dragging my massive cart behind me (I was waiting for the day I could afford to buy a horse). I would wet and mold the clay into beautiful earthenware, load all of that up on my cart, and drag it all the way down to the market, a half hour walk with the weight of my cart and lack of a horse.\n\nBy this time, my house was half way built. All I needed was to trade my pots for gold and that gold for nails. I was confident that, eventhough I was good yet, my pottery would be enough for a handful of nails with which to build my walls. This was when my dreams of being a simple potter were dashed.\n\nThe game is so poorly blanaced that the merchents never had any money or anything you need. Ever. It's a cold day in hell when youre the first one after a merchent get's a shipment of gold and then it's a cold day in hell again when they have anything you need. This means that trade is bogus and pottery is useless. You have to do eveything by your self.\n\nThe community is friendly. Friendlier than any other survival game you'll ever play, I'd bet my life on it. But there's not nearly enough of them. And without the merchents to give my useless pots meaning, all my dreams and all my work was for nothing. At least I got a pretty house out of it.\n\nBut without money, I can't pay the tax on owning land. And if I don't pay the tax, my house will fall apart right before me. And once I built my house, which was what took me a hundred hours, and it's a hundred hours I will alway fondly remember, there was nothing else for me to do.\n\nMy life became farming some crops, tending to some animals, all so that I could feed myself, though I don't think hunger can kill you, only slow your skill gain, but still. Monotany. All so I could farm and farm and farm, until I ran out of the small amount of gold I had managed to scroung, there was no way I could ever face a monster and live long enough to loot it's pockets. I was doomed to watch my pretty little house, and the dreams of my eathenware empire, fall apart around me.\n\nWurm is about player driven stories and histories. I only wish mine where a happy one.\n\nIf you're the kind of person who loves to grind and grind and grind, with outdated graphics and text based gameplay, for the chance to roleplay every once in a while, this is the game for you. I thouht it was for me as well, but maybe in another life, if I had picked it up when it was new instead of playing Minecraft like everyone else, this would be a different story. But it's not.\n\nI'm sorry, Wurm. It's not you. It's me.", "timestamp_created": 1496565834, "timestamp_updated": 1496565834, "voted_up": true, "votes_up": 143, "votes_funny": 16, "weighted_vote_score": "0.896673440933227539", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "18709805": {"recommendationid": "18709805", "author": {"steamid": "76561198000068552", "num_games_owned": 348, "num_reviews": 19, "playtime_forever": 196902, "playtime_last_two_weeks": 552, "playtime_at_review": 87516, "last_played": 1713071912}, "language": "english", "review": "10/10/17 update: I've made some minor additions to my review to account for new features of the game.\n\nI love this game.  That said, there are some things you should know before you buy it, or else you set yourself up for disappointment.  Most of the negative reviews are from people who didn't know these things before they purchased the game.  That just means the game wasn't meant for them, not that there's anything wrong with the game.  \n\nFirst, and most importantly, this game does not hold your hand and guide you through how to play.  Exploration and discovery are part of the game by design.  You get a few popup messages explaining some basic concepts, but then you're on your own.  Plan on spending a healthy amount of time on the Wurmpedia looking up how things work, or you will find yourself disappointed and frustrated.  Alternatively, if you like a challenge, it's possible to discover how things work on your own by trial and error, but not many people can do that.  (10/10/17 Update: This also adds to the feeling of accomplishment when you finally build up your settlement as you want it.)\n\nSecond, the graphics are not visually impressive.  Some of the graphics are from as long ago as 2006.  They serve a function, and that's it.  If you buy this game expecting AAA modern graphics, you will be disappointed.  Don't expect much from the graphics.  (10/10/17 Update: There has been a graphical upgrade recently, but it's still far from AAA graphics.)\n\nThird, this game is *deep* and can be overwhelming for some.  If you get the chance, take a look at the Skills window and browse through the list.  (10/10/17 Update: There are over one hundred of them.)  Every one of those skills is implemented into the game and affects what you can do in it.  There are also a few actions that don't have an associated skill.  If I haven't convinced you to devote time to browsing the Wurmpedia already, this is a very good reason to do that.\n\nFinally, this game is about survival in a medieval fantasy setting, not about action.  Don't expect much from combat.  Combat is pretty much just targeting something and just making sure you're the right distance from the target to effectively fight.  Instead, enter the game with the expectation that you'll have to \"work\" towards building your home and training hard enough to put up a fight against hungry spiders, and that the game will reward you by allowing you to make your permanent mark on the game world.  \n\nYour actions have lasting impact in Wurm.  Long after you stop playing on a public server and the buildings you constructed start to crumble, other players will be able to explore the ruins of your settlement and discover what you did there.  If you play on a server that has been around long enough, you can do the same, and it's pretty fun.  (10/10/17 Update: The upcoming Archaeology and Restoration skills will enhance this feature once they make it into the game.)\n\nIf you're still wondering whether this is the game for you, just try out the MMO version of this game, Wurm Online.  It's free to play, if you don't mind the level 20 skill cap, or you can pay to go premium, which unlocks higher skill levels.  Wurm Unlimited is essentially an official private server for Wurm Online, so if you find that you like Wurm Online, but either can't afford to spend money each month on premium and deed upkeep, or don't have the time to invest regularly into it, then Wurm Unlimited was made for you.", "timestamp_created": 1445946960, "timestamp_updated": 1507682696, "voted_up": true, "votes_up": 109, "votes_funny": 1, "weighted_vote_score": "0.891232967376708984", "comment_count": 12, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "18604549": {"recommendationid": "18604549", "author": {"steamid": "76561198012298343", "num_games_owned": 0, "num_reviews": 29, "playtime_forever": 5841, "playtime_last_two_weeks": 0, "playtime_at_review": 3250, "last_played": 1489524974}, "language": "english", "review": "Wurm Unlimited really is a game unlike any other in feel. When it says you can go anywhere and do it; you can. Now that the game is available off of the official servers it takes that tagline and runs even further with it. This offline version will not only offer the go anywhere, do anything mentality it will also offer moddability and innovation.\n\nThe game is written in Java and the code is thus far unobfuscated. This means that any modding community that crops up, and we're already seeing a seed of one, will be able to expand relatively unfettered. This means a lot for the longevity of the game, which by the way is already monumental (the online version has existed for a decade), will stretch even further. It will also allow for advances in approachability for the uninitiated.\n\nThe game itself is by first definition; relaxing. It lacks the fast paced motifs and get-stoned-by-some-naked-dude-as-a-fresh-spawn mentality of other games of this type. It also lacks cutting edge graphics, but the graphics it does present are relatively clean and playable. I see some beauty in it and you can too if you just look at the screenshots. This also allows for the game to run on older systems. The game also lacks smooth animations, but the animations that do exist get the point across.\n\nThe game's main to dos are listed in the various trailers and description. A lot of it fails to mention the passable magic/faith system in the game that takes it from just a medieval todo to a more fantasy one. Also, the dragons, fiends, giant spiders, and hellthings help move that along.\n\nThe game as of now offers two modes. An Adventure mode which I would recemmond to new players as it bundles in a tutorial, and a \"creative\" mode which uses the term not like that certain world-renowned voxel game, but in the sense that the land is virgin and it is up to you and/or your friends to shape it. The adventure has some prebuilt areas and will guide you through the shallows of the game.\n\nOverall Wurm is a game similar to many, but in a way unique, and the first of it's kind by age, if not function. I'm not saying the game is perfect, because no one will say that, but it is a solid buy. Do not expect instant gratification from this game, and in return it will give you hours, days, months, and maybe years of play time.\n\nSo go now! Strike the earth, mold the clay, and fell the tree, but most of all... Welcome to Wurm Unlimited!", "timestamp_created": 1445453378, "timestamp_updated": 1456794885, "voted_up": true, "votes_up": 380, "votes_funny": 24, "weighted_vote_score": "0.876023590564727783", "comment_count": 14, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "24682551": {"recommendationid": "24682551", "author": {"steamid": "76561198010465863", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 12213, "playtime_last_two_weeks": 0, "playtime_at_review": 1982, "last_played": 1482167449}, "language": "english", "review": "Disclaimer:  I am a wurm noob - a true newbie who has legit only played the game for about 30 hours.  If I miss speak about the actual mechanics of the game, I apologize ahead of time.\n\nI know I don't have many hours on Wurm but I figure it's a good enough time as any to write a review for it based on what I have experienced so far.  Apparently, Wurm Unlimited was a game created ages ago and built on a platform that sort of resembled something of an online MMO version of MineCraft.  I'm not 100% clear on the history, but there are many other reviews and websites that go over it.  I do know that the game has a rich history and is deeply complex (more on this later).  But I am here reviewing the Steam version of the game along with my experiences.\n\nWhen you first launch Wurm, you're greeted with a sort of generic server selection screen.  These servers are the \"free\" servers that exist out there on the internet.  I actually engaged in dialogue with a fellow Wurm player named Mizova who runs the Valoria server (http://valoria-rpg.com/).  Not only did she take the time to answer all of my questions, but she invited me to play on her server...and I am glad I did.  \n\nOnce I found my server (Valoria), I was greeted promptly by the several dozen people playing there (I think about 30 when I logged on) and I slowly started exploring the landscape.  I knew going into this that Wurm would be complicated, confusing, and hectic - I wasn't entirely sure how crazy until much later.  My best honest impression of the game is that it’s a cross between an old school MUD, EverQuest, and Minecraft sort of rolled into one.\n\nI knew I had to get something to eat and get near some water, so I started exploring.  I started botanizing the fields and foraging for food.  After I had secured some potatoes, rice, and a belly full of water, I explored.  I just…wandered.  I stumbled upon a village whose members cautiously greeted me and welcomed me to join them and the rest is history.   Within a few hours I felt like a member of the community, a valued member of the server – I was doing things and learning and I had tasks and adventures ahead of me.\n\nBut…server stuff aside, let’s talk a little bit about the game itself:  I know I said it's like Minecraft, but...it's also not.  It's complicated.  This is by far the most complex, most complicated crafting sandbox game that I have ever experienced.  There are over 130+ skills, and each skill directly relates to something else.   It’s very deep and very, very complex.  But, that’s not a bad thing.\n\nThe best way I can explain this is by using an example that I experienced first-hand within the game.  One of my new friends was telling me that I should work on making some of my own tools so that I could perform all of the various tasks around the village.  Tools like rakes, brushes, carving knives, files, hammers, etc.  You know…tools!\n\nWurm has an interesting crafting menu where you can search and find the items you want to make, and it tells you what you need to make them…and the sub components, and then it tells you what you need to make those and so forth.   I wanted to make an iron file.  This would be a useful tool for improving the quality of my other tools and objects.  So I went to our village’s storage area and brought up the crafting window.\n\nThe file requires a handle, and a file blade.  Okay, easy enough.  The handle requires a shaft, a shaft is made from a log, and a log is cut from a tree.  Grab a log, make a shaft, spin it into a handle …done.\n\nThen, the file blade.  The file blade requires a lump of iron and must be forged into a file blade.  Grab a lump of iron, put it on the anvil.  Uh oh…needs to be glowing hot.  Light the forge, put the lump in the forge, finally the lump is glowing red hot.  Forge the lump into the file blade.   Try to fasten the blade to the handle, uh oh, I waited too long and it’s cooled.  Better toss it back in the forge.   Okay, blade is glowing hot, now I can forge the file.   Done!  Then, I started looking at ways to improve my file.  Polish it with a pelt, hammer on it with a hammer, then…toss it back in the forge, hammer more iron into it, quench it in water to temper it, polish it again… etc, etc.\n\nYou get the idea.  Everything in Wurm is vastly complex and complicated, but it makes you feel like you’ve actually achieved something when you finish it.  Even though I only spent about 45-60 minutes at the forge in the game making tools, I actually walked away chuckling to myself about how it’s the closest thing to realistic I’ll get for forging something in a game.\n\nThere are, of course, some odd things – negative things that would be impossible for me to ignore.  The music gets on my nerves (easily disabled).   Sometimes the camera makes me nuts.  I would LOVE to drop it into 3rd person view for a few minutes, just while I’m riding around doing menial tasks or exploring.  I know there is an \"over-the-shoulder\" third person view, but it's not useful at all and your toon blocks 3/4ths of the screen.   I like to play in 1st person, but I like to watch my toon do things when I am just standing in fields harvesting crops, etc.\n\nAnother thing that only slightly annoys me is the running speed/movement speed/stamina drain.  You have a stamina bar that you use to perform actions.  You can get stronger, and better, but you can't seem to get faster.  You can't sprint, or run, or expend your stamina for a quick burst of speed (at least I don't think you can, lol).\n\nThe skill grind is real, and it’s something that most people that play Wurm will tell you about.  Patience is the name of the game when it comes to playing Wurm and if you don’t have patience it’s not the game for you.  For example.  You can get to 100 in each skill.  I am our village's farmer.  I've farmed over thousands of squares of fields and tended fields and harvested, re-planted, farmed, tended, and harvested again.  My farming skill is only at 28.  It levels slowly.  That doesn't mean you can't do what you want to do, it just means you might be producing lower quality or less quantity than you'd like.\n\nThis game is for crafters.  It’s for visionaries.  It’s for people who like to relax after work with a calming zen garden type game where they can relax, brush down their cows, milk them, and make cheese from the milk.  This is the game for people who like to make something out of nothing.  Erect a castle, dig a canal, or run a farm.  It’s like a medieval village simulator.  Play by yourself, play with friends, play as part of a community like Valoria – but if you enjoy crafting sandbox games, I recommend this.  You won’t find super high stakes action here.", "timestamp_created": 1470194355, "timestamp_updated": 1470194782, "voted_up": true, "votes_up": 80, "votes_funny": 2, "weighted_vote_score": "0.872525811195373535", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "49115570": {"recommendationid": "49115570", "author": {"steamid": "76561197996380858", "num_games_owned": 103, "num_reviews": 5, "playtime_forever": 169069, "playtime_last_two_weeks": 0, "playtime_at_review": 27222, "last_played": 1677132173}, "language": "english", "review": "Oh man, this game...\nI started off with Wurm Online. It's a Java based crafting and survival simulator. That online-only version connects you to the developer owned servers, and you experience the game the way the developers intended. Notch, of Minecraft fame, was on the original team for this game, but wanted to go a different direction. If you just read that as \"this game is like Minecraft\", oh you poor unfortunate soul. This game is like Minecraft like a festering butt boil is like a freckle. In Minecraft, you hit a block for a few seconds, it breaks, and you move on. In this game, you hit a rock wall for 30 seconds. At the end of that 30 seconds, you've done 1 action to said rock wall. Said rock wall will open into a mineshaft after ~50 of those actions. Your stamina will need to regen after about 2 queued actions. So, let's do the quick maths on this, you're looking at ~30 minutes to get through ONE rock wall tile to start your new fangled mine. Now do 30 more, and you might... MIGHT find iron.\nThat's a basic rundown of what to expect with this game. Everything you do at the beginning, when all your skills are crap, will take forever and will be piss-poor quality. However, reward favors the tenacious. Keep at it, grinding away at hundreds of possible skills, and your action timer will slowly decrease, your output quality will slowly increase, and you will become a beast of fruitful burden.\nWith this particular flavor of the game, player owned servers can be customized to make that grind less painful, granting you higher starter skill, higher skill gain advancement, and even some decent starter gear.\n\nStill, getting into this game is not for the faint of heart. It can LITERALLY take you hours of walking to find a suitable spot to call your own. You will die 10 or 15 times trying to get there, and get frustrated as hell, but when you look back at all your hard work as you gaze upon your castle overlooking the valley, it will all feel worth it.... or like a MASSIVE WASTE OF TIME. You know, either/or...\n\nI've been playing for ~10 years.", "timestamp_created": 1550650655, "timestamp_updated": 1632293192, "voted_up": true, "votes_up": 73, "votes_funny": 13, "weighted_vote_score": "0.863719403743743896", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "18990779": {"recommendationid": "18990779", "author": {"steamid": "76561198082316306", "num_games_owned": 586, "num_reviews": 85, "playtime_forever": 44972, "playtime_last_two_weeks": 0, "playtime_at_review": 10823, "last_played": 1699386271}, "language": "english", "review": "Oh, man. . . . Wurm Unlimited. Where the heck do I start?\n\nSo here are the pros/cons of Wurm Online, then I'll do pros/cons of Wurm Unlimited.\n\nWurm Online:\n\nPros\n1) The game is more realistic in terms of crafting, skilling, etc. than any game I've ever come across. \n2) A sense of accomplishment is just around the corner as you build up your character, your deed, or just run off exploring all over the beautiful landscape. \n3) Many will disagree with this, but I think the graphics are a 'pro' for me. I really enjoy the graphics. It's not crazy, but they aren't Minecraft. It is a gorgeous game, in my opinion. \n4) The freedom you get in the game is astonishing and absolutely mind-boggling. \n5) Just one more plank. \n6) Okay, okay, just one more.\n7) Ya' know what, I'll just finish this wall.\n\nCons\n1) For most people, the menus/submenus will be a red 'x' against the game. But honestly, most things are intuitive (use a saw on a log and you'll make things that you would if you were using a saw on a log in RL).\n2) HUGE learning curve (although once you learn how to play, you're like 'duh..that makes sense').\n3) Fighting anything, especially early on in your Wurm life, can take for-EVER!!! This has always been a detractor for me in the game. That said, I must also note that once you obtain a decent QL (quality) weapon with some nice enchants, the battles are pretty quick, but getting the silver to buy such weapons will take a lot of work!\n4) Just one more plank.\n5) Okay, okay, just one more!\n6) Ya' know what? I'll just finish this house.\n\nWurm Unlimited\n\nPros\n1) It's friggin' singleplayer if you want! Take all of the pros from above and plop them down into a singleplayer mode where you can be a GM and fart around on a server! For a lot of players, this is just what they were looking for!\n\n2) No subscription needed and there are tons of servers available - including my own -- Taking Without Constent Dedicated 24/7 -- no subscription needed with the same awesome community-driven action!\n\n3) The GMs of the online servers for Wurm Unlimited are going to be able to help you much more than they ever would on Wurm Online! Your experience could be free from some of the most frustrating aspects of the game if you choose the right server to play on!\n\nCons\n\n1) They changed the way skills are gained and it was a pretty gnarly overhaul. Funny because I didn't think it could be as big of a change, but after playing for 100+ hours, it was a big change. The only con here, however, is the fact that the GM has to constantly tweak the settings to get it close to being realistic, but not annoying (especially the farming).\n\n2) The rest are just the same as for Wurm Online. \n\nOverall, this game is simply amazing. When I get on, I get lost in the Wurm world. I'm a GM now and am hosting my server through Citadel, and I must say, it's awesome to have an investment into the game like I have now. And if you're looking for a great server that will be focused on community, and alleviating a lot of annoyances in the game, look no further than TWOC - Taking Without Consent. \n\n", "timestamp_created": 1447168955, "timestamp_updated": 1447168955, "voted_up": true, "votes_up": 268, "votes_funny": 43, "weighted_vote_score": "0.863301277160644531", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "62874353": {"recommendationid": "62874353", "author": {"steamid": "76561197970440834", "num_games_owned": 0, "num_reviews": 29, "playtime_forever": 1061, "playtime_last_two_weeks": 0, "playtime_at_review": 1058, "last_played": 1580671667}, "language": "english", "review": "I'm recommending this game, but only on three conditions:\n\n1. You have a lot of patience and time to play.\n2. You listen to a lot of podcasts or whatever and you need a \"chill\" game for when you're doing this.\n3. You ONLY buy this on a sale. It's not worth £20+.\n\nOtherwise, I don't recommend it.\n\nWurm is a game that requires a massive investment of time to get enjoyment out of it. Say you want to build a house, this is what the process will be like for your first 10 hours with the game:\n\n1. Find out where the hell you are.\n2. Make a mallet. (Cut down a tree --> Shave wood into Shafts --> Make mallet head --> Combine shaft with mallet head).\n3. Plan your house (requires Carpentry skill, which requires grinding more wood objects).\n4. Obtain around 80 planks for your house = cut down and SLOWLY haul around 15 trees, then saw them into planks over 20 minutes.\n5. You need nails to nail the planks to your house. This means you need to mine iron...\n6. Dig a mine for 2 real time hours. Find iron (if you're lucky/sensible).\n7. Dig iron for 10 minutes.\n8. Haul iron to your house. Smelt iron in a campfire, because a forge needs MORE resources.\n9. Smelt nails. You can now finish your house, so people won't steal all your stuff!\n10. Make a small cart, so you can actually haul stuff at a reasonable pace...this requires cart wheels, which require shafts and shafts require logs so...get out there and cut some trees...\n\nAs you can tell, the above is pretty involved. Not necessarily a bad thing, but it's not a game you can just jump into.\n\nPerhaps my biggest annoyance with the game is the bad UI, which feels like it was designed in 1982 and hasn't been modernised since. If you want to dig a wall for example, you will need to click the wall after double clicking your pickaxe, and then hit \"3\" over and over again.\n\nYou can queue up 3 actions but it can take 50+ hits to break a wall, so you're going to just have to keep hitting \"3\" for the next ten minutes.\n\nWorse than that, crafting is incredibly clunky. You can't just select a tool and create X number of something. Instead for many tasks (such as Improving items, an important thing to do), you need to keep putting things in your inventory, right-clicking them and navigating to the Improve task. There's no way of doing this faster.\n\nIt feels really irritating when this is a game where you have to do the same task so many times. Why do I have to keep navigating this clumsy menu?\n\nAlso, this game is far more fun with friends. Get some mates on and you'll have some laughs (such as when my friend randomly dug through an entire mountain for 8 hours when I was asleep...I still can't believe that).\n\n", "timestamp_created": 1580668559, "timestamp_updated": 1580668559, "voted_up": true, "votes_up": 66, "votes_funny": 15, "weighted_vote_score": "0.862260639667510986", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "19744748": {"recommendationid": "19744748", "author": {"steamid": "76561197992036393", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 41993, "playtime_last_two_weeks": 0, "playtime_at_review": 40266, "last_played": 1487608010}, "language": "english", "review": "Out of all the sandbox, crafting, building, multiplayer games I've played, this one was my biggest disappointment. If you don't try playing this game however, you are missing out on one of the best fantasy building/crafting games ever.\n\nI dedicated 440 hours in 48 days to this game. I started playing Oct. 29th. At first I didn't get what made the game so good, but as I kept playing I began to understand that it is unique and fun to build stuff and upgrade your tools. I built mines, roads, houses, farms, a blacksmith, an inn, a bakery and other shops, a dock with ships, tons of tools and furniture, bred horses, sheep and cared for other animals, including unicorns and a brown bear which was my mount. I eventually rented a Wurm Server so that my friends and I could all play together. By this time I knew that this medieval fantasy crafting game was the best one I've played. What's nice is that you can set your own personal configuration settings for your world to make the experience feel less of a grind. Doing so helps to speed up your progress. I did a x15 skill gain(skills level faster), with a x3 action multiplier(shortens the time it takes to perform actions).\n\nI suppose my situation was unfortunate. I often found myself playing the game alone. Here I had this beautiful town taking shape, but no one to see it. It was like living in a ghost town. I did have some playtime with a few friends, but everyone was busy building their own settlements.\n\nIt was disheartening that my Wurm Unlimited experience did not go as I expected. I had hoped to get more out of the multiplayer aspect than I did. It is such a great game, albeit the graphics and animations are outdated. \n\nTry the game. If you're playing with friends, stick together. Make one settlement. Build a community. Explore the world together. There's potential for a great experience. \n\nUPDATE: 2017\nSo, I started playing WURM again but this time with my cousin and my best friend. We've been having a lot of fun on our private server I'm renting. Me and my cousin have built quite a settlement and my best friend's settlement is just a 2 minute boat ride away. So all in all we have a fun and happy WURM ending!", "timestamp_created": 1450352033, "timestamp_updated": 1486272000, "voted_up": true, "votes_up": 222, "votes_funny": 8, "weighted_vote_score": "0.847978293895721436", "comment_count": 12, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "30417783": {"recommendationid": "30417783", "author": {"steamid": "76561197968566119", "num_games_owned": 726, "num_reviews": 242, "playtime_forever": 1139, "playtime_last_two_weeks": 0, "playtime_at_review": 1139, "last_played": 1489874593}, "language": "english", "review": "A game where every action becomes tedious, but rewarding at the same time.\n\nWant to build a chair? Then you need 6 small nails and a few planks. \n-Want nails? Then you need iron.\n--Want iron? Then you must smelt iron ore into iron.\n---Want iron ore? Then you must mine out iron ore from a mine.\n----Want to mine iron ore? Then you must mine/prospect until you find an iron ore vein.\n-----Want a mine? Then you must find a mineable rock to mine out an entrance.\n------Want a mine that is close? Then you have to dig out the dirt till you find rock.\n--Want to make nails? Then you need a small anvil.\n---Want a small anvil? You may want a forge at this point.\n----Want a forge? You will need 10 stone and 10 clay/mortar. (Mortar becomes a nightmare... so we choose clay.) (Update: A forge now requires mortar, and clay is not optional.)\n-----Want stone? Get it from the mine.\n------Stick the 10 stone togther to form an unfinished forge.\n-----Want 10 mortar then you must find at least 10 clay and at least 2 sand.\n------Want 10 clay? First you must wander till you find clay. \n-------Dig out 30 clay, throw away all clay with a quality of 1. (1ql clay will deteriorate your finished forge's ql.)\n--------Keep 15 or more clays. (You will fail a few attempts, and you will need better ql clay to more easily create mortar with sand, to more easily stick mortar to that unfinished forge.)\n------Want 2 sand? Then you must find a water front that should have sand by it.\n-------Dig out 15 sand, drop any sand back into the ground that has a quality of less than 10ql. \n--------Keep 4 or more sand. (This grants you a buffer for 5 destroyed sand from fails. Each fail with deteriorate the quality by about 5 damage. If the damage gets to 100, the sand/item is destroyed. If the 'sand' gets to 50 damage, you should drop it into the ground and and get a new sand or dig a new sand from the dropped sand's newly created sand spot.)\n---------Mix the sand and clay into 10 or more mortar. (You will probably fail a lot. Just keep trying.)\n----------Go back to where you left your 200kg unfinished forge... and stick the mortar to the forge.\n-Want planks? Then you need logs to saw.\n--Want logs? Then you will need to chop down a tree.\n---Want to chop down a tree? Then get out your axe or sword and find a tree.\n----You are going to want to destroy the tree stump, or other players will hate on you for leaving it in their scenic views.\n\nThere you go! All the materials you need to build a chair! \nNow for the hard part... building the chair... rofl! You thought this would be easy?! lmao!\n\nActually, due to all the tedium, it is rewarding to finish that first chair/item.\n\nAt this point you may be wishing you had a large cart to transport the sand, clay, stones, iron ore, logs, planks. It was probably a good idea, but you will still need nails to finish the large cart.\n\nMost players will want to build a large cart (not wagon) as their first item, so they can stow some stuff away and lock it with a lock they have to craft. (Update: Thanks cfranks007 for pointing out I meant large cart, not wagon.) (Update: It seems you no longer need a lock on the large cart to prevent others from accessing it's contents. Others can still always drag your large cart away though.)\n\nEstablished players will have a deed, with a large house, with many containers inside.\nEstablished players will be able to turn grinding into a mini-game, where you have around 5 different tools on you and hotkey the actions for each tool to be worked on around 10-30 items, for a full night of grinding skill points and chatting on global chat.\n-----\nTo avoid the tedium, the devs could remove the action que, and allow an action to become automatically continued until it was completed. It would be nice to set the game to polish 30 swords and walk away to have dinner.\n-----\nMy biggest gripe is that mines are not 3D, but are 2D since no path can cross over another path inside the mine. This causes players to have to think out mines in depth before mining paths and rooms.\n\nMy second biggest gripe is that every skill is tedious. The most tedious (where tedious means least gain for effort) is weapon smithing. You need it for every axe head, sword blade, or chisel blade you create, or weapon you wish to improve.\nEven with 4000 hours gameplay, you will not be a 100 skill master at any skills, if you even have 70 skill in any at all.\n-----\nIts not like minecraft, where a diamond sword is created and powerful till its quality is 0 and it breaks. But this game has ql for each item, which helps to determine its sharpness, plus damage to that item. Then there are enchantments. And skills for each item. And skills for the base item type. And body skills. And rare items... but all of this is fun.", "timestamp_created": 1489106755, "timestamp_updated": 1491676696, "voted_up": true, "votes_up": 101, "votes_funny": 24, "weighted_vote_score": "0.844493567943572998", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "62310183": {"recommendationid": "62310183", "author": {"steamid": "76561197991591636", "num_games_owned": 0, "num_reviews": 159, "playtime_forever": 8741, "playtime_last_two_weeks": 0, "playtime_at_review": 8713, "last_played": 1602280721}, "language": "english", "review": "I got into this game way too late unfortunately.\n\n\nIts a lot of fun, but there isn't really a player base anymore.   Most servers even if they have some people are on the Heavy decline.\n\n\nMany many ruins across any server you go on mark the testament that this was a great game.    Large flat plains of streets and floors with no buildings, decaying structures and boxes.   Its sad in one way, interesting in another.\n\n\nThis game gave rise to titles like \"Life is Feudal: Your own\"  Its a super interesting way to game, but requires a HEAVY investment of time and daily chores to experience the most out of it.\n\nThe graphics are good for the time period this game was created in.  The game still offers depth of play, but without friends or a group of people you can no longer do much of the higher end things like killing dragons or titans.  (they simply Can NOT be solo'd)\n\nId recommend this game, but don't buy it, as its dead.\n\n\none of those rare gems that's been laid to rest.", "timestamp_created": 1579845134, "timestamp_updated": 1579845134, "voted_up": false, "votes_up": 78, "votes_funny": 1, "weighted_vote_score": "0.841626644134521484", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "42233520": {"recommendationid": "42233520", "author": {"steamid": "76561197980910801", "num_games_owned": 0, "num_reviews": 183, "playtime_forever": 1111, "playtime_last_two_weeks": 0, "playtime_at_review": 1111, "last_played": 1527292456}, "language": "english", "review": "For people who think Runescape isn't grindy enough. You like skilling? Crafting skills? Building houses and doing hoodrat stuff with your peasant friends? Then this is the (only) game for you! Everyone looks like they're made of play-doh and the music is weird, and there are so many other things wrong with the game but none of it matters. There's only one question: are you the kind of person who wants to build a house plank by plank? Nail by nail? Are you someone who would get a kick out of making sure the dirt was level before putting down the foundations? If so, get help. After that, you can buy Wurm.", "timestamp_created": 1527228138, "timestamp_updated": 1527228138, "voted_up": true, "votes_up": 74, "votes_funny": 165, "weighted_vote_score": "0.832153439521789551", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "35513675": {"recommendationid": "35513675", "author": {"steamid": "76561198018621312", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 31420, "playtime_last_two_weeks": 0, "playtime_at_review": 26326, "last_played": 1474948395}, "language": "english", "review": "Not for the faint of heart, or people with jobs,family,loved ones,anything resembling a social life. I've played this for easily over 1000 hours over 2 accounts and can say with 100% certainty, Wurm will destroy a man and rebuild him in it's own glorious image. This is not a new game and it's not a game meant for casual play at all. You either dedicate your life to the game or you dont play at all.\n\nI've been playing wurm since before it came out on steam, back when it was a pseudo mmo called Wurm Online, the sheer amount of time and effort it takes to do even the simpist of tasks will destroy anyone who doesnt quite have what it takes to enjoy games like this. However this is hands down the best game of it's genre.\n\nAlso Notch helped make it so if you liked spending thousands of hours in minecraft you can consider this game its bigger,not as well known, and significantly harder brother.", "timestamp_created": 1507280113, "timestamp_updated": 1507280113, "voted_up": true, "votes_up": 108, "votes_funny": 17, "weighted_vote_score": "0.828691244125366211", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "26041793": {"recommendationid": "26041793", "author": {"steamid": "76561198018169754", "num_games_owned": 0, "num_reviews": 104, "playtime_forever": 72463, "playtime_last_two_weeks": 0, "playtime_at_review": 5279, "last_played": 1669829870}, "language": "english", "review": "I played Wurm Online for a good 9 solid years. I was genuinely hitched on it.\nUltimately I burned out and after a good year hiatus I got Wurm Unlimited.\n\nIf you've ever played Wurm Online, that's the gameplay you're going to get, but with some changes you can make like the rate you gain skills, the amount of creatures, speed of crops. \n\nUnfortunately, there really isn't much more than that.\n\nThis is probably one of the messiest pieces of software on the Steam store from a functional standpoint. You're given barely any maps to use in your servers, and if you want more you'll need to use programs that aren't packaged nor even mentioned in Wurm Unlimited to get them.\n\nThe actual launcher client for picking servers is pointless in its design, as it just shuts itself down once you're in and if you don't like a server you're going to get really annoyed when you have to keep relaunching the full thing to just pick a new one.\n\nAs for customization, this was clearly an extremely quick job when they decided to let Wurm be privatized. The UI is extremely annoying to navigate, it has search options when trying to spawn items that can't even search for things when you type them exactly right or only partially, you have to get the amount it wants to search for just right.\n\nYou want to customize something on your client? That means restarting of course. If you are hosting your own server (As many will likely do), you need to shut your entire server down because it won't let you open the game client on its own, another example of it's poor usability.\n\n\nWurm itself is a very *VERY* dated game and it's been suffering from that for a long time. It's received no quality-of-life improvements in the last few years, and for its age and graphical fidelity, it still has pretty horrendous performance on the CPU side of things.\n\nAs I've recently said in the comments, the only reason I can see why you should buy this is if you've enjoyed Wurm Online itself in the past, have been able to handle all its problems, but just don't want to be paying 8 euros every month for it. \n\n\nIt's a shame there's no really good modern alternative to Wurm, but it is time to admit this is just too old to work these days. The performance is horrendous even on CPUs like an i7 6700k, the UI is extremely dysfunctional and tough to use (nor can it even scale properly). They keep stacking features on overtime but it's just devolving into a mess that's struggling to still be called a program that can run.", "timestamp_created": 1476505730, "timestamp_updated": 1508188324, "voted_up": false, "votes_up": 202, "votes_funny": 5, "weighted_vote_score": "0.82804572582244873", "comment_count": 36, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "131484250": {"recommendationid": "131484250", "author": {"steamid": "76561197995240708", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 106769, "playtime_last_two_weeks": 0, "playtime_at_review": 106769, "last_played": 1669780255}, "language": "english", "review": "So first off: I actually really love this game, so that red thumbs-down icon above this review is probably a little confusing.\n\nBut here's the thing: The 'game' is good. The engine is a hot mess, and as a result the graphics look extremely dated. It's complex, for many folks too complex, and by default it takes forever to get anywhere... But it's exactly the sort of survival builder game I love. I don't even hate how complex everything is just to run a local server, and the modding scene definitely adds new life to it, and lets you tweak the experience a fair amount to suit your tastes.\n\nSo why don't I recommend it? For starters, the engine is a hot mess. By itself that's not enough, but I like pretty graphics as much as the next guy, and this is a strike against it. I wouldn't even count it as a strike, but for one side effect of the bigger thing: They announced some really, really cool upgrades to the engine, with lighting and I think there was some talk about more cosmetic options in clothes, textures, etc. as well.\n\nBut now for the main reason why I don't recommend it: Those upgrades were only for the Wurm Online version of the game. Wurm Unlimited was cut loose with some sweet-sounding words and some unfulfilled promises for cleaner mod support, and then just left to drift. I don't have an insider at Code Club, so I have only to speculate as to their reasoning, but what makes sense to me is this: Wurm Unlimited was released as a way to draw people to come try Wurm Online, and they never expected it to be a viable product of its own, and grow its own communities... but it did. When Wurm Unlimited started to get its own following, including people who tried Online and didn't like it, they cut it loose due to sour grapes... but you can still pay them $30 for the privilege of playing their cast-offs. \n\nThe reasoning for why they abandoned it is the final strike: Modding. Since Unlimited runs on privately hosted servers, you can modify the experience quite a lot, and there are (were?) features made possible with mods that you could never do on Wurm Online, and some mods even allowed server owners to use functionality from the Online version which was disabled for Unlimited. So Code Club said that WU was becoming its own thing and they counted on Modders to keep the community alive and vibrant... But from what I've seen, it had the opposite effect. A lot of modders lost their passion for the game after the announcement, as it meant that a lot of long-standing difficulties and bugs would never be fixed, and a lot of the cool features that Wurm Online had received and had announced for the future would never come. When I stopped playing, there were a good handful of servers with active, friendly populations, but when I tried to come back, I found a lot of built-up but nearly silent servers, where you could wander the many player-built cities and not see a single person.\n\nI really want to love Wurm Unlimited. I want it to be the game I imagined as a kid, and which it comes so close to being... But I don't think you should give Code Club your money for this product. I never played Wurm Online, but I've heard a lot about it, both good and bad. If this strikes your fancy, maybe go check that out. As for me, I'd be just as happy to hear that Code Club went under for starting something that could have been amazing, then abandoning it rather than nurturing its potential.", "timestamp_created": 1674592575, "timestamp_updated": 1674592575, "voted_up": false, "votes_up": 56, "votes_funny": 0, "weighted_vote_score": "0.822001278400421143", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "33070821": {"recommendationid": "33070821", "author": {"steamid": "76561198032369455", "num_games_owned": 465, "num_reviews": 15, "playtime_forever": 32028, "playtime_last_two_weeks": 0, "playtime_at_review": 1723, "last_played": 1706241402}, "language": "english", "review": "I played this game for 20 hours in the past 2-3 days. Before it had a standalone (Wurm Online), I used to play the game on and off. Here are some things you should consider before buying the game:\n\nThis game takes time. LOTS, LOTS, LOTS of time. It took my friend and I 20 hours to FINALLY build a 1x1 shed. [to be fair he only anted a 1x1] (This was on a 2.5x skill gain server)\n\nThis is not a game where you can AFK, even though it has that theme of it. Macros are HIGHLY frowned upon and often bannable. The closest you can get to afk is opening console, and typing \"bind <KEYHERE> <ACTION> (MINE_FORWARD for example)\" \n\nLeveling up skills in a server that isn't modded skill-gain wise will take forever, and ever. Even on skill-gain increased servers it will take a while. Especially since the game does not increment by just one digit. However, leveling up and learning new things is only available after a regular integer.\nInstead, it's decimals. For example, Body control, an important skill for riding different animals, will increment by like 0.061, or even lower. (0.0051?)\n\nThis game is boring as all fuck without playing with someone. Being alone is boring and slows down a lot of progress. \n\nAgain, TIME. This is probably what turns people off the most in this game, is the fact that you can't buiild a castle from the first day. Hell, you cant even build a house on your first night. (Not even close too unless 10x skill gain.. hehe). \nThis game will suck your hours in like a clingy girlfriend. \n\n\nThis game is targeted for specific audiences. A lot of people you will meet and play with are old. My main server's owner is a 64 year old. \n\n\nPersonally-- I think this game is built upon time and accomplishment. You spend a lot of time working on something and the accomplishment, the reward of building said object is what makes the game special.\n\n\n\nYou should take caution into buying this game- If you're willing to spend hours on this game, hours and hours of dedication into the game, BUY IT. \nIf you have a friend thats willing to play with you for hours, BUY IT.\n\nIf you're not going to spend at least 50-100 hours int othis game, DO NOT BUY IT. You will not enjoy it.\nImpatient? DO NOT BUY IT. This game is all about time and patience.\n\n", "timestamp_created": 1498890987, "timestamp_updated": 1498890987, "voted_up": true, "votes_up": 48, "votes_funny": 0, "weighted_vote_score": "0.82171940803527832", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43176283": {"recommendationid": "43176283", "author": {"steamid": "76561197983157087", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 4444, "playtime_last_two_weeks": 0, "playtime_at_review": 3725, "last_played": 1531531959}, "language": "english", "review": "Honestly it makes me kind of sad to see this game getting such mixed reviews, but I get it. Wurm is hard and overly complex and that's kind of what I love about it. The learning curve and time investment make every action mean something. You want to build a chair in any other game that has crafting and it's essentially get 5 sticks, click some buttons and there's the chair. Not here. You need to cut down the trees, cut those trees into logs, make planks, make shafts. Then you need nails which you need iron for, so you have to dig a hole and then hope to god that there is iron in your mine. Then you smelt that iron to make an anvil then work the iron on the anvil to make nails. THEN you get to put it all together. Assuming you've not got a hole already dug and are starting from scratch you've just spent about an hour or more to make one chair. You'll look at that chair and think \"wow the quality level is terrible, it doesn't look good, I don't even need a chair for anything, BUT IT'S MY CHAIR DAMMIT\" and you will feel good about that chair.\n\nMaybe spending all that time gathering resources isn't your thing. Great! Join a community. Team up with other people and trade services for coin or goods. Everything in this universe from the in game government to the economy is player run. Years later this game is still going strong not only with well populated servers but also active development and updates.\n\nThe interface and the actual gameplay feel weird, but as you get into it you realize there is a reason for it. With the sheer amount of menuing and management you have to work with a traditional FPS style control really doesn't fit here. The graphics are...not next gen, but they aren't trash either and they certainly don't take away from what Wurm really has to offer.\n\nThis game is an investment. Everything you do will take time and effort and if you don't know what you are doing you will be checking the wiki every few seconds and cursing under your breath. But if complicated, overly in depth, and rewarding games are your thing you will love this. If you are more concerned with graphics than gameplay or don't want to take the time to learn subtle mechanics then I would recommend you avoid this game.\n\nIf you're on the fence, watch a few videos on youtube. There are hundreds of tutorial videos, one for almost every aspect of the game. Maybe get an idea of what you're going to be walking into.", "timestamp_created": 1530333000, "timestamp_updated": 1530333212, "voted_up": true, "votes_up": 58, "votes_funny": 7, "weighted_vote_score": "0.818984568119049072", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "82977296": {"recommendationid": "82977296", "author": {"steamid": "76561197977825172", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 11615, "playtime_last_two_weeks": 0, "playtime_at_review": 11615, "last_played": 1452248077}, "language": "english", "review": "Game no longer updated by the devs, broke their promise about keeping it in step with Wurm Online that they are keeping updated.\n", "timestamp_created": 1608744016, "timestamp_updated": 1608744016, "voted_up": false, "votes_up": 77, "votes_funny": 1, "weighted_vote_score": "0.818863213062286377", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23762916": {"recommendationid": "23762916", "author": {"steamid": "76561198051433657", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 56905, "playtime_last_two_weeks": 0, "playtime_at_review": 24321, "last_played": 1701048267}, "language": "english", "review": "Per Wikipedia, Wurm Online started beta back in 2003 and went gold in 2006. In 2015, the developer completed a standalone version of Wurm Online and packaged it as Wurm Unlimited.\n\nPros\n- I like the soundtrack and find it soothing. There's something soothing about mindlessly mining ore and listening to the audio that keeps you in a trance.\n- Lots of parameters can be altered to generate the experience.\n\nPro and Con - depending on your perception:\n- In depth crafting system. A large amount of resource gathering is required to build end products. Building ships, buildings, etc. involve quite a bit of resource gathering and give a sense of accomplishment when you finally build the finished product.\n- Age of game. You get a product that has been around for quite a while. This means that people have worked on it for quite a while to develop the systems (Pro). It also means that you're not likely to get a \"fresh interface\" or the latest graphics (con)\n\nCons:\n- Declining population:\nSteam charts - http://steamcharts.com/app/402370   \nSteam charts - http://steamcharts.com/app/366220\nPer the above, you can see that there's never been more than 2000 players online playing this game at one time. The population and number of servers continue to decline. \n- Cost:\nAs of June 2016, the regular price for this game is $30 ($29.99 for those worried about a penny).\n\nAs far as would I recommend it to others... Overall, I enjoyed playing this game, but I would have to give it a no based on the current price tag and current decline of the population. Truthfully, this game is not for everyone. If you can find the game on sale at a significant discount, then it's worth picking up, but only if you like games that involve an extensive resource collecting experience where you don't mind finding yourself spending a considerable amount of time playing solo.", "timestamp_created": 1466788900, "timestamp_updated": 1466788900, "voted_up": false, "votes_up": 119, "votes_funny": 4, "weighted_vote_score": "0.803754210472106934", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "73257620": {"recommendationid": "73257620", "author": {"steamid": "76561197998962220", "num_games_owned": 928, "num_reviews": 18, "playtime_forever": 6317, "playtime_last_two_weeks": 0, "playtime_at_review": 4777, "last_played": 1678338273}, "language": "english", "review": "Now, my recommendation comes with a BIG caveat: This game is nigh impenetrable.\nIf you can get a group of friends willing to put up with frankly baffling UX and janky interactivity, if you can spend an hour getting to grips with the controls and fiddling with the settings to get something usable, and especially if you can get it on sale...\nYou will find a very expressive and [i]shockingly[/i] engaging little game.\n\nI sucked one friend in and we wandered around an empty server one night, baffled. The next day I figured out how to flatten the ground and start a fire. A week later we had 3 more friends and a rowing boat, heading to a new location to settle. Now, two weeks in, we have a thriving village of 7 fools, and we're all specialised in our own skills. We have hilarious stories and character traits that have arisen from our situations, and we just celebrated the maiden voyage of our first large ship, a Corbita.\nIt is not an easy game to get to grips with, but if it sits in your mind a few days after you first try it, you'll find yourself sowing fields and paving roads in no time.", "timestamp_created": 1595679746, "timestamp_updated": 1595679746, "voted_up": true, "votes_up": 39, "votes_funny": 1, "weighted_vote_score": "0.799769163131713867", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "26427982": {"recommendationid": "26427982", "author": {"steamid": "76561197998183960", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 231210, "playtime_last_two_weeks": 0, "playtime_at_review": 136776, "last_played": 1591577653}, "language": "english", "review": "I give this a recommendation only with heavy qualifiers:\n\nThis game is a mess through and through- it's gone through many developers through over a decade.  The graphics are dated, the animations are choppy or nonexistent for some actions.  Combat is fairly passive and random, with the outcome having very little dependence on player skill.  The interface is clunky and difficult to navigate.  The 'NPCs' are terribly scripted to the point of just being annoying distractions.\n\nThat being said, there is no game like it to my knowledge.  I'd be lying if I said it has never irritated me.  It's had me rage-quit more times than I'd like to admit.  It can be very frustrating at times, and difficult to troubleshoot if it's not working right or crashing.\n But if you want a game where you can find a secret valley in a mysterious, whimsical, and dangerous land and start a homestead from nothing with your friends, yet don't mind a pretty steep learning curve and having to go to external websites( wurmpedia.com ), or the kindness of strangers to figure out how to do many things, this may be of interest to you.\n\nWurm players are an odd bunch and you won't often find their likeness anywhere else.  They may squat on your land and try to steal your stuff. They may frighten you, become extremely paranoid at you- -They may try and roleplay an 8th century Byzantine akrites at you.  But they will probably, most likely try and help you the best they can.  I've met some really great and interesting people in Wurm, and hope to meet more even if the golden years have passed.\n\nIf you're not sure, you can always try Wurm Online on a free trial account to get the gist.", "timestamp_created": 1478316858, "timestamp_updated": 1511470472, "voted_up": true, "votes_up": 39, "votes_funny": 1, "weighted_vote_score": "0.792513072490692139", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23958470": {"recommendationid": "23958470", "author": {"steamid": "76561198114676779", "num_games_owned": 116, "num_reviews": 3, "playtime_forever": 941169, "playtime_last_two_weeks": 574, "playtime_at_review": 243655, "last_played": 1712798722}, "language": "english", "review": "Started playing just before Christmas and now I'm hooked. Yes there is a bit of a steep learning curve to begin with but suddenly it all just clicks and makes so much sense. Once you are over that initial curve it is an amazing game. Though what is better then the game itself is the community. Unlike other sandbox multiplayer games you really find yourself having to work together and trade with others. The community is also mature in comparison with minecraft, there are no children running around trolling or being annoying. You are playing with other adults and for me this is great.\n\nWould reccomend to anyone who enjoys building and creating things, skill grinding or being social!\n\nIf you do decide to play I'd definetly reccomend Valoria as a server ;)", "timestamp_created": 1467301982, "timestamp_updated": 1480388106, "voted_up": true, "votes_up": 38, "votes_funny": 2, "weighted_vote_score": "0.788720548152923584", "comment_count": 8, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "30754536": {"recommendationid": "30754536", "author": {"steamid": "76561198012684357", "num_games_owned": 321, "num_reviews": 12, "playtime_forever": 168968, "playtime_last_two_weeks": 0, "playtime_at_review": 37664, "last_played": 1624354745}, "language": "english", "review": "8 hours in Minecraft: Right, I have a full set of enchanted diamond armour, killed the ender dragon and the wither and have a good sized house.\n\n8 Hours of Wurm unlimited: Right, I made a spoon...\n\nIf you are looking for instant gratification then Wurm isn't for you. If you are the type of person that will sit down and untangle 1000 feet of Christmas lights or ball yarn in a room of cats then you will love Wurm Unlimited.", "timestamp_created": 1490544449, "timestamp_updated": 1490544449, "voted_up": true, "votes_up": 49, "votes_funny": 41, "weighted_vote_score": "0.78795325756072998", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "18838481": {"recommendationid": "18838481", "author": {"steamid": "76561198063308436", "num_games_owned": 697, "num_reviews": 29, "playtime_forever": 9627, "playtime_last_two_weeks": 0, "playtime_at_review": 3945, "last_played": 1601073519}, "language": "english", "review": "This game proves you don't need fancy graphics to make an addicting game, that's full of creativity and keeps you going. Today's Sandbox survival games get to the point where you are bored. This game: you don't get bored. You rage hard, but you play to beat the challenge. Even from initial start point, you are basically under pressure to survive. Granted new servers will have starter areas, but beyond those walls you are at the bottom of the food chain. \n\nBy Bottom of the Food chain, I mean the fantasy creatures in this game: Large spiders, ugly trolls and hell hounds are always present when you feel safe. You need to beat the odds of even making it to a decent location: Hills, Swamps, Dense forests etc. \n\nTHIS GAME IS NOT FOR EVERYONE. This game places you in such a bad position, you need to think and act strategically to stay alive. If you do die, you suffer for it: You lose skill points. \n\nI recommend this game based on it's challenge and complexity. No other game compares to it.", "timestamp_created": 1446475653, "timestamp_updated": 1446475653, "voted_up": true, "votes_up": 63, "votes_funny": 0, "weighted_vote_score": "0.787085473537445068", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "28720373": {"recommendationid": "28720373", "author": {"steamid": "76561198048161816", "num_games_owned": 0, "num_reviews": 77, "playtime_forever": 48816, "playtime_last_two_weeks": 0, "playtime_at_review": 21034, "last_played": 1698770660}, "language": "english", "review": "Great game, but it's not for everyone. For the bad reviews regarding single player, you can play sp you just set up a local server and hit run. Instead of writing  a shitty review, RTFM.\n\nIf you like crafting and surviving but not action oriented combat then this game is for you. If you want an action MMO this is not for you. \n\n\nThis game takes patience to start once you skill up things get easier.\nRecommended server: skolpolis\n\nDon't make a bad review just because it's not your game style.\n\nps: watch some videos on youtube see if you like it before you buy it :)", "timestamp_created": 1482860973, "timestamp_updated": 1484851823, "voted_up": true, "votes_up": 75, "votes_funny": 2, "weighted_vote_score": "0.786705672740936279", "comment_count": 9, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "98880159": {"recommendationid": "98880159", "author": {"steamid": "76561198402521885", "num_games_owned": 623, "num_reviews": 136, "playtime_forever": 27900, "playtime_last_two_weeks": 0, "playtime_at_review": 11804, "last_played": 1710022003}, "language": "english", "review": "One of the best sandbox games I ever played. Yes, it looks rough around the edges, yes, UI looks bad, movement is bad but I hardly notice it because I enjoy the level of depth this game gives. It does not hold your hand and to be efficient you would need to read wiki pages, watch video tutorials. Too much content, too many activities to keep you busy. \nI've seen some negative reviews saying this game is being abandoned by devs. I wonder what else would they expect, game is finished and has 10 times more content than any other game in the genre. You will spend thousands of hours just to scratch the surface. This is more than enough for single player game. \nI play outdated version (from steam beta settings) because I want to keep old fishing mechanics. Even on that version (old, without latest additions) I have plenty to do. I also use my own custom map with reduced ores, trees and animals, more flat but I need to grow my own trees if I want wood and it takes doubled time to find ores. I created my own cooking contest for myself where I opened all recipe files and edited it to make sure my toon knows no recipes but one (minced meat). That way I will learn all recipes by experiments. Cooking alone can be moved to standalone game, it has depth you won't find in games dedicated to cooking.\n\nI highly recommend this game to anyone who enjoys sandbox, RPGs, survival games. It might look like not much but underneath the simple visual appearance you'll find very deep and complex game. gamester4life on youtube has introduction videos with very detailed howtos if you need more info. actually what I did, I kept my chrome opened and listened to his videos while playing. helps to learn things faster.\n\nPlayed it on Linux, Debian 10, Nvidia drivers, native Linux port. Game performed as expected, locked 60 FPS on maxed settings. had no crashes or issues ingame. the only time when I had to terminate game process is when I opened settings and its window stuck. If I'm not touching settings everything is stable.", "timestamp_created": 1630930211, "timestamp_updated": 1630930211, "voted_up": true, "votes_up": 35, "votes_funny": 2, "weighted_vote_score": "0.782639265060424805", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "57454668": {"recommendationid": "57454668", "author": {"steamid": "76561198045249103", "num_games_owned": 527, "num_reviews": 8, "playtime_forever": 161850, "playtime_last_two_weeks": 0, "playtime_at_review": 106692, "last_played": 1642123915}, "language": "english", "review": "As of this review time, steam says I have 1777 hours on record. This doesn't include the 3000+ i had on Wurm Online from which this game was birthed.\n\nThis game is captivating, but only for people that are looking at long term accomplishment instead of instant gratification. Most skills can take weeks of work to get to respectable levels, but each incremental gain is in itself a small triumph. Different servers and different mods give a ton of possibilities. The communities are typically full of dedicated long term planners and helpful people, unlike many of the selfish instant gratification types. Game client is very small, runs on java (i believe), and is quite amazing to look at considering these facts. \nThis game requires a lot of time to get anywhere, a ship can take 1000+ parts to build, hundreds of pegs have to be whittled with your carving knife, from shafts that you whittled, from logs you have cut, from trees you have felled. The terrain is completely mutable. Eventually you could dig all the dirt off of an entire mountain down to the rock later, than over months you could mine the rock of the mountain down, then put a layer of dirt over the rock, and it is as if the mountain was never there. There are some restrictions to this, like if someone made a mine tunnel into the mountain, you couldnt mine the rock down past the tunnel unless you used magic to collapse the entire mine... but its doable. You can build castles, villages, have a server with an economy, fight monsters, kill dragons and skin them to make dragon scale or dragon hide armor. You can build 1 weapon the day you create your character, and as time goes on and you become a better weapon smith, you can keep making the same weapon better and better, and enchant it. If you are good at tool smithing, you can take another persons low quality tool that they made and apply your skill to improve it to many times better and hand it back to them. There are thousands of craftable, findable, earnable items in this game. You can play this game for 2000 hours and still have not done everything and have everything possible. Nuff said.", "timestamp_created": 1574135191, "timestamp_updated": 1574135191, "voted_up": true, "votes_up": 32, "votes_funny": 0, "weighted_vote_score": "0.777410328388214111", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "77890656": {"recommendationid": "77890656", "author": {"steamid": "76561198057950624", "num_games_owned": 231, "num_reviews": 12, "playtime_forever": 93123, "playtime_last_two_weeks": 0, "playtime_at_review": 75283, "last_played": 1693061418}, "language": "english", "review": "devs broke their promise to keep parity with wurm online, game is abandoned", "timestamp_created": 1603229064, "timestamp_updated": 1603229064, "voted_up": false, "votes_up": 56, "votes_funny": 1, "weighted_vote_score": "0.77684861421585083", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "24690260": {"recommendationid": "24690260", "author": {"steamid": "76561198035392524", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 66935, "playtime_last_two_weeks": 0, "playtime_at_review": 32368, "last_played": 1668397736}, "language": "english", "review": "I bought this game because a previous reviewer described it as the lovechild of Minecraft and EverQuest. That's somewhat of an accuate description. But Wurm takes strongly after it's Minecraft parentage, which makes sense. After all it was made by some of the same people.\n\nPros:\n- INCREDIBLY DETAILED crafting system. \n- you can build houses and furnish them, make food and clothing, weapons and armor, even build ships\n- sailing is a huge gameplay feature on most servers.\n- sandbox feel lets you build whatever you want\n- no class overstructure means one character can do pretty much everything\n- great to play with a small group of friends, get on a young server and start your own village.\n\nCons:\n-although combat is a feature, I didn't find it to be well fleshed out\n- very limited character customiation and armor options means that after a while everyone starts looking alike\n- there are extremely few functional NPCs (just traders, really) and no quests so combat is entirely sandbox\n- game engine is a 2D engine trying to depict a 3D world - leads to bugs \n- very difficult for single players to get into if no villages are recruiting, you really can't play this game solo well\n- everything involves right clicking and drop down menus, lots of wrist fatigue =)\n\nThings that could be pros or cons depending on your perspective:\n- building takes time and skill, so you get that feeling of really having accomplished something\n- because it is so difficult to be successful alone, playing with others is a bit of a must\n- because the game is cooperation based, you get to know your entire server community, not just your village.\n\nI really enjoyed Wurm for several months until I finally ran out of ideas of stuff to build. And then I didn't know what else to do. I'm not a PVPer and played on a PVE server, but if you like PVP I hear that that is amazing in this game.\n\n\n\n\n", "timestamp_created": 1470233148, "timestamp_updated": 1470233148, "voted_up": true, "votes_up": 31, "votes_funny": 1, "weighted_vote_score": "0.774606287479400635", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "41452591": {"recommendationid": "41452591", "author": {"steamid": "76561198026601363", "num_games_owned": 454, "num_reviews": 47, "playtime_forever": 11919, "playtime_last_two_weeks": 0, "playtime_at_review": 5951, "last_played": 1648445485}, "language": "english", "review": "Old, but gold. Just got an update releasing 2 new skills and lots of other improvements to the game. Come into this game expecting a grind, because that's basically what this game is about: working your ass off to build something to make your mark in the world. It's good alone, but even better with friends by your side. Wurm Unlimited is a fantastic sandbox RPG with a ton of skills to level up and different paths to take. Want to be a blacksmith? A farmer? How about a magic-wielding priest? All of these options are available to you. If you're just starting out, I highly recommend joining an existing village and learning the game with a few other people by your side. It's tough, but also INCREDIBLY rewarding. You won't get your house built in the first day-- but that's okay, because buildings take weeks in real time to decay if they're not maintained. I feel as if Wurm never really rushes you to get anything done and allows you to tackle the game at your own pace. This world rewards patience and dedication. If you're looking for instant gratification however, you may want to do a bit more research before deciding if Wurm is for you.\n\nOh, also, a bit of important information: Wurm Unlimited is an edition of Wurm Online with player-hosted servers instead of the dev's MMO servers and maps. While Wurm Online has a premium feature for extra features, all premium features are available for everyone in Unlimited. Server hosts aren't afraid to add extra mods to their servers (requiring no extra downloading on your part) to enhance your experience. It's fantastic! Check out the Mythmoor (older server, plenty of active deeds) or Revanant (newer, more empty land and less active deeds) servers, the top two populated servers at the time of this review's writing. I'm personally playing on Revanant right now, so if you ever see me in-game, come stop by and say hi!", "timestamp_created": 1523578247, "timestamp_updated": 1523578595, "voted_up": true, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.771547257900238037", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "31712674": {"recommendationid": "31712674", "author": {"steamid": "76561198032089697", "num_games_owned": 92, "num_reviews": 30, "playtime_forever": 38800, "playtime_last_two_weeks": 0, "playtime_at_review": 29206, "last_played": 1605519099}, "language": "english", "review": "The are sandbox games and then there are sandbox games. And then there is Wurms Unlimited. Long before ‘Sandbox’ became a by-word, Rolf and Notch built Wurms Online, it was the one and only 100% sandbox game of its kind to ever exist. In fact it was/is so sandbox-ish you literally feel the sand in your boxer shorts, period!\n\nA disagreement between Rolf and Notch, lead Notch to create a silly little 3D app called Mineshaft….Minedraft?...ummm, look it’s not important what that was called, but Rolf powered on, with the help of his games fan base and soon he popped out a stand alone version of Wurm Online and called it Unlimited!!\n\nGAME PLAY\nSo here we are, Wurm Unlimited has absolutely nothing to do with what is used as fish bait (or that other stupid game ‘Worms’) and everything to do with Medieval life and how to die 1001 ways. With Unlimited you can build anything to your hearts content, from tools of any trade to houses or even to grand towns and cities. You can terraform the ground, mountains, rivers or even make island fortresses. You can also mine tunnels and in recent months you can now create dungeons and dwarven holds.\n\n“But we can do that on (insert ‘something or other’ here) Engineer”, I hear you say! And true you can but Wurms Unlimited is a Mico-Building game, every step of building is done tediously as like real life building. For example, you want to make a simple hammer, you must chop down a tree, cut it into logs then carve these down to shafts then from the shafts you must make the head and handle and finally assemble them together. Every aspect of this game takes the same route, mining to smelting, to forging, it is all done in steps like real smithing. Making clothing, ships, cooking (yes, Unlimited and Online now have cooking recipes), houses, everything.\n\nDid I mention there is 1001 ways to die! You can drown, starve, bash to death by Trolls, God Avatars, become a chew toy for Dragons, Fire Fiends or Daemon Hounds, break your neck/leg/arm climbing mountains, or simply pick a fight with players and tower guards from the opposing kingdoms, so much fun.\n\nAlthough Unlimited is touted as a single player game it is more of a LAN game, so you create your own server and play with friends and family over the Net or Lan. With the choice of Adventure (with some npcs, starter towns and a limited amount of game quests) or Creative (completely clean slate to do as you please) modes straight out of the box you will have months of fun but with fan/community made mod tools you can create your own maps, re-textures and a lot of tutorials on creating your own quests. A great example of this is to check out Katspurr’s recreation of the Ultima Online map on Youtube.\n\nTHE CANDY\nAll is far in love and war, so Wurms is not going to compete graphicly with the likes of The Witcher or Skyrim and even a lot of MMO’s are more prettier but Wurm is still pleasing on the eye with everything looking like real trees, animals, buildings and people, not like other sandbox games emulating that annoying Lego block look (Mindbaft?), so not bad 3D for a Java game.\n\nThe music sound track is pleasing in the background with some authentic tunes and some modern pieces but you do have the ability to install you own in the appropriate folders (there are mods to help). The ambient environmental sounds make the world believable (just don’t go looking for those annoying f^%$&*g ducks, their not in game, yet!), there is a limited amount of animal noises, and a lot of animals have bellowing animations with no attached sound, which might brake your immersion.\n\nTHE BOTTOM LINE\nIf you love the Medieval life, love sandbox and love micro-building, Wurm Unlimited is the bees knees, hands down there is few games that can compete with it, not even that game by Notch, before he sold it to MicroSatan! Its name is just on the tip of my tongue, Minefall? no. And even though Rolf has since stepped away from the development side of both Wurm Online and Unlimited, both are constantly being upgraded and is only getting better with time.\n\nAnyway Wurm Unlimited is just that, Unlimited and only your imagination is its upper limits.\n\nEureka I’ve got it, CRAFTMINES!", "timestamp_created": 1494634372, "timestamp_updated": 1494634474, "voted_up": true, "votes_up": 46, "votes_funny": 18, "weighted_vote_score": "0.767700374126434326", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23559109": {"recommendationid": "23559109", "author": {"steamid": "76561197975305600", "num_games_owned": 181, "num_reviews": 11, "playtime_forever": 185107, "playtime_last_two_weeks": 0, "playtime_at_review": 55581, "last_played": 1676501669}, "language": "english", "review": "Wurm Unlimited is a funner version of the online MMO, Wurm Online.  Single player or multipleyer.  Servers are very configurable.  In Wurm Unlimited players can obtain many useful items which the online MMO dished out to only select players.  This game can be fun solo, but grows so much more when teams come together to build large projects, shape terrain, and trade their crafts based upon their most level'd skills. \n\nI describe this game to my friends as \"very slow minecraft\".  I don't see the details and slowness as a bother.  For me it makes the world larger and more immersive when i can't dig 1 cubic meter of dirt per second, nor carry around 3,500 cubic meters of dirt without breaking a sweat.", "timestamp_created": 1465938155, "timestamp_updated": 1465938155, "voted_up": true, "votes_up": 38, "votes_funny": 3, "weighted_vote_score": "0.765153646469116211", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "27609890": {"recommendationid": "27609890", "author": {"steamid": "76561198019432563", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 16119, "playtime_last_two_weeks": 0, "playtime_at_review": 8902, "last_played": 1612085894}, "language": "english", "review": "Cons: \n\n- Learning curve is hard\n- Outdated ui ( they started working on it )\n- bad optimization here and there ( java )\n- Small team , slow development.\n- Weird combat\n\nPros:\n\n- Lovely community\n- Everything inside game is player made.\n- Massive maps\n- Crafting system\n\n\nThis game has slow progression.If you dont like grinding this game is not for you. If you can handle grinding i highly recommend this game.\n", "timestamp_created": 1480144496, "timestamp_updated": 1480144496, "voted_up": true, "votes_up": 32, "votes_funny": 1, "weighted_vote_score": "0.762192308902740479", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "110774478": {"recommendationid": "110774478", "author": {"steamid": "76561197971789792", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 58614, "playtime_last_two_weeks": 0, "playtime_at_review": 46006, "last_played": 1708883069}, "language": "english", "review": "First and foremost, this is a very niche game. Some people will love it, but most will just be bored after a short time when they start thinking, \"What's the point?\".\n\nI've played both Wurm Online and Wurm Unlimited and Unlimited feels like an afterthought. It has never really mirrored the Online version and it's only gotten worse over the years.\n\nI usually play when I'm in the mood which is maybe once every 6 months and my sessions usually go like this. Find somewhere to build, flatten the area, mine for iron, build a house, build a farm, build a bed, build a boat and... That's it... There really is nothing else to the game even after so many years.\n\nI'm really not sure what this game intended to be but it boils down to a building sim. You can build an entire city if you wanted, but then what? Where does it go from there? Aside from finishing your current building project I can find no other reason to play.\n\nWhat could have made this game great and really stand out from the Online version is open and extensive modding support. When it was first released this appeared to be a goal of the developers. It has since died out. There are no developer tools, documentation or API's available to help you get started, and what fan made tools there were no longer work. It's a stable base for a decent coop RPG, but unless the developers open some doors for the community to expand on that base this game is destined to just smolder on like much unburnt material.\n\nWrite some documentation, release an API, release a map generator, open up the doors to allow the creative minds of the players to mold their worlds into something they love to play and look forward to playing each day.", "timestamp_created": 1645544805, "timestamp_updated": 1645544805, "voted_up": false, "votes_up": 32, "votes_funny": 1, "weighted_vote_score": "0.761244773864746094", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "19043821": {"recommendationid": "19043821", "author": {"steamid": "76561198006219555", "num_games_owned": 149, "num_reviews": 10, "playtime_forever": 9641, "playtime_last_two_weeks": 0, "playtime_at_review": 5619, "last_played": 1573916545}, "language": "english", "review": "Do you miss the challenge of old pre-POP EQ? Do you love building, exploring, and crafting your world? Are you irratated by the playschool ease of most modern MMOs? Then this is the game for you! Everything takes time and effort so when you do accomplish something, it really feels like you have really done something.  It's also great if you love the MMO experience, except for all the other players or if you want to play by yourself or open up a server to just a few friends.  This game is not for everybody, but for those of us who really are old school, hardcore MMO players... this is fantastic. \n\n", "timestamp_created": 1447381424, "timestamp_updated": 1447381424, "voted_up": true, "votes_up": 37, "votes_funny": 0, "weighted_vote_score": "0.759492933750152588", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "19140364": {"recommendationid": "19140364", "author": {"steamid": "76561197972546480", "num_games_owned": 0, "num_reviews": 27, "playtime_forever": 198, "playtime_last_two_weeks": 0, "playtime_at_review": 198, "last_played": 1446401159}, "language": "english", "review": "I tried to like this. I couldn't. I like sandboxes and love them when they have the potential for long term persistent change.\nThis had some micromanaging at the start just to survive your first few nights. That in itself was extremely time consuming and difficult but I like a little challenge.\nMade a server, slightly inflated rates. Ok let's do this.\n\nI eventually found out this relationship wasn't going to happen.\nUser vs UI: You have to right click or go into menus for nearly everything. There is no left-click = use tool. You have to queue up several actions and your character statistics throttle this. It also doesn't help that the game has a built-in wiki that it encourages you to use for every single item. \nThere is no tutorial.\nFighting a wild cat of really low level took half an hour and 3 retreats to heal up. Even then the combat log was saying \"barely poked\" or \"hardly scratched\" which wasn't very reassuring.\nTrying to get started with the 'first night essentials' was taking the greater part of two hours. \nCould hardly make tools as you have a percentage based failure rate in proportion to low crafting skill.\n\nOn top of that Java loved to hang and crash.\n\nThis game is meant for a large persistent community with people religiously returning on a daily basis to get things done. You would only begin to experience what the game has to offer when you have a constant flow of over 16 people working together. There is no going lone wolf and expecting to get a small start to eventually bring people on or become accepted to a group. You need a team and you need people as a single person at starting rank cannot do anything within a reasonable time frame.\nTales of other players explain that they spent months or even years of repeated returns to the game just to spend a lot of time and feel 'rewarded'. It's at this point where the game seems more like a second job than just having fun for a little bit. \nSo for a short pick up and go this is definitely not the game you are looking for. \nIf you like convoluted UI with tons of clicking and days or weeks waiting from queued up actions then this is it.\n\nI don't mind a bit of a grind but this was way too much for my patience, so I can't recommend this title.\n", "timestamp_created": 1447825486, "timestamp_updated": 1447825486, "voted_up": false, "votes_up": 214, "votes_funny": 8, "weighted_vote_score": "0.755898654460906982", "comment_count": 21, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "18619696": {"recommendationid": "18619696", "author": {"steamid": "76561198018365543", "num_games_owned": 267, "num_reviews": 75, "playtime_forever": 40445, "playtime_last_two_weeks": 0, "playtime_at_review": 1463, "last_played": 1492234143}, "language": "english", "review": "Finally, wurm without the harsh, limiting and overburdening rule set. Wurm Online could have been so much more had they just cut out a tad bit of the grind. \n\nNot asking for theme-park hold your hand stuff. Just a game where you don't have to tab out and watch netflix because skilling up is so stupidly boring. \n\nWell, now you don't have to play that way. You can set the skills how you want and be rid of the grip the 'dev' had over the game.\n\nWurm is worth a buy if you love being a settler and surviving and the wilds. Turn the music off for some amazing atmosphere and immersion.  Birds chirping, the hum of the waters, and someone in the distance destroying that stump...\n\nFind a good community and/or meet new people, with 3x or more skill gains you wont have to worry about being glued to that forge for hours just to get one skill up.\n\nThat is what it's all about folks, Wurm Online glued you to the forge or other menial tasks and prevented you from going nomad or exploring proper. This game does not do that, you set the pace, you decided and find out why this game is peaceful and enjoyable. \n\n", "timestamp_created": 1445479748, "timestamp_updated": 1445479748, "voted_up": true, "votes_up": 75, "votes_funny": 2, "weighted_vote_score": "0.752600610256195068", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "50101274": {"recommendationid": "50101274", "author": {"steamid": "76561198054011559", "num_games_owned": 327, "num_reviews": 15, "playtime_forever": 3753, "playtime_last_two_weeks": 0, "playtime_at_review": 3753, "last_played": 1479719549}, "language": "english", "review": "Not normally one to write reviews, but i saw this stained in my library and just had to express my gripes with this absolute tedious, and soulless void of a game. \n\n\n1st: This game is really complex, and while complexity in of itself isn't bad, what is bad is just how absolutely boring and repetitive this games complexities really are. Every interaction is done through a menu interface. You feel more like you're controlling a sock puppet with a serious case of the downs, rather than an actual player, you cant even queue interactions very much. I'd be nice if you could tell your brain dead character \"hey, keep chipping at that rock wall until it's gone!\" Instead, you have to constantly click through the damn menu and wait for the little progress bar to fill, rinse, repeat, rinse, repeat.\n\n2nd: It takes literally forever to build anything at all, and you have to build it piece by piece. It's very in depth and detailed, which would be great if literally everything wasn't such a freaking chore. You fail at doing things just about as often as you would in real life if you were to pick up a hammer and try carpentry, but each failure in this game just means more clicking to bring up the action menu, and clicking to start the action, and watching your character perform the action. Over. And Over. And over. Ad infinitum. This is \"fun.\"\n\n3rd: The world feels dead. Even if you're playing with friends, a group of friends, or a server, the world just feels so disconnected, desolate, and dead. Your interactions with it take place entirely through menus, and hours of slow walking. Walking can be nice, that is if the world was interesting in any way, but alas, it is not. Even the horses are slow. Usually, whenever you go somewhere, half the fun comes from the journey. But here, the journey is tedious, slow, and monotonous. But since the world is dead, desolate, and uninteresting, you won't get any fun from the destination either. So, what's left? Combat right? Well... That leads to the next gripe.\n\n4th: The combat, something fun for most games, is reduced to the same level of tedium as everything else, effectively making it a chore. It's your standard \"Target NPC and watch your character exchange blows with said NPC for 10 minutes\" combat. That style of combat may have worked back when computational resources were limited, but it should have been ditched the moment that changed. It results in a huge disconnect between the player, and the game. As another review stated, you essentially spend 5 minutes exchanging blows with a chicken, while getting tons of wounds, and that's WITH a sword. I don't care how clumsy, and inept you are, it doesn't take 5 minutes to kill a chicken with a sword, nor should said chicken be a serious threat to your insignificant and dull life. Sure, you can pick which body parts your down syndrome champion targets, or the stance he/she is in, but it ends in roughly the same way. 5 minutes of wasted time, a dead chicken, and serious bodily injury to your character. Or, if you're unlucky, a dead player character. Hell even ranged combat isn't much better, since your character just automatically fires arrows in the general direction of your enemy, and lets RNG do the rest. How \"fun.\" Hostile mobs are fine and dandy, but if you think there are any friendly NPCs worth interacting with, you are sorely mistaken there too.\n\nBuilding off of the above gripe, witch is basically that the combat is crap, naturally i'd want to spend as much time running away from it as possible right? Nope, this game can't have that. Once a hostile mob decides to try to forcibly mate with you, you have no way of getting out of it since your character is slower than a half brain dead vegetable with serious down syndrome and a peg leg. A horse can help you avoid this idiocy, but since your horse also has a serious case of the downs more often than not, it's not a full proof escape method. \n\n\nIt is clear that this game was meant to rely very heavily on players, as is the case for any MMORPG, but even with a full crew of lads, or even a full server, this game is still just one big repetitive chore. I honestly got more fun out of this game by idly listening to horror stories on youtube while i mindlessly chipped away at rock, or chopped wood, or built crap. Exploration has always been my thing, and at least in games like WOW the world is an interesting place worth exploring even with it's grindy nature and disconnected, automatic combat.. But here there is no break from the repetitive stupidity of this game.\n\nMy conclusion: If i wanted to experience this game's idea of fun, i'd go to freaking work. Hell, working might be slightly more rewarding, at least at work, you get paid a little bit for wasting your time performing repetitive, monotonous, and tedious chores.\n\n", "timestamp_created": 1555113092, "timestamp_updated": 1555113092, "voted_up": false, "votes_up": 75, "votes_funny": 29, "weighted_vote_score": "0.751336395740509033", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "63377468": {"recommendationid": "63377468", "author": {"steamid": "76561197993057893", "num_games_owned": 274, "num_reviews": 28, "playtime_forever": 20119, "playtime_last_two_weeks": 0, "playtime_at_review": 16651, "last_played": 1582436982}, "language": "english", "review": "!!!!!WARNING!!!!! This game is now ABANDONWARE. This game has been under development for over a long time but it was abandoned to salvage resources to focus on their monthly sub based MMORPG. WU still has potential yet to be unleashed with future mods and community servers but that's highly uncertain since the community is very small. I wish I could post a neutral review as it better suits a divisive game like this but since it offers an experience like few to no other games do, I'd slightly recommend to pick this up at a sale.", "timestamp_created": 1581497580, "timestamp_updated": 1581497580, "voted_up": true, "votes_up": 34, "votes_funny": 2, "weighted_vote_score": "0.747978746891021729", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "19881205": {"recommendationid": "19881205", "author": {"steamid": "76561198022860976", "num_games_owned": 696, "num_reviews": 59, "playtime_forever": 36212, "playtime_last_two_weeks": 0, "playtime_at_review": 17064, "last_played": 1710973030}, "language": "english", "review": "I love this game, but fully understand it is not for everyone. In the video below I talk about my experiences with the game and why I enjoy it so much. Additionally, I talk about the negatives that I have seen lead people away from it, inluding friends of mine I really thought I would love it themselves.\n\nShould You Buy Wurm Unlimited? Let's talk about that...\n\nhttps://www.youtube.com/watch?v=thFOd9Tp3sM", "timestamp_created": 1450893536, "timestamp_updated": 1450893536, "voted_up": true, "votes_up": 65, "votes_funny": 2, "weighted_vote_score": "0.745369374752044678", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "149232651": {"recommendationid": "149232651", "author": {"steamid": "76561198037524033", "num_games_owned": 767, "num_reviews": 8, "playtime_forever": 15157, "playtime_last_two_weeks": 0, "playtime_at_review": 15155, "last_played": 1699054586}, "language": "english", "review": "Man, I absolutely loved this game. I started playing Wurm Online around 2011. When I found out that the game was being released as a standalone game, I knew I had to pick it up.\n\nUnfortunately, the years have not been kind to this game. I anticipated updates alongside the main Wurm Online game. And we got that. \nUntil late 2019. I guess focus shifted. \nI don't expect a game to be updated for decades, but it would've been nice if there was a bit more support. It really had potential to be a great standalone version of Wurm Online. Even the modding scene has dried up. And from what I've heard, the main game is basically dead as well.\n\nThere isn't anything inherently wrong with the game itself. In fact, there really isn't anything like it on the market.\nI cannot recommend this game in it's current state. Maybe someday we'll see a return of development, but I doubt it.\n\nMy biggest recommendation to the devs (if they'll even look at this) is mod support. Get Steam Workshop support going, release some modding tools, and you're golden.", "timestamp_created": 1698725974, "timestamp_updated": 1698725974, "voted_up": false, "votes_up": 32, "votes_funny": 2, "weighted_vote_score": "0.742514610290527344", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "115506213": {"recommendationid": "115506213", "author": {"steamid": "76561197993207103", "num_games_owned": 0, "num_reviews": 29, "playtime_forever": 2456, "playtime_last_two_weeks": 0, "playtime_at_review": 1800, "last_played": 1652978070}, "language": "english", "review": "I like the grind, I really like the complex crafting, I like that I can build houses and towns. \nWhat I don't like is that there is no point in doing anything.\n- whats the point of a fancy home beyond decorations? Linking housing to crafting stations would drive me to do so (e.g. ECO style)\n- whats the point of of levelling combat or better gear? There are no dungeons or combat goals whatsoever - there needs to be a reason to fight and equip yourself (e.g. Valheim bosses)\n\nSomeone else wrote something similar in reviews as well - but once I have my farm, my well, my Iron mine and gear I see no reason to go beyond the basics. Everything I own is low QL - so what? there are no goals whatsoever to make me care to continue progression.\n\nTLDR - Awesome game mechanics - but lacks goals or reason for me to commit my time.", "timestamp_created": 1652630966, "timestamp_updated": 1652630966, "voted_up": false, "votes_up": 24, "votes_funny": 1, "weighted_vote_score": "0.739475607872009277", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "48534542": {"recommendationid": "48534542", "author": {"steamid": "76561198058129950", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 191478, "playtime_last_two_weeks": 0, "playtime_at_review": 40455, "last_played": 1711394968}, "language": "english", "review": "It's hard to write a review for a game which, unlike the original Wurm Online, offers a fundamentally different experience with each individual server you visit and allows you to tailor your own experience to your liking, when playing singleplayer. But if I had to sum it up at it's core and based on my experience with the original version of this game - Wurm Online (which is still up by the way), it's an extremely dated game that offers concepts that are still ahead of the curve to this very day.\n\n[u][b]To Wurm Online players:[/b][/u] You've already experienced the core gameplay, no doubt. To you, this version of the game will give with one hand and take away with the other. It offers an extreme amount of customization options and allows you to tailor your Wurm experience to the \"T\" on top of giving you the ability to host your own dedicated servers - the main driving force behind this re-release. \nHowever, by being divided into a multitude of lesser dedicated servers that most often aren't connected with each other via the WO cluster format (although, to my knowledge, such an option exists), the game loses some of it's charm and sense of grandeur. Trading and being proficient in certain skills is less profitable and even less  relevant, depending on the nature of your preferences, due to a much smaller amount of people available to trade and interact with. Being a boat builder, for instance, may not be as profitable if there's only 10 people on the server.\n\n[u][b]To everyone else:[/b][/u] you're getting yourself into something that could potentially end up being the adventure of your lifetime (albeit a slow-paced one). This game is one of the most complex (and downright complicated) survival/sandbox MMO games out there. However, in turn it also grants the player with an unprecedented level of freedom. Any aspect of the in-game world lends itself as a canvas for player creations and interactions. Each element within can be manipulated according to player's whims. Don't like that tree over there? Cut it down. Simple stuff? What about that pile of dirt and grass? Yeah, go dig that out. Erm...pretty standard. Okay. How about that mountain top over there? Yeah, go ahead, you can mine that shit back down to sea level, granted, it'll probably take you a few decades...\nWurm is a total sandbox. There's absolutely no restrictions (well maybe apart from the GUI, which certainly did not age well.) You're just a person, thrust into a world. Whatever you do with that is up to you. Build a few houses and establish a settlement, or perhaps even an entire kingdom, or maybe become a priest, deriving magical powers through the worship of your favorite god.\n[u]BUT BEWARE[/u] - this game makes no attempts at holding your hand. You will die. It will probably not always make sense. The logic of this game and it's mechanics are extremely unorthodox and will take a certain mindset to get used to and appreciate (or tolerate, at the very least.) You may be a die hard survival/sandbox game enthusiast and hate this game's guts. Or you may not come from such a background at all and fall in love with this game.\n\nThere's no middle ground with this game. It will either make you want to take a bullet for it's developers, or burn their studio down. I happen to fall into the former group, thus my review is marked positive. However, I am aware, that to the other half of the audience, this will fall on deaf ears. And that's okay.", "timestamp_created": 1548390172, "timestamp_updated": 1548390420, "voted_up": true, "votes_up": 23, "votes_funny": 2, "weighted_vote_score": "0.739469647407531738", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23197260": {"recommendationid": "23197260", "author": {"steamid": "76561198076093453", "num_games_owned": 386, "num_reviews": 125, "playtime_forever": 12402, "playtime_last_two_weeks": 0, "playtime_at_review": 1603, "last_played": 1627242361}, "language": "english", "review": "I've played Wurm Online for years. When I first heard of this coming out, I got it for pre-order because it's everything I wanted. It was Wurm Online without being public, I can do anything without harming anyone, and thats how I wanted it.\n\n** You can edit skill modifiers, so the game can be grindy, or not grindy.\nI like it kind of in between, because I get appreciation when I build a house with low skills.\n** You can be GM and change the world whatever you want. Fly! Even seasons & weather change daily.\n** You can mod your world. \nI have a custom map at the moment, I created it with a generator and plopped it in game.\n(Photo below.)\nhttps://67.media.tumblr.com/974ac9faaa8a636b5693eca3f2c58153/tumblr_o7p65xEFve1sd1k09o1_1280.png\n** You can play offline or online, and you do not need to PVP anyone. No looters! Unless you want them!\n** You don't like walking? Build a boat! Big or small, you can go for it. Don't like boats? Ride a horse, or better yet, ride a crocodile, because you can DO that shit.\n** Wanna play as a theif? Adventure mode has a few buildings scattered around, learn your lockpicking skills and break open the doors. I had THIEVERY as my affinity and it was grand watching my skill shoot up when I opened chests.\n**Get your friends together, you can build houses and castles, and farms. \n** Make armor, farms, raise sheep, cows and horses, even firey hell horses!\n\nSince there are no trolls unless you wanna play public, playing privately is a blast with friends.\nI have no regrets getting this standalone version, except maybe that they need to add more furniture, but that's coming!", "timestamp_created": 1464161021, "timestamp_updated": 1464161021, "voted_up": true, "votes_up": 31, "votes_funny": 1, "weighted_vote_score": "0.737939059734344482", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "93712129": {"recommendationid": "93712129", "author": {"steamid": "76561198025661626", "num_games_owned": 1813, "num_reviews": 197, "playtime_forever": 117, "playtime_last_two_weeks": 0, "playtime_at_review": 71, "last_played": 1623634943}, "language": "english", "review": "As great as the game it I cannot not recommend anyone buy it at least at Full Price. Mainly because the Developers lied. They had originally said that this standalone version would be kept up to date with the MMO and they have now abandoned it while the MMO is still getting updates.\n\nWurm Unlimited is a sandbox survival crafting game with a fantasy setting and RPG elements , this game needs a lot of your time and patience, you can do just about anything in this game , you can host your own world and invite other people, enhance your character’s abilities and skills with a very very deep skill progression system that caters to all tastes, lot’s of creatures to hunt and tame and also breed, you can build your own fully functional city, the possibilities are endless. \n\nSadly the Devs gave up on it instead of giving it a fair chance by at least doing bare minimum QoL improvements. Like allowing third person or just making the game easier to understand because it basically plops you in game and says have fun. There is a tutorial, but it's garbage.\n\nI really want to recommend the game as I think everyone should give it a go, but it's abandoned sadly.\n", "timestamp_created": 1623633251, "timestamp_updated": 1623633251, "voted_up": false, "votes_up": 31, "votes_funny": 1, "weighted_vote_score": "0.737044274806976318", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "42503354": {"recommendationid": "42503354", "author": {"steamid": "76561197989363390", "num_games_owned": 284, "num_reviews": 11, "playtime_forever": 17563, "playtime_last_two_weeks": 0, "playtime_at_review": 17232, "last_played": 1532029780}, "language": "english", "review": "I might have gotten to this game quite late, but believe me when I say it's still completely amazing. Despite having started in development 15 years ago as Wurm Online (2003!), this game still receives content updates and overhauls - and the amount of work and love poured into it really shows in its quality. \n\nThis is the absolute best sandbox style game I have ever played, without exaggeration. While its UI is clunky and the game is overwhleming to start, both of these aspects stem from the sheer amount of choice available to you. With complete access to terraforming and over 100 types of skills to do everything you could want - including combat, carpentry, masonry, house-building, farming, animal breeding, tailoring, wine-making, and even bee-keeping - you are completely let free to create your own life in-game. With the sheer number of things to do and goals to set for yourself, each player will have a different experience custom-tailored to their desires, limited more by imagination than ability.\n\nThings in Wurm take time. Time to hone your skills, time to craft, time to complete your goals. Nothing is handed out for free, but instead by your own efforts. This time however, isn't in the form of waiting around - it is through laborious process. Making a cart to be dragged by horses requires assembling planks and wooden shafts to make wheels, putting those wheels onto an axle, and then attaching that to the body of a cart. Everything is done piecemeal, following the natural steps to create something in real life. Even a bed in Wurm takes time to put together: a bed frame, a footboard and headboard (all built from their requisite parts), some sheets and some furs. This isn't like Minecraft, where you can punch a few sheep and a tree and have a bed in minutes; this is a game for when you want to feel like you've accomplished something by working with your hands.\n\nAnd by hell will you feel those accomplishments. Something that seems so easy in other sandbox games - like building a house - becomes a real task in Wurm. A small, basic house will take you at least an hour or two to put together as you build walls, floors, windows, doors, and a roof. Later on, you'll want to build a bigger house - deciding to put together something with multiple floors, higher ceilings, and more square footage will have you spending multiple days to piece it together. \n\nWurm turns tedium into adventure - each step along the way feels like progress instead of grinding. Add that to being in a living, breathing server with other players also shaping the world, and you'll find yourself meeting neighbors, making friends, trading goods and services, exploring together, and lending a helping hand. Even I, who assumed I would play solo and live the life of a hermit, ended up warming up to an extremely friendly community in a tight-knit server, happy to ask questions and give advice.\n\nSeeing as Wurm Unlimited works on a buy-to-play model (as opposed to the subscription service of the Wurm Online MMO), it is more worthy of a purchase than ever before. Most servers on Wurm Unlimited have been running for multiple years, making them just as persistent as an MMO server. If you're looking for a place to start, the Otherlands server cluster is a great place - not too crowded, friendly, and run by a well-respected modder of the game. It's a perfect time as any to start a second life in Wurm!", "timestamp_created": 1528180227, "timestamp_updated": 1529947207, "voted_up": true, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.736682474613189697", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "132433334": {"recommendationid": "132433334", "author": {"steamid": "76561198177896725", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 387316, "playtime_last_two_weeks": 14071, "playtime_at_review": 318445, "last_played": 1713799906}, "language": "english", "review": "If you look at how many hours I've put into this game, it's clear to see that I've enjoyed it. I'm a GM for two private servers. Wurm Unlimited is a game people either love or hate. There is a steep learning curve, every server is set up differently, and with different mods. So your experience will vary considerably depending on which server you play on. The overall mechanics could maybe be described as Runescape-ish. There's a ton of skills to grind. Mining, armor making, farming, cooking, fishing, and tons more. Building is fun if you know what you're doing, and the tricks to make the most of the building mechanics. Most people seem to stick with Wurm for the social aspect. I've made some dear friends that have been a part of my life for many years. I've also had a lot of friends come and go. \n\nWurm isn't for everyone, but I've seen people get sucked in when they learn the mechanics and realize just how much you can do. If you like grinding, skilling, building, and adventuring, Wurm might be worth a try. Contrary to most games, Wurm is extremely open ended. There are no quests. This is the world you live in, and you go about your life with your own goals. Maybe you want to build ships and sail the high seas. Maybe you want to farm and cook like a hobbit. Or band together with friends and take down a dragon. I think this part of Wurm is the most divisive. If you are a person who thrives in games that are task and quest oriented, Wurm can seem TOO open ended. It's definitely a game more suited to self-motivated folks who want to play and explore without being tied down or gated by quests. It's a big ol' sandbox.\n\nThe other important aspect to Wurm Unlimited is finding a server that suits you. Some servers are extremely strict with a lot of rules. Others are more relaxed. I've joined servers where no one ever speaks or engages with each other, or there's a ton of bickering and drama.  Then there are servers where people are welcoming and chat happily with each other all day long. \n\nAs a GM and a long time player, I recommend learning the basics, keep Wurmpedia open (not all the info is correct because it was made for Wurm Online, but much of the info will still be useful to Unlimited players as well), and don't be afraid try out a handful of servers. That's the only way to really get a feel for the differences between them. Find one that has an atmosphere that feels welcoming to you, a GM team that is active and responsive, and has the mods and quality of life improvements that you want. Eventually, you will develop your own preferences and find the server that feels the most like home. Happy Hunting!", "timestamp_created": 1675880280, "timestamp_updated": 1675880280, "voted_up": true, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.735564231872558594", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "104542866": {"recommendationid": "104542866", "author": {"steamid": "76561197987853448", "num_games_owned": 0, "num_reviews": 38, "playtime_forever": 11555, "playtime_last_two_weeks": 0, "playtime_at_review": 11555, "last_played": 1606944047}, "language": "english", "review": "Genuinely one of the best sandbox survival games out there. It somehow manages to capture and distil that feeling of being in a rich fantasy world so much larger than yourself. Playing this gives you that feeling of watching LoTR for the first time.\n\nWill you be grinding for days:                           Yes.\nDoes it look like a 90's potato:                         Yes.\nWill the spiders haunt your dreams forever:    Absolutely.\n\nIs it satisfying:  More than any other sandbox I've played.\n\n\n", "timestamp_created": 1638107453, "timestamp_updated": 1638107453, "voted_up": true, "votes_up": 25, "votes_funny": 4, "weighted_vote_score": "0.735118508338928223", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "28011606": {"recommendationid": "28011606", "author": {"steamid": "76561198123280636", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 73346, "playtime_last_two_weeks": 0, "playtime_at_review": 69916, "last_played": 1479965854}, "language": "english", "review": "I enjoyed Wurm had a neat private server to play on with no fee and some people to hang with.  Built a castle, killed some trolls, even sailed around the world for kicks.  Alas, I have had the \"Duplicate Authorization\" error for 6 months now and haven't been able to play.  I understand that the company is cash strapped but seriously it's hard to recommend a game that you literally cannot play.\n\nAnyone thinking of buying this should recognize a few key \"features\"\n1.  combat is very slow, at it's quickest you strike once every 4 seconds.\n2.  advancement is very slow, grinding up the crafting skill to make anything vaguely useful, i.e. QL 50 takes many hours of click the same button 100's of times.  (more if you gather your materials rather than buying them off another player).\n3.  ranged combat is very bad mostly because arrows have to be crafted individual and then improved individually.  Very long story short, each arrow takes just as much time to craft and improve as a sword or a huge axe, and at best each arrow is good for 5 shots.  So not only does it take a huge amount of time to do it in the first instance, but you are continually having to invest a similar amount of time almost every time you get into combat.\n\nBasically this game reminds me of Eve Online, very slow progression, limited interaction combat and where the chief draws are fairly heavily based in the kinds of connections and friendships you make.  It's neat to make a castle or a ship, but unless there are a bunch of people who band together ultimately these things become meaningless.  I can't say for certain, but I think there are other games that can placate your crafting fix with better combat.", "timestamp_created": 1480382875, "timestamp_updated": 1480382875, "voted_up": false, "votes_up": 42, "votes_funny": 2, "weighted_vote_score": "0.733137845993041992", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "35257675": {"recommendationid": "35257675", "author": {"steamid": "76561198035094289", "num_games_owned": 4896, "num_reviews": 100, "playtime_forever": 167, "playtime_last_two_weeks": 0, "playtime_at_review": 166, "last_played": 1522208867}, "language": "english", "review": "Okay, I've only spent a short period of time in this, but I want to go ahead and say that starting my own private offline \"server\" was a piece of cake. I watched a three minute video on how to do it, and then did it. Simple, no issues, worked fine on the first try. \nThe graphics aren't bad at all. The music is nice. I ran straight into a \"guide\" NPC to show me how to do basic things. So, yeah. I'm glad I ignored the negative reviews from people who didn't bother to look up exactly how to do these things. It's really not rocket science.", "timestamp_created": 1506589179, "timestamp_updated": 1506589179, "voted_up": true, "votes_up": 68, "votes_funny": 1, "weighted_vote_score": "0.732587873935699463", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "28807403": {"recommendationid": "28807403", "author": {"steamid": "76561197980069191", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 6168, "playtime_last_two_weeks": 0, "last_played": 1584862976}, "language": "english", "review": "Very fun game depending on the server you join.  The pacing can be slow - also depending on the server you join - but nearly everyone is wonderfully helpful on PvE servers and the bants are great in PvP.  Most other recent reviews of this seem to be complaining that it is too complicated - but that's kind of the draw for me.  I have to know what I'm doing when I do it, and Wurmpedia has just about everything needed to know how things work.\n\nI'd market this as a cross between Runescape and Minecraft, with *sometimes* Eve-levels of complexity.  Don't play this if you want to slay dragons.  Do play this if you want to know the joys of staking a claim to build a 4x4 wooden house so you can start a textile industry and capitalize on the good port location you have here and start selling sails to passing players on their large ships while doing odd-jobs for that guy who's been here for months in the 64x64 castle at the top of the huge mountain behind you.", "timestamp_created": 1483050865, "timestamp_updated": 1483050865, "voted_up": true, "votes_up": 26, "votes_funny": 9, "weighted_vote_score": "0.731674492359161377", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "26700935": {"recommendationid": "26700935", "author": {"steamid": "76561198015337461", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 268853, "playtime_last_two_weeks": 0, "playtime_at_review": 51437, "last_played": 1709519946}, "language": "english", "review": "My favorite part has to be making roads and bridges to connect the land together and give it a \"lived in\" feel. The seasons are well done and the ambiance is excellent. Sure the graphics are dated but do the job. If you ever get to a point where you have planted a couple hundred trees in a field then saw them grow to a full fledged forest.. its just really neat how different it looks and feels, atmosphere. Chopping the trees, having them fall, shaping the land under you. Just takes patience and imagination. It can be a very Zen experience. NOT an action game, at least not when playing alone or with 1 other person =)", "timestamp_created": 1479594336, "timestamp_updated": 1479594336, "voted_up": true, "votes_up": 22, "votes_funny": 1, "weighted_vote_score": "0.728725016117095947", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "18604244": {"recommendationid": "18604244", "author": {"steamid": "76561198032792135", "num_games_owned": 218, "num_reviews": 2, "playtime_forever": 188703, "playtime_last_two_weeks": 0, "playtime_at_review": 336, "last_played": 1696707127}, "language": "english", "review": "11/10 Would milk male Bison again.\n\nWurm....oh where do I start??!?\n\nSo, I've played Wurm Online (The MMO version of WU) And have had Amazing stories in the living, breathing world.  Good and bad, of course. Was it worth it though? Yes...So much yes. Especially with the friends I made. (hey! :D)\n\nIf you've played the game,.. Well, WU is basically WO...With full customization at our control.\n\n\nWurm is a Sandbox....For me, it's \"THE\" Sandbox. And now that it's released it's own stand-alone version, where I can mod the game to my liking, It's trully  - Finally - The game i've been waiting for.\n\nWith over a 100 skills (I'm not sure the exact amount) you can bet you will find many that you will enjoy, I won't lie though, be warned, Some (Like beverages) Have little use currently.  (There ARE uses, just not much) And some skills have this problem.  But once mods are made, I can't imagine what this will become.\n\nHowever, there are PLENTY that work. Blacksmithing, Woodcutting, Carpentry, Weaponsmithing, Fishing, Mining, this list doesn't really stop.   most skills involve what we call \"Imping\" - Which is improving your tools, weapons, armour, gear, vehicles, Ect.  The higher the \"quality\" of a item, the better it performs in it's task. and the less damage it takes while in-use. I can assure you one thing, You can-not find a better crafting game right now. And I don't think you will for a VERY long time.  this game lives, and breathes, because of the crafting.\n\nNow, in WO (Wurm online) The skill gain is very slow, it takes years to level up skills, and only a hand-full of people have hit \"100\" in a skill.  However, WU you'll be able to set your own speed, So if you wish - You can have it slow, Or you can speed it up. it's YOUR choice! (Default speed on WU is 10x that of WO)  - As a side note, The higher your skill, the better you can craft things /Improve them.  At very low skill,  lets say for example 30, it would be very hard to improve a item over 40.\n\nThe World: Everythings destroyable. Every tree, Every mountain.  Want to dig down 500 feet? Well, if your servers that big. go for it!!  Terraforming in this game was hard to understand at first (For me) But after a while, it got so much fun. You and the players build it, are you in the middle of a huge landmass in a lake, but want to connect it to the ocean? it may take a while, but you can dig/surface mine a \"canal\" To the ocean, so boats can enter!\n\nEach tree is one that randomaly generates, or you plant.  You can \"pick sprouts\" from trees, \"prune\" them to let them live longer, ect.  Forestry/gardening is one of my favorite skills. I love creating my own forest for the world.\n\nTrasportation? Yep. we got that. Horses with saddles/horseshoes/bardings to increase speed, armour, turning. ect. \nCarts, Large and small, Wagons, and multiple boats (Caravel, Cog, Knarr, ect) I personally am not a huge fan of sailing, as it's pretty slow, but (Again!) we get to change that up in our own servers. :)\n\nCombat: Combat is a bit odd, and I really want mods to improve/overhaul this.  The combat is, basically, clicking on a button for where you will aim (The head? The legs? Ect) and same for blocking.  The good thing is, aiming at area's have benefits.....For example, if your in PVP and you hit a guy hard in the foot, he will start moving slower.  \n\nThere IS archery and spells, However, I will warn you - It's not exactly a \"main combat\" role at the moment.  Mods again, are likely to change this.  Archery REALLY needs to be easier to use as it's a button-click fest right now.  Spells are only \"supportive\" in combat, and not really a main fighting style.\n\n\nAnd we have a \"God\" system in wurm, This is a very big part of the game, as we have \"missions\" (sort-of like quest that random-generate) to do things for them for karma (used in spells) and sleep bonus (used for gaining double exp for a short time)  Also, you can become a follower of one that gives some benefits.  You can also become a priest, Which allows you to enchant weapons, armour, and tools for special effects (Increased speed-of-use, More damage, More experience gain, Ect) I really can't wait to see what mods come out for priest...and new spells. :D  Also, champions.  basically a better version of a priest, but limited in number on server.  They're mainly used for combat - they're the big PVP guys you want to kill first! or you will face the wrath of there gods abilitys. \n\nEDIT TO PRIEST:  Priest (Not champions) by default are limited in what they can do, For example, Vynora priest can't mine, dig, ect.  though they can cut trees, farm, ect (each priest has different can-do and can-not.  All priest are not allowed to \"Imp\" things.  However, in WU you can change this to have different/no restrictions if desired.  Champions do NOT have these restrictions, despite being able to cast spells ect.\n\n\nCONS? \n\nBugs,  Lots of weird, little bugs.  I have very few issues personally, but some players have a lot.  (For example, a large cart on some players screen will appear 10 feet away from where it really is...) Or doors not opening (usually due to server lag, though)  Nothing to big usually, But a bit of annoyance at times.\n\nAnimations aren't the greatest.  I really wish there was more, and \"better\" of what we have.\n\nCharacter models feel odd because of the animations. They also could have a model improvement IMO, however, they don't look to bad. (Also, some of the gear for them actually does look pretty sick!, that's not a con obviously :P )\n\nDefault speed of WO (which Isn't the same as WU) is pretty slow for the normal player.  WU is a lot faster from what I've seen so far.  But the game isn't like, For example, Ark. it's slow.  I personally Like this, as it gives a sense of accomplishment.  The good news is, however, that if you DON'T like this, you can speed it up as much as you like, and where you like. (Or the server you join can) \n\n\nIf you want a REAL sandbox, One that REALLY let's you do what you want...... I can't say there is a better game out there.  Since I found wurm, I've not found one even come close (and I've tried at times) And with being able to mod WU, really anything is possible.  I'd highly recommend.\n\n\nIF you have any questions regarding Wurm at all, I'd love to help if able! Pm or comment and I'll see if I can help. And, please, If you agree or disagree with this review, please say so! I would love to hear other peoples opinions on this game, good or bad.  I wish I could share the storys i've had in this game, because I've had so many. Especially with all the friends I've made.\n\n\nTLDR: Highly Recommend to anyone looking for the \"true\" Sandbox. Especially with WU being moddable.\n\n\nEdit: Also like to state, i've played wurm since 2012, which isn't long at all compared to most members. But in that time I quickly grasped the game and have gotten to the point now where I can self-sustain all my things at 90ql and do my own enchants.  Most people specialize, I personally, can't.  My minds all over the place.  So if you only like a few skills, or only a few interest you - Don't worry. The skills have a LOT in them that you can spend, literally, years with.  or, if your interested in all of them......you can easily do all of them! (You aren't limited to skills, UNLESS you priest! I will add info to the priest section on this)", "timestamp_created": 1445452237, "timestamp_updated": 1445453056, "voted_up": true, "votes_up": 149, "votes_funny": 25, "weighted_vote_score": "0.726851820945739746", "comment_count": 24, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "49224066": {"recommendationid": "49224066", "author": {"steamid": "76561197979770641", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 51049, "playtime_last_two_weeks": 0, "playtime_at_review": 46805, "last_played": 1638171770}, "language": "english", "review": "This isn't really a game, but it's more like a pyramid scheme where veteran players constantly attempt to exploit new players. Thus, it is a massive waste of your time unless you want to be someone's slave. On average, most players will never be able to fully experience this \"game\", and you'll learn this only after investing a lot of time.\n\nFor new players, who recently bought this game I have tips, and I recommend following them when you truly want to learn to play this and get the most out of your purchase:\n\n1. Deed your own settlement by yourself or with a small group of friends because you're going to have the most fun when you have complete freedom to make mistakes and build what you want to build. There's much to be learned when you go off on your own and make mistakes.\n\n2. Beware of any player who offers to give you access to \"unlimited\" resources when you join their settlement because they most likely want to exploit you for your labor. I.e. They want to keep the resources that you waste your time converting. You don't want to be stuck farming hundreds of potato plots, cutting thousands of stone bricks, or digging pointless slopes for someone else. I've seen it happen to new players all too often, and they usually get burnt out and quit within a few days - unless they just don't know any better.\n\n3. Ultimately, you don't have to do anything that anyone tells you to do in this game and it's all up to you to decide what you want to do. You should try to be as courteous to other players as possible, but you will do well to remember that this is only a game. You might even find yourself reminding this to other players.", "timestamp_created": 1551070224, "timestamp_updated": 1553455840, "voted_up": false, "votes_up": 116, "votes_funny": 22, "weighted_vote_score": "0.722682178020477295", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "54606823": {"recommendationid": "54606823", "author": {"steamid": "76561197984466782", "num_games_owned": 0, "num_reviews": 80, "playtime_forever": 15640, "playtime_last_two_weeks": 0, "playtime_at_review": 11678, "last_played": 1571613717}, "language": "english", "review": "Server owners play politics on the forums, take advantage of players for real money, all supported by the devs. You'll get treated like garbage if you do anything to help the community. I'm pretty happy in my corner, but I've run into it myself. This game is fantastic, the nasty, toxic community destroy it. It's mostly retired or disabled, bitter people playing forum warrior and faking player numbers on their servers with the support of the development team.\n\nDon't take my word for it. If you buy the game, organize the server list by player count, then compare that to Steam's server listings. \n\n\nOtherwise, mechanically the game is great. If you need someone to play with, let me know. It's a social game and you really don't want to get stuck picking your way through the garbage in this community.", "timestamp_created": 1565746499, "timestamp_updated": 1565746499, "voted_up": false, "votes_up": 47, "votes_funny": 3, "weighted_vote_score": "0.721504628658294678", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "38567175": {"recommendationid": "38567175", "author": {"steamid": "76561198216488652", "num_games_owned": 1546, "num_reviews": 28, "playtime_forever": 525, "playtime_last_two_weeks": 0, "playtime_at_review": 525, "last_played": 1514013701}, "language": "english", "review": "There is a fairly good chance that your experience with this game could be very close to mine. \nI got this game in a bundle, so it wasn't something I had looked into and had built up any idea to compare it to upon playing. If anything, it just sat in my library for a while. Initially, I had figured it to be just another MMO, something I'm not normally too keen on at all. It was actually finding out about the settlement building and all the crafting aspects that got my attention.\n\nSo I tried to dive in and see what I could start. I started my little server to play solo.\n\nIt took some amount of time to get a grip of the controls and UI in their full extent. Almost methodically, I just clicked and right clicked through all of the bits of the UI, figuring out what was what. All told, this took some time. I don't think it ends up being a totally useless setup, but you get in your own way a lot doing this, then that, then that. At the very least, it's worth noting, as have nearly all of this game's negative reviews, that default setup requires you to hold the left mouse button just to look around with mouse aim.\n\nHow fiddly.\n\nFrom this point, I'll just do a play-by-play, hopefully providing a sense of the fiddliness and tedium, as it amounted to in the end for me.\n\nSo gathering what's in my starting inventory and what the tools do seems obvious enough, so I set off to cut down a tree.  Start with wood.\nIt took... too much time and too many clicks, frankly. Right click the tree, choose cut down. Not enough work? Do those motions again. Again. Ah, I have a log!\n\nOkay, so the material has to be in one's inventory to work with it. Okay, even though logs are rather heavy and carrying more than one tends to encumber you like a gut full of whiskey. \nTrying out the various tools on the log, I make some kindling - that'll be useful, I'll need a fire surely. Now I make a... oh, no, I [i]failed[/i] to make a plank. Try again. Okay, made a plank. This log doesn't contain enough material to make these other options... so I have a remaining hunk of log, a spare piece of wood, kindling, and a plank in my inventory now. \n\nWhat can I do with the plank? Let's... mmkay. \n\n*Half hour of spiralling Google searches*\n\nOKAY..... so I need a LOT more trees cut down to logs cut down to planks for the house AND a few shafts to make a MALLET, with which I can then start to work on some flat land to make plans for a house... \n\nMallet first. Select knife, click create, construction materials, and then shaft. Okay, logs whittled down to shafts, one shaft gets cut into a mallet head. Now I select the mallet head, click on the shaft to create ma... okay, that other shaft doesn't work, fine. Make another shaft. Mallet head, click shaft, create, and mallet... okay, I failed to make it. Failed again. Ah, fiinally, I have a mallet.\n\nChrist, now I need to deal with a mountain lion...\n\nI now have a littering of wooden bits and pieces and a dead mountain lion in my inventory. Let's... to hell with it, let's cut up the mountain lion. KNIFE. MOUNTAIN LION. BUTCHER.\n\nI failed to make a paw, head, something else - Christ, how many items can come from a mountain lion in this game? I made meat. Fine, meat.\n\nI'm waaaaaay encumbered, so... drop stuff? Jesus, I have about 40 different things and material byproducts littering my inventory. Drop half of everything. Thieves can steal stuff until I have a house? Fine, whatever... Let's finish the house, and I'll stack up my lincoln logs, and tool parts, and sawdust, and mountain lion meat in it.\n\nSo, house... I have my mallet. Mallet, let's plan a building on some ground. Not flat enough. Okay...\n\nSelect shovel. Click ground. Flatten. Dig, flatten, level. Oh, I can't level, I have to be on flat ground to level.\n\nMallet, go plan on my now flattened ground. Not flat enough.\n\n*A shorter episode of Googling \"wurm flatten ground\" and the like*\n\nOkay, so... I have to make sure that the slopes to and away from the square's corners and tile borders are all evened out to say flat, doing so by digging and dropping dirt where need be.\n\n*Minutes of buggery with digging dirt and hitting the \"flatten\" and \"level\" commands*\n\nEncumbered by the dirt piles I'm carrying from digging... okay, and now I have piles of dirt, and meat, and sticks, and logs basically just scattered like a bomb went off.\n\nHey, the mallet finally planned a house on that square! Let's see if I can plan it into a slightly larger house with the square next to it. It did! I have a two tile house frame now! Something is happening!\n\nNow, let's get greedy and try a third tile house. Oh... my carpentry skill is too low. Fine, I'll take this step by step. Progress is rewarding.\n\nOkay, mallet, let's right click that frame and... 'finalize house plans'......\n\n... My carpentry level is too low to finalize the plans that I started?\n\n*Google*\n\nOkay, I deleted one tile of the plan. FINALIZE. Okay, it finalized, no change visible. Let's try building a wall.\n\nI don't have large nails to do that.\n\nNails. Hm. Nails, that means... metal, which... blacksmithing...\n\n*Google*\n\n\n\nThis was the point at which I just called it quits. The graphics have no character or wow, the sound is actually nice at times, mostly considering some of the music. But, those are footnotes. Everything just takes too much in this game.\n\nI'm sure I played it wrong and all that jazz. Fine admitting it. But the fact is, I've actually leveled ground and built and installed such things in real life. It was immeasurably more fun, more rewarding. And I'm not going to suggest that comparable aspects of building in game and in reality [i]actually[/i] took longer in the game, but the tedium and overcomplication of doing them through the layers of UI certainly tested my patience more than it could have ever been worth if I'd kept going. \nAfter all, it's not like the UI is just part of the early game doldrums of a survival game. Rome wasn't built in a day, but when it was done, Romans happily killed damn near everything they saw. \nKilling that mountain lion wasn't exactly fun. It was... tedious. This is just the game through and through.\n\n\nI can't totally reconcile that the depth and detail of these operations sounds good on paper to me, but in practice just makes the game an utter chore. I think it just requires that I commit way too much to... you know, a video game.\n\n\nTL;DR - go back and read it.", "timestamp_created": 1514017412, "timestamp_updated": 1514018392, "voted_up": false, "votes_up": 125, "votes_funny": 37, "weighted_vote_score": "0.721137881278991699", "comment_count": 16, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "53175828": {"recommendationid": "53175828", "author": {"steamid": "76561198018402100", "num_games_owned": 764, "num_reviews": 22, "playtime_forever": 225606, "playtime_last_two_weeks": 0, "playtime_at_review": 137285, "last_played": 1711197419}, "language": "english", "review": "I've got MMO levels of hours in this game.  I almost feel like I'm starting to know what I'm doing.  That's the joy.  Constantly learning about new things to build or new mechanics after 2000+ hours is fun for me.  90+ skills. Focus on one or all.  Join a village and help it thrive, or just explore/survive the wilderness.  The game is the most absolute freedom I've experienced in a sandbox.  The combat is clunky, the graphics are subpar, my stories of adventures...fascinating.  It's not for everyone and my number one advice is, find someone who's already playing that's willing to teach you the ropes.  The learning curve is steep but if this is your niche/genre, it can be very rewarding.", "timestamp_created": 1562081773, "timestamp_updated": 1562081773, "voted_up": true, "votes_up": 27, "votes_funny": 0, "weighted_vote_score": "0.719276785850524902", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "39517408": {"recommendationid": "39517408", "author": {"steamid": "76561198090757837", "num_games_owned": 1410, "num_reviews": 71, "playtime_forever": 102841, "playtime_last_two_weeks": 0, "playtime_at_review": 40181, "last_played": 1582758627}, "language": "english", "review": "First of all, I changed my review from negative. Why was it negative in the first place? Well... I won't comment on the UI or graphics, these you get used to in an hour. I won't comment on lack of sane controls because you can set up key bindings in a way that you don't need the context menus at all (it will take you 8+ hours of trial and error to understand what you want, but still). What I will comment on are first few days of the game. Those will kill you! Will make no sense whatsoever! The [i]crafting[/i] will feel restricted, has not much to do with what you know from real life. The [i]steep learning curve[/i] everyone talks about is just an unfamiliar set of recipes that are supposed to force players to socialize and buy resources from each other (e.g. you need metal or specialised tool to make virtually anything, even if it doesn't need those in real life) as well as to prevent so called [i]grievers[/i] from creating tons of [i]disposable[/i] characters just to spoil someone's fun. That last one is why they made the experience so hard and it's one of developers' conscious decisions. I hate it. I think there are better solutions. It makes the player feel useless. It makes gameplay a grind and a chore. Game would gain a lot if it was dealt with differently. And the combat system? Oh, man... It's unbalanced, it's melee weapons oriented, it's unrealistic in it's attempt to be deep. There's only one ranged weapon (a bow: short, normal or long) and it's not only silly in the ways of physics (like a [b]minimal distance[/b] to shoot) but also greatly underpowered (took you two days to fully train on a practice target? - great! - now use ~60 arrows to kill anything even though in real life you'd only need one). Unarmed fighting is useless, you have to run from any kind of enemy, including cats and birds. For first few months you can't ride a horse (because apparently your whole life in the rural medieval times didn't teach you anything) or sneak around (because, once again, [i]grievers[/i]). Your mileage may vary from server to server but this is what vanilla feels like.\n\nNow believe me if I say it's just [b]a bad cover for a great book[/b].  And while I agree, the UI, the graphics, the key bindings, first steps in game - it all needs improvement (a lot of it), this game has the depth and feel of no other! You can ride a cow (from the very beginning, it's slow but [b]you can[/b]), build a boat, a ship, a cart, roads, houses... a trebuchet for Fo's sake! You can dig mines, tunnel through mountains, have religion, become not only a farmer, a mason, a fighter but a priest, a trader, an inn keeper if you will! Yesterday a boar run away from me (with bunch of arrows in his back, arrows I was improving for two days so they wouldn't break on impact, but still) and I had to track it down for two hours to finish the job. It was a blast! Can't wait to do it again tomorrow!\n\nIf I was to compare this game to anything it would be the old time's classic, Ultima Online. There even are servers that reproduce Britain, UO's map. And while it's nowhere near where I'd want it to be, I highly recommend to [b]really[/b] try this title (as soon as you get a weekend off and build up some patience). I'm leaving the original review below because the comments wouldn't make sense otherwise. Feel free to skip it. If you don't, be aware it was based on my experience on 3 most popular servers (according to official servers list) and I didn't understand some of that nonsense was by design. My opinion didn't change for a few more worlds until I found [b]1x - New Player Friendly - Vanilla RPvEvP[/b] server by BrewGamingWorlds. Best players and ecosystem I've ever found. In any MMO. [b]Ever![/b] It's what made me stay. If you ever decide to try it out, do me a favor and shout \"Cyperez is a smelly bastard!\" in a global chat. If I'm there I'll come set you up and prove you wrong. ;)\n\n\n[h3]System Info & Performance Report[/h3]\n[table]\n[tr]\n[td]Operating System[/td]\n[td]Linux Manjaro.i3 64bit[/td]\n[/tr]\n[tr]\n[td]CPU[/td]\n[td]Intel® Core™ i5-6600K, 3.9GHz[/td]\n[/tr]\n[tr]\n[td]RAM[/td]\n[td]Corsair Vengeance® 16GB DDR4 3200MHz[/td]\n[/tr]\n[tr]\n[td]GPU[/td]\n[td]GTX 1070, nvidia-390.87-1[/td]\n[/tr]\n[tr]\n[td]Technical Notes[/td]\n[td]negligible light flickering issues (only in character window)[/td]\n[/tr]\n[/table]\n\n\n[h1]Original review[/h1]\nI get why this game isn't liked by popular audience, but it's okay, it's not an action game. What is it, though? A really bad crafting simulation? An even worse survival game? A horrific hack at economy? It has neither. If it tries to mimic real life craftsmanship it's failing greatly. Bad UI and controls. Unbelievable world. Grinder. Unbalanced. Pay to win. Even the most popular servers are unfinished. And the \"steep learning curve\" they're so proud of is just a badly designed set of recipes, that's all. Whatever you do, you need to be a miner first, then blacksmith, then carpenter. Want to make a bow? Need to mine ore, smith it, make nails for a rope tool (yes, you need a tool to make a rope), then make a bowstring with it (cloth string you just make with your fingers and a piece of stick as spindle but bowstring? - nah, [b]go mine![/b]). You made a bow? Great! Can't kill anything without practice because your arrows will \"glance off the target\" even when you hit it. There's no small game, though. Or birds. Or even fish to shoot from the shore. And you can't just practice on a tree. Or a pile of dirt. Or a pumpkin. Because, you know, reasons. You need a dedicated archery target, a round platform made out of bundled grass standing on a tripod. The thing is you need to chop down a tree and use... nails. So [b]go mine![/b] Why not to buy those resources, you ask? Every general shop has nails, you say? I didn't find a single merchant that sells them. And even if they did, they don't want anything but money. So go make a donation... or [b]go mine![/b] - and hope somebody will buy your ore for very very cheap. Wasted 14 hours making a bow and arrows. About 3x slower than it usually takes me in real life using natural materials and [b]no nails[/b]. It's sad to know this is the best MMORPG we've got. I just wish there was less artificial restrictions. Seems well enough designed on technical standpoint, the client is stable, Java so cross-platform - no issues noticed on Linux even in obscure and highly customised environment.", "timestamp_created": 1516559044, "timestamp_updated": 1617385654, "voted_up": true, "votes_up": 25, "votes_funny": 2, "weighted_vote_score": "0.717689037322998047", "comment_count": 24, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "24037640": {"recommendationid": "24037640", "author": {"steamid": "76561198078187111", "num_games_owned": 637, "num_reviews": 140, "playtime_forever": 4549, "playtime_last_two_weeks": 0, "playtime_at_review": 4549, "last_played": 1468460738}, "language": "english", "review": "Wurm Unlimited is one of those gems that's not for everybody.  I had mixed feelings about giving this game a thumbs up or down, but only because of it's price tag.  I'll get to that a bit later though.\n\nFirst thing's first.  Going into this game I knew to expect a few things.  This game is from the early 2000's, which means the graphics were going to be severly dated by todays standards.  It also started out as an MMO, which means that running it single-player might not be a very good experience.  I also knew this game wasn't for the faint of heart.  It's not your typical survival game, and it doesn't pull it's punches.  This was quite evident when I first entered the world, spawning almost direcly on top of a spider which proceeded to slaughter me without remorse and then camp my corpse.\n\nOk, so I mentioned a bit about graphics.  This game is pretty dated as far as the graphics go.  If you can't look past that then you really won't enjoy what this gem of a game truly has to offer.  Being an all-around gamer I found this to be not so bad.  In fact, there are many aspects of the graphics that I actually really like.  Little details, like fish swimming in the water, are very nicely done.\n\nThe interface of this game will frustrate the hell out of a lot of the newer generation of gamers.  Most of your actions are done via right-click menus and require you to have certain items or tools \"activated\" before the right-click menu will give you the options your looking for.  For example, having a hand saw activated and right-clicking a log in your inventory will give you completely different crafting options than if you had a knife activated.  That said, once you get the hang of the interface you can actually see it's really well designed for the level of detail and openness this game offers.\n\nIt's hard to judge the world of this game, having not seen all of it yet myself and also knowing that you can use custom worlds with a little tweaking.  It seemed very \"real\", as if the map was created naturally rather than by a person at a computer.  The jist of it is that there are 3 kingoms on opposing sides of the map and they expand their territories as much as they can, eventually meeting each other and then... Well, that's open to whatever the players want do at that point.  They can be diplomatic and trade lands for other lands, they can war and attempt to take land from the other kingdoms, or they can just live peacefully with their current borders.  There are goals to the game, with \"winning\" being an option, but depending on what style of server you play on those goals can either be important or not.\n\nNow we get to crafting.  This is where this game REALLY gets some major points.  The crafting system is incredibly indepth, as mentioned earlier.  It's so indepth that you can't actually craft a lump of metal, which you have already smelted, unless it's reheated to a \"glowing\" state.  In addition, the more indepth a crafted object is the more resources and crafting stages it requires.  Example, to build a guard tower you have to first build the base of the tower, which is easy.  Then you have to add 500 stone blocks (a crafted item), 500 clay, and 100 planks (a crafted item) before the tower is finished.   This is a HUGE task!  Another example would be a knife.  You can't simply place a lump of ore on a stick and call it a knife (lookin at you Minecraft).  You have to craft the knife blade out of metal, and then a handle from wood, and put the two together to finally make the knife.  Crafting materials and requirements seemed very logical, almost \"real\".  That seems to be the theme of this game, bring as much reality to it as you can, while not loosing the fact that it's a fantasy game.\n\nIn addition to crafting, the materials of the world didn't come in numbered items.  For example, if you picked up a rock you didn't have 1 rock.  You had so many kg of rock.  Each time you crafted something it took a portion of that rock to craft it.  You could also have many rocks, of various weights.  Some might be too small to craft an item with, some might be big enough to have leftover.  They could also be combined to merge their individual portions into one larger portion.  So you could have one rock that is 10kg and another that is 20kg, merge them together and get a 30kg rock.  The weight of items was very important to monitor, as your movement speed didn't just go from 100% to encumbered.  There were actually multiple stages to walking speed.  So carrying 40% of your maximum weight would actually have an impact on the speed you walked, again very realistic.\n\nSo getting down to the nitty gritty.  What is Wurm Unlimited?  Well, it's a very good MMO, in a fantasy setting, including a high detail of realism, that's been converted to home use.  If it's just you playing it you'll find the world very empty and a lot of things will be a very difficult challenge.  If it's you and a few friends there is quite a bit of enjoyment to be found, although the 3 kingdom aspect of the game will probably never be used.  If it's you and a dedicated server of 30+ players you might be able to experience all this game has to offer.\n\nSo do I recommend it?  This is where the difficulty is.  For a player such as myself, who loves a challenge and doesn't mind tedious grunt work to get a task done, this game is absolutely awesome.  For the newer generation of (spoiled) players who like to press one key and click one button to get stuff done this game will come across as boring and very hard to play.  Personally though I absolutely love this game for it's mix of realistic crafting, true sandbox environent, and RPG aspects.\n\nSo again, do I recommend it?  Oy...  It's extremely hard to decide.  If I was to look at this game 10 years ago, at it's current price, I'd think it was a hell of a deal.  Today, not so sure.  Personally I think $32 is fairly overpriced.  That said, I got it on the Steam Sale for $16 which is a much more reasonable cost.  So?\n\nYes... Yes, I recommend it.   ---- BUT ----  Only if you can get it on sale at 50% off it's $32 price tag.\n\n------------------------------------------------------------------------------------------------\n\nFor more no-nonsense reviews check out my curator page at; \nhttp://store.steampowered.com/curator/31550059-Viper%27s-No-Nonsense-Reviews/", "timestamp_created": 1467521747, "timestamp_updated": 1514250704, "voted_up": true, "votes_up": 28, "votes_funny": 4, "weighted_vote_score": "0.717263281345367432", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "35544755": {"recommendationid": "35544755", "author": {"steamid": "76561198161727612", "num_games_owned": 0, "num_reviews": 50, "playtime_forever": 20412, "playtime_last_two_weeks": 0, "playtime_at_review": 6660, "last_played": 1579294624}, "language": "english", "review": "The idea of having a full fledged (and ultra complex) mmorpg for a single price, with no ca$h $hop (and the ability to run your own server) is a dream come true and a steal at this price. On the technical side, this works flawlessly .\n\nSpeeding up skills and having the ability to tweak the game is also fantastic- All around a great piece of software.\n\nWURM feels very much like a graphical MUD and isnt a typical mmorpg- But something much more. Plenty has been written about the 'game  itself' both in its online and unlimited form and it will either be something you 'get' and have the required patience or not. Its pointless to go into that for this review. I personally love the complexity of WURM but others need something more action oriented or with quick progression.", "timestamp_created": 1507383821, "timestamp_updated": 1507383821, "voted_up": true, "votes_up": 31, "votes_funny": 0, "weighted_vote_score": "0.709449052810668945", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "18661302": {"recommendationid": "18661302", "author": {"steamid": "76561198013078167", "num_games_owned": 286, "num_reviews": 1, "playtime_forever": 3275, "playtime_last_two_weeks": 0, "playtime_at_review": 1729, "last_played": 1622864738}, "language": "english", "review": "I'm writing this review based on two things:\n- My 4+ years of playing Wurm Online\n- The 16 hours I have played Wurm Unlimited\n\nTo start, Wurm is one of the best games I have ever played. The community in Wurm Online was always great, minus a few griefers here and there. It has one of the most in-depth crafting systems I have ever seen. And what makes it even better is that you can do anything you want to the world. Want to flatten that mountain or hill over there? Do it! (Although it might take you a while). Want to build a large canal connecting two bodies of water? You can do that! Want to convert a scorpion covered desert into a lush green forest? That can be done. This is probably the single most important reason I stuck with Wurm Online for so long. \n\nAnother thing I like about Wurm is the graphics. Yes, I know some of you are thinking \"How can you like the graphics?\".. But it's not so much about comparing it to current game graphics, obviously current graphics are superior. But that is something that gives this game character.\n\nThe next thing I want to talk about is the UI and controls. I've noticed a lot of people complaining about these, and I don't understand why it is such a bad thing. Yes, the UI might take a while to get used to, but once you get used to it, it isn't bad at all. Same goes for having to click and drag to look around. I understand most first person games do not do this. But once you get used to it, it isn't bad.\n\nLast thing I want to address is the learning curve. I will admit, it is very steep. But it can help a lot if you play with someone who knows how to play. When I first started Wurm Online, I think it took me over a week of playing to finally grasp most of the basic concepts. But I am glad I didn't give up, because it is one of the most fun and relaxing games to play in my opinion. So my advice to all noobs out there, don't give up just because it's hard. If you work hard and learn, it will be very rewarding.\n\nMy summary of Wurm Unlimited:\n\nPros:\n- Very relaxing.\n- In-depth crafting system.\n- Worlds are plenty large enough for a good amount of people.\n- You can host your own servers for solo/playing with friends.\n- You no longer need to pay for premium like in Wurm Online.\n- You can have full control over the server settings, such as no upkeep, skill gain, etc...\n\nCons:\n- For noobs, there is a steep learning curve.\n- There are some bugs that I have ran into, such as mounting/dismounting horses crashing my game.\n\nAll in all, this is a good game for those who are willing to spend some time working in the game. For those who aren't, you can join a server with higher skill gain. Hope this review helps! Have fun and see you in Wurm!", "timestamp_created": 1445707088, "timestamp_updated": 1445831808, "voted_up": true, "votes_up": 56, "votes_funny": 5, "weighted_vote_score": "0.709164202213287354", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "42129887": {"recommendationid": "42129887", "author": {"steamid": "76561198117326886", "num_games_owned": 947, "num_reviews": 118, "playtime_forever": 2639, "playtime_last_two_weeks": 0, "playtime_at_review": 2635, "last_played": 1531839921}, "language": "english", "review": "This game in my opinion is paradise for those who enjoy life skills in mmos and indepth deep crafting. Which i kinda do to an extent. why is it still a not recommended for me? Bottom line is you do all this crafting , grinding , training for what? just to not die so easily to the enemies that randomly spawn in the woods. i do not find the combat very fun or engaging. PVP has never been an attraction to me in these survival crafting games. I really enjoy survival games with fun and varied PVE but this game just has no worthwhile meaningful goal or fun PVE content thats worth all the grind.\n\nBottom line is that to me this games PVE is garbage. adventure mode is where i hoped the good PVE would be but it just feels kinda lackluster just a few npc towns with a merchant or two. Plenty of people enjoy this game but its just not for me.", "timestamp_created": 1526772424, "timestamp_updated": 1526772490, "voted_up": false, "votes_up": 38, "votes_funny": 3, "weighted_vote_score": "0.707144796848297119", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "125835347": {"recommendationid": "125835347", "author": {"steamid": "76561197988503892", "num_games_owned": 837, "num_reviews": 162, "playtime_forever": 1066, "playtime_last_two_weeks": 0, "playtime_at_review": 900, "last_played": 1669265126}, "language": "english", "review": "One of the OG open world survival crafting games. Lots of fun if you enjoy oldschool game design, but unfortunately Unlimited is entirely abandoned by the developers after Jan 2020. Don't buy it at full price, wait for it to be under $15 (or play the MMO which is about $9 USD per month)", "timestamp_created": 1668969018, "timestamp_updated": 1669132429, "voted_up": false, "votes_up": 23, "votes_funny": 1, "weighted_vote_score": "0.705519020557403564", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "46218345": {"recommendationid": "46218345", "author": {"steamid": "76561198056448538", "num_games_owned": 147, "num_reviews": 6, "playtime_forever": 1242, "playtime_last_two_weeks": 0, "playtime_at_review": 1120, "last_played": 1558894375}, "language": "english", "review": "I have this game for like a week now.\nI used to play Wurm Online, So I wasn’t totally new to the game.\n- Got 2 horses, decide to make a cart\n- Go mining, cave collapses (fml)\n- Finally make cart, troll kills one of my horses\n- Run away\n- Get new horse\n- Make house and a small town\n- Decide this is too hard by meself so get a good portion of my discord server this game along with some of my friends\n- I now get request for a duel to the death every time I log on\n- 11/10 would recommend", "timestamp_created": 1542877171, "timestamp_updated": 1542877171, "voted_up": true, "votes_up": 20, "votes_funny": 15, "weighted_vote_score": "0.704849064350128174", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "24380036": {"recommendationid": "24380036", "author": {"steamid": "76561198085119764", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 25686, "playtime_last_two_weeks": 0, "playtime_at_review": 20802, "last_played": 1541365907}, "language": "english", "review": "Good community, graphics are not that great, but the amount of content in this game is massive. There are many skills to master, many items to make and many tools to use. But learning the game might take time, as terraforming and crafting is a bit difficult to learn.\n\n[b] May not be as good as you expect if you are looking for an arcade game with quick fun, but if you invest your time it is really fun. [/b]", "timestamp_created": 1468793147, "timestamp_updated": 1468793147, "voted_up": true, "votes_up": 18, "votes_funny": 1, "weighted_vote_score": "0.704293012619018555", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "19030170": {"recommendationid": "19030170", "author": {"steamid": "76561198039258428", "num_games_owned": 223, "num_reviews": 18, "playtime_forever": 2775, "playtime_last_two_weeks": 0, "playtime_at_review": 1962, "last_played": 1474001913}, "language": "english", "review": "Thought it looked like crap but now it's 5 in the morning and i really don't want to stop playing there is some of the nicest people i've met in a game on here. I also got a dog might as well not buy fallout 4 now.", "timestamp_created": 1447324485, "timestamp_updated": 1447324485, "voted_up": true, "votes_up": 56, "votes_funny": 74, "weighted_vote_score": "0.702160418033599854", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "36514748": {"recommendationid": "36514748", "author": {"steamid": "76561198007932393", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 5684, "playtime_last_two_weeks": 0, "playtime_at_review": 2512, "last_played": 1598179003}, "language": "english", "review": "This game is a toned down version of the first true sandbox/survival/crafting/building game. It is the EVE online of it's genra. This game isnt Rust, Conan Exiles, TUG, Minecraft or PUB sandbox or survival type game. It was billed at the time as a MMORPG (Wurm Online) which it is sort of but unlike anything else of that sort to. This game requires a mature/adult attiude to play and get into. The time investment is huge the learning curve is massive, be warned! As for what it delievers is an experience that was unquie and to this day not match for its sandbox/survival/building style game play. It is not for everyone and I would recommend to try Wurm Online's trail first to learn how to play and see how it plays and if you can get into it. Runescape, RPG World Online and Ultima are the only games before this to deliver this kind of game play.\n\nWurm (Online/Unlimited) has had a small team 2-3 only payed people on it development since it has began. Believe me when I tell you the graphics and getting leaps and bounds better from when I played on line. Though if you require graphics this is not your game.\n\nThe RPG aspect of this game is straight forwarded. Using skills and doing actions raise your stats and skill level like runescape.  Sandbox as the world in both versions are completely deformable if you have enough skill level. Nothing really compares but some voxel games or Minecraft and clones now a days but lack the depth this game has in other areas. Now as for survival in Unlimited doesnt really take effect like it does compared to the on line version. And the combat feels more MUD like then action based. So be warned Survival players. Unlimited does not deliver in that area. Also MUDs are text based games for those that are to young to know or remember them. This game is very much like the old style MUD games.\n\nIf you want PVP and a hardcore experience go to Wurm online. If you want a hardcore sandbox/crafting/building game this is it! Want a faster pace? Join a 10x Server! Unlimited is just what I wanted for a long time after playing wurm on online. A more casual experience but with the complexity of Wurm Online but without month payments! Sign me up and thank you Wurm!\n\nAgain try Wurm Online before you purchase!", "timestamp_created": 1510677508, "timestamp_updated": 1510677733, "voted_up": true, "votes_up": 19, "votes_funny": 1, "weighted_vote_score": "0.701430439949035645", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "31948785": {"recommendationid": "31948785", "author": {"steamid": "76561198030204453", "num_games_owned": 346, "num_reviews": 3, "playtime_forever": 42160, "playtime_last_two_weeks": 0, "playtime_at_review": 16658, "last_played": 1584689851}, "language": "english", "review": "\nAlright now listen up you little scrubs! This here is one of them old timey Simulators. Ya know the kind that granddad or pep pep loves to play. But unlike the ones grandad plays, your pc wont be loaded with desktop stripper viruses from those seedy eastern European websites. Now I am a man of complex tastes like toast and white rice so this game fit my personality well. This game is about as exciting as watching paint dry, relaxing and rewarding.  I played this previously when it was in its mmo form and was a slave, then slowly worked my way up to peassant living in the woods being assaulted by cougars and spiders. But now that you can make your own servers I live like a king, being assaulted by cougars...and spiders.  \n  \nThere are a few setbacks to this game however, if your pc doesn't have dual monitors you are going to have a bad time; this game requires an absurd amount of researching at first. thankfully the fine developers had the hindsight to add a wiki of all the things you could ever need to know, it's best to keep said wiki open in a browser while playing. Another thing is you need to build your skills and depending on how much time you put into it this can take quite some time (server permitting). I know it may sound weird but don't expect to be digging on the face of a mountain within the first five minutes of playing. \n   \n  Now with those things out of the way, this game can be rewarding. Considering the time you put into leveling up your skills  any accomplishment you do be it digging a small hole or completing a fortress you feel rewarded. I love this game because of its high failure chances, and slow grind.  But for some this may feel like watching grass grow. Not me though, I once spent 14 hours watching paint dry on a cement wall. Now granted i was on pain killers from a wisdom tooth extraction but I did it, and enjoyed it. Another thing to note is the servers, now i recommend spending the fifteen bucks a month to rent a server out. (Bluefang is a great provider if your looking for your standard server) you don't have to worry about becoming a slave or dealing with griefing and wars, but if your into that kind of thing public is the way to go.  \n \n The last thing id like to note is the absolute depth of the crafting in this game. the amount of crafting you do in this game still to this day astounds me. No joke, its down to putting tar on ships and pegs in barrels in depth. absolutely everything requires crafting. this game does not give handouts to you except for the standard starting gear. This is where when i was talking about it being rewarding really comes into play. Granted you might spend upwards to 30+ hours playing to start really crafting things that may matter to you.  \n \nIn conclusion would i recommend this game?  Absolutely.", "timestamp_created": 1495706193, "timestamp_updated": 1495706193, "voted_up": true, "votes_up": 36, "votes_funny": 16, "weighted_vote_score": "0.700252056121826172", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "84769930": {"recommendationid": "84769930", "author": {"steamid": "76561198013260541", "num_games_owned": 458, "num_reviews": 18, "playtime_forever": 18662, "playtime_last_two_weeks": 0, "playtime_at_review": 17732, "last_played": 1680404334}, "language": "english", "review": "It's not being supported anymore.\nWurm Online has released a TON of quality of life updates.. it makes it hard to want to come back to Unlimited - even though I enjoy Unlimited so much more.\n\nI'd recommend giving Wurm Online a try instead, since it's free. \nUnlimited can make the game a lot easier, and there are some great communities to join within the servers - but Online feels a lot more polished at this point.\n\nI really hope they bring stuff like the UI update to Unlimited. Until then, I just don't recommend spending 30 bucks on this game. (Although it's probably cheaper in other places)", "timestamp_created": 1610775540, "timestamp_updated": 1610775540, "voted_up": false, "votes_up": 36, "votes_funny": 0, "weighted_vote_score": "0.697159767150878906", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "58823378": {"recommendationid": "58823378", "author": {"steamid": "76561198072011349", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 116088, "playtime_last_two_weeks": 0, "playtime_at_review": 30940, "last_played": 1711705874}, "language": "english", "review": "Whenever you read any of the reviews for this game, either good or bad, look at the number of hours spent playing by the reviewer. This game takes weeks to get into and hundreds of hours to reveal itself. It is very detailed and progress takes a very long time. Playing WU is a commitment. It does seem to attract an older community of players. There are enough private hosted servers (at the time of writing this) for you to get many different experiences. You can play it without interacting much with others on the server if that is your thing. I find the UI frustrating and the gfx ugly as sin but the detail carries it through even though it has the feel of a retro gaming experience. It's a thumbs up for me but its not for everyone.", "timestamp_created": 1575161943, "timestamp_updated": 1575161943, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.696947574615478516", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "75550464": {"recommendationid": "75550464", "author": {"steamid": "76561197973099999", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 26787, "playtime_last_two_weeks": 0, "playtime_at_review": 20522, "last_played": 1601070651}, "language": "english", "review": "Game is no longer supported by the devs.", "timestamp_created": 1599407827, "timestamp_updated": 1599407827, "voted_up": false, "votes_up": 36, "votes_funny": 1, "weighted_vote_score": "0.69516444206237793", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "34749480": {"recommendationid": "34749480", "author": {"steamid": "76561198091670390", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 6623, "playtime_last_two_weeks": 0, "playtime_at_review": 3516, "last_played": 1580959398}, "language": "english", "review": "If you enjoy slow-paced sandbox games and don't mind an outdated UI, then you will probably enjoy Wurm. If you enjoy games where building and community come before combat, but combat is still an option, you will probably enjoy Wurm. If you prefer games with instant gratification, quick combat, and the ability to jump and sprint, I do not suggest this game for you.\n\nEven with nearly sixty hours in Wurm I am still very much a noob. There is a lot for me to learn, and I still don't have enough skill to build a stone floor or destroy a fence. I cannot kill a wolf without help from NPCs. I still don't entirely understand the ground flattening system. I can, however, load up the Wurmpedia on my phone, play some YouTube videos in the background, and spend an entire day building a storage tower next to my house that I spent a week on.\n\nMy advice for getting started is finding a good server. A server where you can ask other players questions and get help is a godsend, sometimes literally with certain deities prohibiting certain actions. I needed something that only drops off human guards, but the deity I follow prohibits butchering humans. I got help from another player whose deity demands butchering humans. In return, I buried her bodies since my god likes that and hers doesn't. It's a community game at its heart, and playing alone is very, very lonely.\n\nTLDR; Sandbox, takes a while, find friends", "timestamp_created": 1504584996, "timestamp_updated": 1504584996, "voted_up": true, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.693820834159851074", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "18654827": {"recommendationid": "18654827", "author": {"steamid": "76561197971074265", "num_games_owned": 1578, "num_reviews": 14, "playtime_forever": 3714, "playtime_last_two_weeks": 0, "playtime_at_review": 2090, "last_played": 1447836410}, "language": "english", "review": "If you don't like the lack of mouselook, no need to worry, just open the console with F1 and type in \n\nbind SPACE \"toggle mouselook\"\n\nYou can also add it to the keybindings.txt file in the client directory. Easy as, and yes you will need it to toggle, there are a lot of menus.  So enjoy this realistic and rewarding sandbox folks.\n\n", "timestamp_created": 1445682620, "timestamp_updated": 1445682620, "voted_up": true, "votes_up": 37, "votes_funny": 3, "weighted_vote_score": "0.69303518533706665", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "79452721": {"recommendationid": "79452721", "author": {"steamid": "76561197989931539", "num_games_owned": 1336, "num_reviews": 45, "playtime_forever": 6639, "playtime_last_two_weeks": 0, "playtime_at_review": 6616, "last_played": 1606315543}, "language": "english", "review": "Game abandoned by devs, broke their promises about keeping it in step with Wurm Online.", "timestamp_created": 1605692543, "timestamp_updated": 1605692543, "voted_up": false, "votes_up": 22, "votes_funny": 1, "weighted_vote_score": "0.691653728485107422", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "35631020": {"recommendationid": "35631020", "author": {"steamid": "76561198051077173", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 2254, "playtime_last_two_weeks": 0, "playtime_at_review": 1714, "last_played": 1537943321}, "language": "english", "review": "If you are not sure about getting this game full price, or want to try it out. There is a free to play version on Wurms offical website. All your skills cap at lvl 20 but you'll be able to play the game and get a feel.\n\nIf I were to compare it to other games it would be: the feeling of oldschool Runescape combind with the freedom and creativity sandbox of Minecraft.\n\nThis game will be difficult for new players, there's a tutorial but experimenting and or the wiki will be your friend.\n\nSetting up a private server for you and your friends will be hard, if you do not have experience portfowarding.\n\nThe game mostly focuses on progress and crafting. You start out with a set of leather armour and iron tools. From these tools you will collect resources and materials. Wurms crafting is very indepth, you have to make every plank and nail for a house esentially. \n\nThis game is not for the impaient. It's for the paient indiviuals who are driven by hardwork and time that pays off.\n\nThis review was written with 28.3 hours of experience. \n\nI recommend this game to those who seek what I've explained.\n\n\n", "timestamp_created": 1507693700, "timestamp_updated": 1507693700, "voted_up": true, "votes_up": 22, "votes_funny": 0, "weighted_vote_score": "0.691233336925506592", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "78301433": {"recommendationid": "78301433", "author": {"steamid": "76561198286070490", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 259109, "playtime_last_two_weeks": 0, "playtime_at_review": 252401, "last_played": 1712528500}, "language": "english", "review": "Wurm Unlimited is an old school style sandbox where everything is made by players. It doesn't hold your hand and is complex, there is always something new to learn and master or expand by. Most who do not like it expect faster gratification or more help with playing a game. Head to the forums for that. You can play this game your way if you enjoy that. I do and have played the game for years, both the Online version and also this one. I am still active on Wurm Online. The game and community is almost a way of life IF this is your type of game. It appeals to Builders and creative sorts, and is admittedly a niche game.  Thanks for reading :)", "timestamp_created": 1603911125, "timestamp_updated": 1603911125, "voted_up": true, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.689682424068450928", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "18917231": {"recommendationid": "18917231", "author": {"steamid": "76561198055879801", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 1565, "playtime_last_two_weeks": 0, "playtime_at_review": 507, "last_played": 1447421586}, "language": "english", "review": "I`m a noob to this game.\n\nI`ve played... what... 8 hours or so. And I`ve never played Wurm Online.\n\nMy mining skill is 25.03 but I still haven`t found a single vein of ore (however an Emerald is glinting faintly in my pocket). I am tending my fields of 2x potatoes, 2x cotton and 2x pumpkins, and have a willow fishing rod and fish in my tent (wondering if those will still be fresh when my 24hours noob buffs run out...)\n\nI have watched the first 4 episodes of Gamster4life`s 30minute Letsplays on Youtube and read a few articles on wurmpedia and completed the guides tasks in ...darn... the rightmost kingdom on the map, adventure mode...`twill come to me... no...no? NO! *sigh* nevermind...\n\nI recommend doing what I described above or more, give it the research, the 8 hours of fiddling about (well mostly mining)  and then, what I just experienced;\n\nLet me start with a few failed experiences, since those are kinda part of the...\"achievement\". I`ve ... crossed paths with both the \"small, common, young, un-fire-breathing, otherwise almost-cudly Hellhoud\" and the \"Young, but Huge, still as-far-as-can-deduce NOT Poisoinous spiderling\". They could not be reasoned with. (Yeah, well, that could still be put on my account, really, pfft...) Whatever, I only survived by running back inside the fences of my kingdom town of... Jenn-something. There was no Jenn there, but I was still saved, even if I spent unecessary time missing her...\n\nThose experiences didn`t leave me ...  leave me ... without a... something...  *sigh* this is a blind sentence.\n\nI learned something from those utterly failed confrontations! YAY! \nThrough Wurmpedia and random alchemy ingame, I learned how to TREAT injuries with natural remedies and through FIRST AID via Cotton bandaging and I healed my wounds (faster than 368 hours of (realtime) waiting with untended wounds).\n\nI also gained a lot of skill in Shortsword and Shield.\n\nThose may have been cruicial when I met my next ... assail... attac... oppon... Aw, fcol MY NEXT ENEMY (maybe I was the agressor... awright gimmeabreak!)\n\nWe fought for several hou-minutes. I cannot truely say if it was five or ten minutes realtime, but I think it was at least three! I was blinded by colorful down and feathers most of the fight, but I remember my sword being blocked furiously by a nasty beak that hacked back at me with a ferocious ferocity unmatched by both the Hellhound and the Spider combined. I closed my eyes and put my shield in front of me, then swung my short sword futil...futuristically hithertoadfrom...or...something until I heard a loud cackle. The beakattacks subsided. I was able to look beyond the somewhat disturing carvings on the backside of the shield I was provided with at the start of the game and realised I had...\n\nWON MY FIRST BATTLE!\n\nI had deafeated a Young Rooster....\n\n...in less than 10 (3) minutes....\n\nyay, or something, or....\n\nWHAT A GREAT GAME!\n\nWhat an adventure,  and I haven`t even gotten started yet! The initial disappointment from having deafeated a mere rooster as my first enemy was somewhat consolidated by the fact that the Young Rooster Corpse weighed in at a sissily 15kg... \n\n*SHEESH* And I even BOTHERED to close my eyes!\n\nThere`s so much to learn, so many posibilities (and so much time to learn it in). The only CON would be if you DON`T like to spend A LOT of time in one (this) game, This game requires that you spend HOURS and not demand a lot of progresssion within the time spent to enjoy it.\n\nI enjoy it a lot, but games does not need to happen fast for me!\n\nI`m an Old-timer at the age of 44, in case that matters to you.\n", "timestamp_created": 1446846245, "timestamp_updated": 1446846245, "voted_up": true, "votes_up": 65, "votes_funny": 59, "weighted_vote_score": "0.68861997127532959", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "58513885": {"recommendationid": "58513885", "author": {"steamid": "76561198019006810", "num_games_owned": 1113, "num_reviews": 31, "playtime_forever": 373725, "playtime_last_two_weeks": 164, "playtime_at_review": 345321, "last_played": 1713403911}, "language": "english", "review": "While the game itself is good the developers just announced they will no longer be updating the game and will rely  on mods for any further  updates to the game. They intend to keep updating the monthly pay version of the game it is just this version that they are giving up on. This is not acceptable.", "timestamp_created": 1574997942, "timestamp_updated": 1574997942, "voted_up": false, "votes_up": 59, "votes_funny": 8, "weighted_vote_score": "0.688348054885864258", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "29929940": {"recommendationid": "29929940", "author": {"steamid": "76561198235955688", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 889, "playtime_last_two_weeks": 0, "playtime_at_review": 872, "last_played": 1648943945}, "language": "english", "review": "This game is really in depth, but honestly not my style. The game mechanics are immensely detailed and complex, I prefer a game where advancing and building is a little more straightforward. If you're looking for a game that requires attention to detail and a long term commitment, this game is definitely for you. If you're looking for something more casual, I would recommend looking elsewhere.", "timestamp_created": 1487111282, "timestamp_updated": 1487111282, "voted_up": true, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.683978796005249023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "142209199": {"recommendationid": "142209199", "author": {"steamid": "76561197969506478", "num_games_owned": 645, "num_reviews": 137, "playtime_forever": 315, "playtime_last_two_weeks": 0, "playtime_at_review": 315, "last_played": 1689277801}, "language": "english", "review": "Unfortunately, I have to give Wurm Unlimited a negative review.\nThe game feels abandoned by its developers, who have shifted their focus to Wurm Online.\nIn comparison, Wurm Unlimited lacks essential features, updated graphics, a polished interface, and even the option for a third-person camera present in Wurm Online.\nIt's disappointing to see the lack of development and support for Wurm Unlimited, especially when its counterpart continues to receive regular updates and ongoing support.\nSo while Wurm Online may be more grind-intensive and require a larger player base, the consistent updates and support make it a more worthwhile investment of your time.", "timestamp_created": 1689523690, "timestamp_updated": 1689524008, "voted_up": false, "votes_up": 28, "votes_funny": 1, "weighted_vote_score": "0.683635830879211426", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "137139483": {"recommendationid": "137139483", "author": {"steamid": "76561198136110504", "num_games_owned": 0, "num_reviews": 44, "playtime_forever": 139609, "playtime_last_two_weeks": 0, "playtime_at_review": 139609, "last_played": 1682180693}, "language": "english", "review": "This game is abandoned, And dead.  And yet their still trying to milk it for money.  Go to the wurmunlimited server list and count the players. Youll be lucky to find thirty players in the entire world, And half of those are probably alts.  I shut down my server forever.  Nobody plays, The game is unfinished and abandoned.  You can't even create missions properly because that was never finished either.  It's just a waste of time.", "timestamp_created": 1682202727, "timestamp_updated": 1682202727, "voted_up": false, "votes_up": 37, "votes_funny": 1, "weighted_vote_score": "0.683565795421600342", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "97402941": {"recommendationid": "97402941", "author": {"steamid": "76561198013724217", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 124616, "playtime_last_two_weeks": 0, "playtime_at_review": 116652, "last_played": 1698153367}, "language": "english", "review": "This game was a lot of fun, and I've played it nearly 2,000 hours. Most of those hours, I enjoyed. It takes a lot of getting used to, and frequent visits to their Wiki to figure out how things work or how things are made/done, but I found that investment rewarding. It's not for everyone, certainly. Combat is text-based/outdated, movement can be clunky and get you killed at times, there's very little guidance for new players, crafting is tedious and complicated, and building/terraforming can be confusing and unintuitive. Nevertheless, it's got a charm to it, and there's quite literally thousands of hours worth of game for you to explore (for better or for worse).\n\nSo why would I rate this game negatively, and not recommend it to others, you ask? Simple: the developers are pigfucking assholes. They've not only stopped development - no new features, changes, bugfixes, etc. - but in fact their final release just adds the 3rd-party modloader that a user named ago1024 spent years developing. No other changes were made. Effectively, they've shifted development efforts onto modders, who by the way barely exist anymore. They couldn't even be fucked to come up with something themselves, they just called this \"good enough.\" But wait, if you try to make a mod yourself that even slightly mimics any features similar to ones found in Wurm Online (which is \"actively\" being updated and they clearly want you to play that instead because it has a monthly subscription cost) they will threaten you with legal action.\n\nWhat does this mean? \"We're not going to update this game anymore, but feel free to make all the fun mods you can think of on our behalf, so we don't feel so guilty about forsaking our game! Wait, what... WAIT! NO NO NO! We didn't mean you could make THAT mod, this is still OUR game...\"\n\nIt's their game, that's true. They made it.\nThey're also assholes. Dick move, Code Club. Fuck you.\n\nServers have died out rapidly. The modding community is also dead, outside of what has already been made. As a (former) modder myself, if you know Java and are comfortable with Javassist and are thinking to yourself \"maybe I can do some stuff\" be warned there is almost nothing in the way of support or documentation on how to start with that. You will be on your own. If that's fine with you, go for it. For the people who are just thinking \"I might like to play this game\": it's just not worth the money anymore.", "timestamp_created": 1628752839, "timestamp_updated": 1676826748, "voted_up": false, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.683357477188110352", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "34460809": {"recommendationid": "34460809", "author": {"steamid": "76561197986715648", "num_games_owned": 0, "num_reviews": 103, "playtime_forever": 2000, "playtime_last_two_weeks": 0, "playtime_at_review": 2000, "last_played": 1447297241}, "language": "english", "review": "This is an EXTREMELY slow paced game. Without god powers I built a small house. It took me a couple of real life days to build that house. There is a certain satisfaction to building something in this game, but the time it takes to farm the materials, take it back to your site, craft the parts and then build, is daunting. Not only do you have to cut down trees, but then craft the planks, then farm ore to make nails using the forge that you have to build. All of these things take a lot of time to do and you can carry only so much. If you compare this to other games building games like Mindcraft, Empyrion or even the just released Citadel, this game has much more depth, but at a snails pace.", "timestamp_created": 1503584442, "timestamp_updated": 1503584442, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.683013379573822021", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "30347131": {"recommendationid": "30347131", "author": {"steamid": "76561198163266677", "num_games_owned": 166, "num_reviews": 6, "playtime_forever": 38477, "playtime_last_two_weeks": 0, "playtime_at_review": 7830, "last_played": 1687755524}, "language": "english", "review": "I honestly have never written a review and had been completely serious about it...\n\nI HAVE NEVER BEEN SO ADDICTED TO ANYTHING AS MUCH AS I HAVE THIS GAME\n\nPros:\nDecent graphics for how old it is\nTons of content\nExcellent playerbase\nRuns on a potato\n\nCons:\nSupport is meh...\nA learning curve almost as difficult as Dwarf Fortress\nDifficult controls\n\nI highly recommend this game to anyone who is patient and willing to learn something new. It definitely pays off in the end.", "timestamp_created": 1488754306, "timestamp_updated": 1488754306, "voted_up": true, "votes_up": 19, "votes_funny": 4, "weighted_vote_score": "0.6829795241355896", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "23148633": {"recommendationid": "23148633", "author": {"steamid": "76561197995103307", "num_games_owned": 72, "num_reviews": 10, "playtime_forever": 20513, "playtime_last_two_weeks": 0, "playtime_at_review": 13148, "last_played": 1481165145}, "language": "english", "review": "After years of playing repeating MMOs (grind grind grind) My friends and I finally found a game that put the adventure back. This game gives you nothing, you will have to earn it. It's not that hard to figure out and you will love the rewards x10 compared to the other games that are now days making it to easy. No you wont get to power level. You cant buy your way in. Your gonna get dropped into a world face first with a compass and a few supplies to get you by. Its getting dark outside so you better run to a city. But wait, you hear a wolf growl from the bushes, you start to run but you are bitten in the leg. Turning your back WU gives the wolf a advantage since you turned. Secondly it not just , you took 23 damage please heal, oh no its WAY more detailed. Your gonna need to find some cotton and bandage that wound. But it also depends on where the wound is and what type. You see your right leg is bleeding out and infection is sure to come. This game is ok on graphics and fighting, but the hidden treasure is in the details. Theres a skill for everything you can think of, sometimes  branches of 2 to 3 skills for one thing. Anytime you make something, your skill effects the quality. You got to get to know people and trade, because you dont have npc shops that sell stuff, only venders owned by players. I'll have to say I am alittle spooked sometimes, the game seems to have some witchcraft in it. It has gods to choose from, altars, animal sacrificing,ect. You can also breed animals, groom them, tame them, sell them, eat them, ride them. Any trade you can think of is in the game and broken down into many parts and it wont be easy. But after you put in the time to be the best at that niche people start coming to you and buying. I went from rock bottom to having a nice little town in about 3 weeks. But in that time I dug dug and dug and my friends dug and we sold the dirt to some rich guy down the street. He needs the dirt for building. We started out with a little hand cart that carried 40 dirt a trip. After becoming friends with the guy, he built us a large cart and then a wagon capable of hauling 3600 dirt. We bought some land and hired some guards that now run around and kill those wolfs. I'd have to call it more of a simulator then a game. It could use some work on the graphics end, but im thinking thats why I dont have hardly any lag issues. I also don't see alot of bugs. Yeah there must be a few, but for all the stuff thats going on in this game they have really put alot of work into making it solid.", "timestamp_created": 1463965686, "timestamp_updated": 1463966006, "voted_up": true, "votes_up": 22, "votes_funny": 0, "weighted_vote_score": "0.68258213996887207", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "18689767": {"recommendationid": "18689767", "author": {"steamid": "76561198048059258", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 40957, "playtime_last_two_weeks": 0, "playtime_at_review": 4704, "last_played": 1620419119}, "language": "english", "review": "I would like to state here that this game is not for everyone, and that comparing it to minecraft is possible but it is vastly differnt, you could also say it is simillar to runescape as far as grinding. \n\nI have played Wurm Online, the original version of this game, and would like to state that because the game hasnt been out long there are not very many high level people to help you get started on the servers so starting is slow and tortuous. that being said it will get easier as more people level up and build, on the worm online servers there was roads made by players going everywhere on the map from deed to deed with guard towers at regular intervals so that you could travel safely. there was also an established economy for all manner of items such as bulk resources and tools and enchants and boats. i also see alot of people not knowing how to get started or do pretty much anything, when i meet these players i show them this link http://www.wurmpedia.com/index.php/New_Player_Walkthrough . and hope that they will read enough and take in the fact that there is a search bar on the site to find pretty much anything in the game.\n\nI love this game the fact it can take years to max every skill is what draws me too it yes its grindy sure the graphics arn't the greatest, but its the community and making the world our own that makes this game great", "timestamp_created": 1445828231, "timestamp_updated": 1445828231, "voted_up": true, "votes_up": 34, "votes_funny": 1, "weighted_vote_score": "0.682176649570465088", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "37248840": {"recommendationid": "37248840", "author": {"steamid": "76561198032112184", "num_games_owned": 0, "num_reviews": 21, "playtime_forever": 68296, "playtime_last_two_weeks": 0, "playtime_at_review": 26643, "last_played": 1536509980}, "language": "english", "review": "So I have played Wurm Online since 2011, it was rough back then but got better with time. But it's still for the masochist.\nWhen Wurm Unlimited came out I was against it, tearing the wurm community apart and all that soap box crap.\n\nBut I got WU about a month ago and man I wish i did it sooner the server I play on (otherlands* and it's creator Bdew) have it set up so perfect, it truely is the way Wurm was ment to be played, I don't think I will ever go back to Wurm Online.\n\nThis game is the ultimate sandbox survival game, yes the graphics are a bit dated and combat isnt great, but the depth of terraforming, building and crafting is equal to no other game out there, yes it has a steep learning curve but getting on the right server is key.", "timestamp_created": 1511490300, "timestamp_updated": 1511558534, "voted_up": true, "votes_up": 16, "votes_funny": 2, "weighted_vote_score": "0.681477785110473633", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "38482548": {"recommendationid": "38482548", "author": {"steamid": "76561198042408841", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 86079, "playtime_last_two_weeks": 0, "playtime_at_review": 78398, "last_played": 1567460878}, "language": "english", "review": "A little bit of background on me so that you can understand where my review comes from. I've played a lot of wurm. Before there was Wurm Unlimited there was Wurm Online and I played a lot of that. I love sandbox games, I love crafting games, I love RPGs and I love anything where you can PVP which makes WU the perfect game for me. I have yet to find a game that replaces this one. The main problem I had with Wurm Online was how long it took to grind before you could actually play the game and compete with people who had been playing longer than you. Wurm Unlimited solved that problem and in my opinion is an amazing game.\n\nThe graphics sucks but continue to get better with every patch.\n\nThe UI sucks and will always suck because it is drop down menus and progress bars.\n\nThe combat sucks and is essential all text based.\n\nThe gameplay sucks because it is all a giant grindfest and there are bugs in the code that will kill you and make you lose all of your hard earned items or the bugs will prevent you from making your house look the way you want it to.\n\nThere is a lot that sucks about this glorious game and to be perfectly honest with you I couldn't tell you why I love it so much. It could quite possibly be a sunken time fallacy. All I know is I love playing this game. Here is a list of the pros and cons of this game:\n\nCons:\nThe lore sucks. It is boring and doesn't make sense\nThe whole religion and spell system is very random and doesn't make sense\nPlaying this game in a pure vanilla style will make this a second job and will limit you severly\nYou will die to a bug in the code at some point\nYou will die to something you don't understand\nYou will be unable to do something and you won't understand why\nFinding a good server that lasts more than a month or two is impossible (But not necessarily required)\nThere are many undetectable cheats that other players will use to have an advantage over you\nThe graphics are sub par compaired to modern games\nA lot of the gameplay is looking at progress bars and drop down menus\nLike most sandbox communities there are a few bad apples that are out there with the sole purpose of ruining your game\nThe playerbase is extremely small and there are far too many servers with less than 10 active people playing\nUpdates take a long time\nThe tutorial in this game is next to non existant and the learning curve is steep\nPermadeath means if you die you have most likely lost all of your items (not true on PvE servers)\n\nPros:\nThere are a million tutorials on youtube that will help you with anything you need to know\nEvery server i've ever been on has been full of helpful people who love to give you advice on anything you could ever ask for\nYou can do practically anything you want\nYou can build anyway you want\nOn PvP servers you can kill anyone you want\nThe crafting and skill system is the most comprehensive and fullfilling one i've ever experienced\nThere are many mods out there that take the boring part out of this game\nThere is a server out there with every kind of gameplay style you could want\nThe game is fun as a solo or a group player\nPermadeath means if you die you have most likely lost all of your items (not true on PvE servers) which gives PVP fights meaning and makes them more exciting\n\nOverall if you like sandbox games I highly suggest playing this game. Even if you are a loner you will have fun. I spent a long time being a lone wolf and i've also joined many big groups of people, I constantly switch between the two because I find both playstyles fullfilling. There are tons of welcoming groups of people. This community is one of the best. I take breaks for months at a time and then come back and discover all the new fun stuff they have added.\n\nIs it a perfect game? No. A lot of stuff sucks about it. A lot. A LOT OF STUFF SUCKS ABOUT IT, but with every update it sucks a little less and the people that play it are good people. Give this game a chance, or a second, or a third chance.", "timestamp_created": 1513849043, "timestamp_updated": 1513849043, "voted_up": true, "votes_up": 18, "votes_funny": 2, "weighted_vote_score": "0.681268990039825439", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "18696682": {"recommendationid": "18696682", "author": {"steamid": "76561197970964121", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 6430, "playtime_last_two_weeks": 0, "playtime_at_review": 2741, "last_played": 1478906226}, "language": "english", "review": "Wurm is one of those rare games that makes memories. \nI can think back to group activities that took part in from years ago. \nIn Wurm you really have to really plan every outing. \nWho's got the healing covers? ...Who's bringing food and water? ...Which set of armor are you going to wear? ...Are we bringing a wagon?...Does anyone know the way there?\nLandscaping and building takes real planning and resource management (not to mention time) but you are rewarded with the ability to make a truly unique (and sometimes beautiful) mark on the land that will stand for ages with upkeep (or slowly fall into ruin with abandonment). \nEvery aspect of structure and item creation is covered. Make a chest out of pine?  Meh. Make it out of cherry or apple? How nice! \nYou'll find yourself saving high quality cuts of different woods for specific purposes as you travel through the forest, or snipping sprigs from plants for planting back at home later. Don't get too comfy while you're out there raking your garden though. A young troll might wander out of the woods and turn you into dinner.\nAdventuring is really an adventure. Take a wrong turn and you can become fantastically lost.\nWurm is an epic game and the amount of detail is staggering. In my opinion it's second only to Dwarf Fortress in detail. \nSince Unlimited relies on private servers, I would stress that one carefully vet a server before committing to play there as weeks of work you put into your home could be undone in seconds by an immature admin. Hope this helps!\n", "timestamp_created": 1445874666, "timestamp_updated": 1445874666, "voted_up": true, "votes_up": 21, "votes_funny": 0, "weighted_vote_score": "0.679993987083435059", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "45467149": {"recommendationid": "45467149", "author": {"steamid": "76561197960943229", "num_games_owned": 123, "num_reviews": 9, "playtime_forever": 211709, "playtime_last_two_weeks": 0, "playtime_at_review": 77274, "last_played": 1630004533}, "language": "english", "review": "Think of Minecraft being 20x more complicated, that's what you've got here. It's super-hardcore, takes a lot of time, but the results are much more worth the time & work you put in. I don't play Minecraft anymore, much prefer Wurm Unlimited.\n\nWasn't a huge fan of Wurm Online with all the pay walls, subscription fees, and lack of available land, but Wurm Unlimited addresses all of that allowing you to host your own world or join one hosted by someone you know.\n\n----\n\nUpdate: I would actively suggest you do NOT purchase this game unless it's on sale for less than 10 £/$/€, for the sole reason that Coders Club has been purchased by a bigger company of which do not wish to give any further attention to Wurm Unlimited.\n\nIt has been announced that there will be NO further feature updates to this game. Although bug updates will (apparently) be done it has currently been 7 months since we've had an update of any form at all, so I highly doubt anything further will arrive.\n\nCoders Club's efforts are now focused on their MMO sister product for Steam, of which will make this the inferior version, intentionally. Key employees that were working on Wurm Unlimited have moved on. (Unconfirmed if fired or resigned.)\n\nDon't just take my word for it. Read about it for yourself here: https://forum.wurmonline.com/index.php?/topic/171793-wo-steam-discussion/\n\ntl;dr: only buy this game if its on sale for cheap.\n\n----\n\nUpdate: This game is getting seriously buggy. Items frequently get lost and progress goes unsaved. 100% abandoned by its owning company.\n\nDO NOT BUY.", "timestamp_created": 1540655226, "timestamp_updated": 1696104741, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.679475486278533936", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "29830895": {"recommendationid": "29830895", "author": {"steamid": "76561198013809714", "num_games_owned": 0, "num_reviews": 33, "playtime_forever": 103282, "playtime_last_two_weeks": 41, "playtime_at_review": 12658, "last_played": 1713648878}, "language": "english", "review": "Poor developer support for both WO and WU.\n\nWU was a blatant cashgrab and an insult to its loyal customers in WO, and they suffer with limited modding support, developer disinterest in allowing players to pursue a good anticheat, and they get the content from WO months later with most of it gutted out. Its essentially a glorified testing ground.\n\nWO has been in a state of decline for a long time, and the developers have also yet to make any gamechanging decisions to bring back older players, balance out any PvP issues that have been festering for years, or advertise the game.\n\nDo not buy this game, do not pay premium for the online version either, and this is coming from a person with thousands of hours in WO who has followed this game since 2005, and started watching it squander its potential since late 2015.", "timestamp_created": 1486755546, "timestamp_updated": 1486755754, "voted_up": false, "votes_up": 50, "votes_funny": 3, "weighted_vote_score": "0.678797602653503418", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "18753321": {"recommendationid": "18753321", "author": {"steamid": "76561198042751961", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 69755, "playtime_last_two_weeks": 0, "playtime_at_review": 4125, "last_played": 1688880021}, "language": "english", "review": "I have been playing \"wurm Online\" for the last 7 years, I decided to share my love of this game in a \"Youtube\" series. For survival games, this 1 is the daddy, the daddy of them all. In my opinion no other survival can touch it, end of. Here is a link to my tutorial series, for all you new players and vets alike: https://www.youtube.com/watch?v=B2eOkefwo7g\n\nI hope you enjoy, be warned, it is comprehensive and WILL overload your brain. :o)", "timestamp_created": 1446166911, "timestamp_updated": 1446166911, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.674939095973968506", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "22469378": {"recommendationid": "22469378", "author": {"steamid": "76561197962150121", "num_games_owned": 917, "num_reviews": 153, "playtime_forever": 24429, "playtime_last_two_weeks": 0, "playtime_at_review": 23774, "last_played": 1462077425}, "language": "english", "review": "I'm going to preface this review with the blunt honesty that this game will not be for everyone.\n\nIt has relatively dated looking assets and UI, and an almost crushingly steep learning curve that doesn't ease up within the first few hours of play. In fact, it may seem even MORE daunting after you play for an hour or two. If you've never played a hardcore MMO like Ultima Online or EVE, Wurm may seem frustratingly difficult to get started in. This is not Minecraft (despite Notch having been on the original dev team), nor is it anything like any other relatively casual crafting game.\n\nAll of those things being said... It is one of the best crafting RPGs I've ever played, hands down. The seemingly unending complexity, the vast array of items and creatures, the fully moldable landscape, and a skill tree to make an Elder Scrolls game seem casual; Deep hardly begins to describe it. Once you manage to get your hands on the reigns of this game's mechanics... there's no turning back. Suddenly you've carved an entire city into the side of a hill with a growing economy of entirely player controlled mechanics that provides a level of satisfaction unfound in most modern RPGs.\n\nIf you're looking for a truly hardcore RPG experience... look no further than Wurm.", "timestamp_created": 1460869218, "timestamp_updated": 1460869347, "voted_up": true, "votes_up": 22, "votes_funny": 1, "weighted_vote_score": "0.673436880111694336", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "28454622": {"recommendationid": "28454622", "author": {"steamid": "76561198078340564", "num_games_owned": 958, "num_reviews": 45, "playtime_forever": 7189, "playtime_last_two_weeks": 0, "playtime_at_review": 4752, "last_played": 1577023151}, "language": "english", "review": "Learning curve wasn't as bad as people made it out to be. It's unique and outdated, though, so it'll take some getting used to. \n\nTook me 30 hours to make my first house, farm and mine, very relaxing process and the values that detirmine the speed of the progression are all customizable to your preference. The slowess does not bother me much, so I'm pretty close to default speed. Reminds me a lot of Runescape, but first person and highly customizable. Lots of skills and professions to work on so there's no complaining about lack of content here. \n\nIf you're in need of some help to get started, follow Shadow's Dawn's YouTube series. Very helpful and explains it well enough to get you over the learning curve. From there on, you can figure out the rest by yourself as you go along.", "timestamp_created": 1482091440, "timestamp_updated": 1482091440, "voted_up": true, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.672335922718048096", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "39587674": {"recommendationid": "39587674", "author": {"steamid": "76561198096000850", "num_games_owned": 91, "num_reviews": 5, "playtime_forever": 101831, "playtime_last_two_weeks": 0, "playtime_at_review": 24052, "last_played": 1688766033}, "language": "english", "review": "As a several year player of Wurm Online I was excited to hear of the Stand-Alone Unlimited version releasing for players who wanted to play in a Single Player environment.\n\nI was not expecting the ability to host private servers with Unlimited and was thrilled to see this made an option available to anyone who wished to go through that process.\nHosting a local-machine server is a challenge to setup to say the least, some settings are not overly clear and changing certain values can cause you to want to throw the keyboard through the screen with frustration. For users who are not familiar with setting up servers without an easy-to-use interface, this is not recommended at all!\n\nThe ability to change rates, starting skill values and other functions within the game itself made it possible to tailor the game to everyone's particular needs. For players who do not enjoy spending weeks or months at a time leveling a single skill several levels, the ability to increase the skill-gain makes this a much shorter and less daunting approach.\nFor those who absolutely hate watching a 15 second time to take a complete swing at a tree to chop down, the ability to reduce action timers was provided too.\n\nI have personally tried each setting in a couple of different configurations but quickly learned that what I loved about Wurm was the fact that to achieve something took quite some time. This made it much more rewarding to have finally built my first 2x2 structure out of wood.\nI felt far more accomplished to have finally cleared out, terraformed and paved out a road to my nearby clay/tar/peat resources for when I needed them.\n\nWurm (both Online and Unlimited) is not a game for anyone looking for an instant gratification or an easy task ahead of them. Wurm is a harsh environment, with crafting recipes that require you to make best friends with the Online Wiki or in the In-Game recipe list.\nFrom needing 20 planks to finish a single wall on your house to needing to mine out the stone to make your bricks to pave your road. Wurm is a game of Survival and pure Imagination.\nA game without limitations, it's the only game of it's kind and after having experienced Wurm I find it impossible to truly enjoy any other Survival Sandbox games as they just cannot compete with flexibility and depth that Wurm provides.\n\nEDIT:\nWhile Code Club AB has stopped Developing the Wurm Unlimited version of Wurm, it does not mean the game is dead.\nThere are still a lot of players, a lot of servers open to the public and a modding community still working with the game.\n\nThe Developers did leave WU to the community to take over, giving us a Beta version with the built-in modloader included.\nEven if I wasn't able to get this version working properly...\nI would recommend just using the Release version and patching your client with the modloader seperately anyway.\n\nWurm Online has been around for over a Decade, it is the parent game of WU (as WU is based completely on WO) and Code Club has decided to put their focus into their Online version.\nWU is stable! There may be a few things here and there that are not like WO but I feel that is because WU is geared more towards the Single Player experience and offering flexibility that WO does not.\n\nYou will find a lot of other reviews here complaining the game is dead and abandoned.\nI have to disagree completely!\nThe game is far from dead, it will not die either. Nor is it \"Abandoned\" any more than it is COMPLETE.\nWhen a game is completed, what do you do with? You stop.\nWO continues to get new features here and there, new updates here and there, sure.\nWU was never intended to get all the features WO has or will get either. They're two different games.\n\nWU for example, Code Club fully supports the use of mods on the client and client-hosted servers.\nWO on the other hand, you can get banned just for trying to get a mini-map on your client.. DONT DO IT!\n\nIn the end, the only comparisons you can make between WU and WO is that they are the same company, one is based on the other and the game-play is the same.\nThey ARE NOT the same game, and they never will be.\n\nDon't let these other reviews convince you that this game is dead or dying and that it's not worth the time to check it out simply because development has stopped.\nBugs are still supported, but nothing new will be added.\nThere are plenty of other games out there on Steam that are also not \"Adding new content\" are we going to call those games abandoned too?", "timestamp_created": 1516820523, "timestamp_updated": 1586575594, "voted_up": true, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.670241355895996094", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "50247966": {"recommendationid": "50247966", "author": {"steamid": "76561198085183333", "num_games_owned": 0, "num_reviews": 32, "playtime_forever": 19657, "playtime_last_two_weeks": 0, "playtime_at_review": 3276, "last_played": 1617802028}, "language": "english", "review": "as much as i wanted to like this game its let down by its community. if you are expecting to be part of a team you can forget it.. this might as well be a single player game.. after a request for help goin on months the community practically told me to play a different game since this isnt a game for \"newbs\".", "timestamp_created": 1555839966, "timestamp_updated": 1555839966, "voted_up": false, "votes_up": 58, "votes_funny": 11, "weighted_vote_score": "0.669867992401123047", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}}, "query_summary": {"num_reviews": 7, "review_score": 6, "review_score_desc": "Mostly Positive", "total_positive": 1603, "total_negative": 670, "total_reviews": 2273}, "cursors": {"AoIIPwAAAHep1OsE": "Mon Apr 22 23:49:19 2024"}}
