{"reviews": {"160809303": {"recommendationid": "160809303", "author": {"steamid": "76561197993433775", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 5760, "playtime_last_two_weeks": 0, "playtime_at_review": 5760, "last_played": 1710580925}, "language": "english", "review": "First off I just want to say that I really like the concept of this game. The visuals are quite good, and the customize-able airship is fantastic! Very cool vibes overall too... flying between ruined skyscrapers and wind turbines and the like. It really is a nice setting for an atmospheric survival game (heh, see what I did there?)\r\n\r\nThat said, at the time of writing this review, this game is pretty devoid of content. After really sinking my teeth into it, there is sadly very little to do. The announcements say that Forever Skies is set to leave early access later THIS YEAR. I honestly don't see how that's possible unless there's a HUGE update in the works. In its current state, I was able to complete all the available content in this game in less than 1 in-game week. And that INCLUDES all the time I spent customizing my airship... There is very little diversity in the types of towers you can find, and the landscape is basically an endlessly procedurally generated assortment of mountains, ruined skyscrapers, and towers of various types. It's visually quite nice, but in terms of gameplay there just isn't enough to do on these towers to keep your attention for long. Normal towers come in 3 types, and each type has about 3-5 varieties that you can find. At one point you can enter a 4th type of tower that houses an elevator that goes below the \"dust\" layer that prevents your airship from descending too far. Unfortunately, every \"underdust\" environment is exactly identical to each other, meaning once you've seen one you've seen them all. Same is true for the other tower varieties. After only a dozen or so hours of playing I became quite familiar with everything that I could possibly encounter along my journey.\r\n\r\nStory elements are also fairly minimal. There are some data pads to find along the way that help you understand a bit about the history of the environment you're exploring, but it's not very deep or surprising. Environmental catastrophe, nature reclaimed the planet, yadda yadda yadda. There are also some collectible objects and posters you can find randomly within the towers that you can then use to decorate your airship. After playing for a bit, I started to find a lot of duplicates of these objects, indicating that there isn't much variety to the cosmetic aspects of the game either.\r\n\r\nAt the end of the day, I still had some fun playing this game, and I understand it isn't yet finished... but it just feels unusually empty for a game that is supposedly close to a final release. I look forward to seeing whatever gets added next, but I don't have high hopes for this game feeling \"finished\" within the next year. Compared to many of the other survival/crafting games I've tried, this one needs a lot more content than it currently has if it's going to get a recommendation from me.", "timestamp_created": 1710720569, "timestamp_updated": 1710720569, "voted_up": false, "votes_up": 292, "votes_funny": 20, "weighted_vote_score": "0.801214754581451416", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161699092": {"recommendationid": "161699092", "author": {"steamid": "76561198157188007", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 364, "playtime_last_two_weeks": 0, "playtime_at_review": 364, "last_played": 1710819633}, "language": "english", "review": "Of the games I've played recently this one scratches an itch that was left largely devoid by Worlds Adrift. I very rarely leave reviews on games but I don't want to watch another good airship game disappear into the ether. \n\nPros:\n- Very nice game atmosphere can go from peaceful air fisherman simulator to horror game real quick.\n- Ship customization is good and despite not having played the new update. Can make a lot of very cool ships depending on your preferences.\n- Story is interesting so far. Excited to see where it goes.\n- If you've played Worlds Adrift you'll get a very similar vibe with this game.\n\nCons:\n- Placement of modules/objects is a little wonky. Takes some wiggling to get things exactly where you want them.\n- As previous reviews have stated the game is fairly \"barren\" in terms of content. However it is still under development and I want to give the devs the benefit of the doubt and I have high hopes for the game.\n- Tutorial feels long for what it teaches you. Then again I did spend most of the tutorial harnessing my inner packrat.\n\nOverall:\nIt's a promising game that if done right could be one of the best games to come out this year for survival/airship sim fans. It has some drawbacks but it's enjoyable enough that they aren't too major and the studio seems to be fairly communicative with their progress which is welcome in an age where most studios like to go dark and drop updates out of thin air.", "timestamp_created": 1711685347, "timestamp_updated": 1711685347, "voted_up": true, "votes_up": 25, "votes_funny": 0, "weighted_vote_score": "0.770269274711608887", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161053687": {"recommendationid": "161053687", "author": {"steamid": "76561198370277451", "num_games_owned": 222, "num_reviews": 1, "playtime_forever": 2673, "playtime_last_two_weeks": 0, "playtime_at_review": 1444, "last_played": 1711473993}, "language": "english", "review": "Recommended by german content creator Cornelius with the words: if Subnautica and Raft had a child.... And he could not point it out better. I was hooked from the first moment.  Floating over a  seemingly dead world, collecting raw material, gathering knowledge to unlock new science and a sad story... The grind is real but not exhausting or to repetitive, riddles must be solved and you can follow the story straight or idle around... Very balanced game mechanic, almost no glitches bc of early access and if stuck you have the *save me button* in the main menu. I love to fly arround and discover the hidden beauty of this changed mother earth, build on my airship, grow plants (in the beta version) and let my mind drift in this calm game. There are threats, danger and the endless drop if you slip...but no fighting action, zombies or mean players wanting zour loot. I have not finished the story yet and just can't wait to go back into the game. I hope there will be a sandbox\\survival option in the end, I don't need multiplayer, this game is better in solitude like *The long Dark*. But I absolut recommend to give it a try...very great first impression and a tendency for addiction will await you! Love it!!!", "timestamp_created": 1711010943, "timestamp_updated": 1711010943, "voted_up": true, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.707171499729156494", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160063252": {"recommendationid": "160063252", "author": {"steamid": "76561198036816061", "num_games_owned": 113, "num_reviews": 7, "playtime_forever": 1023, "playtime_last_two_weeks": 0, "playtime_at_review": 1023, "last_played": 1705007566}, "language": "english", "review": "its a fun game but don't buy till full release.\nfor context there is little to no story so far and not many places to go \n", "timestamp_created": 1709847227, "timestamp_updated": 1709847227, "voted_up": false, "votes_up": 39, "votes_funny": 0, "weighted_vote_score": "0.665700256824493408", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161533981": {"recommendationid": "161533981", "author": {"steamid": "76561198022007885", "num_games_owned": 0, "num_reviews": 24, "playtime_forever": 1741, "playtime_last_two_weeks": 0, "playtime_at_review": 1741, "last_played": 1711477721}, "language": "english", "review": "Review written on March 26, 2024. Game is still \"Early Release\" as of this writing.\r\n\r\nForever Skies is essentially \"Subnautica\" in the air. That's a very good thing! \r\n\r\nIn carrying forward the analogy between Subnautica and Forever Skies, both games do a lot of things right for a futuristic survival game.  In Forever Skies, you unlock new areas through exploration which, in turn, unlocks new tech, which unlocks further areas for expansion. It's a simple formula but it feels very balanced and robust and entertaining. \r\n\r\nI love the idea that future tech development involves feeding raw materials and plans into a 3-D printer... It's a game mechanic that makes sense and simplifies \"crafting\" for the player. I love that your base moves with you and that it can be customized. \r\n\r\nWhere Subnautica and Forever Skies diverge is that Subnautica was a beautiful game with distinct biomes that were unique and alien. Forever Skies might one day get there (and I hope it does!!) but for now, it's a bit monochromatic. \r\n\r\nThe game is a steal for 20 bucks, even in early release. I just hope my save game is compatible with future expansions as they become available!  \r\n\r\nIf you enjoyed Subnautica, this is a must-have game in my opinion. \r\n\r\n", "timestamp_created": 1711483952, "timestamp_updated": 1711483952, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.63866347074508667", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158615319": {"recommendationid": "158615319", "author": {"steamid": "76561198027755505", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 928, "playtime_last_two_weeks": 0, "playtime_at_review": 928, "last_played": 1708252833}, "language": "english", "review": "This game feels like a mix between Subnautica and Raft with some uniqueness that makes it perfectly its own. A playthrough of the current content took me approximately 15 hours, and that was with going pretty linearly toward main quest objectives. The modular ship crafting has a lot of nice features and will provide much extra game time for those who like crafting/base building. For those who aren't as big on the base building, the pacing for farming materials to advance through the story is just right—neither overbearing nor too easy.\n\nI didn't notice any bugs (at least not of the coding variety). Certain parts of the game pretty consistently experience fps drops, but rarely did it brick my gameplay, and I feel pretty strongly those issues will be ironed out once the game is optimized for full release.\n\nOverall, this was a very fun experience and well worth the investment. I am looking forward to seeing the full release of the game!", "timestamp_created": 1708253742, "timestamp_updated": 1708253742, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.629859745502471924", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162235803": {"recommendationid": "162235803", "author": {"steamid": "76561198007644998", "num_games_owned": 0, "num_reviews": 258, "playtime_forever": 1562, "playtime_last_two_weeks": 391, "playtime_at_review": 202, "last_played": 1713705216}, "language": "english", "review": "[h1] DELIGHTFUL and RELAXING [/h1]\n\nBeing a bit older than most gamer's, and having a bit more enjoyable time playing games that allow my pace, less reactivity, and not a shooter, this game seemed to be just up my alley.\nI requested information about bugs and content before buying, and it was all positive regarding content, updates daily, development progress, and content additions with a small story line that is growing.\nIt is relaxing, go at your pace, no stress survival game while trying to find a cure that took out the entire planet.\nYou are sent back to recover what a team was sent there to do in regards to this viral cure, with survival elements that are forgiving and well done.\nNever have I seen a game with this game style, artwork that is eye opening and just fresh on all levels.\n\nIf you are at the point I was, reading other reviews, and wondering if it is worth the price and still Early Access, you can bank on this game to be completed, and still even at the time of this review, Forever Skies® has an unprecedented amount of play time to offer and replay ability.\n\nYou know you can trust us, when we say, \n[h1] \"Get it and you wont regret it.\" [/h1]", "timestamp_created": 1712292013, "timestamp_updated": 1712292013, "voted_up": true, "votes_up": 8, "votes_funny": 2, "weighted_vote_score": "0.628378391265869141", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159504690": {"recommendationid": "159504690", "author": {"steamid": "76561197970414769", "num_games_owned": 460, "num_reviews": 12, "playtime_forever": 1898, "playtime_last_two_weeks": 0, "playtime_at_review": 1898, "last_played": 1709339629}, "language": "english", "review": "I would love this game if it weren't for the most important thing. The Airship. \n\nThe artstyle/design of the ship is just bad. Even with every piece unlocked there is no way to not make it look like an ugly box. \nThe ship is the tool for the player to interact with the world. It IS the game. It should be the thing they worked on the most yet it looks a tech demo or alpha version. If this the final design then there is no hope for this. \nIt also looks nothing like the promotinal art. \nThere is a limit of how much \"magic\" you can make sience fiction but this design is pure fantasy. The walls and floor are cardboard thin, yet somehow magicly are able to carry and protect you from giant flying debris.\nIf they were going for a sleek futuristic apple/subnautica design then they did not manage capture it.\n\nThe outside of it is just boring and flat. It does not fit the world at all. \n\n- There should be a differance between outer and inner wall with outer being thick and able to protect you and a the normal inner wall cheaper that get destroyed when hit. You could round up the outside of the thicker wall to give us corner or angles, something to not make it look like an ugly flying cube.\n- Window variations with bulleyes, chest high windows that are inward the thick walls to make the outside look more 3 Dimensional.\n- More tech outside other than engine and turbine like how does you radar screen magicly get a signal. There should be dish outside that get damaged when hit. You could tie it into the progression system to only able to receive some signal and not all at the beginning with an upgrade or additinal dish later. \n- Instead of having the water Condenser looking like a cheap camping equiptment on the ground you could make a wall device that needs an outer wall on the other side and when you move the airship it slowly creates dirt water out of the atmosphere.\n\nThe frame of the game is good, I'd just really wish they work on the ship before they continue work on the story.\n\nEDIT: They since removed the art that seemd \"conceptual\" and replaced it with renders of the actual design ingame.", "timestamp_created": 1709166776, "timestamp_updated": 1711666687, "voted_up": false, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.604190647602081299", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161986478": {"recommendationid": "161986478", "author": {"steamid": "76561198049725294", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 1022, "playtime_last_two_weeks": 0, "playtime_at_review": 881, "last_played": 1712063377}, "language": "english", "review": "Calling it simply \"Subnautica in the sky\" doesn't give this game enough justice. It has it's similarities to Subnautica, and comparing the two is definitely a compliment with the hit Subnautica was. BUT. This game has a different feel for me. Many talked about Subnautica giving them thalassophobia or triggering fight or flight, but if you're like me and only found the game to be peaceful and easy, this game is NOT that. \n\nThis game has so much potential!! To bring up some of the issues mentioned in other reviews, yes it does have frame rate drops, when going down the lift, the frames drop, sometimes during storms, or when theres a lot going on visually such as during high winds, but I found dropping to 1080p on Medium worked for me (Ryzen 5 5500, 8gb ram, RTX 4060) I could run it on Epic, but the frames suffered and honestly visually the game is still attractive on Medium thanks to it's art style!\n\nIt goes from chill, you're gathering scrap for your next upgrade, to suddenly being warned by your AI companion \"A storm is coming\" and you're darting for your ship to get to lower ground before the extremely loud thunder claps start and the lightning wrecks havok on your ship. Only to find out that during your dart you ran into an insect that gave you meningitis and through glass that's caused you to develop a bleeding disease I can't spell. Next you're running around your ship desperately hoping your plants haven't rotten away so you can craft a cure for your diseases, all whilst your AI that should be saying \"Starvation Risk\" is now going \"hnfihfahwd\" because of the meningitis. That is such a cool feature and personally my favourite that I had to bring it up. \n\nThe exploration feels a little sparse for now, as others have mentioned there isn't too much variation in the localities, and I'm hoping that as the game continues development we'll get a couple more variations in the towers but at the same time, that familiarity feels empowering after a while, when you need to gather a specific item and know exactly what sort of tower to go searching for. On these towers, I'm not sure if this is a bug or intentional, but some towers will have debris clipping through the buildings, which visually makes sense, but theres no way to clear the debris (I'm talking metal beams, not things you can extract) which can lead to you getting stuck if you try and force your way through for that good loot, hopefully this will be tidied up in later updates, but I've only come across this once or twice!!\n\nTLDR: If an hour of gameplay equals a pound spent to buy the game, you'll get your money's worth and more! Looking forward to see what's coming in future updates!\n", "timestamp_created": 1712013194, "timestamp_updated": 1712013194, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.584992706775665283", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162305105": {"recommendationid": "162305105", "author": {"steamid": "76561199183550121", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 5920, "playtime_last_two_weeks": 799, "playtime_at_review": 2993, "last_played": 1712817572}, "language": "english", "review": "as a subnautica fan, and a no mans sky fan this game really works", "timestamp_created": 1712372153, "timestamp_updated": 1712372153, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.567567586898803711", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "163015035": {"recommendationid": "163015035", "author": {"steamid": "76561198113621491", "num_games_owned": 652, "num_reviews": 33, "playtime_forever": 376, "playtime_last_two_weeks": 376, "playtime_at_review": 376, "last_played": 1713309788}, "language": "english", "review": "I love, love, LOVE the atmosphere of the game. the game play leaves much to be desired I got 6 hours in hoping that i would get over the starting hump. All I find is more tedium. tediously gather resources to research just to tediously gather resources to craft something that just keeps the cycle going. I will return after more updates in hopes that the speed of resources gathering is increased or the amount needed is greatly reduced.", "timestamp_created": 1713310217, "timestamp_updated": 1713310217, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.566296279430389404", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161965653": {"recommendationid": "161965653", "author": {"steamid": "76561198008487038", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 891, "playtime_last_two_weeks": 0, "playtime_at_review": 891, "last_played": 1711992283}, "language": "english", "review": "Subnautica, but in an airship. :)\n\nIts main gameplay loop consists of  exploring, gathering resources and technology, which allows to craft tools to explore further. The survival mechanics are very forgiving, at least once you discover gardening.\n\nThere's a light story to motivate your actions, though it mostly stays out of the way. The focus is definitely on exploration.\n\nBuilding one's airship-based base, and moving around with it, is quite satisfying.\n\nThe game looks nice. Performance leaves a bit to be desired, with occasional FPS drops, but is not getting in the way of the game.\n\nSome jank is present still, especially with terrain hitboxes which can make traversal a bit frustrating at times. (I'm looking at you, tree branches).", "timestamp_created": 1711992819, "timestamp_updated": 1711992819, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.560293138027191162", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159989700": {"recommendationid": "159989700", "author": {"steamid": "76561198249609800", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1676, "playtime_last_two_weeks": 0, "playtime_at_review": 1676, "last_played": 1709742677}, "language": "english", "review": "The game is heavy on graphics. By pressing \"run hardware\" in the options you will be able to run the game on medium settings with RTX 3060. So why the default graphic settings were on max when loading the game for the first time?\r\nThe overall random lights(compounds) is a weird idea as there is no clear direction where the player should go. And when the player is given direction most (if not all) compounds become irrelevant if not for the achievements. Take Subnautica as an example, not a lot of compounds, but those are split in biomes or split by different watercolors and the direction is somewhat constantly being provided to the player (even if there was no clear goal it was rather self-explanatory to go deeper to explore and you will eventually progress the story). Here same thing can be achieved by using clouds or fog instead of rendering unnecessary stuff and leaving more hints about where to find what. It took me a while to find a ship workstation if not for the question mark at the end of the game and then 5min later \"the end\".\r\nAll compounds are essentially copy/pasta with some small changes like some walls or paths are open or blocked. meaning, if you lack some resources you already know the way to get it - that was just a boring or bad design idea - might just add a console line or cheats to spawn stuff instead of spending time on this design. After all, it's a single-player game, so let players decide how they want to mess with the game.\r\nThere are bugs and glitches like with the medical bed just consuming all of the resources and not giving any results, or being stuck in textures or just outright falling through and dying.\r\nThe general idea of living in the skies is not so bad, but exploration happens on the \"ground\" objects and you even need to dive to the lower levels for rare stuff - nothing to explore in the sky.\r\nYou can't talk about this game if you are not comparing it to Subnautica or maybe Planet crafter(but not really).\r\nI believe releasing this project early was a mistake as further development will most likely add more assets like maybe on-board plantation, solar energy with rechargeable batteries or wind energy(does sound logical to have since you live in the sky). But no big rework of the project will ever happen, maybe in an expansion or the next game.\r\nIf you want a better experience just try Subnautica if you like exploration and immersion. + over there you get to build a submarine with other logistical equipment instead of starting off with it. I mentioned Planet Crafter because the game does have the potential to be better than Subnautica. After all, over there the the same environment changes as you progress also unlocking new areas. It is an amazing feature, but that game also has its problems.", "timestamp_created": 1709753869, "timestamp_updated": 1709753869, "voted_up": false, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.555893599987030029", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161691018": {"recommendationid": "161691018", "author": {"steamid": "76561197964471157", "num_games_owned": 1167, "num_reviews": 302, "playtime_forever": 231, "playtime_last_two_weeks": 0, "playtime_at_review": 231, "last_played": 1711674765}, "language": "english", "review": "Pretty good, like Stranded Deep and Subnautica had a child that flew away with Helium Balloons.", "timestamp_created": 1711674843, "timestamp_updated": 1711674843, "voted_up": true, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.54864037036895752", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158518773": {"recommendationid": "158518773", "author": {"steamid": "76561198000715584", "num_games_owned": 0, "num_reviews": 88, "playtime_forever": 55, "playtime_last_two_weeks": 0, "playtime_at_review": 55, "last_played": 1708165474}, "language": "english", "review": "The concept is sound but the mechanics are awful, much has evolved in the last 15 years of survival crafting games and this game could do a lot to learn from them. Inventory the size of a purse and survival needs such as food and water lasting about 5 minutes in total means a tedious scramble and not much time to familiarise yourself with the world you must operate in, and that's an essential facet of these sorts of games. Recommend giving this game some time to cook.", "timestamp_created": 1708165768, "timestamp_updated": 1708165768, "voted_up": false, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.546178102493286133", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162299505": {"recommendationid": "162299505", "author": {"steamid": "76561197998037017", "num_games_owned": 115, "num_reviews": 5, "playtime_forever": 893, "playtime_last_two_weeks": 0, "playtime_at_review": 893, "last_played": 1711936725}, "language": "english", "review": "Has a lot of potential. Similar vibes to raft.  My only issue is the massive performance drop in certain areas.", "timestamp_created": 1712364879, "timestamp_updated": 1712364879, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.544997990131378174", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160283559": {"recommendationid": "160283559", "author": {"steamid": "76561198145899402", "num_games_owned": 0, "num_reviews": 27, "playtime_forever": 200, "playtime_last_two_weeks": 0, "playtime_at_review": 200, "last_played": 1708483643}, "language": "english", "review": "Starting to think that this is not going to be a complete game.  I feel they are trying to prove how many updates they are making by putting a counter but I don't really see a lot of updates.  Don't buy until a major update comes around if any.  I regret buying this....I had a feeling it was a money grab but I didn't listen to my intuition.", "timestamp_created": 1710097327, "timestamp_updated": 1710177253, "voted_up": false, "votes_up": 31, "votes_funny": 0, "weighted_vote_score": "0.541378557682037354", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160195412": {"recommendationid": "160195412", "author": {"steamid": "76561198123096503", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 3439, "playtime_last_two_weeks": 0, "playtime_at_review": 3439, "last_played": 1699494692}, "language": "english", "review": "Do not buy this (edited*) title. At least wait for release. They just want money, it's not about creation or talent showcasing or pride for these folks.\n\nThey care more about interacting with money-providers than actually developing a game. What is being discussed in all the dev videos and nonsense, the updates that aren't being released? When even was the last update, in 2023 right? Over 5 months ago, just checked.\n\nThey've had like a dozen new posts* ... all about dev videos (about the stagnation?(edited*)) and panhandling for Steam awards when they only have 5% of a game developed. This is a (edited*)\n\nWhat about, (edited*) develop the game people have paid for? I didn't pay for videos about the game that is not being developed. (edited*)\n\nConcernedApe created a higher quality game and they did it alone without the world funding their game in advance. Also without flapping their lips needlessly.\n\nI've never wanted a developer* to say less(edited*).\n\nThis whole \"fund our game before we even have anything to sell\" thing is super trashy. Embarrassing for gamers, devs, and publishers alike.\n\n***I've updated my review to remove the harsh language. I was annoyed and frankly tired of feeling like people are being taken advantage of.\n\nI'm sure this game could be fantastic when it's finished, whenever that is; nothing but hotfixes and news posts for over 5 months does not bode well. I shouldn't have bought an early access title and that is my own fault.\n\nI'm stepping away for a couple years, I'll check out the completed game and remove the Not Recommended review if its a good game.\n\nProcedural generation is crap, it's the largest corner cutting brought to video games since inception. No Mans Sky is a fun game but it's boring and not creative having a universe that is all the same thing repeating. Raft is the same few islands on an infinite loop. Forever Skies is no different, every ruin is the same few copy and pasted. How boring and lacking creativity. It IS a bad game right now and gardening won't fix the repetitive boring lack of changing scenery.\n\nPut in the hard work and build a full world or have a shallow repeating copy paste world.\n\nThere isn't much more to this game than the game trailer shows.\n\nIt's an absolute shame seeing the state of gaming since like 2012. Everyone's so greedy and all companies have become so shady. If I or any random citizens behaved like companies do today, we'd be in prison within the week. But everyone enables the behavior, guess I'm the odd one out.", "timestamp_created": 1710002467, "timestamp_updated": 1710727470, "voted_up": false, "votes_up": 23, "votes_funny": 3, "weighted_vote_score": "0.537068188190460205", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159360338": {"recommendationid": "159360338", "author": {"steamid": "76561199151189498", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 1132, "playtime_last_two_weeks": 0, "playtime_at_review": 570, "last_played": 1709478761}, "language": "english", "review": "Subnautica but in the sky with a mobile base. So yes, it's fantastic.", "timestamp_created": 1708995455, "timestamp_updated": 1708995455, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.533568859100341797", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162971399": {"recommendationid": "162971399", "author": {"steamid": "76561198006738836", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 571, "playtime_last_two_weeks": 0, "playtime_at_review": 571, "last_played": 1712218895}, "language": "english", "review": "It's got some interesting concepts and art, and the airship being the base is a great idea. However there's not really much to do - you can fly from place to place to pick up blueprints, follow the story, gather resources, etc. But, there's not really any enemies (some hostile fauna/flora and the occasional storm) and so it got boring fast. I didn't make it to the ground-level tunnels, but also not really motivated to get there with the current state. \n\nKeep on follow, buy if you're interested in the idea, otherwise wait.", "timestamp_created": 1713251144, "timestamp_updated": 1713251144, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.528985500335693359", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162475895": {"recommendationid": "162475895", "author": {"steamid": "76561198810724216", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 2060, "playtime_last_two_weeks": 756, "playtime_at_review": 1303, "last_played": 1713627968}, "language": "english", "review": "Game is early release. finished it in 24h, in no rush.\r\nit reminded me of Subnautica when it was in early release, lot of fun.\r\nget to build flying base, uprgade kit, find new locations, still need work on but i loved it.\r\nkeeping it in my library for further updates.\r\n7/10", "timestamp_created": 1712577177, "timestamp_updated": 1712577177, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.526627242565155029", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "163318579": {"recommendationid": "163318579", "author": {"steamid": "76561198003302441", "num_games_owned": 272, "num_reviews": 4, "playtime_forever": 3499, "playtime_last_two_weeks": 685, "playtime_at_review": 3496, "last_played": 1713724025}, "language": "english", "review": "Love the game and have almost 60 hours in it. The latest update, \"Gardening Branch,\" did break something though. When viewing the water filter, it will crash your game. I just reinstalled and it was fine. It's early access, and bugs are to be expected. Love the crafting and exploring. It's a fresh take on the survival genre. You should give it a try. The addition of gardening really changes a lot of things. Also, looking forward to them expanding the enemy's storyline.", "timestamp_created": 1713710563, "timestamp_updated": 1713710563, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162579820": {"recommendationid": "162579820", "author": {"steamid": "76561199118595178", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 2735, "playtime_last_two_weeks": 1118, "playtime_at_review": 1736, "last_played": 1713732142}, "language": "english", "review": "I love this game so much, had it for about two weeks now and this is the perfect single player game for me. Heavy on the resource management for sure (which I thoroughly enjoy), and not overly realistic with the survival aspects, along with an expansive crafting, cooking, and gardening features. The scenery is beautifully apocalyptic, capturing the intended effect of a ruined planet earth devoid of any human life.\r\nIt is a little bit demanding computer-wise, but that's to be expected with any 2023 title. And truthfully, that's the only thing I have to complain about, the optimizations (and lack thereof) made. I have hope for the future though, as the devs are continuously updating it.", "timestamp_created": 1712715256, "timestamp_updated": 1712715256, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161756878": {"recommendationid": "161756878", "author": {"steamid": "76561198023507237", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 518, "playtime_last_two_weeks": 0, "playtime_at_review": 376, "last_played": 1711922478}, "language": "english", "review": "Still definitely a work in progress, but a  hauntingly beautiful world.", "timestamp_created": 1711747492, "timestamp_updated": 1711747492, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160428640": {"recommendationid": "160428640", "author": {"steamid": "76561199569277448", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 741, "playtime_last_two_weeks": 0, "playtime_at_review": 671, "last_played": 1710450146}, "language": "english", "review": "Watching trailers for this game, it looked to be pretty clearly inspired by Subnautica above all else and as someone who is eagerly anticipating the forthcoming Subnautica sequel, this had me very interested.\n\nIf you are, like me, a Subnautica fan and you are thinking about buying this game to get your fix, I would highly caution you. It falls short in many areas. I understand it wants to differentiate itself, but if you are going to take away something that makes the game fun, you need to replace it with something equally fun. Here are the major points which kept me from enjoying this game:\n\n* Looks visually interesting and impressive in the trailer, but the actual product falls short of this. It has its moments but more often it's pretty dull and depressing to look at.\n\n* On a related note, the world feels rather dull, lifeless, and sad. Yes I know it is a post-apocalyptic setting. Other games take place in a post-apocalypse and manage to make it lively and fun in their own way. Video games are supposed to be fun and exciting. In 11 hours of play I have encountered very few life forms and the ones I have are not interesting in any way to interact with.\n\n* I take a major issue with the game's design. My first couple of hours were frustrating as I had to do tech upgrades just to get any vertical movement at all. You do realize it isn't realistic to say that a hot air balloon can't manage to elevate itself by 5 feet to get to an unreachable area. An easy fix for this would be to just start the airship off with one turbine already built. \n\n* Another related aspect of the design I take issue with: I don't think any progress of the game happening upward is even necessary. You could, like Subnautica, have progression move downwards into the toxic fog, but the game was designed to prevent this, since the underworld loads separately and is limited to indoor, on-foot areas. A HUGE missed opportunity in my opinion and despite the game being in early access, I'm sure this aspect of the games design is set in stone by now. Unfortunate as I think this design choice was a bad one.", "timestamp_created": 1710302031, "timestamp_updated": 1710409174, "voted_up": false, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.522536575794219971", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159261730": {"recommendationid": "159261730", "author": {"steamid": "76561198050138668", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 1242, "playtime_last_two_weeks": 0, "playtime_at_review": 1242, "last_played": 1708879254}, "language": "english", "review": "Unfortunately I cannot recommend the game at its current state. There is much potential and it can be quite fun, however it is very unpolished yet. Here are some examples:\n\nThe UI:\nThe UI is a mess. You cannot place markers and lose orientation very quickly. If you place ressources [spoiler](eg. inside the lift to the underdust)[/spoiler] and fly away to gather other ressources you need, you will probably not find your way back. Also all objects on your radar are squeezed to the border and it is very hard to distinguisch them. The unability to zoom doesn't make it better. The Databank delivers very little infromation, sparing out the information you really need [spoiler](e.g. that gastroenteritis virus can be extracted from dust lettuce).[/spoiler]\n\n- Ressources:\nRessource grinding can be very annoying. You need tons of synthetics only to put three room pieces together with plastic walls. If you use synthetic fuel, it will be burned faster than a paper plane in a crucible.\nOther fuels are more effective, but the ressources needed are very rare. Furthermore you can make yourself comfortable with cruising around for hours to get the ingredients for one freakin' booster.\n\n-Questline:\nThe questline seems broken. There are passages skipped by whatever trigger. [spoiler]At a certain point you will be promted to visit three infected greenhouses. After the second one it suddenly skipped and told me to craft some holographic thingummybob at the workstation I did not yet have. So I got the workstation first, but had no blueprint to go on. Revisiting a infected greenhouse didn't make it either, because there was no computer left there to get data (and maybe the bp) from. [/spoiler]\n\n-Powering:\nWhy do some devices need power where others don't. And why is the battery sucked out so fast. I cannot even recharge three tools without changing the batteries of the charger. And why can you craft crystal batteries, but not solid state bateries?\nYes you can say it is easier to get SSBs, but it is easy to get polymer-ingots, too but you have a recipe for that. \n\n-World Design:\nLooks very great at the first view. But you will soon realize that there are all the same buildings over and over again. Hunting for all blueprints you need, makes the game very repetitive.\n\n-Others:\nThe official wiki is outdated and delivers false information.\n\nEDIT:\nforgot to mention, that the perfomance is poor because there are way too much particles to be rendererd. (Why are there actually flying steel-beams through the air?)\n\nAnd contrary to what some people say: This game is NOT like Subnautica in the sky, not even rudimentary. This is just a nearly empty world littered with skeletal skyscrapers.", "timestamp_created": 1708882252, "timestamp_updated": 1709049270, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.521992146968841553", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158857539": {"recommendationid": "158857539", "author": {"steamid": "76561198002050572", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 3751, "playtime_last_two_weeks": 0, "playtime_at_review": 2940, "last_played": 1708574839}, "language": "english", "review": "This is a great co-op survival crafting game.  It's pretty obviously not done, but in its current state (February 2024) it's got around 40 hours worth of content in it.  I'd describe it as 2 parts Raft, and 1 part Subnautica.\n\nYou fly around a map with randomly placed towers/skyscrapers, and encounter deliberately designed buildings, although which one is where is random, but you will end up seeing the same ones repeatedly.  However, they're pretty much all bigger than the small islands on raft, and there are already WAY more of them.\n\nIf that description sounds remotely appealing to you, buy it!", "timestamp_created": 1708483560, "timestamp_updated": 1708483560, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.52173912525177002", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158782245": {"recommendationid": "158782245", "author": {"steamid": "76561197961044762", "num_games_owned": 0, "num_reviews": 62, "playtime_forever": 1686, "playtime_last_two_weeks": 0, "playtime_at_review": 1111, "last_played": 1708841896}, "language": "english", "review": "A very complete early access survival game that deserves more recognition. It is very addictive building up your travelling airship home and investigating points of interest. The game is designed so that each stage of building your ship and adding machinery unlocks access to additional gameplay elements, eg. higher towers, new research, new fauna and flora, and the Underdark. I don't completely understand how the map populates with POI's but when you leave the area and return later they seem to have reset as materials and items will be renewed which allows you to build up your airship even further. I am glad they did not limit resources in the game. This game is highly recommended if you love open world survival games.", "timestamp_created": 1708407138, "timestamp_updated": 1708407138, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.52173912525177002", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162275410": {"recommendationid": "162275410", "author": {"steamid": "76561198012929364", "num_games_owned": 1223, "num_reviews": 25, "playtime_forever": 2077, "playtime_last_two_weeks": 35, "playtime_at_review": 1649, "last_played": 1713724908}, "language": "english", "review": "really fun and chill game .", "timestamp_created": 1712338883, "timestamp_updated": 1712338883, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.521276593208312988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "163164159": {"recommendationid": "163164159", "author": {"steamid": "76561198178912998", "num_games_owned": 367, "num_reviews": 62, "playtime_forever": 193, "playtime_last_two_weeks": 81, "playtime_at_review": 193, "last_played": 1713532089}, "language": "english", "review": "Subnautica but in the sky over a dead world - try not to fall :P", "timestamp_created": 1713532122, "timestamp_updated": 1713532122, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.520958065986633301", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157124299": {"recommendationid": "157124299", "author": {"steamid": "76561198160832545", "num_games_owned": 1248, "num_reviews": 125, "playtime_forever": 120, "playtime_last_two_weeks": 0, "playtime_at_review": 120, "last_played": 1706461243}, "language": "english", "review": "Disclaimer: I have received this game for free through a LurkIt campaign for streamers. Leaving a review was not part of the campaign and I do it out of my free choice to share my thoughts.\n\nI've watched a friend play this few months ago. The game really intrigued me but I ended up with same feelings about it.\nIt's a Subnautica-like game but in the air and You're flying an airship, which You can expand in any way You want.\nIt gets pretty grindy though. I wish that this game would be a co-op. Still one ship, even if it would be just 2 people co-op.\nThe game was also constantly changing my graphic settings to Epic, even though I wanted medium (due to streaming).\nI still need to play a bit more of the game, but for now I really think it could be more balanced or if possible remade for a 2 player co-op. It would be so much better to play with a friend!\nStill worth getting on a bigger sale IF You're a fan of survival/crafting games like Subnautica / Raft.", "timestamp_created": 1706540447, "timestamp_updated": 1706540447, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.52054065465927124", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159976230": {"recommendationid": "159976230", "author": {"steamid": "76561198007143370", "num_games_owned": 259, "num_reviews": 33, "playtime_forever": 457, "playtime_last_two_weeks": 0, "playtime_at_review": 457, "last_played": 1708553256}, "language": "english", "review": "Swing and a miss for the open world genre. Most unlocks are pretty much just a step further in the plot, without actually adding any fun elements to the game. It has action/platformer elements, but the execution is not at all set up for that. Once I jumped from my ship onto a girder, only to find out that the girder wasn't an object, so I fell through it and plummeted to my death. Not cool when you get punished for death. Generally speaking, it's just not fun, which is too bad, because by the time you realize it's not going to get fun, you're past the 2 hour threshold for a refund.", "timestamp_created": 1709739950, "timestamp_updated": 1709739950, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.520034611225128174", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162191196": {"recommendationid": "162191196", "author": {"steamid": "76561197977152995", "num_games_owned": 0, "num_reviews": 92, "playtime_forever": 2479, "playtime_last_two_weeks": 1399, "playtime_at_review": 2108, "last_played": 1713492847}, "language": "english", "review": "Pensive and haunting. Like Raft but more floaty and with slightly fewer sharks.", "timestamp_created": 1712242986, "timestamp_updated": 1713154693, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.519999980926513672", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "163187402": {"recommendationid": "163187402", "author": {"steamid": "76561198061017121", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1007, "playtime_last_two_weeks": 2, "playtime_at_review": 1007, "last_played": 1713555696}, "language": "english", "review": "I can't currently recommend the game. Since the Gardening update, anytime I look anywhere near the water condenser, my game crashes. I've sent several bug reports since the patch was initially introduced, and it still hasn't been fixed. Since I can't even look at it long enough to remove it, it literally makes the game unplayable until it's fixed.\n\nOther than that, the game is fun and interesting. Maybe when they get around to fixing that little hiccup, I would definitely recommend it.", "timestamp_created": 1713555804, "timestamp_updated": 1713555804, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.519841253757476807", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "163162383": {"recommendationid": "163162383", "author": {"steamid": "76561198858547364", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 5095, "playtime_last_two_weeks": 5095, "playtime_at_review": 5095, "last_played": 1713390791}, "language": "english", "review": "I would play for another 84 hours if I could just find some more repair patches.\r\nno, o.k., seriously\r\nI would play for another 84 hours if I could just make another immunity booster.\r\nI read somewhere that \"Google is my friend.\" so I \"researched\" it (research being what all you crazy kids born after 1980 call the first ten Web search results). All I can find is half The Internet believes they can never make another immunity booster, again and the other half seems to claim they go down in the dust, like, all the time and those giant cricket things are lying around like oil on Jed Clampet's old homestead.\r\n\r\nFIVE STARS for being one of 20 games in the last 5 years that actually pauses when I need to urinate.", "timestamp_created": 1713530005, "timestamp_updated": 1713530005, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.519841253757476807", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158545822": {"recommendationid": "158545822", "author": {"steamid": "76561198030336925", "num_games_owned": 0, "num_reviews": 176, "playtime_forever": 2337, "playtime_last_two_weeks": 38, "playtime_at_review": 2298, "last_played": 1712872416}, "language": "english", "review": "several attempts at playing. Many bugs get written out and then patched back in the next update. They need to download the \"current\" build to every programmers computer to get rid of these older bugs. These bugs include but not limited to; inability to complete main story line due to steps being broken from inability to gain spacific items. Hermorragic fever (ex), 1 item drops where you need to research the cold resist instead of 3. these are some time just time consuming in order to find the next site. but even then they do not spawn in that area either until next step is completed.", "timestamp_created": 1708189912, "timestamp_updated": 1708189912, "voted_up": false, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.515577971935272217", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1710173852, "developer_response": "Hello, \n\nWe just sent out a patch that should fix the issue you mentioned.\n\nPlease check and see if it works for you.\n\nIf so, would you consider removing the negative review, please?\n\nMany thanks! :)"}, "162161390": {"recommendationid": "162161390", "author": {"steamid": "76561198799145298", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 1336, "playtime_last_two_weeks": 1, "playtime_at_review": 294, "last_played": 1712662249}, "language": "english", "review": "I see a lot of potential in the game, even though it is early access and it's a young game, there is \"few\" bugs there and there. And performance might be requiring 3 3090s to run it smoothly as it potentially lags out the ssSSShhiiitt out of my game WHEN I FUCKING OPEN LOCKERS!?!. ALSO CAN THE GUY STOP BREATHING like a old man with type 10 asthmatical diabetes. CUZ all i am hearing is ear rape inside my deepest part of my soul. Also pls do not get me started about jumping, pls in real life i would fucking jump at least 2 metres horizontally if i had the balls. This guy just doesn't care about dying or slipping on the 1 mm thick pathway.", "timestamp_created": 1712204705, "timestamp_updated": 1712204705, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.508928596973419189", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158275605": {"recommendationid": "158275605", "author": {"steamid": "76561198000608773", "num_games_owned": 0, "num_reviews": 227, "playtime_forever": 839, "playtime_last_two_weeks": 0, "playtime_at_review": 839, "last_played": 1707879640}, "language": "english", "review": "I am about 14 hours in and have hit the end of the current content. \nI really like the game! it is somewhat a mix of subnotica and raft but with a blimp. this acts as a mobile, build able base. I compare it to both of these games in part because of rafts scrap floating by mechanics and subnoticas tech progression. \nMaps are randomly spawned in POIs that you fly to and from with a light that you can power down to know if you have been there or not yet. Most things have more then one use, and in some cases I ended up using them for the wrong thing for the story, and needed to go hunt down more of it. this isn't bad however, it just lets you learn what you need and how to use it. POIs do have varied types with larger ones seeming to spawn less then smaller, and it is possible to miss upgrade scans. thankfully it has a bit of a codex to tell you what to look for and what POI type you want to visit for it.  I got auto extractors pretty late in the game, and thus I was alwase low on synthetic material and had a excess of batteries. With upgraded ones that focus on the flying debris, I could trade batteries for multiple stacks, and used them a a sort of auto turret to prevent damage from said debris while flying. \nthe story is a little scant, but I also may have skipped some stuff by accident. \n it has a build system that you can make complex without being overly confusing, and supports large base building if you want it. I kept mine relatively small. unlike subnotica there is no central power or fuel system, and you cant recharge batteries, but anything you put on your ship that makes it fly just integrates no matter where it is. \nThe only two complaints is that sometimes it is very hard to find what is damaged on the ship, and for whatever reason it would revert my saved graphics settings from medium to epic. while my computer can ruin it at max, its a lot more fluid at lower settings. I did also have a bug where I approached the same tower I was just at for one of my story missions and it auto completed a next step for one reason or another. \nAll in all, I really like it and excited to see where it goes.", "timestamp_created": 1707881113, "timestamp_updated": 1707881113, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.50724637508392334", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161909227": {"recommendationid": "161909227", "author": {"steamid": "76561197972146384", "num_games_owned": 1614, "num_reviews": 10, "playtime_forever": 1812, "playtime_last_two_weeks": 0, "playtime_at_review": 401, "last_played": 1712390501}, "language": "english", "review": "Great start to an early access game, graphics are good, runs smooth and the story is engaging.\r\nThe whole premise is fairly unique and captivating - looking forward to see what the dev(s) come up with as we move forward.  Lot of possibility.", "timestamp_created": 1711918813, "timestamp_updated": 1711918813, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.505576252937316895", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140666623": {"recommendationid": "140666623", "author": {"steamid": "76561197973193893", "num_games_owned": 0, "num_reviews": 105, "playtime_forever": 1813, "playtime_last_two_weeks": 0, "playtime_at_review": 798, "last_played": 1702668969}, "language": "english", "review": "Review as of 25/06/2023:\n\nGeneral:\n- 6 hours to beat the story.\n- 13 hours to unlock every blueprint and max out the ship.\n- Major updates planned every 3-4 months.\n- 4 player co-op is on the roadmap.\n- Graphics and GUI feel like Planet Crafter, exploration is similar to Raft.\n\nPros:\n- Completely new concept that hasn't been done before.\n- Complete customizability of the airship.\n- Underdust survival elements with mazes of tunnels, oxygen requirements etc.\n- Well hidden secrets with the most valuable loot being hidden behind some kind of climbing/exploration puzzle that is not obvious.\n- Multiple destination types and layouts, loot is unlimited as the map doesn't have a limit (like Raft).\n- Loads of unlocks, blueprints and upgrades to discover.\n\nCons:\n- Stack sizes for a lot of items are way too small.\n- Starting chest size is 6 slots, which combined with small stack sizes is a micromanagement hell.\n- Initial survival elements feel a bit too harsh (food/water drain fast, energy restores while sleeping which drains both food/water in the meantime). Over time you unlock items that make survival way easier so not an issue in the long run, but in the early stages most of your time will be spent on keeping your stats up.\n- Fairly short amount of story at the moment. There only really is 1 true story location so far.\n\nOverall with the current 20% discount to £19.99 I feel like it is worth it. Probably wouldn't pay the full price until they add more content or co-op.", "timestamp_created": 1687690072, "timestamp_updated": 1687690072, "voted_up": true, "votes_up": 182, "votes_funny": 0, "weighted_vote_score": "0.913318455219268799", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140770629": {"recommendationid": "140770629", "author": {"steamid": "76561198017281305", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 4377, "playtime_last_two_weeks": 0, "playtime_at_review": 1473, "last_played": 1712187413}, "language": "english", "review": "People will say you can easily complete the entire story of this game in about 8 hours and that is true. And you know, the story is fine. It's not bad. But listen. Listen to me. Look me in the eyes. This game is not about that. This game, is about taking your little magic airship building gun, and building little rooms and platforms with it. and then deleting them and making new ones because you got a new balloon on your airship and it totally threw everything off but now you can make more rooms anyway. and it is about putting up little airship posters in your little airship bedroom. And then going outside and shooting one hundred million stupid plastic balls out of the stupid sky because you built too many stupid railings and now you're out of synthetics. Anyway. That is the purpose of this game, and it fulfills that purpose, and does it well. 100/10, would shoot plastic balls out of the sky again.\n\nThat said, there ARE some things that could be improved. First of all, I could use more airship building options but that almost goes without saying. In particular double doors and railing gates would be good (unless they already exist and I just haven't found the blueprints yet, in which case, carry on). Also, some sort of trash can or at least the ability to drop items in the world would be extremely welcome. Inventory management in this game is, in my opinion, overly onerous. Some easy tweaks would improve this, and I hope to see such tweaks in future updates. Other quality of life improvements I'd like to see would be the ability to queue multiple crafts, and some way of tracking which locations on the map you have already visited. There are also some graphical and performance issues (in particular, the [spoiler]elevator to the underdust[/spoiler] stutters noticeably every time I use it, and sometimes when using the deck cannon my character's clothes wander off to the side).\n\nFinally. Combat. Many people have requested this and I see that it is in the roadmap (er, flightmap). Respectfully... bullshit. Every game has combat. You can play other games if you want to fight monsters. Almost literally any other game that exists, actually. This game doesn't need combat, I don't need it, I don't want it, please don't add any type of mandatory combat to this game. Thanks.\n\nSUMMARY OF REVIEW: if you like base building, play this game. if you like to fight monsters, go away.", "timestamp_created": 1687837692, "timestamp_updated": 1687837692, "voted_up": true, "votes_up": 162, "votes_funny": 22, "weighted_vote_score": "0.900980532169342041", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140509408": {"recommendationid": "140509408", "author": {"steamid": "76561198036219824", "num_games_owned": 308, "num_reviews": 29, "playtime_forever": 6163, "playtime_last_two_weeks": 296, "playtime_at_review": 1623, "last_played": 1713027295}, "language": "english", "review": "(Kickstarter backer, hence why I have more hours played than the game has been in EA at the time of writing)\n\nThe closest game to this in mechanics is Raft.  You expand a mobile base that you use to visit towers to scavenge for supplies, while below you a toxic dust storm rages across the globe endlessly.  No combat to speak fo yet, biggest dangers are falling to your death, food, water, lighting from storms, and drunk piloting.\n\nAs it just entered EA, don't expect the full story yet, it's bare bones currently, and only has the first significant story location.  Currently things are more focused on mechanics.\n\nIf you can't understand the concept of EA, wait until full release.  If you can, and you like these sorts of games, and want to help contribute via feedback and suggestions, grab the game.", "timestamp_created": 1687456864, "timestamp_updated": 1687456864, "voted_up": true, "votes_up": 187, "votes_funny": 5, "weighted_vote_score": "0.898719668388366699", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141752738": {"recommendationid": "141752738", "author": {"steamid": "76561198278904341", "num_games_owned": 934, "num_reviews": 82, "playtime_forever": 1952, "playtime_last_two_weeks": 1076, "playtime_at_review": 875, "last_played": 1713790039}, "language": "english", "review": "I like this, but... I've run out of stuff to do. And that happened pretty quickly. And I played about 6 more hours after I ran out of stuff to do. I'm wondering if it's a little too early for early access; it's not that the story reaches a dead end, but that up to the point where it does, you've been guided toward everything that you need and can do. And so the remainder of the time is either replaying at harder difficulties, or trying to box off everything you can that's in the game so far. If you replay, then you have to do those story pieces again, because all the essential equipment is locked behind the story/tutorial experience.\n\nI'm wondering long-term, what legs does this game have as a Subnautica or NMS style experience when there's very few options to go down and no options to go up. To expand here would be a major content update - like, major - and it's just that the whole game universe is limited without those major content updates. I'm talking more than just Underdust here: explorable buildings, to be able to get out and wander across those mountains, set up bases, build, etc. To be Subnautica requires being able to build those kinds of experiences in a different world where a lot of stuff won't work; to be NMS requires something else entirely.\n\nThat's the kind of experience that has longevity, but I don't know what's really planned.\n\nBut it's fun. It's not expensive, but to justify the full price it'll need a lot more. I'm not holding my breath for the updates, because there's a lot of work to go into this. It's nice that it's a big team, and it's a great technical experience anyway, but the question is whether or not they have the imagination and ability to follow through with it to turn that solid gameplay core into something great.", "timestamp_created": 1688989498, "timestamp_updated": 1688989498, "voted_up": true, "votes_up": 134, "votes_funny": 1, "weighted_vote_score": "0.896085739135742188", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "150378934": {"recommendationid": "150378934", "author": {"steamid": "76561197970416376", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 1160, "playtime_last_two_weeks": 0, "playtime_at_review": 1149, "last_played": 1703614867}, "language": "english", "review": "Positives:\n-Graphics: GOOD\n-Gameplay:GOOD, survival, nice interface, fairly immersive.\n-The single ground location where you use an elevator to reach the earth added a nice change. Definitely needs more of these types of locations.\n-The story needs expanding, I played solidly for a few weeks until reaching the end of the work in progress game.\n-The \"pet\" you eventually obtain doesn't really do anything apart from sit on a pillow; some interaction/following around the airship would be nice\n-Devs listen to feedback- I asked for in game difficulty amendment, it was added within a week\n\nAnnoyances:\n-Feeding the player like he has a tapeworm. Having to eat and drink every 10 minutes or die, not lose health, DIE.\n-Lack of NPCs, lack of significant monsters beyond overgrown centipedes.\n-Similarity of landing locations, repeated buildings. They need to be way more varied.\n-lack of variety of caught food\n-Inability to really land on the ground, even on the peaks of mountains, lack of clipping (no clipping) in some locations like that feels buggy.\n-as above- the story as it stands is good but not long enough, once you get the science research station and land on the overgrown greenhouses using an immunity booster, there's not much else to do.\n\n\nOverall loads of potential, and it was entertaining as far as it goes, but I would like to see perhaps a)running out of food/water slowly drains health, doesn't equal instant death b) way more variety of ground locations to land on c)more variety of enemies and monsters d)NPCs e)further expanded storyline\n", "timestamp_created": 1700336632, "timestamp_updated": 1703280866, "voted_up": true, "votes_up": 79, "votes_funny": 2, "weighted_vote_score": "0.877828240394592285", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "146609111": {"recommendationid": "146609111", "author": {"steamid": "76561198149866475", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 25278, "playtime_last_two_weeks": 30, "playtime_at_review": 14846, "last_played": 1712610427}, "language": "english", "review": "Since before the demo, I been part of the discord group. My personal experience is that these devs take their game very serious. They listen to their community, in all forums\n\nFor the game itself. I think it's a bit of other survival games. Collecting is similar as in raft, where building hints more towards subnautica. The graphics and story, is completely Forever Skies.\n\nYou're a scientist on an apocalyptic earth, trying to find a cure for a disease. No humans are left at that earth, it's just you(and somewhere down the line of development, your friends) and just a not so friendly earth. \n\nIt has elements of multiple stuff. There is lore, there are building elements, of course the usual survival and exploration. \n\nI'm looking forward to the content these devs will bring in the future", "timestamp_created": 1695153144, "timestamp_updated": 1695153144, "voted_up": true, "votes_up": 133, "votes_funny": 0, "weighted_vote_score": "0.870193541049957275", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148325071": {"recommendationid": "148325071", "author": {"steamid": "76561198091035382", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 25864, "playtime_last_two_weeks": 8, "playtime_at_review": 608, "last_played": 1713651327}, "language": "english", "review": "Raft and Fallout had a bouncing baby blimp. The little guy is not quite ready for the big leagues, but if the folks who brought it into the world (Far From Home) continue feeding it regular updates, I suspect it will grow up to be big and strong. It's got all the makings of a future pro.  \n\nIf you like watching games grow up, this is one to keep your eyes on.", "timestamp_created": 1697445778, "timestamp_updated": 1699139839, "voted_up": true, "votes_up": 138, "votes_funny": 13, "weighted_vote_score": "0.865868031978607178", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140510823": {"recommendationid": "140510823", "author": {"steamid": "76561198007944105", "num_games_owned": 782, "num_reviews": 50, "playtime_forever": 142, "playtime_last_two_weeks": 0, "playtime_at_review": 30, "last_played": 1708598599}, "language": "english", "review": "Raft meet Subnautica in the post apocalyptic skies of earth.", "timestamp_created": 1687458505, "timestamp_updated": 1687458505, "voted_up": true, "votes_up": 181, "votes_funny": 7, "weighted_vote_score": "0.86454319953918457", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141146833": {"recommendationid": "141146833", "author": {"steamid": "76561198004816145", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 857, "playtime_last_two_weeks": 0, "playtime_at_review": 857, "last_played": 1688314714}, "language": "english", "review": "A mixture of Raft and Subnautica, with a story.\n\nYou build an airship that you can expand, upgrade and then also steer from one location to the other. The game starts with a tutorial where you build your basic airship frame with a cockpit and one room and you go from there. You visit several different locations, that are somewhat differentiated in tiers to gather resources, find blue prints for building, and advance the story.\n\nPros:\n\nThe overall world design is cool, and the graphics look amazing. You do really feel that the world below is toxic and you are barely surviving by hoping from one location to the other. Building is nice, the game gives you a lot of tools to build your airship, as well as a good set of decorative items to place to really make it feel homely.\n\nThe survival aspects are there, but not annoying. Raft has this problem where you are surviving constantly, meaning the game itself is constant stress because either the shark messes with you, seagulls annoy you, or you are constantly either thirsty or starving. In Forever Skies it is more balanced, and by advancing the game you can make things that make your life surviving easier. As it should be.\n\nThere aren't a lot of threats, and imho that is a good thing. Right now it is the perfect balance of surviving while not being constantly pestered by all sorts of things that are just annoying to deal with.\n\nCons:\n\nThe story is short. I moved through the story in one long evening (5 hours), and then I spend about ten more hours to get all the blueprints, and build my airship to maximum cozyness. The game needs more POIs to find, but also a longer story, and perhaps more reasons to descend beneath the toxic cloud.\n\nA bit of of jank. Just a tiny bit though. Movement on foot and especially jumping is a tad bit janky, but that its not that bad. I had worse.\n\nIt also does not seem very optimised, as my graphics card was on full blast in 1440p locked at 60pfs. But I had neither any stutters nor FPS drops.\n\nImprovements:\n\nLateral movement for the airship. You have yaw, up and down, forward and backward; but sadly no straight left to right (lateral) movement. Would be cool to have.\n\nMore things to do place inside the airship, as 3x6 airship was more than enough for me to have all the storage I ever needed, plus all production. I have seen people build these huge airships, but there is sadly no point yet. Perhaps indoor farms?\n\nA way to make food last longer. I know the freezer exists, but it would be nice to have a can \"presser\" where you press cooked food into a tin can using metal.\n\nOn board water storage. Give us these huge blue barrels that contain sap so we can store fresh water on the ship. Or better yet, a water cooler.\n\nCoop: so I can throw my friend off my airship into the toxic death below.\n", "timestamp_created": 1688315830, "timestamp_updated": 1688315830, "voted_up": true, "votes_up": 57, "votes_funny": 1, "weighted_vote_score": "0.857918381690979004", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "154109048": {"recommendationid": "154109048", "author": {"steamid": "76561198882401336", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 2109, "playtime_last_two_weeks": 0, "playtime_at_review": 1176, "last_played": 1703473071}, "language": "english", "review": "This game is fantastic. Similar to Subnautica, the landscape is visually stunning and the entire survival fundamentals function well for the genre. Forever Skies displays a lot of promise for being an Early Access title. I've really enjoyed my playthrough, but I've encountered some challenges that can make the game difficult at times:\n\n1. There is no auto-save function. I've encountered a few game crashes from frame drops mainly when taking the elevator. It's sad when I lose 10-15 minutes of progress without an auto-save function because i forgot to save manually. \n\n2. The ability to filter Map icons. Unless you plan to just pick a direction and go with the flow, the entire circumference of the map is littered with overlapping icons. \n\n3. Organic replenishment. This is more of a question as I haven't really been paying close attention to whether a plant or nut regrows after harvest. I have returned to previously visited Greenhouse rigs and haven't found any new growth, but it may have been too soon. If this feature is not implemented, I'd love for the opportunities to grow our own from seeds in planting beds. \n\n4. Linear gameplay. As the player unlocks and upgrades their ship, more towers become available to the player, but most of these upgrades and unlocks are hidden within the main story quest. This is fine, but I'd prefer to take my own path. I'm at a point in the main story where my progression is halted until I find some more honey...so now I have to go on another journey to explore new towers I haven't already visited. \n\n5. Asset replication. I think I've explored the same metal box a few dozen times. The same two lockers on the ground laying on their sides. This isn't really a challenge, but more a complaint. The only reason to explore these areas is to take advantage of the number of crafted resources you can find, i.e. circuit boards/polymer. \n\n6. Player/Environment Interaction. As I continue to build/expand my ship, both horizontally and vertically, I've noticed the increasing challenge to maneuver my vehicle for rig docking as even the smallest branch sticking out from a greenhouse is enough to bring me to a complete halt. Most rigs have between 1-3 circular docking areas large enough to fit a moderately sized ship and hovering with a docking ramp can only get you so close. It would be nice to craft a smaller vehicle for better maneuverability in tight spaces. \n\n7. Gameplay loop. Others have mentioned the monotonous loop and it's true to some degree. Each type of tower rig contains the same resources, which is good if you're targeting a particular resource, but ultimately you're just flying from rig to rig chasing resources. Occasionally you do find a blueprint or poster, but I always strip every rig down to the bare bones and walk away with another 100 glass I probably don't need. This leads me to the final challenge. \n\n8. Early game hoarding is discouraged. Storage boxes have 9 spaces and resources can stack to 1x, 10x, 25x, and 100x, depending on the resource. I'm assuming I'll be able to upgrade the boxes later, but it's hard to hoard anything when I can only stack rarer resources to 10. Why do plants have their own inventory slot? This is a problem when you introduce a perishable timer on every organic matter. Until I found the cold storage blueprints I was unable to keep anything organic for fear of spoiling. \n\nChallenges aside, Forever Skies is extremely fun and I plan to visit most if not every tower rig. The seasonal event adds a nice touch as well. Looking forward to the next development.\n\n", "timestamp_created": 1703222475, "timestamp_updated": 1703474486, "voted_up": true, "votes_up": 68, "votes_funny": 1, "weighted_vote_score": "0.857137024402618408", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140886531": {"recommendationid": "140886531", "author": {"steamid": "76561198015258616", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 903, "playtime_last_two_weeks": 0, "playtime_at_review": 699, "last_played": 1708214766}, "language": "english", "review": "Some say this has a \"raft\" feel to it, but I have not played raft, however subnautica is a great analogue to compare from, that started with enough content to keep you busy for a while then as content dropped, It got even better - Forever Skies gives me the same feeling I got from subnautica - I cannot wait for more updates and as the game stands, yes far far from complete but still enough to whet the appetite. Should you get it? I dont know but i am a 53 yr old gamer loving it and us old buggers hate everything.", "timestamp_created": 1688014166, "timestamp_updated": 1688014166, "voted_up": true, "votes_up": 56, "votes_funny": 5, "weighted_vote_score": "0.844758331775665283", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "144166925": {"recommendationid": "144166925", "author": {"steamid": "76561198341599439", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 733, "playtime_last_two_weeks": 0, "playtime_at_review": 733, "last_played": 1690831641}, "language": "english", "review": "I really enjoyed the Beta/Demo. Nice visuals and good pace if you are not wanting anything too hectic.\n\nA great start, my only concern is the road-map shown. It seems to focus on things like interactive pets and multiplayer. The story is a great start but only has 1/20th of the content you would expect from a finished game of this cost and calibre. \n\nThere is about 2 hours of content currently, you take a bit longer the first time you play due to uncertainty and slow air travel. Slow travel is actually enjoyable but cannot be considered content for the game surely. \n\nDevs' please continue to work on the story and narrative before you do anything else. Apart form combat, the story seems to end as combat has not been done yet. \n\nLooking forward to seeing a full story/campaign (10x-20x the content and duration of the current beta).\n\n", "timestamp_created": 1692011621, "timestamp_updated": 1692011621, "voted_up": true, "votes_up": 58, "votes_funny": 0, "weighted_vote_score": "0.840761423110961914", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140608948": {"recommendationid": "140608948", "author": {"steamid": "76561198007216075", "num_games_owned": 0, "num_reviews": 65, "playtime_forever": 492, "playtime_last_two_weeks": 0, "playtime_at_review": 492, "last_played": 1687603894}, "language": "english", "review": "This is a recommendation, BUT, only barely.\n\nIt took me around 4 hours (I restarted thrice, due to various reasons) to reach the \"Hey, this is it for the current version! But dont worry more will come!\" bit.\n\nWhats there is decent, but not enough to \"make your own fun\" as it were. Once you've seen the different outposts, you've seen them all, despite some having different layouts.\n\nHonestly, its a decent game, not great, but not bad either. Above average, 7/10.\n\nIf you have enough money to spend 23-29 euro without having to save up first, then I'd say go for it, it'll be a short session, but you'll likely enjoy whats there. If you dont have that kind of money to spend, then dont buy this game, there wont be enough gameplay to make up for the price at this point in time.", "timestamp_created": 1687604793, "timestamp_updated": 1687604793, "voted_up": true, "votes_up": 62, "votes_funny": 0, "weighted_vote_score": "0.829905152320861816", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "143093141": {"recommendationid": "143093141", "author": {"steamid": "76561198072453334", "num_games_owned": 0, "num_reviews": 30, "playtime_forever": 1679, "playtime_last_two_weeks": 0, "playtime_at_review": 742, "last_played": 1690935278}, "language": "english", "review": "Wait until it's out of early access-you'll hit the end of content point and be sad otherwise. Also, $30 is questionable for the amount of content atm, should probably be $15-20..?", "timestamp_created": 1690734184, "timestamp_updated": 1690734805, "voted_up": true, "votes_up": 100, "votes_funny": 0, "weighted_vote_score": "0.827215433120727539", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "152616599": {"recommendationid": "152616599", "author": {"steamid": "76561197972308194", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 2782, "playtime_last_two_weeks": 0, "playtime_at_review": 2693, "last_played": 1712265738}, "language": "english", "review": "So 45 hours played...and it's a hard one to review.\n\nVisually stunning, the concept and artwork is absolutely amazing in places and feels right. The level of detail and time and effort they have put in is phenomenal!\n\nBut that for me is pretty much where it stops...\nFly to next tower, collect stuff, build more stuff, have a drink and food, sleep maybe....\nFly to next tower, collect stuff, build more stuff, have a drink and food, sleep maybe....\nFly to next tower, collect stuff, build more stuff, have a drink and food, sleep maybe....\nFly to next tower, collect stuff, build more stuff, have a drink and food, sleep maybe....\nGet my point? \nThere is little to the story right now, except we have viruses and you play a mini-game if you will to find a cure that you then...fly to a tower to collect the stuff to make an antidote and then...fly to- hell you know what's coming next.\n\nIf you want to build an airship your way, then that's what the game is about so far. I was hoping to see more and frankly I'm just disappointed. The whole game is supposed to be about survival and frankly its just about building an airship that doesn't need building, you can complete the story and have everything you need without really having to try, even on hard/ hardcore. Food, water and resources that are so scarce, you trip over them.\n\nFrankly, it's a total let down as there was so much potential in this and it's just pretty. If you actually watch the trailers etc you will notice that it all looks the same, there is very little in the variables department, with all the towers etc being stamped out of a mould, of about 4 or 5. Each one slightly different but not so as you would notice.\n\nIt's just a no from me at the moment. After 50 hours i can say i'm bored and there isn't much coming in the pipeline except more of the same.", "timestamp_created": 1701390769, "timestamp_updated": 1701390769, "voted_up": false, "votes_up": 128, "votes_funny": 8, "weighted_vote_score": "0.819588840007781982", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "153251291": {"recommendationid": "153251291", "author": {"steamid": "76561197961395165", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 663, "playtime_last_two_weeks": 0, "playtime_at_review": 663, "last_played": 1702163643}, "language": "english", "review": "Very likeable cross between Raft and Subnautica. Only around 10 hours of gameplay available at this stage in early access, so perhaps not worth the full price yet. But I am looking forward to further updates.", "timestamp_created": 1702163987, "timestamp_updated": 1702163987, "voted_up": true, "votes_up": 63, "votes_funny": 2, "weighted_vote_score": "0.812106430530548096", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140571557": {"recommendationid": "140571557", "author": {"steamid": "76561198019658590", "num_games_owned": 946, "num_reviews": 25, "playtime_forever": 539, "playtime_last_two_weeks": 0, "playtime_at_review": 539, "last_played": 1687546134}, "language": "english", "review": "Begrudgingly I'll give this a thumbs up. Shallow feels too harsh for what has clearly been made with care but this game just doesn't have a complete enough core gameplay loop. Actually there isn't really even much of a loop right now. It's almost linear aside from food and water.\n\nIn my 8 hours I completed the currently available story only stopping at about 5 or 6 towers in total and 1 of those was purely because it was in between my 2 story locations. Just those few stops gave me nearly all the resources i needed to complete the story and upgrade my ship beyond its requirements. I do say nearly however because i still needed to shoot down an absolute TON of synthetics which drift by and maybe a few dozen metal as well.\n\nMaybe future content will flesh that all out... \n\nThe one thing i feel like is missing from the game though is choice/options. I was just moving forward constantly without ever needing to consider my path. Resources can all be crafted up a tech from a few base components such as Metal, Synthetics, Copper, Plant Resin, and Crystals. \n\nMetal and Synthetics are literally flying around you ship constantly so they are abundant but time consuming. The other three aren't used enough to necessitate hitting more than 2 windfarms (copper) and just 1 greenhouse tower.\n\nI'll leave crystal a mystery but suffice to say I have far more than I needed after finding it as well.\n\nI'd love to see some side-grade type recipes or even bulk crafting recipes would be nice. \n\nPlaying on normal i died 3 times but otherwise never suffered and real difficulty. \n\n1st. Deleting a room i was standing in while i wasn't paying full attention to my aim.\n2nd. suffocating upon discovering that while you can craft additional oxygen tanks for some reason, they do not provide any additional oxygen...\n3rd. confirming the reason for the 2nd death while trying to determine if additional oxygen tanks added efficiency. Spoiler: they do not. don't bother crafting anything other than the upgraded one i guess.\n\nanyways. its an alright game. no buyers remorse but I was definitely hoping for more that what i got. I don't remember how big subnautica's world was when it first hit early access but i feel like it was much deeper than this currently is. Heh, a pun.", "timestamp_created": 1687548510, "timestamp_updated": 1687548510, "voted_up": true, "votes_up": 42, "votes_funny": 1, "weighted_vote_score": "0.80259174108505249", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140507026": {"recommendationid": "140507026", "author": {"steamid": "76561198030741989", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1538, "playtime_last_two_weeks": 0, "playtime_at_review": 128, "last_played": 1689603553}, "language": "english", "review": "Play tested the game during multiple closed sessions and watched it grow into something marvelous.  The developers interact and engage with discord community when compared to others who seem to ignore.  If you are a fan of Subnautica games you will enjoy this game.  Forever Skies is a great survivor game and I highly recommend!!", "timestamp_created": 1687454069, "timestamp_updated": 1687454069, "voted_up": true, "votes_up": 56, "votes_funny": 0, "weighted_vote_score": "0.779133796691894531", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141222835": {"recommendationid": "141222835", "author": {"steamid": "76561197985734681", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 198, "playtime_last_two_weeks": 0, "playtime_at_review": 196, "last_played": 1697476086}, "language": "english", "review": "A Subnautica in the sky. You would not know its different developers. Credit to them, its very well made I'm really enjoying it so far", "timestamp_created": 1688399129, "timestamp_updated": 1688399129, "voted_up": true, "votes_up": 31, "votes_funny": 0, "weighted_vote_score": "0.768561959266662598", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "153968352": {"recommendationid": "153968352", "author": {"steamid": "76561198000143202", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 1995, "playtime_last_two_weeks": 0, "playtime_at_review": 1995, "last_played": 1703038414}, "language": "english", "review": "Forever Skies is a prime example of a small-studio early-access game done right. It's a beautiful title that explores some genuinely new ideas and has wonderful game-design sensibilities.\n\nAs of writing this review, I've played it fully through twice now, at different stages of EA, The first playthrough was admittedly a bit rougher around the edges, but it felt like a fair amount of content, and a ton of potential. I had a blast with it, right up till the moment the story ended.\n\nI've come back after a while (not really sure when I bought it), and noticed there was some new content. So I played it from the beginning again. I'm glad I did - there were a lot of mechanical (and some story) changes that I admire. This is a team that's unafraid of revisiting their design choices and exploring new paths. There is also another \"chapter\" to the story, which I find progressively more enticing the more I explore the world.\n\nIt currently struggles a bit with performance issues. This is understandable, as the team is focusing on design and content before optimization. So it's poorly optimized at the moment. I am able to enjoy it fully, but I have fairly decent hardware. If you're threading the minimum specs, know that there will probably be some extra turbulence on your flights. That said, I've experienced virtually no situations (in the story thus far) where good framerates mattered for gameplay. It's a pretty chill experience.\n\nThis gives me major Subnautica vibes (though replace thalassophobia with acrophobia). The comparison doesn't just end there though - they are both fairly chill in terms of survival elements. Both deliver their stories through wonderfully cryptic data logs and such, Both have an interesting \"alien\" world to explore. I suppose one big difference is there's nowhere near as much wildlife in Forever Skies, But it's got it's own unique charms instead.\n\nI highly recommend!\n\nEdit: I rarely review games. When I do, it's usually because I'm unusually impressed with a title. So a big part of this review is also directed at the devs, in gratitude for their excellent work!", "timestamp_created": 1703039905, "timestamp_updated": 1703039967, "voted_up": true, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.76703113317489624", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "154874212": {"recommendationid": "154874212", "author": {"steamid": "76561198034421852", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 362, "playtime_last_two_weeks": 0, "playtime_at_review": 362, "last_played": 1703919726}, "language": "english", "review": "Great concept, awesome graphics, an no major bugs. Its not ready to be played yet though. If you want to support the developers of a game with a lot of potential, go ahead and buy this early access. If you want to actually play a game then pass for now.\n\nThe game play loop is just moving from tower to tower in your airship collecting stuff. There's no depth yet, but I see the bones of greatness. Hopefully the current hassle of inventory management, movement restrictions, and quick depletion of resources aren't here to stay. If that's the final direction then I probably won't make it very far when the game is complete.", "timestamp_created": 1704005642, "timestamp_updated": 1704005642, "voted_up": false, "votes_up": 57, "votes_funny": 4, "weighted_vote_score": "0.765555024147033691", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "150088182": {"recommendationid": "150088182", "author": {"steamid": "76561198030205236", "num_games_owned": 0, "num_reviews": 27, "playtime_forever": 4536, "playtime_last_two_weeks": 0, "playtime_at_review": 3297, "last_played": 1700659187}, "language": "english", "review": "S K Y N A U T I C A", "timestamp_created": 1699919147, "timestamp_updated": 1699919147, "voted_up": true, "votes_up": 41, "votes_funny": 8, "weighted_vote_score": "0.751739144325256348", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "142373723": {"recommendationid": "142373723", "author": {"steamid": "76561198323223189", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 2370, "playtime_last_two_weeks": 1191, "playtime_at_review": 730, "last_played": 1713799588}, "language": "english", "review": "This game is early access. Every negative review I've seen has been a complaint that the game is not finished. If you are looking for a complete game, don't buy anything early access.\n\nVery fun game, looks great, feels great, some solid mechanics, creative (though very incomplete) background lore. Plays a lot like Subnautica. Love this game, but again, not at all complete, quite far from it, but has potential and the devs are actively adding in community requested features.", "timestamp_created": 1689725124, "timestamp_updated": 1689725124, "voted_up": true, "votes_up": 63, "votes_funny": 2, "weighted_vote_score": "0.750728726387023926", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140507256": {"recommendationid": "140507256", "author": {"steamid": "76561199327569262", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 490, "playtime_last_two_weeks": 0, "playtime_at_review": 367, "last_played": 1687527188}, "language": "english", "review": "Pertty good so far!\n\nThe available \"story\" is short for now, but it will be extended in the future. After 4-5 hrs of gameplay it is done and you are left with the open world. So, if you are not really into base building and survival, and come for the story I recommend you to wait.\n\nBase building - top, a lot of customization opportunities and very stylish\n\nSurvival - even  \"Normal difficulty\" is demanding. Even I do not eat and drink so much irl. If you are more into exploration and base building choose \"easy\", you will not regret\n\nBugs - a lot of textural bugs, no critical so far\n\nAll in all - great potential, still a lot to be done, I would say still pretty empty compared to state-of-the-art survival games. If you do not fall in love with demo - wait till full release, if you do - go ahead and support the developers!", "timestamp_created": 1687454353, "timestamp_updated": 1687454353, "voted_up": true, "votes_up": 35, "votes_funny": 1, "weighted_vote_score": "0.749928414821624756", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "144918165": {"recommendationid": "144918165", "author": {"steamid": "76561198041396648", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 410, "playtime_last_two_weeks": 0, "playtime_at_review": 410, "last_played": 1691891443}, "language": "english", "review": "Save yourself the money and buy something else this is literally just a glorified demo, it even ends like a demo. I waited 2 months to leave this review because I wanted to give the developers a chance to update the game,well today was the final straw. the magically update today? NEW POSTERS!!!! you cant farm on your ship but you can sure pick a great poster to hang on the wall. The game has about 5-6 hours of game-play even shorter if you just rush through it. It ends right as you meet your first enemy. I understand early access game take time but don't release a game unless you have one major update in the pipeline. The developers themselves have said updates will come every 4-6 months which would be fine with more game in the beginning but is just ridiculous at this price. This game should be a free demo with the content it has currently. save yourself the money because at this rate I'm honestly thinking this is more a scam than a real game. (i'll update my review if this ever changes but fat chance that will ever happen, at least not for 3-4 years at the rate this game is going.\n\nEDIT: just wanted to give a 5 month update... still nothing has been added other than POSTERS, ONE LOCATION (as of today) and other random useless shit. The Dev's comment on my review is completely 100% a Lie. At this rate this game is going to be in early access longer than 7 Days To Die. THIS GAME IS A DEMO AT BEST DON'T WASTE YOUR MONEY. If you'd like to know how jaded i am that i spent 30 bucks on a demo and almost 6 months later nothing has been added to the game of any value id rather put time into REDFALL which has a player count of less than 5 people daily on steam.", "timestamp_created": 1692883045, "timestamp_updated": 1697483030, "voted_up": false, "votes_up": 227, "votes_funny": 10, "weighted_vote_score": "0.743970036506652832", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1692898753, "developer_response": "Hi jckooper,\n\nI understand your frustration with the very small content patch we made live today. This text is taken from the Steam post we published half an hour ago that explains why it was so small:\n\n\"For those with a keen eye, we did a very small patch to the game. This was originally meant to be a standard patch with a few quality-of-life updates, bug fixes, and some additional in-game posters added-in to wrap it all up.\n\nHowever, our eagle-eyed QA team caught a few instances of something that might impact a few players with more advanced airship builds. So it was decided to run more tests before committing the fixes, but because we already had these posters ready, we thought we might as well put them into the game. It’s a quick and easy thing to add so no point waiting.\"\n\nThe QOL changes mentioned are coming in the next few weeks, but we saw no reason to keep players waiting as the posters were ready.\n\nIn the post I mentioned, we have also left sneak peeks of our next major update (expected soon). Please consider taking 5 minutes to have a look -  https://store.steampowered.com/news/app/1641960/view/3669924544085165512?l=english\n\nAll the content in our flight map WILL be delivered to players. We're prioritising what goes into patches, hotfixes and updates based on your feedback.\n\nThanks!\n- Greg (FFH)"}, "140712454": {"recommendationid": "140712454", "author": {"steamid": "76561198331368439", "num_games_owned": 119, "num_reviews": 1, "playtime_forever": 3227, "playtime_last_two_weeks": 5, "playtime_at_review": 1119, "last_played": 1713568546}, "language": "english", "review": "Great concept, amazing graphics. I need more of this.", "timestamp_created": 1687747834, "timestamp_updated": 1687747834, "voted_up": true, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.73866581916809082", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "142588151": {"recommendationid": "142588151", "author": {"steamid": "76561198215068573", "num_games_owned": 78, "num_reviews": 18, "playtime_forever": 5236, "playtime_last_two_weeks": 0, "playtime_at_review": 2748, "last_played": 1690345994}, "language": "english", "review": "[h1]BIG recommend from me - I'm absolutely LOVING Forever Skies!![/h1]\n\nYou'll see some reviews here saying Forever Skies \"lacks content\" or \"isn't done enough,\" but don't let those deter you like I almost did.  All I have to say is that those people either aren't used to indie games, or they rushed through every quest marker as fast as possible while completely ignoring the exploration and base-building in this game.  Both elements are a complete joy and though I'm excited for more content in the future, it's [b]100% playable as-is.[/b]\n\n[hr][/hr]\n\nHaving said that... there are [i]a few[/i] issues that could use a little refinement/QOL improvements that would make this great game even better.  The devs addressed most of my biggest issues (storage space and stacking, the \"synthetic grind\" killing my soul, and fabrication costs), but here are a few more things that I feel would really improve the experience for players:\n\n[b][u]1.  Storms do WAY too much damage [/u][/b]\n\nThis is my biggest gripe with the game, hands down.  It's incredibly frustrating, and could be the difference in me putting a couple hundred hours into this game or quitting in frustration in another day or three.  \n\n- During every storm, the lighting completely WRECKS my entire airship, including my high-cost equipment (indoors and out) as well as the airship itself (indoors and out).  \n\n- This is especially true for players like me who geek out for hours and hours on big builds, and therefore have to stay parked for a long time in resource-rich but dangerous areas.\n\n- The biggest issue is that there is no safe place to \"park\" a while for those who want to [i]seriously[/i] build or overhaul their airship without having to:\n\na. stop what you're doing and make 875446889743 repair patches every ten minutes (using half the resources you just gathered and needed for your build) \n\nor \n\nb. make a mad dash to the console to fly away from the storm (which is impossible sometimes mid-build/upgrade since you had to pick it up for said build/upgrade).  \n\n- Adding a spot for the players who are build-intensive at resource-heavy locations (or even consistently safe/calm areas in the sky to hang out while we build without having everything we just made undone by lighting strikes) would be a really enormous QOL improvement.  \n\n- An option to turn OFF storm damage for those who [i]only[/i] want to build would be even better, or even a \"creative\" mode with no damage and no huger/thirst/health concerns :)\n\n[b][u]2.  Plant spoilage rate is FAR too fast (and the cooker/fabricator speeds are far too slow). [/u][/b]\n\nConsidering how many plants can be collected at each greenhouse location and the limited uses for them, the rate that the plants spoil at means that over 90% of the plants you collect while exploring expire while you're still crafting/cooking them unless you return to your airship every time you pick up 2-3 plants (which is incredibly tedious, no one wants to do that). This has severely hindered my desire to even visit the greenhouses - I would honestly rather catch 1000 dust lettuce/dust moths with the crappy lure than go through all the steps required to craft the advanced or unique ones just to have the plants spoil before I can even get the lures fabricated by the time I get back to my airship.\n\n[i]*Note: I do realize there is a freezer in the game that is supposed to prevent this from happening, but in 45 hours I have yet to come across it.  Having the freezer (also other tech, see below) be accessible much earlier or in a more obvious location might resolve this issue and incentivize players to explore more greenhouses and/or use more plants in crafting.[/i]\n\n* Edit to add:  I found the freezer.  It does nothing at all, and everything still spoils just as fast. :(  \n\n[b][u]3.  The location of certain tech isn't clearly defined or even hinted at, making important or desirable tools pretty hard to find. [/u][/b]\n\nI had no idea where to even begin to find the workstation (windmill?  greenhouse?  underdust?) However, blueprints that require the workstation begin showing up in your blueprints menu from nearly the first radio tower or two.  \n\n- Giving players some sort of hint on how to find the tech they want or need, or hiding the blueprints/uses/etc for that tech until you obtain it, would avoid some confusion and frustration.\n\n[b][u]4.  The UI text size cannot be adjusted at all, is next-to-impossible to read in several menus, and the text/background color schemes on nearly all of the UI interfaces are VERY hard to see. [/u][/b]\n\nThis one is kinda important, especially for visually impaired people (I am not, but it's still very very hard for me to see the UI text!) \n\n- Playing with a PC connected to a television greatly exacerbates this issue.  I often have NO IDEA what the main UI says since the sky/background/etc is often the exact same shade of blue as the text for basic in-game messages (i.e., \"food has cooked,\" or \"lure has caught a thing,\" etc).  \n\nWorse yet, the \"[i][b]extremely light green text on slightly lighter green background[/b][/i] color scheme in the menu tab that tells you about the locations and the resources you find at them is basically unreadable (for anyone on any screen). \n\n- Adding some accessibility options that enlarge text size/change text color for all UIs in the game would be wonderful!!\n\n- Even just making the text in all menus and UIs a bit bigger/darker would go a long way, and is likely a pretty easy fix until accessibility options can be optimized :)\n\n[b][u]5.  There is no option for a glass door. [/u][/b]\n\nThis is just my OCD, but with an entirely glass airship that looks AMAZING in all glass, the metal doors stick out like a sore thumb (and are kinda ugly, sorry!)\n\n- While we're on doors, a wider or double door option would also be killer!  The amount of things we have to put on catwalks outside is kind of a lot: water collection units, insect catchers, extractors up to and including the extra-enormous but [b][i][u]COMPLETELY FANTASTIC IN EVERY SINGLE OTHER WAY[/u][/i][/b] auto extractor (thank you!!!!!!!), etc - means I often run into the doors/equipment or get stuck outside on/between/behind the equipment when trying to enter my airship.\n\n- Side note that the railings for the catwalks are too tall for the extractors and too tall for the player character to jump over ;)\n\n[b][u]6.  Thank you for the increased inventory space OMG what a huge improvement!!!  But hear me out... INVENTORY FUNCTIONS THOUGH!!!! [/u][/b]\n\n- I would KILL for an auto-sort function, a hot-deposit function would be awesome, and a build from storage function is essential for build geeks ;)\n\n[b][u]7.  The story is pretty sparse (but this is to be expected in EA). [/u][/b]\n\n- I don't play survivalcraft/base building games specifically for the story per se (and I assume more story and lore are in the works anyway) but this world you've created is SO COOL!  \n\nI want to learn more about it... \n\nOverall, I think great story with a lot of surprises, reveals, or twists (etc) would hook me [i]even more[/i] into this already great game.  \n\n- Adding some element of secrets/hidden locations/mysteries for the extra-curious, extra-observant, or extra-diligent to find [i]might[/i] mean I never do anything other than play Forever Skies again XD\n\n[h1]Thank you so very very much for all your hard work, you've made a wonderful game and I am excited to see more added to it!![/h1]\n\n(edit: format errors)", "timestamp_created": 1690038059, "timestamp_updated": 1691890271, "voted_up": true, "votes_up": 27, "votes_funny": 0, "weighted_vote_score": "0.732310950756072998", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140508276": {"recommendationid": "140508276", "author": {"steamid": "76561198045453755", "num_games_owned": 169, "num_reviews": 6, "playtime_forever": 1303, "playtime_last_two_weeks": 0, "playtime_at_review": 1303, "last_played": 1687402678}, "language": "english", "review": "Very solid game for early access. About 10-12 hours worth of content if you don't mess with ship modding too much. Interesting story. Experienced no crashes at all. Game is not optimized for larger resolutions at this time, but I was still able to maintain about 58fps at 2560x1440. It feels similar to Worlds Adrift which is a favorite of mine. If you like ship building and island exploration you will enjoy this game.", "timestamp_created": 1687455578, "timestamp_updated": 1687455578, "voted_up": true, "votes_up": 32, "votes_funny": 3, "weighted_vote_score": "0.71370851993560791", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140541483": {"recommendationid": "140541483", "author": {"steamid": "76561198000408251", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 192, "playtime_last_two_weeks": 0, "playtime_at_review": 192, "last_played": 1687505384}, "language": "english", "review": "Forever skies centres around an airship you pilot, expand and use to fly to locations, where you will be collecting resources, finding upgrades and progressing the story. If you have played raft etc you will be familiar with the basic formula. I've been waiting to play this since the demo came out some time ago, but was quite disappointed with what is currently available and how its been implemented.\n\nThere are all the pieces of what makes a good game of this genre - things to explore, collect, build, research etc, but it all just doesn't feel right individually nor does it come together right. Part of it is a quite awkward UI, which seems to just slow you down and get in the way, but its deeper than that. You are flooded with basic resources which takes away any feeling of progression or difficulty, and the trivial but time delayed method by which you get them ends up rendering the basic game-play loop a chore rather than a challenge. Research is almost instantaneous, which again detracts from any feeling of achievement when you finally unlock stuff. \n\nYour airship gets damaged by randomly floating debris which you can do little about since its largely everywhere and the way the building system is setup often means you are quite often hunting around your ship trying to find which part has been damaged, which ends up feeling mechanically like tedium that is just getting in the way of you playing the game. Locations that you visit are largely identical with minor variations. Food and water is so plentiful that it makes the whole hunger / thirst system seem largely pointless. \n\nVisually the game is quite nice, and I love this genre, but unfortunately the core game design is just so far off the mark that I don't see much hope for this game developing into something great down the track - although I hope I am wrong. I have asked for refund.", "timestamp_created": 1687507347, "timestamp_updated": 1687507460, "voted_up": false, "votes_up": 211, "votes_funny": 14, "weighted_vote_score": "0.711799442768096924", "comment_count": 30, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "144184167": {"recommendationid": "144184167", "author": {"steamid": "76561198023906435", "num_games_owned": 265, "num_reviews": 11, "playtime_forever": 1984, "playtime_last_two_weeks": 0, "playtime_at_review": 1851, "last_played": 1711625523}, "language": "english", "review": "[h1] Subnautica! but in the sky [/h1]\n\nIf you like the gameplay of Subnautica you will enjoy the gameplay in Forever Skies. The base building is great, resources have a good range (still could be expanded) and the atmosphere makes you respect the dangers of the environment and lore. The thunderstorms have some of the best thunder in any game!\n\n[u] So far the Pros are: [/u]\n\n- No game breaking bugs found after 30 hours of play\n- Good initial story/lore building \n- Interesting world to be explored \n- Nice progression of unlocks/research\n- Solid if not a bit standard survival genre mechanics (food/water etc) \n- You start really feeling like your ship is your home, expansions are worth working for and the fact that environmental sound/effects is blocked by doors/walls makes you feel safe inside.\n\nThe [u] cons [/u] of Forever Skies (at the point of review) really revolve around it being in early access. The story still has some way to go to be developed and the level of content is ok so far but there is a huge amount that could be added (some of which the devs have disclosed in roadmaps). Although the game is still in early access it plays very well and holds your hand just enough to let you make discoveries just when you need them.\n\nI really enjoyed the 30 hours I played, after which I felt I was at the point where I had experienced pretty much all of what the game has to offer at this point if its development but also having been able to dedicate a lot of time to resource gathering and base building. For an early access game its great!\n\n", "timestamp_created": 1692023026, "timestamp_updated": 1692023026, "voted_up": true, "votes_up": 27, "votes_funny": 1, "weighted_vote_score": "0.709239780902862549", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140538903": {"recommendationid": "140538903", "author": {"steamid": "76561197967220570", "num_games_owned": 563, "num_reviews": 7, "playtime_forever": 485, "playtime_last_two_weeks": 0, "playtime_at_review": 362, "last_played": 1687578040}, "language": "english", "review": "Skynautica.", "timestamp_created": 1687502595, "timestamp_updated": 1687502595, "voted_up": true, "votes_up": 49, "votes_funny": 14, "weighted_vote_score": "0.703581929206848145", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "147247121": {"recommendationid": "147247121", "author": {"steamid": "76561198014874603", "num_games_owned": 143, "num_reviews": 21, "playtime_forever": 1756, "playtime_last_two_weeks": 0, "playtime_at_review": 1756, "last_played": 1689715236}, "language": "english", "review": "The game tries too hard to be like Subnautica and really dropped the ball in that attempt. So much so that it actually works against the title. Relies heavily on procedural generation so after a few hours the novelty wears off quickly. Very janky at its core, food / water depletes too fast (even tho food and drink is abundant, it's annoying) & there is very little to do beyond smashing through the main objective. \n\nFrom there it's a boring endless sky of the same points of interest you've already seen a million times. There are effectively no hostiles in the game besides static bugs or lightning, all of which are easily avoided or mitigated. The upcoming patch which adds a new hostile NPC seems severely lackluster & small. For as long as it's been out, the cadence of updates & small quantity of content within them is a bad omen for its future.\n\nOverall, the game just needs more of everything times 10. It has a good idea at its core, but it's just not there. It's great they want to add in co-op, but I cannot fathom what adding another player would do. You don't need help for anything at all in the game, a second person would just be extra weight.\n\nHopefully the game will change for the better, but I'm not holding my breath.", "timestamp_created": 1695948694, "timestamp_updated": 1695948873, "voted_up": false, "votes_up": 234, "votes_funny": 11, "weighted_vote_score": "0.703189969062805176", "comment_count": 21, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "156455437": {"recommendationid": "156455437", "author": {"steamid": "76561197999295691", "num_games_owned": 320, "num_reviews": 14, "playtime_forever": 1439, "playtime_last_two_weeks": 0, "playtime_at_review": 466, "last_played": 1706379300}, "language": "english", "review": "Imagine Subnautica but going the other direction. Game has a really fresh premise and interesting crafting/base building system, and a fascinating world to go along with it. Waiting for a bit more content, but at this stage its already a recommendable early access game.", "timestamp_created": 1705834037, "timestamp_updated": 1705834037, "voted_up": true, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.701846539974212646", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "144037600": {"recommendationid": "144037600", "author": {"steamid": "76561199026392108", "num_games_owned": 290, "num_reviews": 77, "playtime_forever": 366, "playtime_last_two_weeks": 0, "playtime_at_review": 366, "last_played": 1700595715}, "language": "english", "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☑ Adults\n☑ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Difficulty }---\n☐ Just press 'W'\n☑ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☑ Short\n☐ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10", "timestamp_created": 1691878969, "timestamp_updated": 1691878969, "voted_up": true, "votes_up": 98, "votes_funny": 10, "weighted_vote_score": "0.698949038982391357", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141255401": {"recommendationid": "141255401", "author": {"steamid": "76561197985646811", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 9075, "playtime_last_two_weeks": 0, "playtime_at_review": 3461, "last_played": 1710880100}, "language": "english", "review": "One of the best Early Access Releases this year! \nPros:\nFreedom to Build\nGood story (so far)\nDoes not feel like a grind\n\nCons:\nStory is relatively short (similar to Raft's EA)\nStorage/Stack size (for some items)\nBuilding restrictions (i.e. Can't make a room where one of the walls has attached shelves, can't put a floor where there is a container with more item stacks than you have slots)", "timestamp_created": 1688431378, "timestamp_updated": 1688431378, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.69774472713470459", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "150244949": {"recommendationid": "150244949", "author": {"steamid": "76561197999279647", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 3048, "playtime_last_two_weeks": 0, "playtime_at_review": 3030, "last_played": 1705706821}, "language": "english", "review": "Cant wait till this game actually looks like it does in the video adds. \n\nThis is an interesting game with a ton of possibilities. Definitely needs much more content. played through the whole game in about 16 hours. Much of what you see in the video is not how you see it in the game. I expect one day it will look just as it's advertised. I don't recommend buying this game since it's still in early, early production. However, hope they keep developing this game. It could be a really big hit with the right guidance and development.", "timestamp_created": 1700171047, "timestamp_updated": 1700171047, "voted_up": false, "votes_up": 47, "votes_funny": 1, "weighted_vote_score": "0.683249235153198242", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140707294": {"recommendationid": "140707294", "author": {"steamid": "76561197975735833", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 298, "playtime_last_two_weeks": 0, "playtime_at_review": 298, "last_played": 1687735988}, "language": "english", "review": "This is a game that actually follows what early access is *supposed* to be: a game with a complete skeleton that needs its bits fully fleshed out. Nearly everything that makes up the final game is basically there from the exploration to the crafting to the base building. It seems like the only thing missing is combat. Personally I don't mind it not yet existing as I am having a much more fun experience exploring and crafting without worrying about monsters jumping out at me.\n\nNow bear in mind the game as it is is pretty short. I got to the current end of the quest line in under five hours and I wandered around quite a bit. That being said, what IS there is fun and I got my money's worth out of the game already.\n\nPros: good, solid gameplay; solid crafting system that doesn't force you to pick up everything that is not nailed down (the two most commonly used materials literally fly through the air); atmosphere is well established; story is interesting and is teased, there are no exposition dumps; health is much more nuanced then in other games: you actually need to tend to your other meters to maintain your HP\n\nCons: I had some trouble getting decent frame rates, I suspect it was because most of the game is particle effects; hunger/thirst meters drain fast; inventory is small and objects do not stack very high\n\nAll in all, assuming the devs do not go dark I anticipate this being a pretty clever title when finished. I recommend it even as is.", "timestamp_created": 1687739102, "timestamp_updated": 1687739102, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.68084949254989624", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "144968548": {"recommendationid": "144968548", "author": {"steamid": "76561197978756246", "num_games_owned": 69, "num_reviews": 34, "playtime_forever": 934, "playtime_last_two_weeks": 0, "playtime_at_review": 67, "last_played": 1693053379}, "language": "english", "review": "Very similar to Subnautica and Raft.\n", "timestamp_created": 1692946895, "timestamp_updated": 1692946895, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.680836081504821777", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141180325": {"recommendationid": "141180325", "author": {"steamid": "76561198057795149", "num_games_owned": 0, "num_reviews": 95, "playtime_forever": 600, "playtime_last_two_weeks": 0, "playtime_at_review": 522, "last_played": 1712015637}, "language": "english", "review": "This is Early Access.  The usual disclaimers apply.  \n\nLike Subnautica, Forever Skies is 10% gameplay and 90% atmosphere.  Unlike Subnautica, the game is literally 90% atmosphere.", "timestamp_created": 1688347385, "timestamp_updated": 1688347385, "voted_up": true, "votes_up": 22, "votes_funny": 34, "weighted_vote_score": "0.67506861686706543", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141917524": {"recommendationid": "141917524", "author": {"steamid": "76561198180687279", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 1139, "playtime_last_two_weeks": 0, "playtime_at_review": 591, "last_played": 1701586228}, "language": "english", "review": "After watching the Starfield reveals, I developed a taste for games where I could not only fly but live on and customize my own ship. I wanted to be on something that would be my traveling home, my lifeline and my vehicle of exploration. Obviously I turned to Subnautica and Below Zero and as always they were excellent. I started searching for similar games which brought me to Forever Skies. This game is exactly what I was looking for and in many ways it captures that feeling better than Subnautica ever did. It all comes down to the sheer necessity of my mobile home. In Subnautica I can build a base and live there (which is great fun!) and never REALLY need my Cyclops submarine. A base and a seamoth will do just fine. But in Forever Skies, your airship is your life. You depend on it for everything. There you must cook, eat, drink, sleep, craft, store items, research and explore. You have to keep an eye on damage and fuel. You develop a daily routine. Get up, make water, make sure you have bait ready to go to \"fish\" for the big moths that fly around in the dangerous wastes below (I can't tell you how horrific it sounds to subsist on a diet of boiled moths!). The ship becomes your place in the world. It becomes the primary character in the game and you get to know every inch of it because you designed it from scratch.\n\nThe atmosphere in this game is amazing. You get up and walk outside onto the catwalk you've built and the wind sounds almost like a raging ocean. You go back inside and close the doors and the sound is muffled, serving as a psychological reprieve from the horrors outside. You suddenly feel safe in your flying fortress.\n\nAt first I had a very small airship and I was happy with it. It had everything I needed and I knew my way around perfectly. But the game pressures you to upgrade. You see your airship can only go so high (and so low), yet many of the platforms with life-saving materials and loot are too high for you to reach. So you have to upgrade your balloon which also allows you to build a bigger platform underneath. With the bigger platform comes more storage and amenities and room to breath. I've just finished upgrading my airship to what I'll call \"phase two\" and even though it's very simple and functional I'm proud of it. I visualized it and built it and it's my own. I don't want to turn this review into a comparison to  Subnautica because I love that game too, but let's face it, aside from some limited interior design and custom placement of storage lockers, etc., my Cyclops is exactly like your Cyclops and everyone else's who ever played that game. Not so with my Forever Skies airship.\n\nI could go on and on about how much I love this game and the feeling it gives me when I play, but I don't really know where to begin or end. You get the picture.\n\nOf course it is early access and there are some rough spots but none that have bothered me too much. I complained to the devs about the lack of rebinding options for the keyboard but that was fixed in the experimental branch. The game actually updated before I started writing this so maybe those changes have come to the main release itself. In truth, as the game stands now, it feels very polished, EA or no EA.\n\nThe immersion factor is superb and the ship is amazing. I've become addicted to this game world and I know as the development increases it will only get better. I'm sure many others have said this but I'll say it too: if you love Subnautica you'll love forever Skies.", "timestamp_created": 1689180610, "timestamp_updated": 1689181006, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.66669774055480957", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148347821": {"recommendationid": "148347821", "author": {"steamid": "76561198312669363", "num_games_owned": 114, "num_reviews": 7, "playtime_forever": 415, "playtime_last_two_weeks": 0, "playtime_at_review": 403, "last_played": 1705720462}, "language": "english", "review": "I just think it's a really cool game is all. The concept is fairly unique and the gameplay is pretty fun. It can be a little annoying to farm certain resources at times but the devs have made it easier since release and appear to be making an effort to balance the game as time goes on.", "timestamp_created": 1697479353, "timestamp_updated": 1697479353, "voted_up": true, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.664939045906066895", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148448251": {"recommendationid": "148448251", "author": {"steamid": "76561198193557654", "num_games_owned": 346, "num_reviews": 40, "playtime_forever": 534, "playtime_last_two_weeks": 0, "playtime_at_review": 492, "last_played": 1701472015}, "language": "english", "review": "The Forest - Land\n\nSubnautica - Sea\n\nForever skies - Air\n\nNeed i say more?", "timestamp_created": 1697651889, "timestamp_updated": 1697651889, "voted_up": true, "votes_up": 64, "votes_funny": 3, "weighted_vote_score": "0.664578378200531006", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140983457": {"recommendationid": "140983457", "author": {"steamid": "76561198062234712", "num_games_owned": 0, "num_reviews": 29, "playtime_forever": 598, "playtime_last_two_weeks": 0, "playtime_at_review": 598, "last_played": 1688070842}, "language": "english", "review": "To be honest i can't say it's entirely negative but it's just a demo in terms of content and the story progression is too short for the 10 dollars above average early access price tag, as well as the plethora of performance issues when playing the game (ie going below the dust is a big example\n\nthings i viewed as problems\n\naudio SFX below the dust loops randomly for no determinable reason.\n\nthe drop and rise to it actually can make the game freeze sometimes (mind you i have 2080 super and an i7 cpu) \n\nthere's a distinct grind to this game that leaves me feeling i never have enough resources (similar to raft actually)\n\nsome of the resources needed are finite and once you use them you can no longer get any more (meaning long-term survival is hindered by it) I.E solid state batteries\n\nthe overall lack of danger or thirst/hunger/fatigue management ||on higher difficulties too|| (the sicknesses really arent that bad and easily curable and lightning is entirely avoidable if you stay anchored to a location)\n\nProgression is minimal (ie you do two missions and the entire story is done as of writing 06/30/2023) i understand they intend to add on more later but right now it just feels like a demo you're paying 30 dollars for, and it's just not worth the price it's asking for right now.", "timestamp_created": 1688141403, "timestamp_updated": 1688141462, "voted_up": false, "votes_up": 58, "votes_funny": 5, "weighted_vote_score": "0.660793662071228027", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140553968": {"recommendationid": "140553968", "author": {"steamid": "76561197972347871", "num_games_owned": 312, "num_reviews": 25, "playtime_forever": 1414, "playtime_last_two_weeks": 0, "playtime_at_review": 148, "last_played": 1690150955}, "language": "english", "review": "It's fun, but you need to remember that it's in EA and not optimized.. I like it and it looks promising. Its like Subnautica :)", "timestamp_created": 1687527052, "timestamp_updated": 1687527052, "voted_up": true, "votes_up": 15, "votes_funny": 1, "weighted_vote_score": "0.660755693912506104", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "145229401": {"recommendationid": "145229401", "author": {"steamid": "76561198015891638", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 658, "playtime_last_two_weeks": 0, "playtime_at_review": 658, "last_played": 1693199830}, "language": "english", "review": "Too early in development.  Good setup, just quest line stops just too early to buy now.  Wait a bit.", "timestamp_created": 1693268731, "timestamp_updated": 1693268731, "voted_up": false, "votes_up": 18, "votes_funny": 1, "weighted_vote_score": "0.659013807773590088", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141978972": {"recommendationid": "141978972", "author": {"steamid": "76561197978188596", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 233, "playtime_last_two_weeks": 0, "playtime_at_review": 233, "last_played": 1689247433}, "language": "english", "review": "Solid game with good core mechanics and interesting premise. Unfortunately there is not enough content here to justify the price to entry, currently.", "timestamp_created": 1689247499, "timestamp_updated": 1689247499, "voted_up": false, "votes_up": 121, "votes_funny": 11, "weighted_vote_score": "0.657693624496459961", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "142254807": {"recommendationid": "142254807", "author": {"steamid": "76561198012471754", "num_games_owned": 805, "num_reviews": 17, "playtime_forever": 1011, "playtime_last_two_weeks": 0, "playtime_at_review": 798, "last_played": 1691694068}, "language": "english", "review": "Pretty fun little game so far, still not much content in it, but hopefully it will come. IF you like RAFT, this is the game for u.", "timestamp_created": 1689583394, "timestamp_updated": 1689583394, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.65478593111038208", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "147766841": {"recommendationid": "147766841", "author": {"steamid": "76561198980536427", "num_games_owned": 0, "num_reviews": 17, "playtime_forever": 2517, "playtime_last_two_weeks": 0, "playtime_at_review": 633, "last_played": 1712110431}, "language": "english", "review": "Gives subnatica vibes in some cases, but has a great story so far though its is still very much in the beta, then the flying mechanic is very linear and isnt anything hard to learn, and the quest list is very useful so you dont get lost and lose whats a good next step to progress", "timestamp_created": 1696630994, "timestamp_updated": 1696630994, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.643414020538330078", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "153854479": {"recommendationid": "153854479", "author": {"steamid": "76561198029854323", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 1237, "playtime_last_two_weeks": 0, "playtime_at_review": 1237, "last_played": 1699455121}, "language": "english", "review": "A game that can immediately make me WANT to know more about the lore... and its not an immediate clone of something that's been done before? \n\nTop Marks just in those respects.\n\nIt has Great art and sound design with its visuals immersing you in this post-collapse earth, and its story just giving you enough to become invested in the future of this title. \n\nI cant wait to see the potential this has to become akin to a Subnautica-of-the-skies. The exploration and scale of the environment is beautiful in similar ways to titles like Horizon: Zero Dawn - being able to experience the downfall of mankind among the last vestiges of its opulence, still towering high above the ominous clouds below and genuinely giving me vertigo when i almost didn't make a leap of faith to a platform. \n\nThere is still a long story ahead for Forever Skies, and i wont pretend this is the only title to have \"so much potential\" in the much maligned 'Early Access' genre, but the Developers are both active and responsive to community feedback, which allows for cautious optimism that we will get to find out much more about the world that remains above and below The Dust.\n\nI cant wait to see where this title goes from here.", "timestamp_created": 1702903914, "timestamp_updated": 1702903914, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.635717868804931641", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "144944946": {"recommendationid": "144944946", "author": {"steamid": "76561198077355695", "num_games_owned": 0, "num_reviews": 27, "playtime_forever": 4543, "playtime_last_two_weeks": 0, "playtime_at_review": 1264, "last_played": 1706018710}, "language": "english", "review": "The idea of the game is nice. BUT....\n* (Almost) No Lore...\n* The \"main story\", if you may call it, is for 1 hour (max) of the game.\n* 23€ (on sale) is defiantly TOO MUCH for it (comparing to The Planet Crafter and Subnautica series)\n* HW/SW optimization - NOT FOUND!!! (RTX 4070 is lagging like hell; picture is freezing in the \"under dusk\" elevator ALL THE TIME). Shades are not optimized as well.\n\nFor the moment it is a VERY RAW product and a BIG disappointment. Hope to see a better game in the near future.\n", "timestamp_created": 1692913930, "timestamp_updated": 1692913930, "voted_up": false, "votes_up": 22, "votes_funny": 2, "weighted_vote_score": "0.635708510875701904", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140812824": {"recommendationid": "140812824", "author": {"steamid": "76561197962413173", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 712, "playtime_last_two_weeks": 0, "playtime_at_review": 691, "last_played": 1689023143}, "language": "english", "review": "Forever Skies: Worth Playing? \n\nForever skies has STRONG Subnautica vibes in all of the best ways. From the story, to the world and exploration, you can't play Forever Skies without thinking of Subnautica. \n\nInstead of being under the ocean though, you are in the sky. You get command of your own airship within the first 15 minutes of the game. Flying the airship feels a lot like the larger 'Cyclops' submarine from Subnautica - but in Forever Skies even the hull/frame of the airship is modular and customizable giving even more personalization. \n\nEven the world and exploration gives extreme Subnautica vibes. In this world, there are these radio/beacon stations that contain valuable resources and recipes for you to collect which you can use later to craft. These stations are littered about the world, very similar to the sunken parts of the spaceship in Subnautica.\n\nJust like Subnautica, you start the game with limited resources. You gather resources throughout your exploration, and you gather recipes to create better things. There's a tool for scanning, crafting, gathering, there's even a few weapons. As you explore you learn more about the world, and the people on it. \n\nI almost feel bad comparing it to Subnautica so much - the story is quite unique and surviving the harsh environments in the game is also quite different from Subnautica. But the inspiration is clear, and the mechanics are similar enough that one can't talk about this game for more than a minute without mentioning ... Subnautica.\n\nIs this game fun? Yes, it is way more fun than the game should be. To me, this proves that the Subnautica 'formula' can be applied to other environments/themes quite successfully. \n\nThe main pain-points for me are similar to that of most other early access games. There are performance improvements that need to be made (especially on the planets surface). Some of the UI could be a bit more clear, specifically the part where you navigate the discovered information about the lore/tech/etc. \n\nThere is also the issue of amount of content currently present in the game.\n\nRight now, you can get through the entire game in about 6 - 10 hours of gameplay. But when you reach the conclusion of the current content there is a message from the devs saying \"this is only the start\".\n\nSo is it worth playing? If you have exhausted Subnautica completely and you are going crazy looking for something similar - I would say YES this is worth playing! \n\nIf you are looking for something with more than 6 - 10 hours of game time, then I would recommend smacking the wish-list button and checking back in after a few more updates! \n\nI do not regret my purchase at all, the time I have spent in the game was fantastic and I look forward to the future of Forever Skies.\n\nFollow me on Twitch at www.twitch.tv/killerham", "timestamp_created": 1687899487, "timestamp_updated": 1687899487, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.630915820598602295", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "156773213": {"recommendationid": "156773213", "author": {"steamid": "76561198072197369", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 1370, "playtime_last_two_weeks": 0, "playtime_at_review": 558, "last_played": 1706357481}, "language": "english", "review": "An interesting concept, but nothing like ready for real-world play; there's really not very much to do, and what there is tends to be quite repetitive.\n\nPart of me feels bad for giving an early-access game a thumbs down, but there are three specific things about the game that to me represent actual developer decisions and are thus unlikely to change as the title develops: they are -\n\n1: Long press\nI hate long press (where you have to hold down a button for a certain period of time to activate a function) with a passion - just by itself it nearly ruined No Man's Sky for me, and I regard it as a serious error of judgment by any developer who tries to use it.\n\n2: Overdone survival mechanics\nAlmost half your time in this game is spent repetitively feeding and hydrating yourself, exacerbated by a regular need to sleep that drains both food and water. There is \"survival mechanics\", and then there is \"tedium\", and this game is definitely in the latter category.\n\n3: Really bad UI decisions\nAs an example of this, if you want to move a storage box, you have to empty it first. Want to put in a new window? You have to remove anything you've placed near it (not necessarily actually attached to it - just near it). And the inventory! Oh lord, it's awful! It's tiny, and there are plenty of things that don't stack. You will spend a lot of time in this game shuffling your inventory around, and I loathe inventory-shuffling.\n\nThere are actually other aspects of the game that annoy me too, but they are mostly things that could be ironed out during early access. The three things above, though, are game-killers for me. \n\nIf they can fix these things and polish the rest, I'll happily change my rating to thumbs-up, because there is some real potential here... But as it stands, it still needs a whole lot of work.\n", "timestamp_created": 1706182618, "timestamp_updated": 1706182618, "voted_up": false, "votes_up": 30, "votes_funny": 0, "weighted_vote_score": "0.6303863525390625", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141056114": {"recommendationid": "141056114", "author": {"steamid": "76561198032216688", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 3041, "playtime_last_two_weeks": 44, "playtime_at_review": 974, "last_played": 1713307765}, "language": "english", "review": "I don't normally leave comments, but this game made me change that.  \nThoroughly enjoying the game.  Played through what is currently the story and it is intriguing.  It's a unique concept and I like building and upgrading my airship.  The storage containers you get at first are super small, only 6 slots.  There are other options, a wall cabinet and a larger chest, but you have to find them.  Things do respawn at the moment, which is nice so your exploration can continue while we eagerly wait for more.  \nHeartily recommend!\n", "timestamp_created": 1688222993, "timestamp_updated": 1688222993, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.630305886268615723", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148819359": {"recommendationid": "148819359", "author": {"steamid": "76561198008893350", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 894, "playtime_last_two_weeks": 0, "playtime_at_review": 440, "last_played": 1698720883}, "language": "english", "review": "Excellent!!  Hard to believe this game is still in Early Access.  Likely the content amount will need to keep growing, but the quality of gameplay itself at this stage is better than some fully released games I've bought.  As an avid Subnautica player, I can indeed confirm the many comments from other players supporting similarities, especially in the need for subtle, finesse style of driving (flying vs piloting i guess) your main vehicle (not the small one in Subnautica, but the sub).  However, this game is quite creative in concept, and fundamentally different to Subnautica in that Subnautica vehicles cannot substantially be changed (except for adding a few things such as storage, farming, and a few installations of system upgrades and weapons which none in itself drastically change the sub's shape or form, just what it can do).\n\nIn Forever Skies your airship (think of a huge, moddable Zeppelin) is basically as upgradeable and flexible as you want it to be (as your Subnautica fixed bases basically, but in here you take the base with you!).   The fact that your buildable base is also your transport changes quite a bit the game.  It's I guess what I wished my sub could have been in subnautica, as if the little drone thing could have slowly grown into the sub, and later a massive sub base which obviously would have not fit in the internal caves but you get the point.  Floating around the clever version of the virus infected world in FS is such a different experience to most games i've played.  The airbase does require some large mass movement control to manage, and to approach the many buildings critical to story progression does require finesse and proper flying, not just simple AI-controlled approaches as in other games.  Then there's the thrill of using some key tools reserved for outdoors, near the ship edge type of tools (like a \"fishing\" device that uses lures to procure food from lower altitudes not safe to fly) that put you near the edge of your ship and test your fear of altitude in an interesting way.\n\nAll in all a really pleasant experience for explorers/crafters/base builders.  Even better, as I mentioned the quality of implementation so far is vastly superior to a good number of fully released games I've bought.  Now, my rig is fairly powerful, so regarding compute needs all i can say is that with a good PC the game plays smooth and looks beautiful.  No bugs found yet (aside from what my fishing lures catch, lol).  Cant wait for full release to see what else the developers throw in.  Definitely recommend.", "timestamp_created": 1698191018, "timestamp_updated": 1698191018, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.629924774169921875", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140758876": {"recommendationid": "140758876", "author": {"steamid": "76561197971040782", "num_games_owned": 1043, "num_reviews": 257, "playtime_forever": 89, "playtime_last_two_weeks": 0, "playtime_at_review": 64, "last_played": 1688249004}, "language": "english", "review": "Subnatica and Raft.    If you played those two you'll enjoy the game.   Light on the content but by the sounds of it I have about 10 hours before I run out of what the game has to offer.   I do find the constant need for food and water annoying as I did with the previous two titles.  \nThe graphics are more on the cartoon side with that Borderlands / raft feel an not close to the level of detail and SFX as Subnatica has (but hey its EA).    At $23 bucks I think the game is worth the sale price.    8/10", "timestamp_created": 1687818388, "timestamp_updated": 1687818388, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.629425466060638428", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141600723": {"recommendationid": "141600723", "author": {"steamid": "76561198094904154", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 5907, "playtime_last_two_weeks": 1629, "playtime_at_review": 684, "last_played": 1713291425}, "language": "english", "review": "Liking it so far.   Kind of a Subnautica (one of my favorite games ever) in the sky vibe.  Little bit of a learning curve.   I think thefre could be a bit more tutorial to it but it's pretty easy to get the hang of how things work.  There are a few things I'd like to see improved, but it IS early access.\nCreating your own Airship is really fun and probably the highlight of the game for me so far.", "timestamp_created": 1688823367, "timestamp_updated": 1688823367, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.623975574970245361", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141807416": {"recommendationid": "141807416", "author": {"steamid": "76561198031026148", "num_games_owned": 185, "num_reviews": 69, "playtime_forever": 430, "playtime_last_two_weeks": 0, "playtime_at_review": 430, "last_played": 1689048078}, "language": "english", "review": "Very good survival in a beautiful enviroment. Relaxing gameplay, based on exploration, crafting and base building.\n\nIt doesn't seem to be a lot content in the current EA version. If you are a slow paced player like me that likes to explore the next skyscraper instead of rushing to the next objective, and takes its time to craft things and build a decent aircraft, you can expect 30ish hours before the plot is complete and there's not much to aim left.\n\nBut what is there is good gameplay in a awe isnspiring enviroment, so it's good to unglue few summer nights. Devs seem committed in adding content, to wich proportion nobody knows, but it's not an abandonware. Might be you pay it cheap now and in an year or two it will become an amazing project, who knows.", "timestamp_created": 1689048653, "timestamp_updated": 1689048653, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.621408581733703613", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "143805827": {"recommendationid": "143805827", "author": {"steamid": "76561197977620684", "num_games_owned": 1524, "num_reviews": 19, "playtime_forever": 2111, "playtime_last_two_weeks": 873, "playtime_at_review": 1029, "last_played": 1713732727}, "language": "english", "review": "I enjoyed Forever Skies game very much. \nIt's like Subnautica but in the skies. \nIt's pretty much looting, crafting, and building without enemies.", "timestamp_created": 1691699180, "timestamp_updated": 1701029002, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.620534360408782959", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140699434": {"recommendationid": "140699434", "author": {"steamid": "76561198057804968", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 308, "playtime_last_two_weeks": 0, "playtime_at_review": 308, "last_played": 1687655104}, "language": "english", "review": "Interesting Game with a cool premise but right now there is not enough Content to make the game enjoyable or worth the price of admission IMO. I was able to easily beat the current content included in 5 hours which is ridiculous for a \"Survival Game\". I understand its in early access but only releasing with 5 hours of content is disappointing. \n\nAnother thing i was hoping to see was some sort of physics or struggle actually flying the airship. One would think with it being on a planet Ravaged by high winds (Enough to send metal flying) it would not sit stone still in the middle of storm with no fuel.\n", "timestamp_created": 1687730521, "timestamp_updated": 1687730521, "voted_up": false, "votes_up": 45, "votes_funny": 2, "weighted_vote_score": "0.619475126266479492", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140581464": {"recommendationid": "140581464", "author": {"steamid": "76561198039190938", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 3760, "playtime_last_two_weeks": 0, "playtime_at_review": 841, "last_played": 1711953485}, "language": "english", "review": "I'm sure others have come to a similar conclusion in that Forever Skies is a bit like Subnautica, but in the sky instead of the sea, so if you enjoyed Subnautica, then you'll likely enjoy Forever Skies.\nEven though the game is in early access, it feels very polished overall, but does need a bit more optimising for better frame rates. That said, it's very stable as yet for me, no crashes or glitches etc., so give it a try.", "timestamp_created": 1687559850, "timestamp_updated": 1687559850, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.617195725440979004", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140527525": {"recommendationid": "140527525", "author": {"steamid": "76561197995967575", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 345, "playtime_last_two_weeks": 0, "playtime_at_review": 345, "last_played": 1687479072}, "language": "english", "review": "First, a disclaimer: While I can't recommend the game in its current state, I'm hopeful that this will change sometime in the coming months. There's a solid skeleton here, but it needs a lot more meat on its bones before it gets a thumbs-up from me. \n\nCompared to other early access games, Forever Skies is very well polished. Even on launch day, I only noticed a handful of bugs in my 6 hours of playtime, all minor interface issues that were easily remedied. The game looks good, the airship design mechanics work well, and exploring the world feels natural. I caught a couple of tools that seemed to be missing their sound effects, and spotted at least one spelling mistake in the interface, but that still puts it in the \"exceeds expectations\" category for me.  \n\nWhile the content is polished, though, there just isn't a lot of it. Six hours was enough for me to reach the end of the story, and that was at a rather leisurely pace. About a third of that consisted of puttering about over a ruined city, landing atop various towers, looting them for resources, and generally having a blast. Another third was dedicated to inventory management, shooting mining lasers at alien tumbleweeds, and using the resources thus gained to craft more small boxes to help manage my inventory. \n\nThe last third of the game involved docking my ship at a big tower and exploring a cramped and confusing dungeon area. At this point, the free-roaming gameplay I'd been enjoying was replaced with a simple, tedious loop: \n1. Go down the elevator.\n2. Run around until I hit a barrier.\n3. Grab or scan something nearby. \n4. Go up the elevator to research the thing.\n5. Repeat. \n\nParts of it were visually stunning, but being on a 100-second oxygen timer meant I was scrambling to and fro too fast to really appreciate it. After a few cycles of this, the end arrived without much fanfare. I could return to the clouds and set sail again in search of new furniture or compartments, but I'd run out of truly novel content. Compared to other games in the genre, it felt like I ran out of road right when it should be starting to get good. \n\nRight now, Forever Skies feels like a pitch for the game the developers want to make. There are lots of hooks that aren't really expanded on, indications of what content might arrive in the future, but what's there now is just enough to whet the appetite. I very much like the look of that future game, and hope to see it come to fruition. \n\nIf you just can't wait to sink your teeth into a surprisingly robust demo, and you don't mind gambling a decent chunk of your money to do so, you might consider picking up Forever Skies now. If not, I still suggest keeping this game on your wishlist and following its future development. If the devs can stay on track with their planned updates, this could become one of my favorites games in the genre..", "timestamp_created": 1687481948, "timestamp_updated": 1687481948, "voted_up": false, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.612717747688293457", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140821934": {"recommendationid": "140821934", "author": {"steamid": "76561198038467884", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 555, "playtime_last_two_weeks": 0, "playtime_at_review": 313, "last_played": 1697958524}, "language": "english", "review": "Much like Subnautica back in the early access days, the game already has the bones of its building, crafting, and exploration system with minimal jank. All that's waiting is the content. Here's hoping the devs will deliver!", "timestamp_created": 1687913611, "timestamp_updated": 1687913611, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.612578153610229492", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148478545": {"recommendationid": "148478545", "author": {"steamid": "76561198040800768", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 2715, "playtime_last_two_weeks": 0, "playtime_at_review": 867, "last_played": 1709836555}, "language": "english", "review": "This survival game reminds me of raft but in this story you are floating on a Zepplin over a toxic dust covered earth. The controls need some fine tuning they are set a little high for me but can be adjusted. The game seems simple at fist but the complexity slaps you in the face as it makes you search for the answers to move forward. The survival aspect seems to almost come and go as only when you need advance the story does it return to make your life harder. The balance of improving you airship with out it becoming over weight is hard at first but then the challenge becomes driving a compact ship or making the Titanic and trying not to run in to stuff cause it's so large. If you like a slow paced game you need to take time on this is not a bad game. But it's not going to hold your hand you will need to read and pay attention to survive and advance.", "timestamp_created": 1697708373, "timestamp_updated": 1697708373, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.611940324306488037", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140748779": {"recommendationid": "140748779", "author": {"steamid": "76561198012168712", "num_games_owned": 432, "num_reviews": 1, "playtime_forever": 1213, "playtime_last_two_weeks": 1, "playtime_at_review": 909, "last_played": 1712851867}, "language": "english", "review": "Not much Content atm but hopeful for more to come, Devs seem active. \nGameplay as it is now is great, story is not very long atm but it gets you engaged and there is allot of small lore items/datapads to find. \n\nEnviorment is lovley and just wait until you get into a lightning storm best i have seen in a game so far. And the the toons of hidden loot past small jumping and climbing puzzels can keep you going for hours.\n\nBuilding has a nice feel to it but missing some detail like ability to move things easily, you can move parts and furniture no problem but when you get to the Ballons unless you planed good from start its going to cost you some materials.\n\nStorage is a big thing for me in a game like this and was about to give that a big negative until i found the airship workstation today and now everything is sorted and on nice shelves.\n\nGiving this game my biggest recomendation ever but if you want a complete game with hours and hours or story, wait and come back later its not there YET.", "timestamp_created": 1687805806, "timestamp_updated": 1687805806, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.609082460403442383", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140686794": {"recommendationid": "140686794", "author": {"steamid": "76561198095466924", "num_games_owned": 281, "num_reviews": 22, "playtime_forever": 1185, "playtime_last_two_weeks": 0, "playtime_at_review": 618, "last_played": 1688072217}, "language": "english", "review": "It can be tough to get a mostly unbiased review of a game, even more so when its \"early access\", so I'll try my honest best here as always. \n\nTLDR for those with overly short attention spans: its okay in its current state and has some good potential.\n\nWhile I have some gripes about the game as it is right now I do find that it has some interesting potential in the survival crafting game category. It looks good, they have obviously spent some time with the animations and art, it also seems to run decently (at least on my current rig, was pushing 4k ultra with no real issues, with other background tasks running). The story is interesting enough for the type of game it is, its not doing anything revolutionary but its a tried and true way to push the exploration aspects of the game along enough to keep you going in the right direction in its current state. So for the Pros I think its a nice addition to the category from what I've seen so far and if you like this type of game I think its going to be worth playing.\n\n***Cons as of right now that I've notice:\n-the movement feels a bit sluggish, almost like you are walking in fluid unless you are \"sprinting\", and your stamina gauge runs out very fast when you are sprinting. Getting off ladders is also quite hazardous since you tend to move backward some as you are getting off them, if you are on some small pipe or near a ledge this could cause a lot of issues.\n\n-the air ship is the main selling point here, like the raft in Raft or the sub in Subnautica, it makes sense that it would be a little floaty since its a blimp, but honestly a little more responsive handling would be nice.\n\n-Interacting with objects can be a bit cumbersome, a lot have hitboxes that are quite small so you can't interact with them easily, it also feels like you have to be a bit too close to everything.\n\n-I think they are looking to add farming into the game (similar to Subnautica) and that would be nice as it would make the numerous plants easier to deal with for all the crafting/nutrition needs and give you more reason to build out your sky ship. However it would be nice with the harvesting if you either didn't use stamina with the knife OR you used far less. Constantly having to wait while you character gets out of breath after swinging the knife just a few times isn't great, makes for harvesting bio materials a slog.\n\n-Storage improvements would be great. The stacking sizes are quite low as well as the storage box sizes. I don't know if this is \"realism\" seeping in, but good storage is always a QOL aspect that makes games far more enjoyable. I'm sure they are looking to add larger containers as something to craft, and it seems some slightly better storage, but the storage gets out of hand very quick with the various things that for some reason don't stack (such as the plants) and having very small stack sizes of some things that you find quite a bit of early on. Making stack sizes far larger would be nice and a greater option for storage in the beginning of the game, even if you have to collect more materials. If nothing else having tons of boxes on the floor makes the game harder to play just when dealing with walking around your ship since they don't stack or attach to walls.\n\n-Stacking food would also be great, as well as some sort of crafted fridge to keep things fresh. I don't personally mind the survival aspects of eating and drinking, but filling up your precious inventory with food always gets frustrating in games. I know its hard to balance the food spoiling things with stacks, but a sweet spot would be nice, maybe have some sort of \"preservative\" material that you can use to craft lasting food that you could then stack in some way. Stacking the old rations like any of the other old food would be nice also since they are another thing that takes up space. But this is part of the storage issues from before.\n\n-Recycling built objects would be nice. We already have the tool for it might as well make use of it. When I got to the point where I could make the storage shelves and larger boxes I had more than a few boxes full of small boxes. Yes you could throw them overboard, but it would be nice to get the resources back (even some) that were spent on them OR possibly having an option to use them to make some of the larger containers like you can when making the larger water bottle or upgrading other items.\n\n-Maybe some hints on what the missing research items come from. I just happened to miss one and didn't realize what it was I was looking for because I thought the thing I had passed was something I already knew about. Had to backtrack because I was missing materials to progress. In this case it was a barrel I believed was just another thing with polluted water because it wasn't very well labeled, and wasn't overly obvious to be something new, but turned out to be something important. \n\n\nI've seen the devs responding in forums so they seem to care about what people are saying and wanting to make their game enjoyable so far. Thats a good sign, but lets see where it goes. I think the modders will have a time with this game, but I would prefer the actual devs to put out something great to start without relying on such things like the AAA devs seems to do these days (***Bethesda***).", "timestamp_created": 1687715025, "timestamp_updated": 1688138729, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.608192741870880127", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "154349239": {"recommendationid": "154349239", "author": {"steamid": "76561198333621998", "num_games_owned": 0, "num_reviews": 63, "playtime_forever": 1286, "playtime_last_two_weeks": 0, "playtime_at_review": 1286, "last_played": 1703484113}, "language": "english", "review": "So the game is cool and all, and I recommend it because it's a pleasant experience, however it does leave a lot to be desired.\n\nFirst of all, some of the stuff you see in the trailer almost never happens, or it does happen, but you were expecting something different from the trailer.\n\nNavigation is quite clunky, but you get used to it. Gameplay is also quite repetitive, with places repeating and just having variations. Honestly, I would hope the places weren't generated automatically, and were hand-crafted but fewer in number.\n\nThe biggest issue is really the building mechanics. Just an example, you cannot change a floor (from metal to glass let's say) if it has stuff on it. So you have to move all the stuff first, change the floor, then move them back on it. In general, building is such a hassle that I almost avoided it. Also, by building a bigger ship navigation becomes even clunkier than before, and you can't even see what part is colliding with the environment. So I prefered building a smaller ship. Which goes against what you see in the trailer (ie a ship with two floors etc). Though it's possible to do that, I dunno why you would do it.\n\nIn general that game has made some choices for gameplay and stuff that really need some fleshing up, or reconsidering.\n\nOh, also, it required my computer to be set on the lowest graphics, and it still lagged or even crashed occasionally, and I got a good machine - not ultra, but it shouldn't have had any problems running in medium or high. And it had problems even on lowest, so. Decide at your own risk.\n\nAnyway, I'm still recommending it, because until the current EOC I enjoyed playing it.", "timestamp_created": 1703485409, "timestamp_updated": 1703485409, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.606986880302429199", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "144286849": {"recommendationid": "144286849", "author": {"steamid": "76561198206493740", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1915, "playtime_last_two_weeks": 430, "playtime_at_review": 1409, "last_played": 1713032341}, "language": "english", "review": "Plays a lot like Raft but in the sky. Has the same feel, start out with nothing but gradually find useful items. Research requires you to find the desired equipment and scan it, then research it, then build it. Good mechanics for the ship, there's a weight limit so you can't build a million storage crates unless you research and build the right ship part. Story/lore is interesting but incomplete (it is an EA). All in all, worth the EA price.", "timestamp_created": 1692130011, "timestamp_updated": 1692135088, "voted_up": true, "votes_up": 9, "votes_funny": 1, "weighted_vote_score": "0.605137467384338379", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "149771747": {"recommendationid": "149771747", "author": {"steamid": "76561199046599231", "num_games_owned": 140, "num_reviews": 6, "playtime_forever": 788, "playtime_last_two_weeks": 0, "playtime_at_review": 414, "last_played": 1700768140}, "language": "english", "review": "A good mix between Subnautica and raft but not ready for the big leagues yet but i hope it will when it gets to full release", "timestamp_created": 1699468993, "timestamp_updated": 1699468993, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.604246199131011963", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140543210": {"recommendationid": "140543210", "author": {"steamid": "76561198373677588", "num_games_owned": 0, "num_reviews": 56, "playtime_forever": 371, "playtime_last_two_weeks": 0, "playtime_at_review": 371, "last_played": 1687510077}, "language": "english", "review": "So just doing story missions took me about 11 hours, overall pretty cool timewaster/chillout sort of game. It feels and looks like an Indie game made in Unreal Engine, decent but not extremely polished. I don't think its worth 35AUD (discounted price) but whatever, you can support the developers.\n\nIf you are looking for a deep survival gameplay experience I suggest you wishlist this for now and play subnautica etc instead.", "timestamp_created": 1687510407, "timestamp_updated": 1687510407, "voted_up": true, "votes_up": 11, "votes_funny": 2, "weighted_vote_score": "0.602821886539459229", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148631393": {"recommendationid": "148631393", "author": {"steamid": "76561198003067812", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 1839, "playtime_last_two_weeks": 0, "playtime_at_review": 1698, "last_played": 1698015451}, "language": "english", "review": "Take Raft. Replace it with an airship that you can control right out of the gate (instead of floating aimlessly for a while). Remove Bruce. Add viruses (non-threat really), dust, grime, and wasteland and other 'post world' solidarity. That's Forever Skies. Has a ton of potential.", "timestamp_created": 1697924860, "timestamp_updated": 1697924860, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.600469708442687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140780319": {"recommendationid": "140780319", "author": {"steamid": "76561197965996899", "num_games_owned": 0, "num_reviews": 53, "playtime_forever": 37, "playtime_last_two_weeks": 0, "playtime_at_review": 37, "last_played": 1687724739}, "language": "english", "review": "This got me thinking I should play Subnautica while this one bakes out of EA.", "timestamp_created": 1687857376, "timestamp_updated": 1687857376, "voted_up": true, "votes_up": 6, "votes_funny": 2, "weighted_vote_score": "0.60000002384185791", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "146120450": {"recommendationid": "146120450", "author": {"steamid": "76561198096652743", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 511, "playtime_last_two_weeks": 0, "playtime_at_review": 511, "last_played": 1694445320}, "language": "english", "review": "As a big Subnautica fan, I really enjoyed the game. I was, however, really hit hard by the aprupt end (due to early access). Overall, however, really good. I hope we can get a big content update some time. I still think it was money well spent to support the developers on their journey.", "timestamp_created": 1694445530, "timestamp_updated": 1694445530, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.599426567554473877", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "143002424": {"recommendationid": "143002424", "author": {"steamid": "76561197992135430", "num_games_owned": 0, "num_reviews": 174, "playtime_forever": 524, "playtime_last_two_weeks": 0, "playtime_at_review": 65, "last_played": 1690975215}, "language": "english", "review": "Forever need food, water sky's\nMight help the game here if you didn't have to spend most of it hunting, making, colleting food and water.  Yes it's one of those. Another dev that thinks if survival is in the name then you need to eat and drink 100 times your body weight per day.   So many of them make the same mistake, only a few getting it right from the get go.\n\nI will still recommend it as the rest of the game is really enjoyable, and I hope they bring the eating and drinking requirements down to sensible levels soon.\nPeople are saying that there is only 12 hours of game here and  you can bet 11 of those are spent eating and drinking.  So realistically your getting 1 hours game play for your money.", "timestamp_created": 1690613215, "timestamp_updated": 1690962881, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.599001646041870117", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140926829": {"recommendationid": "140926829", "author": {"steamid": "76561197972107045", "num_games_owned": 265, "num_reviews": 5, "playtime_forever": 8346, "playtime_last_two_weeks": 0, "playtime_at_review": 8345, "last_played": 1691238360}, "language": "english", "review": "It's extreme rare that I will rate a game, especially in early access. But there are aspects about this game that I am in love with!\n\nIf you're wonder what this game is like, it's basically Subnautica in the sky, with part of it on the surface of the planet. A thick toxic layer covers the planet and will kill you if you take your airship into the \"Dust\" below. \n\nThere are bases and outposts that litter the sky atop wind farms, comm towers, and skyscrapers where people tried to survive. In these location you can find needed items, tools, blueprints, and items to scan so you can learn about them or fabricate them for use.\n\nThere are several stations that do various jobs that you can place on your airship. There are currently several styles of furniture you can discover the blueprints for by going to all the locations. There are also old world relics left over and forgotten to time. These are placeable decoration and the computer's interpretation as to what they were for is sometimes comical, i.e. the football you find is most likely an item of \"worship.\"\n\nThere is already a fair amount of notes, logs, journal entries, mail, etc. that helps paint the lore, dispair, and conditions people were living in. Some of the items and messages are required for quest objectives. There is a very slight puzzle, if you could call it that, system where you have to figure out how to get around certain obstacles or get things to work such as doors and unpowered laptops. All can be solved by carefully searching the areas, reading messages laying around or crafting items. \n\nYou will acquire a scanner tool. Use this on anything you can. It will give you blueprints, lore, important info, and required knowledge and the ability to craft items. Try to explore ever square foot of a location for supplies, relics, and other useful things. Create crates to store the most valuable ones in.\n\nBUILDING THE AIRSHIP: You start out with a small humble airship to travel to other locations but as you do you pick up necessary materials and blueprints to expand the airship. You expand the ship using the Airship Tool which is basically the same as the builder tool if you've played Subnautica. It has a menu of compartments and part. All cost materials!\n\nCurrently I have managed to make a x4 ballon wide \"Quad Blimp\" with over 6,000 lbs of weight capacity. x6 Upgraded Engines and x4 Upgraded Turbines. .This gives me the max altitude attainable as well as the max speed and acceleration. \n\nThe airship takes damage from collisions with debris, structures, low altitude, and the horrific storms. Lightning is probably the single most dangerous thing in the game and the most costly to repair! Try to get next to a tall structure so that the lightning will strike it instead of you! You will have repair kits you can loot and craft too. You will use them as fast as you go through a pack of chewing gum. Loot everyone you can hold as you will need it. Same with fuel. Water and food can be caught extremely easily when you need to eat and drink so don't store a lot of it, especially if it will spoil. Only store purified or canned water and ration kits.\n\nSome people say the game isn't what it's worth but I disagree. I played both Subnauticas and many other similar survival games prom kickstarter to where they are today. This game has major potential! They're taking some of the best ideas, environmental concepts and base building ideas and putting them together. \n\nI will warn that this game currently is a gfx hog and can play very laggy on potato computer. I myself have a gtx 3080 and decided to play on high instead of epic quality which basically eliminates all lag. But it will no doubt be optimized in the future. There are a lot of particle fx everywhere which makes the environment vibrant and very unique. \n\nI think this game will take a few years if they stay dedicated to it and could turn out to being up there with Subnautica in terms of creativity, mystery, exploration, survival, and lore.", "timestamp_created": 1688070320, "timestamp_updated": 1688070320, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.598540186882019043", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140520233": {"recommendationid": "140520233", "author": {"steamid": "76561198275327418", "num_games_owned": 203, "num_reviews": 80, "playtime_forever": 555, "playtime_last_two_weeks": 0, "playtime_at_review": 549, "last_played": 1688884994}, "language": "english", "review": "I've been following FS since it's original demo release, I was along for the ride as they gave updates on their Discord about how the games coming along, I was there when they launched the first (and second) closed beta, however sadly I wasn't able to participate, I even backed the project on Kickstarter to support them, I've been eagerly awaiting their official release and when it finally came, oh boy was I hyped.\n\nSince I backed the project I was given the game 3 days early which was nice. When I first launched the game I was initially disappointed when I saw the popup in settings that there was no official ultrawide support, however they had added an FOV slider and pumping that up seemed to be enough to make the game playable, in-fact I had zero issues with weird UI or anything related to an ultrawide resolution, you could have told me the game 100% supported ultrawide monitors and I would've believed you.\n\nNow onto the actual game, the first part was pretty much the same as in the original demo minus a few alterations, however after that was were the real fun began, finally being able to check out what's beyond that initial plot of land, and I gotta say it was a lot of fun, getting out there and exploring the other random plots was great, constantly finding new things to research and new areas to explore, surprisingly one of the highlights of FS for me was the rain and thunder effects, being at the edge of somewhere far away from your ship just to be given that notification that a storms coming, to then rush back to the safety of your airship, as your go in to shut the doors you hear one final crack of lighting so loud it feels real, then after the doors close to only be able to hear the faint sounds of the rain and thunder is the most immersed I've felt in a game in a long time. Ok that's the end of my weird little weather tangent lol.\n\nAs I progressed I did notice some flaws in the game, most notable after a while all the islands kinda just mesh together since apart from a few they all look and act about the same, fairly small, you land, spend a few minutes savaging for resources, then leave to go find the next one which usually looks very similar with only a few changes, which is fine, but I felt that after just a few hours of exploring I had seen everything there was to see on these islands, nothing new was there to excite me, I'd love more story elements, or little minigames, or just fun little unique things on some islands, but given that FS just came out in early access I'll give them a bit of slack since the game is genuinely fun despite that.\n\nAs I was playing through the game I also had their Discord open on the side to see what others were up to, and as I was going through the game I started to see people talking about how they had already finished the game or discovered all there was to be discovered, which surprised me, surely two days after release people can't be already beating the game? Can they? Well as I continued playing I soon found out that there wasn't quite as much content as I had initially thought, in just 9 hours I had \"Finished\" the game, while there were still minor things left to explore and the game doesn't technically have an end, I had finished all major parts of the game.\n\nWhile the game did indeed turn out to be short that doesn't mean it was bad, what was there was amazing, in fact some of my favorite games are those that are short but what they have are truly amazing, I had an amazing time with it and given that Forever Skies just came out I trust they'll add way more as the updates go on, but if you're planning on getting FS now just be aware of the fact that in it's current state it's rather short.", "timestamp_created": 1687470159, "timestamp_updated": 1687470159, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.595835864543914795", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140787253": {"recommendationid": "140787253", "author": {"steamid": "76561198006577539", "num_games_owned": 0, "num_reviews": 44, "playtime_forever": 213, "playtime_last_two_weeks": 0, "playtime_at_review": 213, "last_played": 1687868509}, "language": "english", "review": "Absolutely fantastic so far.  They have really nailed the atmosphere and I'm really enjoying the progression.  The game is in early access so there is somewhat limited content at this time but they have a real winner on their hands here.", "timestamp_created": 1687868778, "timestamp_updated": 1687868778, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.594883263111114502", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141476440": {"recommendationid": "141476440", "author": {"steamid": "76561198011234478", "num_games_owned": 238, "num_reviews": 9, "playtime_forever": 1610, "playtime_last_two_weeks": 0, "playtime_at_review": 754, "last_played": 1710818059}, "language": "english", "review": "Very chill, it's basically Raft but in the sky. [strike]A little light on content for the price point[/strike], the (incomplete) main story can be finished in about 6-7 hours, but their road map is promising and I'm happy to support the devs at the current price. The first upcoming patch has some great QoL changes coming.\n\nedit: Wanted to come back to this and say this is very worth the price, regardless of the length of the main story right now. There's something just so cathartic about floating around, collecting resources, and building your airship. The first update was great, and the devs are awesome and very responsive to the community.", "timestamp_created": 1688676377, "timestamp_updated": 1690110556, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.587645769119262695", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140517876": {"recommendationid": "140517876", "author": {"steamid": "76561198000086758", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 429, "playtime_last_two_weeks": 0, "playtime_at_review": 88, "last_played": 1688341740}, "language": "english", "review": "Admittedly I'm a little biased toward this game because it fits my image of \"ideal game\": ambient apocalyptic world to explore while surviving on your airship.  \n\nI played the demo long ago and have been anxiously waiting for this EA release.  Similar to the demo, 4k does have issues (the game warns you of this) however simply turning on DLSS still fixes it for me.  \n\nI'm delighted to see this game maintained and expanded on what it previously had, giving me that little bit of faith back that games can proudly wear the early access title and make me proud to have made the purchase.", "timestamp_created": 1687467000, "timestamp_updated": 1687467000, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.580652952194213867", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140566561": {"recommendationid": "140566561", "author": {"steamid": "76561198325578369", "num_games_owned": 166, "num_reviews": 19, "playtime_forever": 529, "playtime_last_two_weeks": 0, "playtime_at_review": 513, "last_played": 1708040509}, "language": "english", "review": "Decent start for an early access. The story content is a little short right now but the gameplay loop is enjoyable. The one thing I wished was there right now though is the option to also make bases on top of buildings", "timestamp_created": 1687542308, "timestamp_updated": 1687542308, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.580419540405273438", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141775724": {"recommendationid": "141775724", "author": {"steamid": "76561198125999812", "num_games_owned": 0, "num_reviews": 23, "playtime_forever": 623, "playtime_last_two_weeks": 62, "playtime_at_review": 315, "last_played": 1713486572}, "language": "english", "review": "Love this game! I'm afraid of heights so being able to die just by falling off is enough danger to keep me in a constant state of fear... which is a good thing hahaha", "timestamp_created": 1689012248, "timestamp_updated": 1689029941, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.579480886459350586", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140933256": {"recommendationid": "140933256", "author": {"steamid": "76561198328438358", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 11436, "playtime_last_two_weeks": 0, "playtime_at_review": 8695, "last_played": 1688241350}, "language": "english", "review": "Great game with some limitations. Visuals fantastic, concept fantastic, playability very, it sucks you in but the depth does not exist atm. The parts that are done I would rate as some of the best I've played. Challenging but not to tedious. I hope in time the water and food systems can be more automated. Building is a way to much fun you can get lost for hours in building your airship. The game just needs to grow my only negative comment oh BTW if you are looking for intense combat this is not for you. Exploration building crafting survival story line are all great but if your a shooter then look elsewhere.", "timestamp_created": 1688077592, "timestamp_updated": 1688077592, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.578544080257415771", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140650264": {"recommendationid": "140650264", "author": {"steamid": "76561197970927532", "num_games_owned": 475, "num_reviews": 18, "playtime_forever": 401, "playtime_last_two_weeks": 0, "playtime_at_review": 401, "last_played": 1687653706}, "language": "english", "review": "First of all, it's really good, in fact a little too good to be true. It’s an extended demo, or a Part 1 of a multi part story. I was having a great time until I reached a point after which I can no longer progress, and I get a Thanks for Playing message, see you in 3-4 months, \n\nThe game is basically Raft, where you float around in a ship and gather floating junk to expand your ship. You land on little islands in the sky for some extra loot and blueprints. It's very enjoyable but the sudden ending left a sour taste. Devs should have stated this is just part 1 of a game that won't be finished for years. I don't like how Raft did it either, and I never returned to finish Raft after the first few chapters,\n\nBut I have to recommend it, because it's a fun few hours.", "timestamp_created": 1687661809, "timestamp_updated": 1687661809, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.575107336044311523", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140515421": {"recommendationid": "140515421", "author": {"steamid": "76561198246428158", "num_games_owned": 234, "num_reviews": 10, "playtime_forever": 1667, "playtime_last_two_weeks": 0, "playtime_at_review": 1140, "last_played": 1709513363}, "language": "english", "review": "You can feel the love and care that has gone into Forever Skies by the Far From Home team. You can easily lose the track of time playing and I can't wait to see how the game develops in the future. As others have said, if you love survival games you'll love this.", "timestamp_created": 1687464052, "timestamp_updated": 1687464052, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.570445060729980469", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "141505781": {"recommendationid": "141505781", "author": {"steamid": "76561197962692786", "num_games_owned": 0, "num_reviews": 160, "playtime_forever": 424, "playtime_last_two_weeks": 0, "playtime_at_review": 261, "last_played": 1688724976}, "language": "english", "review": "Its like raft but better and with an airship. great survival game.", "timestamp_created": 1688715220, "timestamp_updated": 1688715220, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.569230794906616211", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "140619150": {"recommendationid": "140619150", "author": {"steamid": "76561197976641472", "num_games_owned": 347, "num_reviews": 25, "playtime_forever": 1020, "playtime_last_two_weeks": 0, "playtime_at_review": 1020, "last_played": 1687616831}, "language": "english", "review": "**Early Access Release Review**\n\nThis game has soo much promise.  I really do wish they waited to release this when they had more content in the game.  As I want to play more, but there is nothing left to do.  I'm still glad with my purchase, there just isn't enough content for the price.\n\nI finished the playable story at about 10 hours in, then spent the rest of my time getting all the upgrades, building everything and upgrading my balloons as big as they could be.  Played around with multi tiered ship building, got to a point where I had a pretty self sustainable  set up and then sadly ran out of things to do.\n\nI can already tell that when the 4 player mode comes out the game will be much more fun especially once the next plot progression is released.  I can't wait.\n\nHere are some things I wish they would update though....\n\n1.)  Make the compass device be a discoverable map device.  In that it shows you where you went and what you've seen (black out areas you haven't been to, color in areas you have).  I missed one storage container upgrade early on, and after spending an hour trying to back track to find it... I gave up.  If the world was more notable I wouldn't ask for this, but half the time you can't see due to a storm or it's dark, or it's the same looking area as places you been before... you get my drift..\n\n2.)  Allow us to que up multiple crafts of the same craft at a time.  When you have to make 20 plastic scraps and you can only make them 1 at a time, it takes you out of the game play and makes it less fun, not to mention has you ending up having to eat and drink due to the time passed.  (This could also be done with and upgrade to the processor if you didn't want it to be something anyone can start out doing)\n\n3.) Some crafts (like Polimer) have no animations, they just sit on the finished product image until it's done, then rotates. (I'm sure this will be fixed, just listing everything I found)\n\n4.) Voice acting to the notes.  I want to get immerse in the lore of the game, but some times I'm in say the under ground and am running out of air, or not wanting to sit around while my thirst and hunger are ticking away,  being able to que up the note for a Voice Actor to read it out would help me stay in the moment instead of having to stop and read on a screen that prevents me from continuing to play.  Same goes for the  notes you get for scanning something.  Having a voice actor (say the scanning device's programmed AI Voice?) tell me the info I just scanned instead of having me hold the tab button, stop playing, open a new screen, read the note, that's buried in this huge menu (which itself has bugs), then exit out of it just to keep playing bit of a buzz kill.\n\nAll this said... I am not disappointed in my purchase.  I will be eagerly waiting the next updates.  But in the current state of the early access, I would not advise others to get this game yet, unless they want to support the developers.  There really isn't 30$ worth of content here.", "timestamp_created": 1687618458, "timestamp_updated": 1687618458, "voted_up": false, "votes_up": 22, "votes_funny": 0, "weighted_vote_score": "0.569113969802856445", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "148743641": {"recommendationid": "148743641", "author": {"steamid": "76561198983922106", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 1472, "playtime_last_two_weeks": 0, "playtime_at_review": 1470, "last_played": 1704540872}, "language": "english", "review": "Great start. Hope to see way more in future. Mechanic of building and upgrading your ship is amazing, but I would love to be able to build my own outpost with all sorts of resource farms, residents that can be used as party members for quests outside of outpost and a deep interaction with these residents. That would take this game to the next level and make it even more interesting and interactive.", "timestamp_created": 1698080303, "timestamp_updated": 1698080303, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.565217375755310059", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "144531401": {"recommendationid": "144531401", "author": {"steamid": "76561198035532489", "num_games_owned": 215, "num_reviews": 8, "playtime_forever": 831, "playtime_last_two_weeks": 0, "playtime_at_review": 831, "last_played": 1692402408}, "language": "english", "review": "I love the concept of this game. For $30 though I thought I would get more game play. As it is, you can \"finish\" the game in less than 12 hours. Its a very interesting concept, but needs some changes and additions. When your coming in for a landing you have no clue of your actual height so can damage your ship if you dont go slow. The inventory  storage is pretty bad. Modifying you ship is clunky. I love where this is going, but its not there yet.", "timestamp_created": 1692411687, "timestamp_updated": 1692411687, "voted_up": false, "votes_up": 14, "votes_funny": 1, "weighted_vote_score": "0.565055668354034424", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159359759": {"recommendationid": "159359759", "author": {"steamid": "76561198004235940", "num_games_owned": 623, "num_reviews": 73, "playtime_forever": 992, "playtime_last_two_weeks": 0, "playtime_at_review": 780, "last_played": 1712019093}, "language": "english", "review": "Updated Review: Given the last changes and how the devs are continuously updating the game, I would recommend the game.  Forever Skies is a great little exploration game with lots to find, lots to build, and a really unique take to the genre.", "timestamp_created": 1708994575, "timestamp_updated": 1711177389, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.564896762371063232", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1710866554, "developer_response": "Hey there, our latest update is currently live on our beta branch and has a bunch of new content.\n\nPlease consider giving it a try when you get the time and let us know your thoughts!\n\nStill many updates to come before we leave Early Access :)"}, "140517211": {"recommendationid": "140517211", "author": {"steamid": "76561198053420350", "num_games_owned": 587, "num_reviews": 20, "playtime_forever": 742, "playtime_last_two_weeks": 0, "playtime_at_review": 111, "last_played": 1689959407}, "language": "english", "review": "Around 1h in, I had a full inventory. Went to make a box... it has a tiny amount of space. WHY? you're encouraged to gather resources, everything costs 20-30 of a thing (but stacks are 50 >.<)... stacks need to be made much bigger, the inventory needs to be bigger, the storage boxes need to be three times the size to start with. Frustrating.\n\nEdit: Roughly 8ish hours in, Finished the story as it currently stands. I like the gameplay loop, I can see how it can be a game to replay and build massive airships and explore and decorate. \n\nThe inventory management issue persists up to \"mid?\" game. There are definitely great improvements - the big boxes, the shelves that allow you to stack two of the boxes... but I had 4 of the big boxes filled with (realistically) random junk that I had to keep around because building more things. \n\nThere needs to be a kind of low-efficiency/free power for the chargers, or upgraded versions with massive batters. Or rechargeable batteries that can be switched out. Taking the lifts into the underdust and wanting to use the extractor is frustrating because you have to return several times to recharge if you want to harvest everything. Same with the builder. There's windmills all over, why can't we have one?\n\nI would like a bit more transparency in the tech tree - unless I missed it there's no \"this could be unlocked, go to these sorts of places to find!\" guide, just a general \"you've scanned X% of this type of structure\"\n\nMore variety in the ruins would be nice, though for EA this is decent (Underdust aside, both that I visited were extremely similar) \n\nOverall, I finished the current story, spent another couple of hours grinding for materials, getting some exploring in... had fun!", "timestamp_created": 1687466182, "timestamp_updated": 1687647531, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.562841534614562988", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}}, "query_summary": {"num_reviews": 39, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 2120, "total_negative": 262, "total_reviews": 2382}, "cursors": {"AoIIPwFtbnue0ekE": "Mon Apr 22 23:47:54 2024"}}
