{"reviews": {"159498797": {"recommendationid": "159498797", "author": {"steamid": "76561198043442363", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 27653, "playtime_last_two_weeks": 0, "playtime_at_review": 27653, "last_played": 1544995791}, "language": "english", "review": "This game was awesome, the concept was amazing, progression was great, gathering, crafting, combat, everything was great, but it was too dependent in having a full team vs each other. \n\nSome mistakes killed the game and I'm not sure what cause the devs to abandoned it, It's a shame it didn't work out.\n\nI still think of Rend as one of the best games I played till this date, and some of the most fun I had with my friends in a video game.", "timestamp_created": 1709159343, "timestamp_updated": 1709159343, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "43906284": {"recommendationid": "43906284", "author": {"steamid": "76561197989040042", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 13262, "playtime_last_two_weeks": 0, "playtime_at_review": 561, "last_played": 1535580700}, "language": "english", "review": "    I am a disabled gamer, and I play games with voice commands and a headmouse since I can't use my hands or fingers I have a few buttons on my wheelchair since I'm paralyzed from the neck down including mouse buttons which I push with my wrist so I really need a fully cutomizable key config ...the first thing I noticed thats keeping me and alot of my disabled and abled body friends from playing is that the mouse cannot be configured with the keyboard keys and vice versa! Although it's not a problem for my abled bodied friends they got refunds since I couldn't play with the clan! My thoughts that may help correct this is to add two harvesting keys like: \nleft harvest key\nright harvest key\nthat way the mouse keys can be configurable for those who need to adjust them like myself! << this would get me to buy the game again and all my friends that want to play with me in the disabled community!\n\n     Also the bow has to be aimed down the sights to fire but the crossbow doesn't which makes the bow virtually impossible for me to tame or do combat with,  If the bow could shoot from the hip with maybe a small reduction in accuracy, or ad the aiming process to the left click or make it fire like the crossbow just slower... that would make taming possible for me or maybe you could add some spirit bolts for the crossbows which at that point the ads for bows wouldn't be such an issue for me and other disabled gamers... I really like the game and recommend it for my clan and friends thanks in advance! looking forward to playing this again!", "timestamp_created": 1533287775, "timestamp_updated": 1533287775, "voted_up": true, "votes_up": 743, "votes_funny": 71, "weighted_vote_score": "0.911103427410125732", "comment_count": 25, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44302521": {"recommendationid": "44302521", "author": {"steamid": "76561198020728468", "num_games_owned": 0, "num_reviews": 113, "playtime_forever": 13243, "playtime_last_two_weeks": 0, "playtime_at_review": 12101, "last_played": 1536098633}, "language": "english", "review": "After playing two full 'cycles', griefing was quite commonplace. Everytime, the game mechanics offered me no real countermove besides shooting my own faction (and thus being penalized, for defending myself!). Losing factions tend to become inactive. So I've experienced several times how my own faction was in fact the most dangerous enemy and my own base the most dangerous place in the game. I was elder in both games too. If you're wondering wether that gave me more options, you obviously don't know where this review is going. The outcast system is entirely toothless. The team damage mechanics are easily gamed and exploited in favor of the griefer, even without making more accounts or calling in fellow trolls.\n\nWhy is there team damage inside the faction base at all? Shields are up, the enemy cannot attack, why is it even an option for 'allies'? \n\nLikewise, why are there three elders? Why does the game assign them, rather than the players? Why do the players assign outcasts, rather than the game? Regulation or agency, pick one.\n\nBut the worst part is that these problems are unfixable. All additions so far have turned out to contain loopholes that end up hurting more than they help. The relevant mechanics are poorly conceived at the core and the resulting game is stuck halfway between true regulation and true player agency, ending up with the worst of both worlds: a system that appears to protect you, but is easily exploited and likely to cause you and your faction more damage and setbacks than if there had been no system at all.\n\nEdit: I forgot, but there's actually one more nail in the coffin of this horrible system: allies will be able to see you through walls even as they kill you. Allowing advanced 'allied' players with crystalline arrows to spawnkill you over and over inside your own base or any clan base you might have available to hide in. You can't see enemies in any similar fashion. So crystalline arrows are considerably more useful for teamkilling than any other application!\n\nThis is the extent to which the developer has not anticipated griefing and is helpless to stop it.", "timestamp_created": 1534894100, "timestamp_updated": 1535060714, "voted_up": false, "votes_up": 130, "votes_funny": 5, "weighted_vote_score": "0.884490251541137695", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "49850564": {"recommendationid": "49850564", "author": {"steamid": "76561197978825084", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 108535, "playtime_last_two_weeks": 0, "playtime_at_review": 108221, "last_played": 1584732017}, "language": "english", "review": "This game is not full release. Dev team moved on to new project and just slapped a \"out of EA\" label on this game. \n\nstay away its only half finished.", "timestamp_created": 1553952581, "timestamp_updated": 1553952581, "voted_up": false, "votes_up": 147, "votes_funny": 12, "weighted_vote_score": "0.881398499011993408", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "76669083": {"recommendationid": "76669083", "author": {"steamid": "76561198107606058", "num_games_owned": 135, "num_reviews": 19, "playtime_forever": 7906, "playtime_last_two_weeks": 0, "playtime_at_review": 7906, "last_played": 1550752470}, "language": "english", "review": "Bring back REND!!", "timestamp_created": 1601227330, "timestamp_updated": 1601227330, "voted_up": true, "votes_up": 108, "votes_funny": 1, "weighted_vote_score": "0.853662490844726563", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "88036654": {"recommendationid": "88036654", "author": {"steamid": "76561198046018318", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 6700, "playtime_last_two_weeks": 0, "playtime_at_review": 6682, "last_played": 1684526960}, "language": "english", "review": "GIVE US THE ABILITY TO HOST AND PLAY OUR OWN SERVERS IF YOU'RE JUST GOING TO NEVER TOUCH THE GAME AGAIN \n", "timestamp_created": 1615143073, "timestamp_updated": 1615143073, "voted_up": false, "votes_up": 53, "votes_funny": 0, "weighted_vote_score": "0.843098282814025879", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43959724": {"recommendationid": "43959724", "author": {"steamid": "76561198044737808", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 764, "playtime_last_two_weeks": 0, "playtime_at_review": 762, "last_played": 1533735618}, "language": "english", "review": "I bought this game hoping to see cooperative faction pvp. Instead, I saw one alpha guild that just steam rolled over everyone, stole our materials, built their own base, starved us and told us to go out and find our own resources, and left us to die during reckonings. Then we found out there's a Frostkeep developer and his wife in the clan and they're abusing their insider knowledge to ban people and skirt the rules.\n\nWould appreciate a prompt refund if this is how this company does business.", "timestamp_created": 1533535377, "timestamp_updated": 1533535377, "voted_up": false, "votes_up": 797, "votes_funny": 96, "weighted_vote_score": "0.824234247207641602", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "43906591": {"recommendationid": "43906591", "author": {"steamid": "76561198046010977", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 2635, "playtime_last_two_weeks": 0, "playtime_at_review": 1760, "last_played": 1535052498}, "language": "english", "review": "****FULL REVIEW**** ******UPDATED REVIEW AT THE END******\n\nHere is my in-depth review for those who may find it useful:\n\nPros:\n- its different - in a world full of similar games and battle royales, this game is a breath of fresh air\n- For an early access game it runs better than most games i've played at launch\n- Its got a huge PVE element and huge PVP element\n- There are multiple ways you can play this game and that intrigues me. \n\nCons:\n- Yes there are currently an abundance of  trolls and griefers (will talk more about this shortly)\n- There are minor bugs i've found, most have been fixed with a quick restart and never frustrating\n- Yes the UI is a bit 'dull' and doesn't have some advanced features, but will talk more on this in a moment. \n- It is a grind heavy game, but that is only a con if you don't enjoy grinding (will talk more shortly as well). \n\nA bit about me, i'm 25, PC gamer for 10 years and console gamer for a long time too. I don't have a favourite genre of games and enjoy giving everything a try. I've put in about 15 hours into this game so far.\n\nThis game for me is amazing, its so addicting. When i first got my hands on this game it was 2300 and i had work at 0700. Me and my partner decided to play for an hour before bed to try it out. We went to bed at 0500......work was bad that day!\n\nSo lets talk about some of the Cons, cause if you are reading this review you are probably trying to see if this game is for you, and you are most interested in 'why shouldn't i buy this'\n\nSo firstly, trolls and griefers. Yes at this moment in time it is a big issue with this game. I have had random friendlies start shooting me randomly for walking past them, when challenged they gave me a world of abuse in chat. All i could do is just /report them and go on my way. I have also encountered people who are purposely not playing this game as multiplayer and just playing solo, the issue with this is you need to work as a team of 20 upgrading the main base to have a chance of winning. \n\nNow fair enough to those players, this game came out 3 days ago, not everyone knows how to play this game correctly yet. So the next type of troll is actually members of the game who ARE playing it correctly, shouting and swearing and abusing people in chat for not helping the team, rather than giving helpful advice.\n\nThe last bit of trolling i have heard of but not experienced is people making second accounts, making a second char on your enemies team, then getting a butt ton of intel for your team, and also destroying items and bases from the inside. \n\nYES this issue does need to be resolved. However, i love the fact that is happening. One of my favourite games ever is EVE online which i played for 5 years. What i loved about that was it had a feel of 'Anything goes'. I like the fact that you have to always be on edge with this game. AND TO NOTE, there are ways to get around the trolls. Here are some of the things you can do:\n\n- If you get shot by a team mate, you can attack them back and kill them and not lose rep, so is someone going round killing team members? well group up and keep murdering that numpty till he quits the server...\n- If you get a spy dumping items: create a separate base at the back of the main base. In that base have all the main storage boxes for the team. As you speak to and learn to trust the non-spys in your team, give them access to that vault. doesn't it sound fun to have to find spys and eliminate them? Also how fun does it sound to try and be a spy and gain someones trust?\n- Got someone being rude in chat? Just report/block/ignore them. The worst thing is to reply back, there is nothing you can say that will stop the barrage of abuse, and if you just ignore them they get bored quick....\n\nSo lets talk about the UI. Yes it is a bit simple, and there are a lot of things missing. For example a lot of people are crying for a 'sort' button in the inventory, or a button to quick move items across without having to click and drag. But guys this is an early access game, there will be 'simple' things missing. But that's the beauty of an early access game, rather than just complaining in chat, get an account with the official game forums, give them constructive feedback, and watch as the game slowly becomes better thanks to YOU! \n\nSo yes this game IS Grind heavy. But that isn't a bad thing. It gives me such a feeling of accomplishment to level up a skill, or from grinding mats and making loads of simple bows, now being able to make a awesome one for everyone. If you don't like grind heavy games and you just want to pew pew and kill some people after dropping from a bus and doing some dances, well you know what game to go back to...\n\nLast thing i want to talk about is why i love this game so much. It is a game where you can be what you want to be. Want to just farm resources and build a huge ass base for your team? You can do that. Want to become a master crafter in weapons, armour, cooking etc and then be the main supplier to your team of amazing gear? You can do that. Want to level up your character, go out into the wilderness, kill huge pve monsters and gank enemies trying to farm some wood, harvest their souls as your bounty and contribute to your team winning overall? Hell yeah you can do that. Yes granted, you do need an even split of all these types of roles. If everyone on your team just wants to PVP, you aren't going to have a base and will lose. However, there are so many servers, official and private. Go into several, find a group of people you gel with and crack on!\n\nOverall guys if you have actually read this whole review you are clearly interested in the game. The game is currently £23 and be honest with yourself, you've probably spent more money on a takeaway before. Your clearly interested in it, don't worry about the negative nannys, pick up this game, try it yourself, If you are anything like me you won't regret it.\n\nAnd worst case scenario if you aren't happy with the game right now, its early access, it will change weekly, in 2 months it may be completely different. \n\nHope this has been helpful! From my time in the game i feel pretty knowledgeable so far so any questions just leave a comment ^_^\n\nFowl_play_gaming\n\n(find me on twitch.tv/fowl_play_gaming for regular streams of this game)\n\n***UPDATE***\n\nSo i'm now almost 30 hours in, all of my above review still stands and wouldn't change the review. I just wanted to add something.\n\nSo this game is A LOT about which server and team you choose. I mentioned in my review you need to server hop and find people you gel with. THIS IS SO IMPORTANT. Me and my partner were loving the game, but the team we were playing with were not working together and was a bit toxic, so simply we switched to another server and another team, we found one who used discord, was super helpful and friendly.\n\nThis meant when ever i needed help i have 6-10 people helping me with one job! It meant i have been given more flavour of the game by going on raids with them. And for the reckoning we even had 20 people online, all in discord working perfectly together!!\n\nI understand this is probably a lucky find.... But i should say that clearly the right people are out there in the right servers who want to play this game for its full potential like me :) However you just have to find them!! \n\nAny more questions please let me know :) Also thank you to the people who have followed my twitch channel after reading this review, its very much appreciated!\n\n- Fowl_play", "timestamp_created": 1533289327, "timestamp_updated": 1533553692, "voted_up": true, "votes_up": 138, "votes_funny": 6, "weighted_vote_score": "0.818934798240661621", "comment_count": 12, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "69876093": {"recommendationid": "69876093", "author": {"steamid": "76561198140955178", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 3692, "playtime_last_two_weeks": 0, "playtime_at_review": 3692, "last_played": 1573142817}, "language": "english", "review": "Please Bring it Back", "timestamp_created": 1590562130, "timestamp_updated": 1590562130, "voted_up": true, "votes_up": 68, "votes_funny": 3, "weighted_vote_score": "0.815656840801239014", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "53517036": {"recommendationid": "53517036", "author": {"steamid": "76561198060473620", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 1748, "playtime_last_two_weeks": 0, "playtime_at_review": 1748, "last_played": 1555552239}, "language": "english", "review": "Abandoned Game. DONT BUY.", "timestamp_created": 1562247747, "timestamp_updated": 1562247747, "voted_up": false, "votes_up": 48, "votes_funny": 3, "weighted_vote_score": "0.796937048435211182", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43959635": {"recommendationid": "43959635", "author": {"steamid": "76561198006346302", "num_games_owned": 520, "num_reviews": 8, "playtime_forever": 908, "playtime_last_two_weeks": 0, "playtime_at_review": 908, "last_played": 1533410464}, "language": "english", "review": "Before I start, I'll point out that I received this game for free as a partnered alpha tester.\n\nSo Rend is a team based survival PvP game, with some cool features, but a lot of dreadful design problems.\n\nPersonal progression is separated into 3 different areas: main character level, which unlocks class perks. There are currently 4 classes to choose from. This style of progression lets you unlock perks that give access to spells and quality of life buffs.\n\nThen there are the \"skill\" trees. If you want to gather more from bushes, you're learning Botany, if you cut a lot of logs, you get woodcutting experience etc. Everty so many levels you get a choice of two perks to lock onto your character. Most of the time the choice is easy to make as one perk is inherently just useless...\n\nThe third is ascension perks. Points for this progression seem entirely random. On one character I was ascension 5 by regular level 4, on another I reached level 12 before my first ascension point. Although you can get more points at the end of a game.\n\nCharacter progression is very grindy, and promotes players taking on specific jobs - no use in all 20 mastering woodcut after all.\n\nTo craft more gear, a team needs to work together to research specific areas of progression, and for me this is where most of the problems are.\n\nEven if your team researches something specific, such as bows, then to craft that tier 5 bow, an individual player still needs to craft tiers 1-4 personally. This unfortunately promotes resource waste.\n\nGriefing is far too easy. I will not list things here as I don't want to help spread it. But it's far too easy for players to ruin each other's fun.\n\nBetween Reckonings you will rapidly run out of things to do. You spend all of your time fortifying and preparing for the Reckoning. The Reckoning itself is incredibly fun though, everyone's shields are dropped and you're attacked by waves of creatures and then sit with no shielding for an hour. It's quite spooky!\n\nBut, the between time is lacking... There needs to be some sort of PvE event that allows a team to trigger a Reckoning at another faction's home. It would let players control PvP events, as full scale raids aren't possible which shields are up.\n\nFinally, possibly one of the biggest issues I have noticed is balance. Not genuine game balance, each team gets the same gear (with a unique resource in their area). The balance issue is in being able to pick a team.\n\nI can pick a server, make a character on one team, check out what they have, delete the character and check out another team.\n\nI can do this until I see who the most powerful group is. And I feel this is happening a lot. On most servers during non-peak times you can see one or two teams heavily outweigh the other.\n\nDo I think Rend was ready to leave Alpha? Not by a long shot.\n\nBut it does have a lot of potential. The problem is that it's being held back by some pretty damaging design flaws that are putting a lot of players off. If these were fixed, and more content beyond fortifying was added, this game could be awesome.\n\nOf course, this is just my opinion, but right now I wouldn't personally recommend this game. Wait until it's further along in its development cycle.", "timestamp_created": 1533534824, "timestamp_updated": 1533534824, "voted_up": false, "votes_up": 114, "votes_funny": 2, "weighted_vote_score": "0.796670615673065186", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44178823": {"recommendationid": "44178823", "author": {"steamid": "76561198053418143", "num_games_owned": 76, "num_reviews": 7, "playtime_forever": 13356, "playtime_last_two_weeks": 0, "playtime_at_review": 13320, "last_played": 1534857894}, "language": "english", "review": "I want to like Rend, I really do. It's exactly the kind of game I would normally enjoy playing. However, it falls way short in many areas and unfortunately a lot of those areas are in the core game design so I don't see much hope for the future.\n\nThe first major issue is population. Each server has max 60 pop, 20 per side and anyone else trying to get on is put in a queue. This design obviously has issues. The objective of this game is to get 100k spirits so it's a bit like a race. Now imagine a rowing competition where you have 3 boats; one has 10 players, another one has 5 and the last one has 15 - which one do you think will win? So, if you are serious about winning you're probably going to have to be continuously advertising and recruiting (wow so fun).\n\nSecond issue is communism. This game is all about teamwork. You are expected to share everything with a bunch of strangers, including the workload. You can probably see how this might create an unfun experience for casual players. If you just want to build a nice little personal base and contribute absolutely nothing you can expect people to get mad at you. On the other hand if you are a competitive player and want to win you will probably find that not everyone shares your style of play and that can also be very stressful. Just like group projects in the real world right?\n\nThirdly and perhaps most crucially, this game is basically cookie clicker 2.0. 90% of your time in Rend will be spent doing mundane repetitive clicking tasks. That other 10% is wasted time where you should have been clicking on stuff. The win condition of the game is literally to click on floating blue things 100,000 times! The 2 most important things for faction progress are sparks and spirits. Red sparks = clicking on trees, blue sparks = clicking on ores, yellow sparks = clicking on rocks, purple sparks = clicking on plants. There you have it, thats this game in a nutshell. Oh you thought it was about PvP? Sure you can spend your time running around enemy lands but have fun falling massively behind in research and contributing nothing to the main win condition.\n\nPersonally I can live with mundane repetition, many games thrive on that sort of thing. This game however fails to properly create that virtual sense of reward that comes with it. Everything you do is for the benefit of the faction, that is supposed to be your \"reward\". Thanks Stalin, that makes me feel really good about myself... not.\n\nSo there you have it, if you enjoy playing cookie clicker and being forced to share everything with people you hate then this game is for you. If you are a casual player or a competitive player without a big premade group (of robotic people) then I would steer clear of this game.", "timestamp_created": 1534388179, "timestamp_updated": 1534388179, "voted_up": false, "votes_up": 123, "votes_funny": 14, "weighted_vote_score": "0.787923097610473633", "comment_count": 15, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "51415305": {"recommendationid": "51415305", "author": {"steamid": "76561198131392657", "num_games_owned": 95, "num_reviews": 6, "playtime_forever": 2207, "playtime_last_two_weeks": 0, "playtime_at_review": 2204, "last_played": 1596593787}, "language": "english", "review": "I mean this review is really tricky to write. On one hand I absolutely love this game. The progression system and pvp are really fun and the fact that you are always playing with the same people for weeks is a great way to make really good friends. But sadly on the other hand this game is kinda dead. I wish Frostkeep would advertise this game more because it was super fun when I was playing it, but at the moment just no one plays it. I think I'm most likely going to give this a good review but I would warn anyone new to the fact that this game is kinda dead. I really just hope that it becomes popular because this game was so much fun.", "timestamp_created": 1561344776, "timestamp_updated": 1561344776, "voted_up": true, "votes_up": 47, "votes_funny": 1, "weighted_vote_score": "0.786855876445770264", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "44336205": {"recommendationid": "44336205", "author": {"steamid": "76561197972635969", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 3670, "playtime_last_two_weeks": 0, "playtime_at_review": 3670, "last_played": 1535236517}, "language": "english", "review": "Rend is best described as a game full of promise that fails miserably in it's execution. In my 30 years of gaming, this game is absolutely the one I [b]want[/b] to match the description, but it's own core design problems get in the way.\n\nRend takes elements from the MMO and survival sandbox genres, and tosses them into a competitive team vs team arena with a definitive end-point. It has some of the best attributes of all of its inspirations: leveling, class archetypes, open-world base building, creature taming, PvP, technology trees, and more. It pairs three factions against each other, in a 20v20v20 faction setup that promises to include political maneuvering both globally and within your faction, and ensures that if one side gets too dangerous the other two can keep them in check. It's everything you'd want your typical sandbox survival game to be.\n\nWhere it fails is in the execution. Where there should be a complex battle between three balanced factions, instead we see one pre-formed clan absolutely decimating two groups of random strangers. They allow you to choose your faction, without restriction, so clans are populating an entire side with strong organization from the moment a cycle begins. There is no balancing between the factions themselves, so said clan is often paired up against two factions comprised of solo players or small groups with little to no interaction prior to joining the server, and this quickly forces some poor sap into the role of a psuedo guild recruiter as they desperately attempt to get things organized. However, there are no catch-up mechanics, so as soon as your faction falls even a day behind  it's likely you will spend the next 3-4 weeks watching a loss play out in slow motion. Within days this leads to the losing factions abandoning the server out of a complete lack of hope and desire to play, which in turn diminishes the enjoyment for the victor as it they spend the remainder of that cycle grinding out a win with little to no interaction. This is as big a lose-lose scenario as you can find, with neither the winners or the losers getting to enjoy the experience the game describes. \n\nAs I write this review, I am looking at the server selection for all of the official North American West servers. Only two have more than 8 people on total, with the majority sitting at one faction with 2-3 players and the others at 0, and almost all of the servers are less than a week into this cycle. Without a method to balance the factions the population has all but disappeared, and every server feels like a ghost town.\n\n[b]Pros:[/b]\n[list]\n[*]Great graphics\n[*]Smooth gameplay\n[*]Dynamic experience, with a variety of activities to choose from.\n[*]Concept full of potential\n[/list]\n[b]Cons:[/b]\n[list]\n[*]Completely unbalanced teams, allowing for pre-formed groups to compete against groups of strangers and skews the battle almost immediately.\n[*]No method of catching up as soon as you are behind, so you have to choose between losing over the course of a few weeks or giving up entirely.\n[*]The developers have addressed the future plans for this game as of two days ago, and balancing the factions is not even an agenda item. Little to no hope of this changing any time in the near future.\n\nAll-in-all, Rend could be a great game. Right now it's not, because of flaws in the game design when it comes to faction balance. While they haven't addressed this concern yet, if they ever do I would absolutely recommend taking a look.", "timestamp_created": 1535047422, "timestamp_updated": 1535047594, "voted_up": false, "votes_up": 63, "votes_funny": 3, "weighted_vote_score": "0.785394430160522461", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "49523131": {"recommendationid": "49523131", "author": {"steamid": "76561198190868926", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 7260, "playtime_last_two_weeks": 0, "playtime_at_review": 6547, "last_played": 1552150880}, "language": "english", "review": "amazing game idea, i recommend the GAME IDEA, but i do not recommend the game at this time. currently, they have new servers coming out every week, so you are lucky to get a week and a half out of players before they jump ship and the server becomes a 2v1v0 and they switch to the new 5v3v2 server lol (not a lot of people playing it currently, probably for this reason alone. i know i am 1 of them)\n\nthis game could be a masterpiece. they could introduce farming and fishing, make it expanded upon the current map size where u just walk left or right for 5 minutes and find the enemy base to actual continents per faction. \n\nlots of pets to capture, lots of trade skills to work on, lots of animals to hunt, this game has a lot going on, but it dies out fast after your first week because then your faction becomes empty because they hop to the new server. \n\ni can not recommend this game until they change it to 1 month per new server, or reset all the servers upon release. (while also resetting ascension points and stables that carry over from server to server)\n\ni will be waiting for this game in the future. still 1 of my favourites, but i just cant put any more time into it knowing it has a lifespan of 1 week any time u make a character.", "timestamp_created": 1552426073, "timestamp_updated": 1552426073, "voted_up": false, "votes_up": 39, "votes_funny": 1, "weighted_vote_score": "0.773097753524780273", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "45906464": {"recommendationid": "45906464", "author": {"steamid": "76561198036003331", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 50206, "playtime_last_two_weeks": 0, "playtime_at_review": 36811, "last_played": 1551610500}, "language": "english", "review": "Anything less than 50 hours and you haven't even played once all the way through a saga. The game was hugely popular on release and showed tons of promise. Most of the initial wave of players were super addicted and enjoying the game. Part way through Early Access the game went through growing pains when the under powered servers were completely and totally overwhelmed. Since then the dev team has been taking hundreds of minor bugs/balance changes in play style and ingame mechanics and items. Recently the devs added two new modes and implements several sweeping changes. Hardware upgrades are in progress. The game has a super active dev team that is working to bring the game to a level where stable competitive play is not only possible but entertaining.", "timestamp_created": 1542675952, "timestamp_updated": 1542675952, "voted_up": true, "votes_up": 47, "votes_funny": 3, "weighted_vote_score": "0.763342559337615967", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44536439": {"recommendationid": "44536439", "author": {"steamid": "76561197998644275", "num_games_owned": 51, "num_reviews": 16, "playtime_forever": 40033, "playtime_last_two_weeks": 0, "playtime_at_review": 34101, "last_played": 1584847588}, "language": "english", "review": "250 hours played >500 steam hours logged.  I cannot recommend this game in its current state.  There are too many bugs that take up hours of time due to lost resources, kits, pets, etc..., all for every saga to end with a few people from one faction forced to grind spirits alone just to reward those who quit days or weeks ago with the rewards they didn't earn.\n\nThere are dozens of servers with less than 10 people online (all factions combined), this leads to a complete lack of PvP.  This lack of PvP leads to a very boring grindfest with no thrill or adventure.  This is after the largest patches that changed the spirit system, which was meant to encourage PvP.  The huge amount of official servers combined with the enormous amount of private servers leaves the average server population far below the 20 v 20 v 20 cap which means increased grinding and decreased PvP.\n\nThe taming system, while potentially better than ARK's, is so imbalanced a single player can skip to end game high level pets with no time investment or skill.  There are numerous taming items that are non-functional, lack any tool tips, and are unnecessary.\n\nThe building system is completely limited and only provides square pieces and one triangle so structrue design is boring and small.  The crafting system is extremely complicated with some items such as a bow taking 8 different items from different professions to craft.  This in itself isn't bad, but there are many items that aren't even in the game yet leaving entire professions unable to craft their items.  \n\nThe personal crafting stations function magnitudes faster than the faction stations which force players to utilize personal/clan bases instead of the faction.  The lack of control for storage also forces players to avoid the faction base.  A complete lack of faction control leads to an endless stream of trolls with the freedom to grief entire factions with little to no repercussion.\n\nThe class system is so imbalanced only one class is viable for PvP (Assassin), only one class is viable for farming(Pathfinder), and the other two classes are useless unless paired with the afformentioned(Shaman/Warlord).  \n\nThe research system is also unique but again extremely imbalanced.  On three seperate sagas we managed to unlock the last level of one tree while other trees were still only in the 2nd stage.  The XP and faction rep rewarded is also imbalanced due to this skew, causing those who wish to help their faction to be punished and fall behind.\n\nThe server host is abyssmal.  Constant disconnects and lag spikes lead to poor PvP experience, unwarranted deaths from falling into holes or off of map, and frustration. \n\nDeveloper response is minimal at best.  After sending 90% of their team to a gaming convention the week they launched, there was no communication regarding numerous game breaking bugs, exploits, and server issues.  \n\nThere is no end game content.  No bosses to fight, areas to explore, advantages to be gained, nothing.  \n\nDon't waste your time with this one, at least not until it is out of EA.  The graphics are nice, and the theory is unique and could be fun if they figure out how to implement it.  But as it stands, the current state is boring, buggy, and unpopulated.", "timestamp_created": 1535915433, "timestamp_updated": 1535915869, "voted_up": false, "votes_up": 62, "votes_funny": 2, "weighted_vote_score": "0.760406494140625", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "99920329": {"recommendationid": "99920329", "author": {"steamid": "76561197997600653", "num_games_owned": 190, "num_reviews": 14, "playtime_forever": 1134, "playtime_last_two_weeks": 0, "playtime_at_review": 1134, "last_played": 1538603863}, "language": "english", "review": "This game is a total scam. The devs took down all servers and this garbage is still up for sale on Steam. Shame on the devs and shame on Steam for allowing this.", "timestamp_created": 1632548840, "timestamp_updated": 1632548840, "voted_up": false, "votes_up": 36, "votes_funny": 0, "weighted_vote_score": "0.758257508277893066", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43857765": {"recommendationid": "43857765", "author": {"steamid": "76561197993503758", "num_games_owned": 460, "num_reviews": 12, "playtime_forever": 12850, "playtime_last_two_weeks": 0, "playtime_at_review": 5592, "last_played": 1566884990}, "language": "english", "review": "I realy love this game and recommend it but overall game needs some improvements in UI and gameplay.\nIts good game for ALPHA dont know about 30$ price and EA. Still needs some REALY needed improvements ( I just dont get it guys, is that SOOO hard to make a freaking SORT button for inventory? Even in alpha its sooo annoying and you only need to spawn a button and write 2 rows of code, do you even try out you UI?)\nTHIS IS NOT ARK, RUST, CONAN EXILES ITS DIFFERENT.\n[h1][-][/h1]\n[b]1. No tutorial.[/b]  \n I played almost in all survival games and still I spent 2 hours to learn how to cook meat in campfire (UI is awfull). There is no tutorial overall, because of that people playing in this like in solo game. This is TEAM based survival game, yes there is personal bases but they made for making outposts in some dangerous places.\n[b]2. Personal bases.[/b] \n As I said before - people playing in this like in solo game but its wrong way. To unlock new tiers of everything you must upgrade main base. To win this game you must collect 100 000 souls (in 1 run you max can collect only 20). \n[b]3. Thiefs and trolls.[/b]  \n You found a good group of guys that helps you with main base, you farm stuff to upgrade main base aaaand some solo players just steal everything and build their own personal bases. Cause they dont know that its team-based game and there is no tutorial.\n[h1] Dear devs make personal bases only for high rep people in faction, this will solve almsot all problems! [/h1]\n[b]4. UI - its awfull. [/b]  \n No inventory sorting, there is a button on campfire thats says \"OFF\", but when u press it, it turn campfire ON, cause of sound and effect bugs I wasted 2 first hours in game dying from starving and trying to cook some meat in turned off campfire.\n[b]5. Bugs and lags. Bad netcode (for now) [/b] \nYes its early alpha, yes it got tonns of bugs. There is always desync from the server, u always stuck in some stone that does exist on the server but not on clientside. You trying to collect some resources but they are not collected cause of desyc, on client-side u have them, but on the server side - no. To fix that u need to leave location and let it be downloaded again. PVP is sooo hard cause of the desync and teleporting ppl.\n[b]6. Useless pets.[/b]  \nIts reeeeeeeeeeealy reeeeeeeealy hard to tame someone, the system is cool but pets are useless for now. I tamed one of the most powerfull creature and it cant even kill a boar in starting location and it dies with 2 shots. Also pets are not marked for you friendly faction, my pet got killed by my own guys thousand times. They are buggy and useless for now. Taming doesnt worth it yet.\n[h1][+][/h1]\n[b]1. Setting.[/b] \n Its realy interesting. You play for one of 3 factions 20x20x20 on each server, so max 60 players in the game. Each faction lives in their own map, all 3 maps are identical, you can use portal to get to other faction. Main goal of the game is to collect 100 000 souls on your main base. Main base always shielded but 2 time in a week shield falls off and you are getting raided by tonns of scary spooky....slenders? In that time you base in biiiig troubles, this npc will break everything in their way to get to the center of it and steal some hard collected souls, each hit -X souls for your faction. After u defend your base from this slenders enemy faction can raid you too....or you can raid them.... well its realy fun and scary time. But not only during this time you need to go to the other factions maps, if u want to get some cool stuff you need bronze, bronze crafted from 3 different ores melted together....and each faction has their own ore =) So you need to steal resources from enemy maps or bases to upgrade your own. Thats pretty unique and makes pvp more like needed stuff to do, not only for fun and stealing stuff =)\n[b]2. Team play.[/b]\nThis game is pure team play based. There is personal bases but for now they are cancer. You must work as a team, every upgrade and research for whole faction can be made only by playing as a team. You will never get a good weapon or armor if u will play solo. Every research needs tonns of \"sparks\", u get sparks from doing everything but all this sparks are different, there are 4 type of sparks, each have their own researches and places to get. Getting some wood will give u 1 type, collecting plants 2nd, building something 3nd.....and 4th is for....crafting I guess? (I got too less of it but I crafted tonns of armors). Well even if u unlock some cool stuff u need to craft pretty much of it so you can do the best possible quality of it, so everyone must be focused on something, 1 needs to craft bows, another one armor, 3rd one repeaters or crossbows and so on. All the crafting can be done only im main base, personal bases got their \"personal crafting\" stations but they must be unlocked with sparks and you still need to craft them on main base =) (Personal bases are cancer of this game!)\n[b]3. Pets and taming.[/b]  \nTaming is realy hard and interesting. You need to craft special stuff to capture a souls of the creature you want to tame, then you need to kill that creature and go to the spirit realm where you must using special arrows capture soul of that creature. But you cant stay long in spirit realm its very dangereous, there is always tonns of slenders and everysecond you get damaged, more you stay - more dmg u get. If u will die in spirit realm - all your stuff will be in spirit realm, and you can get it back only from spirit realm =). This system is realy interesting and hard, you will need to waste many hours trying to undestand how to tame and tame your very first boar or wolf. Pets are so fun to have, they have giant potential, buuut for now they are useless and not worth wasting time taming it. You can use pets as mount, as carrier or as a weapon, but they deal no dmg and die in 2 shots in current stage of the game. Still love it (I tamed a giant Draak and everyone was scared of me he-he-he).\n[b]4. Optimization.[/b]  \nFirst guys that made game on Unreal Engine not to lag. gtx780, 2k resolution, max settings - stable 60+ fps. Pretty good graphics, more cartoon like.", "timestamp_created": 1533056528, "timestamp_updated": 1533056528, "voted_up": true, "votes_up": 139, "votes_funny": 11, "weighted_vote_score": "0.757825970649719238", "comment_count": 14, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "49964836": {"recommendationid": "49964836", "author": {"steamid": "76561198033510015", "num_games_owned": 0, "num_reviews": 41, "playtime_forever": 5179, "playtime_last_two_weeks": 0, "playtime_at_review": 5179, "last_played": 1554455911}, "language": "english", "review": "\"Hoo-hoo-hoo, go on, take the money and run\n Go on, take the money and run\"\n\n- Steve Miller Band\n\n Dead game, only like 8 official servers even up, companies that make \"cash grab\" titles should get banned from Steam.", "timestamp_created": 1554456041, "timestamp_updated": 1554456041, "voted_up": false, "votes_up": 35, "votes_funny": 5, "weighted_vote_score": "0.753461301326751709", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43901237": {"recommendationid": "43901237", "author": {"steamid": "76561198071896897", "num_games_owned": 0, "num_reviews": 41, "playtime_forever": 4237, "playtime_last_two_weeks": 0, "playtime_at_review": 1419, "last_played": 1542420810}, "language": "english", "review": "2 days grinding..... gear up the wazoo... a flourishing base..... a group of 20 members alll working together for the first time in survival game history.  Feeling deeply accomplished and on top in the soul collecting war. We were sure to win. Teamwork baby .....\nBut when the sky turned red. And the monsters came.... The crew came together to defend the base they worked on so hard. With excitement and confidence the fight began.... as I rained arrows of terror down on the never ending uggly beasts. We all realized. \n\nWe just fu**** up... \n\nAs our base crumbled and everyone we cared for died.  I  contemplated what I have accomplished falling 4 storys because the wall I was perched up on exploded. \n\n2 days.\n 15 mins lvled to the floor.  \n\nDespite what you may think here. \"Oh screw that noise.\"\n\nThe best part is we are all ready to build the F out of the base again better. Bigger. Stronger and more bad ass. \n\nYou will die.  You will lose. And you will rebuild.  Because this shit is EPPPIC hhahahahaa. \n\nGreat job developers. For smacking me in the face for thinking I could handle a reckoning. \n\nI LOVE IT", "timestamp_created": 1533258200, "timestamp_updated": 1533258200, "voted_up": true, "votes_up": 53, "votes_funny": 26, "weighted_vote_score": "0.753164172172546387", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "50991217": {"recommendationid": "50991217", "author": {"steamid": "76561197963725897", "num_games_owned": 1400, "num_reviews": 9, "playtime_forever": 3588, "playtime_last_two_weeks": 0, "playtime_at_review": 3588, "last_played": 1554381001}, "language": "english", "review": "Massive disappointment. I played a ton when Rend was released into EA and thought it had huge potential. However, the game bled players due to a few poor design choices that never really got addressed (zero incentive for a losing team to stick out a full \"cycle\" which can take weeks to conclude, and zero chance of a team putting in less hours to actually put up a fight with greater skill/coordination). Watching the devs continually miss the mark in their patches was a painful experience because I REALLY want this game to be good and popular, but it is neither. What's even more frustrating is that they never seemed to want to involve the community in development even though we ALL HAD THE SAME COMPLAINTS. They finally gave up after putting in the bare minimum of effort to walk through their development roadmap, though I don't particularly blame them since I'm sure they are seeing zero income from sales at this point.\nI resisted making a review until now in the hopes FK would get their shit together, but they never did. Now I just want to vent. The sour taste Rend left in my mouth leaves me questioning whether I'd consider buying their next game. They seem to have passion and the drive to try out some original ideas, but they don't have the flexibility to pivot when their ideas fail (as many inevitably do).", "timestamp_created": 1559389493, "timestamp_updated": 1559389493, "voted_up": false, "votes_up": 27, "votes_funny": 0, "weighted_vote_score": "0.75041043758392334", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "47728758": {"recommendationid": "47728758", "author": {"steamid": "76561198048628640", "num_games_owned": 0, "num_reviews": 111, "playtime_forever": 3078, "playtime_last_two_weeks": 0, "playtime_at_review": 3020, "last_played": 1549134752}, "language": "english", "review": "I'm still putting time into this game, I bought it a couple weeks back and I've been playing with friends a lot recently, got about 25 hours in at the time of this review.\n\n[i]Rend[/i] is an open world survival game with RPG elements (you gain levels and skill XP for the things you do which unlock perks to make things more interesting and/or easier) and both PvE and PvP servers.  I don't really care for PvP in survival games, because there's something incredibly un-fun about spending dozens of hours building a base only to have some ****head come along and destroy it for fun.  It's a waste of time.  However, PvE is really fun in my opinion, especially if you play with friends.  Really happy that this game gives you the option.  You can play the game at your own pace, live where you want to, and not have to worry about getting killed by players, just nasty animals. ;P\n\nA lot of people in the reviews keep saying this game is dead or there's only 5 players online and that's just plain untrue.  Every single time I've logged on I've seen a total of probably 30-50+ players just on the PvE servers, not even counting the PvP ones.  Sure, the playerbase is a little bit low, but it's definitely not dead.  Additionally, playing this game solo is definitely possible if you're careful and aware of your surroundings.\n\nPROS:\n+Beautiful environments\n+You get to choose if you want PvP or PvE\n+Unique creatures\n+Multiple types of ranged combat\n+You can spend LOTS of time in this game exploring, farming mats, killing stuff, building, etc.  Good time-killer.\n+Taming\n+Playable solo or with friends (but it is easier with friends)\n+Quite a bit of crafting and research depth\n+Unique leveling/research/skill system\n+Boon of the Gods chest drops (ALWAYS grab these)\n+Unique and fun buffs/enchantments on gear (makes you huge, makes you small, makes you sprint super fast, etc.)\n\nCONS:\n-Still needs optimization work done, probably wouldn't run well on low-end computers (I get 40-80 fps varies wildly with a GTX 1070 even on low settings)\n-Seems to have some kind of memory leak after playing for several hours on end, using 13+ GB of RAM is really odd\n-The crafting UI and crafting in general have a decently steep learning curve and it takes getting used to\n-Some creatures roam in packs which makes playing solo a lot harder (if you're into that)\n-Early game is VERY grindy, it will take you 6-8 hours of play time to get your bearings and start being able to do more fun stuff and get fun gear.\n\nIn general, I'd recommend this to people that want to play a beautiful survival game with RPG-esque elements that don't mind the things attached to an Early Access game (bugs, optimization issues, etc.).  I really enjoy it, I got several friends into it, and I'd highly recommend you try it if you're willing to cut it a little slack.\n\n[b]OVERALL RATING: 7/10 (would be 9/10 if it was optimized a little better)[/b]", "timestamp_created": 1545532431, "timestamp_updated": 1545532488, "voted_up": true, "votes_up": 41, "votes_funny": 0, "weighted_vote_score": "0.749607563018798828", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "44320578": {"recommendationid": "44320578", "author": {"steamid": "76561197981680180", "num_games_owned": 55, "num_reviews": 21, "playtime_forever": 27403, "playtime_last_two_weeks": 0, "playtime_at_review": 15420, "last_played": 1699570636}, "language": "english", "review": "Look, Does the game need some work? yes. This is early access. Thats the name of the game. If you are new to \"early access games\" then just sit tight and wait for the officail release. If you buy this game and write a bad review because of a bug, you are doing it wrong. You must understand what early access is and what it means to you as a gamer. \n\nRend, is a beautiful world with almost always something to do. You don't log in and stair at your screen with nothing to do like WoW or any other mmorpg. Rend ends. The game is won or lost by what you decide to do within the world. The game has great potential to be a true sand box survival game. Something that a lot of us older gamers can appreciate and have been craiving since the UO days. (not compairing rend to uo) \n\nIf you understand what Early access means, and are interested in a game with tight knit communitys and a steep learning curve then please give this game a chance to win you over. This game is not for every one, but those of us who have been around a while and enjoy a harsh and unforgiving world full of challenging systems, the game we have been looking for may just turn out to be Rend. \n\nPlease feel free to contact me for help or friends to play with.", "timestamp_created": 1534976156, "timestamp_updated": 1534976156, "voted_up": true, "votes_up": 45, "votes_funny": 0, "weighted_vote_score": "0.740280628204345703", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "73772805": {"recommendationid": "73772805", "author": {"steamid": "76561198139530470", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 562, "playtime_last_two_weeks": 0, "playtime_at_review": 562, "last_played": 1565162478}, "language": "english", "review": "I think everyone should be refunded for the game if its no longer playable.  I payed for a service.  Basic lemon rule should apply.", "timestamp_created": 1596573406, "timestamp_updated": 1596573406, "voted_up": false, "votes_up": 32, "votes_funny": 0, "weighted_vote_score": "0.73996657133102417", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "47190188": {"recommendationid": "47190188", "author": {"steamid": "76561198153481173", "num_games_owned": 100, "num_reviews": 8, "playtime_forever": 12820, "playtime_last_two_weeks": 0, "playtime_at_review": 12634, "last_played": 1536246847}, "language": "english", "review": "One of the best Survival games I've ever played BUT ( and its a huge but ) theres alot of problems\n1. Nobody plays the game\n2. There are tons of bugs that haunt the game\n3. Balance issues are a nightmare\n4. Customization is lacking compared to its competitors\n5. $30 is way to much for what they are delivering. \n\nI would love to reccomend this game but its to expensive for what is put on the table.", "timestamp_created": 1543508403, "timestamp_updated": 1543508403, "voted_up": false, "votes_up": 52, "votes_funny": 5, "weighted_vote_score": "0.729709029197692871", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "102265553": {"recommendationid": "102265553", "author": {"steamid": "76561198112338335", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 21, "playtime_last_two_weeks": 0, "playtime_at_review": 21, "last_played": 1561687847}, "language": "english", "review": "When Games get abandoned, we should get refunds no matter how long we had the game. BAITED AGAIN.", "timestamp_created": 1636124262, "timestamp_updated": 1636124262, "voted_up": false, "votes_up": 29, "votes_funny": 0, "weighted_vote_score": "0.729575097560882568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "48314779": {"recommendationid": "48314779", "author": {"steamid": "76561198005397993", "num_games_owned": 1889, "num_reviews": 22, "playtime_forever": 7633, "playtime_last_two_weeks": 0, "playtime_at_review": 7546, "last_played": 1577757434}, "language": "english", "review": "[h1]My newest addiction.[/h1]\nLet me preface this with a short story. My introduction to this game was at an event called PDXLAN. For the first time ever, the LAN party invited indie devs to show off their games. One of these games was Rend. I figured I'd give it a shot, it was a free demo. Plus they were giving out swag. I'll be honest, I mostly just wanted some cool stuff to take home from the LAN party. I sat down at one of the computers, and a dev immediately came over to me and asked me about my background of playing survival games. I told him about my experiences in ARK, and 7 Days to Die. He stood with me while I started playing, and hung out with me to teach me the mechanics of the game. He let me ask some questions about the game and its future, and overall it was a very positive experience that I didn't expect to get. That's what really sparked my interest in the game.\n\nFast forward to today, about two months later. At the time of this review, I'm at 121.4 hours. I have only one character, level 44, and I play almost every weekend. I play in exploration mode, which is effectively an online PVE mode. I'm not even at end game content yet. I can get into every major zone at this point, but I don't have the best gear in the game, and there are still a lot of challenges that stand before me. Certain zones are usually too dangerous to try and tackle solo. This game begs for you to run around end explore, but it has no problem with smashing your head in if you're playing too casually. \n\nAny time my brother and I would go to a new area we haven't explored much of, it felt like an expedition. We would spend half an hour to an hour just prepping ourselves with gear, medicine, food, ammunition and other items to ready ourselves. We'd get there, and we would take it very slow. We'd walk, we'd leave torches as markers to find our way back. We'd pick every fight, evaluate it, and either engage or avoid. We'd spend hours in an area. Sometimes it would go well, we'd haul back a huge amount of whatever we were looking for. Sometimes it wouldn't go so well, we'd be running around everywhere, split up from each other and fighting to survive just long enough to escape the terrors we got ourselves stuck in. It was thrilling, and the feeling of taking home a lot of resources, or sometimes new gear made the risk worth it.\n\nIs this game buggy? Yes. Will you encounter some kind of issue or incomplete mechanic? Yes. Is this game worth pushing through these problems? Absolutely. I've never had so much fun in a survival game before. I can play it solo, I can play it with my brother, or our friends. We can all dedicate a night to taking care of our own bases, or ban together on major expeditions. Regardless of what it is I'm doing with my time, I can always find something to do, I can always make an adventure for myself, and I always feel like I'm progressing.\n\nIf you're unsure about this game, or if you're starting new, here is my advice. Jump into PVE first. Play by yourself, or with a bud. And don't be afraid to ask questions in chat. A lot of people are actually super helpful in this game with advice. The second thing you need to do is join the Discord server, which is linked to on the main menu of the game. You can directly speak to the developers, ask questions to the community, or report bugs directly to the devs themselves instead of some ticketing system.\n\nThis might sound weird. But, Rend isn't really just a game to me anymore. From the very first time I sat down to play at PDXLAN, to checking up on the Discord channel, to giving advice and gear to new players, I've felt like a member of a large community. I did pay for the game, but I don't feel like a consumer. I feel like a contributor to a major project, and it's an amazing feeling. If you enjoyed ARK, 7 Days to Die, Rust, or any survival game? You owe it to yourself to at least try this game.", "timestamp_created": 1547412708, "timestamp_updated": 1547412708, "voted_up": true, "votes_up": 34, "votes_funny": 1, "weighted_vote_score": "0.727934718132019043", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "55321847": {"recommendationid": "55321847", "author": {"steamid": "76561197997706277", "num_games_owned": 311, "num_reviews": 7, "playtime_forever": 309, "playtime_last_two_weeks": 0, "playtime_at_review": 309, "last_played": 1534010988}, "language": "english", "review": "Abandoned Game. DONT BUY.", "timestamp_created": 1569689863, "timestamp_updated": 1569689863, "voted_up": false, "votes_up": 36, "votes_funny": 0, "weighted_vote_score": "0.721769213676452637", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43938206": {"recommendationid": "43938206", "author": {"steamid": "76561198049421906", "num_games_owned": 453, "num_reviews": 1, "playtime_forever": 357, "playtime_last_two_weeks": 0, "playtime_at_review": 357, "last_played": 1533432896}, "language": "english", "review": "In the current state of the game the netcode is in such a horrid disarray that pvp is wholey unenjoyable. The base idea behind the game is great but the execution of base mechanics was poorly done for early access it needs about another year in its alpha phase to work out more bugs.", "timestamp_created": 1533433564, "timestamp_updated": 1533433564, "voted_up": false, "votes_up": 101, "votes_funny": 8, "weighted_vote_score": "0.721399664878845215", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "67345987": {"recommendationid": "67345987", "author": {"steamid": "76561197968997567", "num_games_owned": 0, "num_reviews": 50, "playtime_forever": 328, "playtime_last_two_weeks": 0, "playtime_at_review": 328, "last_played": 1533976666}, "language": "english", "review": "This game has been abandoned by the developers. I need a refund", "timestamp_created": 1586933483, "timestamp_updated": 1586933483, "voted_up": false, "votes_up": 24, "votes_funny": 1, "weighted_vote_score": "0.720226049423217773", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "49472496": {"recommendationid": "49472496", "author": {"steamid": "76561197990299460", "num_games_owned": 0, "num_reviews": 27, "playtime_forever": 2877, "playtime_last_two_weeks": 0, "playtime_at_review": 2876, "last_played": 1552190048}, "language": "english", "review": "the game was alive for like 2 weeks and then everyone realised how bad it is now there arent even enough players to fill 1 server, so unless you want to play this faction based game all on your own doing nothing but fighting laggy AI with a bad combat system, you shouldnt buy it - maybe wait 5 years till its out of EA and hope players return to it but imo the devs should just refund every game and scrap the whole thing", "timestamp_created": 1552190497, "timestamp_updated": 1552190497, "voted_up": false, "votes_up": 32, "votes_funny": 2, "weighted_vote_score": "0.706892013549804688", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "53914720": {"recommendationid": "53914720", "author": {"steamid": "76561198072573899", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 16319, "playtime_last_two_weeks": 0, "playtime_at_review": 16232, "last_played": 1632064306}, "language": "english", "review": "Nice game but the developers gave up on it", "timestamp_created": 1562503873, "timestamp_updated": 1562503873, "voted_up": true, "votes_up": 22, "votes_funny": 0, "weighted_vote_score": "0.697476029396057129", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "49855658": {"recommendationid": "49855658", "author": {"steamid": "76561197993785902", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 36371, "playtime_last_two_weeks": 0, "playtime_at_review": 35300, "last_played": 1600455437}, "language": "english", "review": "Can't recommend it.\n\nSpent most of my time on the game wishing they would finally adjust/add/remove the main concerns and problems of the players that stuck around for months.\n\nAlways waiting for that next patch that would fix the huge, obvious, not-fun problems. \n\nOn patch day, the general reaction was almost always this: \n\"oh we got at least a third of what we hoped and a bunch of miscellaneous stuff, unwelcome changes, and half working fixes, cool I guess, next patch will be better for sure!!\"\n\nIt's like the devs had no one among them who understood what it was to be a player in their game. Like they needed someone to play among the pleb and give them direct feedback, but didn't. But then, they didn't trust the player base to know what was fun and what wasn't, as slowly but surely, they all left. Most of the suggestions on the discord were ignored until it was too late, and after it was too late, they were still ignored.\n\nI was flabbergasted by this game when I started. I thought I had finally found a rough but sparkly gem, something that could be so much more than it already was. And it was good. And it was fun. Until it wasn't.\n\nDon't buy even on sale, dead game. Let them re-use assets, mechanics and dynamics on a new project and hope they learned from the first one. I for one assume they were in over their heads and didn't have a proper lead with enough influence in their (small) organisation to make bold, smart choices.\n\nShout out to deathsFALL. Often demonized, never matched on a level playing field.", "timestamp_created": 1553966355, "timestamp_updated": 1553966457, "voted_up": false, "votes_up": 22, "votes_funny": 0, "weighted_vote_score": "0.694823265075683594", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "46434839": {"recommendationid": "46434839", "author": {"steamid": "76561198013111552", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 62212, "playtime_last_two_weeks": 0, "playtime_at_review": 54329, "last_played": 1553963686}, "language": "english", "review": "900+ Hours in this game and counting. Game has had some decent changes since it was released to EA.  Latest patch added 2 new game modes and many of us are having a blast there.  If this game peaks your interest, I would definitly buy it. Dont take my word for it tho, break out that google and look at the videos that are out there.\n\nOnly major flaw in this game atm is the population is low, you can help that buy joining and having a blast.", "timestamp_created": 1542915695, "timestamp_updated": 1542915695, "voted_up": true, "votes_up": 27, "votes_funny": 3, "weighted_vote_score": "0.693140029907226563", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "50148295": {"recommendationid": "50148295", "author": {"steamid": "76561197994407233", "num_games_owned": 51, "num_reviews": 1, "playtime_forever": 814, "playtime_last_two_weeks": 0, "playtime_at_review": 814, "last_played": 1554997239}, "language": "english", "review": "game is okay, but the hackers on servers ruin it and GM's don't care all you get it a \"sorry that happened, let us know if there is anything else we can do\"", "timestamp_created": 1555349033, "timestamp_updated": 1555349033, "voted_up": false, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.692209601402282715", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "73341572": {"recommendationid": "73341572", "author": {"steamid": "76561198957557530", "num_games_owned": 74, "num_reviews": 10, "playtime_forever": 255, "playtime_last_two_weeks": 0, "playtime_at_review": 42, "last_played": 1599710364}, "language": "english", "review": "This game had incredible potential and my friend and i enjoyed it a lot when we had gotten the chance to play the game. I'm disappointed that this game was abandoned and we weren't left with a way to play it anymore.\n\nIf we cant play the game, it should be taken off steam. People are going to buy it and realize its just a menu screen and nothing more at this point.\n\nIf this game gets revived ill change my review to positive because I want to see this idea thrive, but i really doubt thatll happen.", "timestamp_created": 1595822417, "timestamp_updated": 1620068621, "voted_up": false, "votes_up": 19, "votes_funny": 1, "weighted_vote_score": "0.691835761070251465", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43858790": {"recommendationid": "43858790", "author": {"steamid": "76561197994507840", "num_games_owned": 399, "num_reviews": 3, "playtime_forever": 10994, "playtime_last_two_weeks": 0, "playtime_at_review": 6801, "last_played": 1534446444}, "language": "english", "review": "[u]** This is a review on the Alpha build before launch. **[/u]\n\n[h1]Summary[h1]\nRend is about building a great base to withstand the reckoning as much as PvP against 2 other factions. You can choose to be either Conclave, Revenant or Order. It is about working together to make sure you win the game and come out victories. The choice is yours. Frostkeep Studios put out a good alpha with a lot of potential to grow.\n[h1]Rating (out of 10)[h1]\n[list]\n[*]Graphics: 8,5\n[*]Audio: 7\n[*]Story: 5\n[*]Content: 8\n[*]Controls: 9\n[*]Gameplay: 9\n\n[h1]Graphics[/h1]\nThe game delivers on the graphics. It is build on the Unreal Engine 4 and you really notice on the environment. From sunrise to sunset. You can see the light coming through the vines and trees just on top of the hill. It goes fluent with the day and night cycle. The creature look good, not HD but good enough. Reason I wont give it a 9 or 10 is because it is not HD or 4K. And for this game it is not needed, it fits just right. The sky is the most beautiful. You see planets in all kinds of shapes and sizes. \n\n[h1]Audio[/h1]\nThe music is nice to listen to. It does cut off from time to time through my plays but relaxing.\nThe audio itself, let it be combat or crafting is what you expect from any game. The sounds are a right fit for what you use. The weapons sound ok. Crafting the same.\nThe good thing about the ambient sound is that you feel like you are either in a forest or in the swamp. \n\n[h1]Story[/h1]\nYou are one of these survivors and you can pick your faction. All around you there are these big stones with glowing glyphs on them you can select. These will show you some lore. That is the most story you get out of the game. It could only spark the warrior inside yourself to want to play the game and wage this war by yourself. You can read the whole story at rendgame.com\n\n[h1]Content[/h]\nBefore going into [b]crafting[/b], [b]PvP[/b] or [b]PvE[/b] I first want to say that the content you can access is all up to you. This means crafting in particular. If you want to dedicate yourself to 1 thing, like armour crafting, or want to do it all. It is possible! Once you made your character, joined a faction and start your journey you can select classes. There are 4 classes in total and you can only pick 2 of them. Each with their own skills. The nice thing about selecting a class is that you can still switch to another one. So, if you are reading all the skills and you did not invest a point you that is. The points you spend can not be refunded as far as we know. Choose wisely. The classes in this game are Pathfinder, Shaman, Warlord and Assassin. You level your character and can spend points into your specific classes. Level 50 is the maximum level of your character.\n\nYou also get ascension points. These points can be earned by doing everything that yields experience in the game. They are infinite and can be spend on getting these extra bonusses in the game like more experience or more carry weight or even getting a new hairstyle for your character. There is even the possibility to get pets/mounts in the game. I have not explored this possibility with the playtime I got but it is looking good. Want a fast mount? Or a beast that carries stuff for you? You can get it here. Playing solo, in a clan or really being part of the faction is all up to you as a player.\n\n[b]Crafting[/b]\nStarting off with crafting. It is the most important thing in the game! There is so much! Different kind of weapons ranging from close combat all the way to long range. There is no hand to hand weapons or shields. They were removed and will be introduced later on. There is a lot for armour crafters as well. You can get light armour with a lot of resistances to the environments up to leather armour that is wonderful for PvP. And now for the building. The game gives you 4 basic structures at the start that are in the area where only your own faction can enter. From these buildings you start crafting adventure. One of these four buildings is where you do your research. The good thing about the research system is it is central. With almost everything you do you get sparks. These sparks are used for your research and the whole faction benefits of it. These are some of the things you can make: Armor, weapons, potions, building materials, private crafting benches, boxes, siege tools and much more. There is enough to get your time spend without even going into PvP.\n\n[b]PvP[b]\nWelcome to PvP in Rend. This is always a hard thing to balance. But here it worked with all the range combat. Physical weapons are not in the game at the moment and will be added on a later time. You are the PvP god! If you are thinking that there is some good hunting for you if you know where to look. But be warned, you can go everywhere except into the base of your enemy that has these big shields up. Let it be their starting area or a outpost. There is a huge shield up in the starting area that will not allow for anyone except their own faction to enter it. And the closer you get, the weaker your shots will be. Around the starting crafting area there is a roughly 250 meter radius that will give you a debuff and the closer you get the to shield the higher it will be. The higher the number on your debuff the less damage you do. \nSo, you got a kill! Or you didn’t… Either way, the person that died drops all that he has on him or her. Make sure you are not bringing anything of value or else the enemy will surely be thanking you for that present you brought.\nOutposts are a big thing in the game. An outpost can yield you a couple of sparks. These you can convert yourself when acquired to the research you want to. Taking this outpost will make it your factions. There will be an announcement in the chat when a shield will go down and up again, so prepare. Every person in the vicinity of the crystal will get a box dropped with loot if you manage to claim it. In the box there can be potions, armour or even more sparks.\n\n[b]PvE[b]\nPvE is straight forward. Grinding materials by chopping down trees, fighting monsters and surviving. There are several biomes in the game and each and every one of the unique. This is where the game lacks a bit in content. There are no raid bosses, there are no dungeons or cave systems to explore. You will spend your time on the surface and sometimes go into a little cave for mining. Every biome is a different Tier. And you only go in there if you need materials for crafting.\n\n[h1]Controls[/h1]\nControls in the game are very basic for movement. The only complaint I would have is that there is no autorun and no crouch. With the distance you travel sometime it can come in handy. Harvesting controls are different though. You use both mouse buttons. \n\n[h1]Gameplay[/h1]\nFinally gameplay! After that much reading, or you skipped most of it, we get to the point if the game is fun. Like said before, it depends on you and the people in your faction. This game relies heavily on teamwork if you want to beat the other factions. Yes you can solo here, but wouldn’t you want to make sure your base is defended and win it?\nWorking together will either make or brake this game for you. It worked for me and the whole faction I am in is working together. People that I never met before and we help each other so much. I could not imagine being in a faction where everyone is doing a solo run, that is not how this game should be played in my opinion.\nYou won! Or lost. Either way the you start new, fresh and start competing again for the next round. This is not a server reset! You keep only your ascension points.\nGame plays fluently and well. Only time with the gameplay that I had a problem was massive framedrops at the outpost. That is about it. For a alpha is runs better then most games I played in the past. \n\nIn the end, would I recommend this game? Yes\n\nIf you love PvP in small numbers and love to build and help as a community/faction then that is good.", "timestamp_created": 1533060698, "timestamp_updated": 1533060698, "voted_up": true, "votes_up": 42, "votes_funny": 3, "weighted_vote_score": "0.688086509704589844", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "64028293": {"recommendationid": "64028293", "author": {"steamid": "76561198080069493", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 1934, "playtime_last_two_weeks": 0, "playtime_at_review": 1934, "last_played": 1548632926}, "language": "english", "review": "Devs abandoned the game. Player based died. This is a dead game. Back in the day when it was all hype, it was legit. But now... I'm not even sure how it's up for sale anymore.", "timestamp_created": 1582517086, "timestamp_updated": 1582517086, "voted_up": false, "votes_up": 21, "votes_funny": 0, "weighted_vote_score": "0.687611758708953857", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43894491": {"recommendationid": "43894491", "author": {"steamid": "76561197999226695", "num_games_owned": 750, "num_reviews": 14, "playtime_forever": 274, "playtime_last_two_weeks": 0, "playtime_at_review": 183, "last_played": 1533227753}, "language": "english", "review": "For clearing out some reviews on this game I found myself on desperate need of writing this comment. Positive comments are on top negative are at bottom.\n\n:POSITIVES (+):\nFirst of all this is neither a singleplayer nor a co-op game. This is a team based game. Every individual has a job to do in this game.  Some are gatherers, some are crafters some are explorers and some are warriors. The hardest part is that for these 4 main jobs you can only have maximum of 20 people. So one of those 20 people will come out and be a leader and manage what everybody should do. What researches are needed to be done etc. \n\nThere is one giant huge big misunderstanding of current state of game. I read some reviews and they say there is not much to do. Gather and attack thats all they said. This is so wrong. There is a huge map of the spirit world. It's like upside down int the Stranger Things.  That part of the game by itself  whole different game. \n\n:NEGATIVES (-):\nThere are not much I can say in this current state. It's in early access and people are so demanding for a full game and review this game as such. Anyway so far for a non-patched early access game missing parts are no crouching ( I mean seriously? ) therefore no feeling of stealth. No melee weapons and lack of tutorial. Tutorials at current state is like when you come close to something they pop up and at the start location some stuff are written on the stones. For a game this big I think developers are working on a different kind of tutorial and add it to the game later on.\n\n:WHO SHOULD BUY THIS GAME:\nEverybody who likes to play with friends or total strangers shouldn't miss this game. But if you are a guy like Kirito in Sword Art Online ( or any other I'm the greatest solo player there is kind of guy) stay away from this game. It seems like ARK or CONAN Exiles but its nothing like those.", "timestamp_created": 1533226882, "timestamp_updated": 1533740654, "voted_up": true, "votes_up": 20, "votes_funny": 1, "weighted_vote_score": "0.684198975563049316", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44757145": {"recommendationid": "44757145", "author": {"steamid": "76561198023179709", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 25895, "playtime_last_two_weeks": 0, "playtime_at_review": 25448, "last_played": 1553396584}, "language": "english", "review": "Edit 3/23/19 Wanted to login with a friend and see some progress, Game is looking smoother and more streamlined toward getting into action. Haven't seen other players but the pve combat was a bit smoother in the noobie area. Game is certainly moving in the right direction and  I hope the devs keep the wheels churning forward because I have a good feeling about this game.\n\nEdit 1/26/19 Reinstalled the game, looks like a decent amount of improvements. However the game is still plagued with mobs constantly evade locking even when im standing right out in the open on flat terrain. It can also be quite the challenge to get started on a server when everyone else has favorited companions with very high pet ratings and can just zip around you and your expected to fight them, essentially you need to kill them but if they are going to die they will mount up and run away. I can see pets established on a saga in progress but not a fresh wiped saga where people had carried their pets over, I had taken a break for 3 or so months and it would seem I have lost my pet I had favorited and carried across a couple sagas and servers. Overall not exactly a welcoming experience for a returning player. I will revisit this game and update this review in a few more months possibly longer.\n\nI never write reviews, even for bad games, this is one of the most frustrating games I have ever played.\nIt has such incredible potential to be an outstanding game but it is filled with griefers and the dev team is flushing it down the toilet. There is such easy fixes they could do for the game but refuse to take any action, they stand by and let it wither and rot to the dismay of that last remaining players.\nOne day it might be a good game and I could update this in the future to reflect that but save your money until a future date.", "timestamp_created": 1537061777, "timestamp_updated": 1553391348, "voted_up": false, "votes_up": 51, "votes_funny": 4, "weighted_vote_score": "0.679307043552398682", "comment_count": 9, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43897587": {"recommendationid": "43897587", "author": {"steamid": "76561198042112790", "num_games_owned": 445, "num_reviews": 29, "playtime_forever": 3599, "playtime_last_two_weeks": 0, "playtime_at_review": 1394, "last_played": 1535058439}, "language": "english", "review": "One of the three factions had 8 Pre-Alpha players, so they already knew the vast majority of the game.\nBecause of that they had an amazing start and progressed much faster, after the war started out team was trying to tame pigs and they come along on GIANT deers and shoot us for meterials - repeat\n\nAlso one player had 2 accounts, joined out faction fed them info and dumped out all our gear on the enemy base or threw it to the floor to despawn, thats not even to mention the trolls who jumped in to kill our own team while on our team..\n\nThe game is a bit poison at the moment - AVOID", "timestamp_created": 1533239280, "timestamp_updated": 1533239280, "voted_up": false, "votes_up": 71, "votes_funny": 15, "weighted_vote_score": "0.676301360130310059", "comment_count": 12, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "98141294": {"recommendationid": "98141294", "author": {"steamid": "76561198000924194", "num_games_owned": 1579, "num_reviews": 7, "playtime_forever": 1070, "playtime_last_two_weeks": 0, "playtime_at_review": 1070, "last_played": 1565693716}, "language": "english", "review": "Do not buy this game. The developers literally took down the master servers so you cannot play anymore. Frostkeep should be banned from posting games on steam.", "timestamp_created": 1629800411, "timestamp_updated": 1629800411, "voted_up": false, "votes_up": 21, "votes_funny": 0, "weighted_vote_score": "0.675394117832183838", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "65729696": {"recommendationid": "65729696", "author": {"steamid": "76561198279642339", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 6687, "playtime_last_two_weeks": 0, "playtime_at_review": 6687, "last_played": 1555231022}, "language": "english", "review": "RIP so mutch wasted potential", "timestamp_created": 1585077476, "timestamp_updated": 1585077476, "voted_up": true, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.674331426620483398", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43991949": {"recommendationid": "43991949", "author": {"steamid": "76561198043887655", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 19065, "playtime_last_two_weeks": 0, "playtime_at_review": 6344, "last_played": 1538353183}, "language": "english", "review": "Fantastic foundation requiring a great deal of polish on almost all aspects of the game from hitboxes, to latency/rubberbanding to balancing, etc.\n\nSuffers from some crippling flaws though.  \n\n1. The very limited options for building your faction base.  If you were to server hop you'd notice they all pretty much look the exact same.  You're given a couple rows to build walls, rows to place production buildings and a few rows in the back where you can either build more production or more walls.  There's not enough room for much creativity.\n\n2. The game expect factions to work together towards common goals, but rewards small groups of people within the faction choosing to do their own thing.  You can't do everything in a personal base, but you can do most things, and in some cases process materials much faster than the faction base, at a fraction of the cost.  This leads to people focusing on objectives that don't directly help the faction and/inturn leads to infighting.  \n\nPolish and my complaints can be fixed before proper launch though, so it's definately a check back later game.", "timestamp_created": 1533689580, "timestamp_updated": 1533689580, "voted_up": false, "votes_up": 23, "votes_funny": 2, "weighted_vote_score": "0.672450423240661621", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "99849738": {"recommendationid": "99849738", "author": {"steamid": "76561198055705498", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 506, "playtime_last_two_weeks": 0, "playtime_at_review": 506, "last_played": 1632422103}, "language": "english", "review": "This should no longer be on the Steam store. You cannot play - they've taken down all main servers.", "timestamp_created": 1632422225, "timestamp_updated": 1632422225, "voted_up": false, "votes_up": 21, "votes_funny": 0, "weighted_vote_score": "0.672333359718322754", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "65102946": {"recommendationid": "65102946", "author": {"steamid": "76561198147458791", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 4254, "playtime_last_two_weeks": 0, "playtime_at_review": 4088, "last_played": 1657398119}, "language": "english", "review": "PLEASE bring this game back", "timestamp_created": 1584295770, "timestamp_updated": 1584295770, "voted_up": true, "votes_up": 30, "votes_funny": 1, "weighted_vote_score": "0.669545531272888184", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "55398381": {"recommendationid": "55398381", "author": {"steamid": "76561198417760096", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 78, "playtime_last_two_weeks": 0, "playtime_at_review": 78, "last_played": 1535847824}, "language": "english", "review": "I got this because I'm a huge ARK fan and enjoyed the little I played of Rend. I put it down with hopes to come back to a more fleshed out game with more content - but it has been abandoned and that's really sad. Please devs, revive this.", "timestamp_created": 1569988711, "timestamp_updated": 1569988711, "voted_up": false, "votes_up": 17, "votes_funny": 1, "weighted_vote_score": "0.667832076549530029", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "99717166": {"recommendationid": "99717166", "author": {"steamid": "76561197961146583", "num_games_owned": 0, "num_reviews": 42, "playtime_forever": 8, "playtime_last_two_weeks": 0, "playtime_at_review": 8, "last_played": 1547783615}, "language": "english", "review": "Do not buy this game. The developers literally took down the master servers so you cannot play anymore. Frostkeep should be banned from posting games on steam.", "timestamp_created": 1632198021, "timestamp_updated": 1632198021, "voted_up": false, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.661723971366882324", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43891288": {"recommendationid": "43891288", "author": {"steamid": "76561198026734628", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 208, "playtime_last_two_weeks": 0, "playtime_at_review": 208, "last_played": 1533208536}, "language": "english", "review": "Alright, so, couple points first and foremost:\n\nGraphics -\n\nGame is beautiful, and runs fairly well. It's early access, so it's expected that some of the models and animations look unfinished and somewhat low quality on occasion. Entirely understandable.\n\nGameplay -\n\nAwful. Don't get this unless you and at least 4+ other friends are willing to commit to it for long hours and long periods of time. You cannot do anything without a decently sized group of people. The game is extremely grindy, combat is relatively poor, menus are extremely unintuitive and unfriendly to new players and nothing in the game tells you how to do vital things.\n\nTraveling is worse. Starting gear won't be able to get you out of the starter area, because most of the mobs have large aggro distances and will follow you until you die, and they hit like trucks.\n\nFinally, the #1 killer for me is the fact that random players can join your faction, take materials and other things out of the inventories, and jump off the edge of the map to make it disappear forever. Sure, you can kill them, but if you do, you lose reputation with your faction and that hurts you just as much as them stealing the items. But then they can just respawn at the base, and then do it all over again while you gain nothing.\n\nAll in all, the game looks beautiful and has a ton of potential, but it is Early Access, and I have high hopes that it will end up better! As the game is now though, it's not good.", "timestamp_created": 1533214944, "timestamp_updated": 1533214944, "voted_up": false, "votes_up": 29, "votes_funny": 1, "weighted_vote_score": "0.655673801898956299", "comment_count": 8, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "43921749": {"recommendationid": "43921749", "author": {"steamid": "76561198045818247", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 6138, "playtime_last_two_weeks": 0, "playtime_at_review": 4221, "last_played": 1534991621}, "language": "english", "review": "Too many core game mechanics and aspects of the game lead to instability and game crashes. Rend is a game based around the teamwork of the faction, when really it is ONLY based around the teamwork of the faction. If not everyone is on the same page then your faction is doomed to fail. Towards the mid-game the responsibilities of the faction are made thick by the tier system - which is based around research. Research can easily be derailed in this game and throw an entire faction off course.\n\nNew players are given WAY too many freedoms when they join the game. There is no way to force obedience or train discipline to the new players within the factions of the game - which is an immediate must given just how reliant the game is on communication and teamwork. No forced roles to cement trust and reliance within the group, If you \"turn in souls\" every night you basically become the \"Elder\" or \"Captain\" - very easy to abuse. New players can steal and troll and grief, and cannot be stopped without taking drastic measures. The game punishes you for killing the trolls, it's almost comical.\n\nSkills are also incredibly unbalanced, classes called \"Assassins\" and \"Shamans\" rule the game as of now. Assassins when paired with movement speed can outrun anything. Especially with how unstable the official servers are and how attempting to tame creatures currently force-kicks you from the server instead. Even in the official servers you are consistantly rubber banding regardless of ping - due to heavy desync. Imagine shooting a half-invisible target running faster than anything currently in the game PLUS desync - it's not fun. The materials to reliably tame animals are many, but scarce. How much teamwork is needed to tame larger creatures is near supernatural. Shamans skip all of that using their talents, skills and spells, they control the faction the most in terms of taming, which seems to be 20% the game's entirety.\n\nI do not recommend this game, do not purchase this until they gut and rework it from the ground up because the only way this game can become a success is if teamwork is not a requirement. In many cases the team cannot progress because someone \"doesn't want to\" open a spirit portal as shaman, or produce high-quality bows. \n\nOh, also there are no real melee weapons in this game - regardless of being based off of norse mythology. So wait until release to check this game out, the devs have a lot to work on and it is gonna take a while to get it done. currently I consider it crap.", "timestamp_created": 1533359655, "timestamp_updated": 1533359977, "voted_up": false, "votes_up": 90, "votes_funny": 7, "weighted_vote_score": "0.654551088809967041", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "73792589": {"recommendationid": "73792589", "author": {"steamid": "76561197995247737", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 66, "playtime_last_two_weeks": 0, "playtime_at_review": 66, "last_played": 1590023198}, "language": "english", "review": "Unplayable. Online only game with no viable online options. Was waiting for something to happen with this but they took the money and left us with nothing to play. I'm done with buying online only games.", "timestamp_created": 1596597156, "timestamp_updated": 1596597156, "voted_up": false, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.653370082378387451", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "74011203": {"recommendationid": "74011203", "author": {"steamid": "76561197965418175", "num_games_owned": 494, "num_reviews": 17, "playtime_forever": 110, "playtime_last_two_weeks": 0, "playtime_at_review": 110, "last_played": 1533179543}, "language": "english", "review": "Devs abandoned game. dont buy it", "timestamp_created": 1596950518, "timestamp_updated": 1596950518, "voted_up": false, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.652894675731658936", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43879238": {"recommendationid": "43879238", "author": {"steamid": "76561198020011926", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 7, "playtime_last_two_weeks": 0, "playtime_at_review": 7, "last_played": 1533139733}, "language": "english", "review": "remove singleplayer and co-op from the feature of this game since it doesn't have any of those.", "timestamp_created": 1533152909, "timestamp_updated": 1533152909, "voted_up": true, "votes_up": 34, "votes_funny": 9, "weighted_vote_score": "0.648552536964416504", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "86474064": {"recommendationid": "86474064", "author": {"steamid": "76561198852296674", "num_games_owned": 10, "num_reviews": 28, "playtime_forever": 2554, "playtime_last_two_weeks": 0, "playtime_at_review": 2554, "last_played": 1534663998}, "language": "english", "review": "Sad, i liked that game", "timestamp_created": 1613144551, "timestamp_updated": 1613144551, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.647677481174468994", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43915299": {"recommendationid": "43915299", "author": {"steamid": "76561198010573833", "num_games_owned": 157, "num_reviews": 8, "playtime_forever": 30332, "playtime_last_two_weeks": 0, "playtime_at_review": 13300, "last_played": 1536928656}, "language": "english", "review": "As other people have been saying, it's fun till someone starts griefing and intentionally taking faction loot and droping it in the middle of no where or giving it to opposing factions.  Experiencing one of these people now named dantheguy.  \n\nAlso the personal housing really breaks defending against the reckoning.  For example we are a solid 36 hours behind on all research and main base defense because everyone just runs off and makes their own little fort more often then not taking resources from the main base to do it.\n\nInteresting concept just impossible to impliment because of griefers.  If this some how gets fixed I can recommend it but right now I would avoid it till its addressed.  Theres also a gigantic dispairity between factions when you fall behind on that kind of stuff.  Game has devolved in to the other factions being near god like and able to take a group of us out solo.\n\nLosing everything on death is far too punishing when your already behind on research.  Becomes near impossible to catch up if the teams ahead of you really stay on you.  Already having the advantage then they take all your gear and items essentially reseting you to have to go out and craft everything again which makes the disparity grow ever more.  \n\nThe ascension concept is kind of self defeating.  It takes quite a while to achieve for your average server.  Were at 2 weeks in and the server is mostly dead now.  The entire covenant faction quit because of a griefer and I'm pretty sure monster hunter pulled away big chunks of the rev and order factions.  Only a hand full of people on during reckoning and only 2-4 people the rest of the time if your lucky.  So now trying to get all thoes spirits is just going to take even longer with so few people.  And with a 72 hour wait once you ascend it's kind of not worth ascending anyway.  The weirdest thing ever having a wait time of 3 days to play another game.  Why this isnt instant or 10 minutes is baffling at best and just really poor game design at worst.  Nothing screams we never actually played out game like a 72 hour wait time to play again lol.\n\nA new system was put in place called the outcast system to deal with griefers that intentionally try to delete mats or other griefie behavior.  All it really seemed to do was let the 3 longest playing players on your faction abuse other people.  Causing more problems than it solves in its current state that they actually had to release new patch notes saying abusing outcast system was banable.  \n\nAlso it looks like a lot of the servers not just mine are dying out.  When first starting there were so many near capacity.  Now its single didgits most of the time.  Buy at your own peril as this game may already be death spiraling.\n\nThere is certainly fun to be had so an argument could be made that getting this game on a good steam sale might make it worth.  However I would verify that people still play it before hand as it's not looking good right now.  And you may want to shop around for a server for a while and not just pick the first one you see.  Make sure your not joining a server where 1 team is just decimating the others as its no fun to log in and be stuck in base for hours on end (has happened to us).\n\nOn the bright side devs seem to be active in discord and open to constructive critisim so I am hoping they can get their game fixed up and be sucessful.  Also a lot of updates pretty quickly.  Sadly they some times roll them out during reckoning which is just terrible imo (if steam didnt have the longest patches in the history of man it wouldnt even be an issue but a freaking 19mb patch that should take all of 10 seconds to download, install, and be back in business some how can take upwards of 45 insane minutes) but im glad to see work being put in.  Which brings me to another point.  Getting kicked for a server restart or a patch or even disconnecting doesnt actually remove you from the game so your toon is still standing there just waiting for an npc or player to come kill him droping all his loot when your not even around to get it back.  I get that this is probably intentional so you cant duck out of pvp by just logging out.  But this is too punishing when its a server reset or patch or even just a legit dc. Which are usually not even announced so you can get somewhere safe.  and when they are its like 10 seconds before it goes down so you have no chance getting safe before it goes down and you lose all your stuff for no reason.", "timestamp_created": 1533325152, "timestamp_updated": 1534388096, "voted_up": false, "votes_up": 29, "votes_funny": 2, "weighted_vote_score": "0.646037757396697998", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "45059057": {"recommendationid": "45059057", "author": {"steamid": "76561198049503469", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 6838, "playtime_last_two_weeks": 0, "playtime_at_review": 5816, "last_played": 1539013777}, "language": "english", "review": "The Skinny:\nPros -interesting faction based survival game with an end goal\n        -Nice aesthetics\n        -lots of buffs and debuffs and status effects. might put off some casuals but i like it personally\n        -taming system- the way you go about taming. needs more work\n        -small but dedicated team of developers with previous professional experience\n        -Love the reckoning hour both in theory and in some of its current practice\n        -frequent patches addressing issues \n\nCons -Limited building system, not much of a focus for this game\n         -for a match style intended to last upwards of a month, snowballing is too easy. most matches are usually decided \n         within 2 days\n         -need more reasons to tame more than a stag or a turtle. that's all anyone tames, everything else is crap =/\n         -griefing/ trolling. it's easy for members of another faction to come to your side and just camp you. brand new \n         players aka nakeds get spawn killed and can't leave base at all when this happens, making it near impossible \n         sometimes for new players to even get a grasp of the game. This can really hinder the game\n         -still needs more quality of life additions such as pet commands and a better storage system, among other things\n\n\nRend has potential. It really does, and yet there's so much hate for it right now, some of which is unwarranted as an early access title.\n\nI'll start with this: it is early access, don't expect a complete game here.\nThere is a LOT of balancing that needs done for starters, and the taming system, while cool in concept, needs to be expanded upon more. PvP needs to be worked on to reduce griefing/ trolling, which by the way can be avoided by not playing with crappy players, but it happens nonetheless. \n\nFor those saying the developers aren't listening, I've seen the majority of complaints on the main forums being addressed, maybe not as much here on steam but the complaints are the same. While not finished, they have implemented patches addressing some issues and mentioned what they're brainstorming to resolve other issues. Lastly, this is an 18 man team, you gotta give them actual time to figure things out.\n\nWanna see milking early access titles? go look at games like 7 days to die and enjoy the once yearly updates. these guys have been doing them weekly and are making an effort to fix things. these things aren't made overnight.\n\nUltimately, the game has good potential, but more than that, the devs are active on community.rendgame.com, so go see for yourself. If you want the full experience and don't care about helping make the game better, i'd say wait for release. No shame in that", "timestamp_created": 1538495671, "timestamp_updated": 1538495671, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.642218887805938721", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "67761682": {"recommendationid": "67761682", "author": {"steamid": "76561197998893566", "num_games_owned": 133, "num_reviews": 10, "playtime_forever": 4784, "playtime_last_two_weeks": 0, "playtime_at_review": 4770, "last_played": 1587484897}, "language": "english", "review": "This game is so promising, it's so sad the developers gave up on it. I've been waiting for this game for ages, stuck by it for years. a survival game with norrøn mythology is probably the best recipe out there. So much more that could have contributed to this game like melee weapons, dungeons and what not besides the only faction war. I really hope this game gets ressurected one day into the gem that it is and that it deserves to be. Gazing upon the tree of yggdrasil is breath taking and the music is amazing.", "timestamp_created": 1587482057, "timestamp_updated": 1587482057, "voted_up": true, "votes_up": 18, "votes_funny": 1, "weighted_vote_score": "0.640498638153076172", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "137758869": {"recommendationid": "137758869", "author": {"steamid": "76561198237008938", "num_games_owned": 91, "num_reviews": 14, "playtime_forever": 2237, "playtime_last_two_weeks": 0, "playtime_at_review": 2237, "last_played": 1564948954}, "language": "english", "review": "can we have r money back yet u never did shit with game", "timestamp_created": 1683164716, "timestamp_updated": 1683164716, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.640372216701507568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "49079678": {"recommendationid": "49079678", "author": {"steamid": "76561198140910950", "num_games_owned": 60, "num_reviews": 2, "playtime_forever": 10860, "playtime_last_two_weeks": 0, "playtime_at_review": 10557, "last_played": 1535639588}, "language": "english", "review": "Like every other multiplayer on steam, it is ridden with cheaters/exploiters.  FK is not interested in addressing the issue, most likely because they can't and wont ever be able too.  If being beaten illegitimately is a turn off, especially after investing very large amounts of time farming, do not waste your time here.  The cheaters hop from server to server effectively making the legitimate players there move or quit the game.\n\nThe biggest turn off is customer service. I submitted a ticket about an issue I found with their \"perks\". It turned out some were being granted a work around on transferring them to new characters at the time, which was great because of the need to move when cheaters arrived.  Apparently I was not special enough to get the same service as others, and got told the same in more words. \n\nI've never written a review, much less a negative one.  I truly hope this game and its developers fail, they deserve no less from the customer service I experienced, and I played DAYZ for 3200 hours.  My patience is there, but not with rudeness from people you pay and support.", "timestamp_created": 1550523006, "timestamp_updated": 1550523006, "voted_up": false, "votes_up": 14, "votes_funny": 1, "weighted_vote_score": "0.640325307846069336", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "74905459": {"recommendationid": "74905459", "author": {"steamid": "76561198072831811", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 6813, "playtime_last_two_weeks": 3, "playtime_at_review": 6761, "last_played": 1712624968}, "language": "english", "review": "I loved this game. I hate seeing it in the state it is in. I played it when in came out and until it died. I still get on and enjoy what it is.", "timestamp_created": 1598384107, "timestamp_updated": 1598384107, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.639962255954742432", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "86095894": {"recommendationid": "86095894", "author": {"steamid": "76561197997476217", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1251, "playtime_last_two_weeks": 0, "playtime_at_review": 1251, "last_played": 1597176420}, "language": "english", "review": "Game was good until it got abandoned by the devs...", "timestamp_created": 1612644738, "timestamp_updated": 1612644738, "voted_up": false, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.639156937599182129", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "59669857": {"recommendationid": "59669857", "author": {"steamid": "76561198018675050", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1723, "playtime_last_two_weeks": 0, "playtime_at_review": 1723, "last_played": 1546906186}, "language": "english", "review": "Saw this game at a PAX event many years ago and played the alpha.  The game was super fun and had a really cool and different style than your everyday survival game.  I managed to get about 6 of my friends to buy it a year ago and we had some good fun but there just wasnt enough people playing to have a good time with all of the aspects of the game.  Its a shame the game died shortly after release.  I would love for you guys to put some money back into marketing and kick start this game again. If you guys just re-marketed it and spent a little time and money i think that it would really turn out to be a gem of a survival game because it has such a unique and distinct mechanic.   Really hope to see this game make a comeback in the future. \nLong story short people need to know about this game and the devs and studio need to make this happen.\n\nWould totally recommend this game under circumstances of more people playing.  Ive waited years for this game to get big and it just didnt for some reason.", "timestamp_created": 1576083806, "timestamp_updated": 1576083806, "voted_up": true, "votes_up": 9, "votes_funny": 1, "weighted_vote_score": "0.637948453426361084", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "54293371": {"recommendationid": "54293371", "author": {"steamid": "76561198052251871", "num_games_owned": 775, "num_reviews": 2, "playtime_forever": 16317, "playtime_last_two_weeks": 0, "playtime_at_review": 16071, "last_played": 1580591089}, "language": "english", "review": "As many other reviews have said. This game was amazing when there were people playing. There was a time when I was on all day every day for a week straight. The group I was playing with was fantastic and we had a great time working together to progress. However that time has passed and the game has definitely fallen off. It's a little heartbreaking.", "timestamp_created": 1564088899, "timestamp_updated": 1653109138, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.635620296001434326", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43952135": {"recommendationid": "43952135", "author": {"steamid": "76561198064642878", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 4826, "playtime_last_two_weeks": 0, "playtime_at_review": 1440, "last_played": 1554312949}, "language": "english", "review": "I purchased Rend as someone who spends a lot of time playing Rust, Hunt Showdown, Terraria, and Starbound with my husband and who enjoys fantasy settings, PVP, intricate crafting, and sandbox games given the right context.\n\nTL:DR - The game has loads of potential. This feels new and fresh and I have enjoyed it immensely. HOWEVER, if you aren't sold by what you see in the videos and by streamers like Cohhcarnage, DO NOT buy this YET. Give them a few more months to add and polish. Wishlist it for now :)\n\nInitial Thoughts:\nRend was something I actually marked \"Not Interested\" for in my Q (I cycle through most of this genre of game without looking closely at them) and then stumbled upon again from an ad while surfing online. I watched a couple of videos and pretty soon was showing my husband and 5 minutes later we both were downloading it.\n\nIt's *really* nice to look at. I love the popping colors and \"art style\". It's good while not being CPU heavy (looking at you Hunt...). I've run it easily from my laptop without any graphical/loading/rendering bugs or issues. In fact the only bugs I've seen pertain to taming animals and a few minor ones in crafting and neither have impacted my progress. I love the dynamic of getting 20 people in team and allowing them to do their own progression while benefitting most from everyone working together. There's an event that happens at intervals (could be 1 a week, could be every day depending on server) called The Reckoning where the shields go down on each of the three player capitals on the map and everyone is sieged by  monsters for 15 min out of an hour. The remaining 45min is left to encourage a major PVP battle between groups. Really fun to prepare for and the Discord went crazy when it started. \n\nI'm not saying this game is perfect. They have a lot to work on. There's a lot of grinding and there's a lot that really isn't practical or doable by a single player. Mobs that will roflstomp you in one hit unless you have two friends or clanspeople with you who can help drop em. And the battle system itself needs some polish IMO. \n\nAll things said though, I've learned so much and still have so much to learn in the 14ish hours I've played at the time of writing this. I recommend giving it a shot. I'm looking forward to future content patches and fixes, but it's definitely playable and fun right now as it is.", "timestamp_created": 1533494931, "timestamp_updated": 1533494931, "voted_up": true, "votes_up": 37, "votes_funny": 2, "weighted_vote_score": "0.633975088596343994", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "68453723": {"recommendationid": "68453723", "author": {"steamid": "76561198168010580", "num_games_owned": 79, "num_reviews": 2, "playtime_forever": 1433, "playtime_last_two_weeks": 0, "playtime_at_review": 1368, "last_played": 1588518019}, "language": "english", "review": "I would love to see this game come back in some way, Even though I did not put as many hours into it as I would have liked the time I Spent with the game was amazing. With more time and players this game really could have been something!", "timestamp_created": 1588452977, "timestamp_updated": 1588452977, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.633699655532836914", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "70989272": {"recommendationid": "70989272", "author": {"steamid": "76561198097208148", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 594, "playtime_last_two_weeks": 0, "playtime_at_review": 594, "last_played": 1578781185}, "language": "english", "review": "Took the money and ran never buying anything from these devs again.", "timestamp_created": 1592500737, "timestamp_updated": 1592500737, "voted_up": false, "votes_up": 16, "votes_funny": 1, "weighted_vote_score": "0.6324118971824646", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "44966641": {"recommendationid": "44966641", "author": {"steamid": "76561198034949618", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 12579, "playtime_last_two_weeks": 0, "playtime_at_review": 8569, "last_played": 1539443704}, "language": "english", "review": "After 160 hrs in Rend, Im having to put the game away for a while. As an avid beta tester in the truest sense, i was active on their feedback line for constructive criticism. Unfortunately the most glaring problems with the game are not the Developers priority. \n\n-The balancing adjustments have been so heavy handed and misplaced, and the implementations of main systems have been ignored. \n\n-The obvious and simple to fix bugs and failing systems are very punishing after hours of grinding for gear and upgrades. \n\n-The inifficient net code and rubber banding makes PvP only viable for the everpresent exploiters and cheaters.\n\n- The server accessability and team switching is poorly managed. First there are waaay to many servers, most of which are dead. When a server starts, one team will pull ahead and crush everyone. The other two teams will move onto another server leaving the lead team to grind until the server resets. \n-Durring this time, small groups of 2-3 pvp trolls and exploiters will jump onto the vacant teams. They will someone win fights 2v6 with instnt kills from distance but somehow take fire from 4-6 players and get away.\n\nThis game is beautiful and fun at heart but the difficulty and frustrations in trying to get the developers to listen to their Alpha testers has diven most of its helpful playerbase away.", "timestamp_created": 1538058828, "timestamp_updated": 1538058828, "voted_up": false, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.632061660289764404", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "43973270": {"recommendationid": "43973270", "author": {"steamid": "76561198034396518", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 8938, "playtime_last_two_weeks": 0, "playtime_at_review": 7220, "last_played": 1541747676}, "language": "english", "review": "Game was going great, its EA so i can look past the buggy creatures and laggy servers, but have no report button for exploiters??? really??? had this with Dark & Light and look how that game turned out. game would be much better if you could report and get swiftly banned players that exploit. also to hear about one of the devs giving insider info on an official server is filth. game has potential will give positive review when exploiters are banned.\n\nEDIT: i understand they have put in the outcast system and you can report people on your own faction but you cannot report other factions players. they are the ones openly exploiting.\n\nOn a better note i am watching the patches coming in and they are progressing to fix everything very quickly i am feeling the urge to change to positive review if this keeps up.", "timestamp_created": 1533596384, "timestamp_updated": 1534395135, "voted_up": false, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.629829943180084229", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "43864499": {"recommendationid": "43864499", "author": {"steamid": "76561197984985614", "num_games_owned": 0, "num_reviews": 37, "playtime_forever": 122, "playtime_last_two_weeks": 0, "playtime_at_review": 122, "last_played": 1533087730}, "language": "english", "review": "Pretty boring, only ranged weapons. Chinese players just build by themselves and team kill you for mats.", "timestamp_created": 1533088946, "timestamp_updated": 1533088946, "voted_up": false, "votes_up": 51, "votes_funny": 26, "weighted_vote_score": "0.628720343112945557", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "47404287": {"recommendationid": "47404287", "author": {"steamid": "76561198109426967", "num_games_owned": 0, "num_reviews": 17, "playtime_forever": 523, "playtime_last_two_weeks": 0, "playtime_at_review": 517, "last_played": 1550965092}, "language": "english", "review": "This game died after it was launched.. but the devs didnt lost hope.. and countinue doing very good and meaningful updates .. good job devs.. and i hope this game will be big sometime.", "timestamp_created": 1544321737, "timestamp_updated": 1544321737, "voted_up": true, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.626172065734863281", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "50678858": {"recommendationid": "50678858", "author": {"steamid": "76561198156021248", "num_games_owned": 1263, "num_reviews": 255, "playtime_forever": 52, "playtime_last_two_weeks": 0, "playtime_at_review": 52, "last_played": 1580715515}, "language": "english", "review": "Do not, and i mean this, BUY THIS GAME. It is an absolute joke and is nowhere near ready to be released in my own opinion.\nyou cannot progress in this game whatsoever due to the game being dead. 19v19v19 (faction vs faction vs faction) and so on and on it was supposed to be but no...... that idea died within the first 38 hours of the game being released and to top that off when the game came out, it was more or less unplayable........ now it IS playable but the game is dead and i dont ever see rend coming back. DO NOT waste your money on this as i can think of better games than this you could buy and ACTUALLY enjoy. \nGame is no longer supported by the devs as they seem to see the game ad \"complete\" which is total BS.\nGood things: it was a great idea (at first), graphics where nice and the sounds/fighting was ok\nBad things: This game in general and the devs", "timestamp_created": 1558053209, "timestamp_updated": 1558053209, "voted_up": false, "votes_up": 17, "votes_funny": 2, "weighted_vote_score": "0.62560880184173584", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "109747582": {"recommendationid": "109747582", "author": {"steamid": "76561198031461360", "num_games_owned": 113, "num_reviews": 14, "playtime_forever": 7187, "playtime_last_two_weeks": 0, "playtime_at_review": 7187, "last_played": 1535118356}, "language": "english", "review": "sad to see this game is fully abandoned still, game had potential, sad devs rather rug pull then fix their issues and we're the ones being screwed since we bought a game yet u cant even play it offline since authenticator servers are offline long time, this stuff should be highly illegal and punished yet consumers seem to have little to no rights in this consumer world :c", "timestamp_created": 1644272203, "timestamp_updated": 1644272203, "voted_up": false, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.625523507595062256", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "77980531": {"recommendationid": "77980531", "author": {"steamid": "76561198030892847", "num_games_owned": 0, "num_reviews": 31, "playtime_forever": 417, "playtime_last_two_weeks": 0, "playtime_at_review": 417, "last_played": 1603390829}, "language": "english", "review": "Scam.\n\nthis game has no servers to play on, developers are a**holes who make it to the release, then closed everything after few months.\n\nthis is the reason why I will never ever buy any game in the EA.\n\nDuck them all.", "timestamp_created": 1603391180, "timestamp_updated": 1603391180, "voted_up": false, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.624881446361541748", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "49248729": {"recommendationid": "49248729", "author": {"steamid": "76561198231782348", "num_games_owned": 19, "num_reviews": 32, "playtime_forever": 10059, "playtime_last_two_weeks": 0, "playtime_at_review": 8231, "last_played": 1535962543}, "language": "english", "review": "I was sent a free key to play test in the ALPHA. I showed the devs how easy it would be to screw over another faction in a video. I sent the UNLISTED youtube video to _Scapes_ their community manager. 13 minutes later I was \ngame banned from the Alpha (The version of the game BEFORE the Early Access version that costs money.) Remember the Alpha is for HEAVY testing, I tested the game, showed them the problem and was banned. \n\nThe game lasted a whole 1-2 months before the player base dropped to 60-220 average players. During these 1-2 months the game was experiencing serious game breaking issues. But the devs did not care, while this was all going on, they were at a German convention center celebrating the release of their game. When they finally got back to the states, did they bother fixing the issues or at least address the community on what they plan to do? Nope, they went to PAX West in Seattle to yet again, celebrate and share their game at another convention. \n\nThis is how you DON'T do things when you're developing a VERY unique game. I give them credit for approaching a very tough idea for a game. But they didn't pay enough attention to anything that was going on. \n\nThe Developer team: https://www.frostkeep.com/\n\nTeam Memebers:\n\nJEREMY WOOD\nMAT MILIZIA\nSOLOMON LEE\n\nThese are names you want to keep an eye out for when buying another random game. If any of these names are a part of that team, STAY AWAY. Horrific group of people to be in charge of a video games development.\n\nhttps://youtu.be/NWfpQ4_pyjA", "timestamp_created": 1551199660, "timestamp_updated": 1551200698, "voted_up": false, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.624671876430511475", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "44990752": {"recommendationid": "44990752", "author": {"steamid": "76561198079631087", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 17287, "playtime_last_two_weeks": 0, "playtime_at_review": 17287, "last_played": 1536823710}, "language": "english", "review": "On a real note, i enjoyed this game on the first three weeks of it being out however now......The problem seems to be developers / Admins off the discord keep you in the blue with alot of stuff, Servers are rubbish. Its all a reptitive grind for just no result. They expect to be out of alpha in 6-12 months they'd need a few years because their very incapable of pushing forwards. They have a dead game right now. Maybe 100 players at the lowest time. If they pull something magic out of their hat it'd be a great game. However i dont see Frostkeep doing this. Feels like their adding content which is useless and none of the community like however they still keep it in they are VERY slow with updates. Their Community  manager isn't the best with criticism i feel like under a different development this game could be insanely good. Would i reccomend it to friends or family or even a stranger of course not. They have a long way to go and for £22.99 its not even worth half that in its current state of development.", "timestamp_created": 1538174331, "timestamp_updated": 1538174331, "voted_up": false, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.622986316680908203", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "45858309": {"recommendationid": "45858309", "author": {"steamid": "76561198277881265", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 18661, "playtime_last_two_weeks": 0, "playtime_at_review": 8284, "last_played": 1585931414}, "language": "english", "review": "At the moment the game is struggling with a proper amount of online players. But the concept is great, fell in love with the project since the announcement trailer. The developers are putting a lot of work and the game is improving with every patch. The survival side is great, but need more PVP elements, that's seems to be the main issue for most players. But nothing that can't be fixed! Wish all the best to the developers!", "timestamp_created": 1542451879, "timestamp_updated": 1542451879, "voted_up": true, "votes_up": 18, "votes_funny": 1, "weighted_vote_score": "0.621529996395111084", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "105330160": {"recommendationid": "105330160", "author": {"steamid": "76561198169367153", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 3389, "playtime_last_two_weeks": 0, "playtime_at_review": 3389, "last_played": 1542675660}, "language": "english", "review": "IF you are wanting to buy this game and happen across this review, the game is no longer supported/ abandoned. It was a really cool game, just sad to see it went to waste with this shitty company.\n\nHopefully someone takes this game and runs with it.", "timestamp_created": 1638756406, "timestamp_updated": 1638756493, "voted_up": false, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.621187269687652588", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "44223061": {"recommendationid": "44223061", "author": {"steamid": "76561198040410730", "num_games_owned": 0, "num_reviews": 35, "playtime_forever": 16758, "playtime_last_two_weeks": 0, "playtime_at_review": 12519, "last_played": 1551833327}, "language": "english", "review": "This game is dead.", "timestamp_created": 1534573339, "timestamp_updated": 1551833368, "voted_up": false, "votes_up": 16, "votes_funny": 2, "weighted_vote_score": "0.618994832038879395", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "87615581": {"recommendationid": "87615581", "author": {"steamid": "76561198116652346", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 3986, "playtime_last_two_weeks": 0, "playtime_at_review": 3986, "last_played": 1561187141}, "language": "english", "review": "No longer playable.", "timestamp_created": 1614526808, "timestamp_updated": 1614526808, "voted_up": false, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.611764669418334961", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "53753734": {"recommendationid": "53753734", "author": {"steamid": "76561198092107075", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 5663, "playtime_last_two_weeks": 0, "playtime_at_review": 5663, "last_played": 1562213827}, "language": "english", "review": "Was an interesting concept and a somewhat fresh take on the survival genre, but now the servers are dead and the true ultimate point of the game is nigh in-achievable. If only they would come back and fix the games bugs, keep the servers up, that'd be cool.", "timestamp_created": 1562393744, "timestamp_updated": 1562393744, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.611597955226898193", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43918340": {"recommendationid": "43918340", "author": {"steamid": "76561198089792284", "num_games_owned": 153, "num_reviews": 2, "playtime_forever": 2888, "playtime_last_two_weeks": 0, "playtime_at_review": 1129, "last_played": 1555351303}, "language": "english", "review": "I would like to talk about the biggest complaint that people seem to have with this game. That is griefing and not really being able to do anything about it. I think a major problem with the way people are handling this is that they aren't understanding the main purpose of their factions base. A faction's base is meant to be a crafting station and a place to deposit your spirits that you get out in the world. It is NOT your personal home where you should be putting valuable loot that you and your friends spent a lot of hours working to get. There is a reason that the final tier of the basic survival crafting tree is the divinity stone, which allows you to claim land as your own. This game doesn't have building in it for no reason, and if you don't want people griefing and taking all your crap, don't leave it in some random chest in the spawn for someone to take. This also doesn't mean you should build a base and never come back, and I think rend did a good job by not allowing people to craft everything in their own personal home. Even strategically speaking having all of your factions loot inside one small square base isn't exactly the best idea. Go out and explore the world, build up something for you and your friends, and you can even make it so that other faction members can't open your door, and then you should be good. Again don't forget to deposit your spirits and fortify your factions base when you can, that is the purpose of this game. Also I know that people aren't just griefing rare loot, but they are throwing out basic ore while it is cooking and everyone else is around. Again this shouldn't be that hard to stop, just actually get to know your faction and communicate. You don't need a mic or have to put up a picture of yourself or anything like that, just type /faction. I was in a server where this one guy kept coming in and throwing out our stuff, and me and a couple other people were constantly telling new factions members to look out for this guy and to let other people know. So when someone saw him come online, there were 3 or 4 people saying in the faction chat, \"Hey this guy is throwing out loot and being a loser, watch out.\" And people would take loot out to prevent him from doing anything and they would just ignore him. If he tried attacking people he would get killed by a few of us, and if no one went out of the way to attack him, then there was nothing for him to do and he probably got bored. Don't feed the trolls and argue with him and attack because that is what losers like that guy want. If you have a friends base to go to, or your own then go there and do something else for a while.\n\nThis is one of those games that is either going to be really good, or complete trash. I personally think it will be very good if they stay on the right track, and I believe that over time this game could gain a decent community that works together and helps each other out. But that simply will not happen if people keep allowing griefers to take their stuff and give it to other factions. That will just create toxic players and completely ruin this game. \n\nAt the same time, the system isn't perfect as is. There needs to be even better way to stop griefers, and I think that rend is already on to it with the faction rep system. Maybe the top 3 people in the faction are the leader and 2 officers or something, and they have the ability to initiate a vote kick or something, and they could only allow like people who have a decent amount of rep to vote. After someone is kicked the rest of the faction could then get a pop up saying like should that guy have been kicked and if enough people say no then whoever started the vote loses a lot of rep. And maybe if you lose a certain amount of rep then you lose the ability to ever become a officer type again.", "timestamp_created": 1533339974, "timestamp_updated": 1533339974, "voted_up": true, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.611360847949981689", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "63192693": {"recommendationid": "63192693", "author": {"steamid": "76561198239753478", "num_games_owned": 0, "num_reviews": 17, "playtime_forever": 2677, "playtime_last_two_weeks": 0, "playtime_at_review": 2677, "last_played": 1534276939}, "language": "english", "review": "Game is about to be unplayable due to server shut down. You won't be able to get your money's worth.", "timestamp_created": 1581215369, "timestamp_updated": 1581215369, "voted_up": false, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.609678745269775391", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "62121560": {"recommendationid": "62121560", "author": {"steamid": "76561198123288373", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 17144, "playtime_last_two_weeks": 0, "playtime_at_review": 17144, "last_played": 1553911427}, "language": "english", "review": "Great game, great potential...yet it's abandoned by devs.", "timestamp_created": 1579497452, "timestamp_updated": 1579497452, "voted_up": false, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.608644425868988037", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43866999": {"recommendationid": "43866999", "author": {"steamid": "76561198271926579", "num_games_owned": 54, "num_reviews": 1, "playtime_forever": 153, "playtime_last_two_weeks": 0, "playtime_at_review": 62, "last_played": 1533082343}, "language": "english", "review": "The game looks cool and like it could be a lot of fun but after a few hours of play i realised how shallow the game is. It is literally just harvest up one group of material so that you can get that group of gear and then start harvesting the next highest material. Also there is not enough incentive to use your resources on your faction base. People will camp the workbenches and just take what people craft for themselves. Also after only playing for a couple of hours I exprerienced 3 server crashes. Refunded it and would not recommend buying it until full release.", "timestamp_created": 1533103871, "timestamp_updated": 1533103871, "voted_up": false, "votes_up": 76, "votes_funny": 14, "weighted_vote_score": "0.60802161693572998", "comment_count": 22, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "94295591": {"recommendationid": "94295591", "author": {"steamid": "76561198088738533", "num_games_owned": 196, "num_reviews": 5, "playtime_forever": 24487, "playtime_last_two_weeks": 0, "playtime_at_review": 17849, "last_played": 1706208988}, "language": "english", "review": "Frostkeep Studios\n\nJeremy *\nCo Founder and CEO\n\nSolomon *\nCo Founder and CEO\nDid animate for Beast Wars, dude gets a half pass.\n\nMatt *\nCo Founder\n\nMichele *\nChief Marketing & Communications Officer\n...lmao, now works at EA. Makes sense.\n\nAll public information, not DOXing. Even left out the last names. All thieves.\n\nSold a game. Year later, no one can play. The end.", "timestamp_created": 1624573808, "timestamp_updated": 1624573808, "voted_up": false, "votes_up": 18, "votes_funny": 3, "weighted_vote_score": "0.606660902500152588", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "54526776": {"recommendationid": "54526776", "author": {"steamid": "76561198167890035", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 1678, "playtime_last_two_weeks": 0, "playtime_at_review": 1678, "last_played": 1551579653}, "language": "english", "review": "Note to self: never buy any of their other games they make or have made. quick cash grab and ran quicker then my father for a thing of milk.", "timestamp_created": 1565317934, "timestamp_updated": 1565317934, "voted_up": false, "votes_up": 16, "votes_funny": 4, "weighted_vote_score": "0.606495797634124756", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "51142859": {"recommendationid": "51142859", "author": {"steamid": "76561197997377382", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 1665, "playtime_last_two_weeks": 0, "playtime_at_review": 1665, "last_played": 1536433574}, "language": "english", "review": "the dev pretty much decided to say fuck it and abandon their shitty game that people pay for. Never buy from that company.", "timestamp_created": 1560106013, "timestamp_updated": 1560106013, "voted_up": false, "votes_up": 15, "votes_funny": 1, "weighted_vote_score": "0.605882763862609863", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "49895066": {"recommendationid": "49895066", "author": {"steamid": "76561198048797355", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 920, "playtime_last_two_weeks": 0, "playtime_at_review": 920, "last_played": 1554062655}, "language": "english", "review": "More than half the negative reviews praise the game and then say no when it comes to recommending because there aren't enough players. Seems like they don't realize the \"Mostly Negative\" might be a reason why more people aren't trying the game. You want more players but hey, you're not gonna tell them to buy this game. That seems very counter-intuitive, don't ya' think?\n\n\nGame is pretty decent with a focus on playing as a community. The core design automatically combats the Alpha tribe issue common in other games in the genre. If you like games of the sort and are looking for a somewhat unique take on it, I would definitely recommend checking Rend out.", "timestamp_created": 1554132008, "timestamp_updated": 1554132008, "voted_up": true, "votes_up": 23, "votes_funny": 3, "weighted_vote_score": "0.603039026260375977", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "106231581": {"recommendationid": "106231581", "author": {"steamid": "76561197968127224", "num_games_owned": 937, "num_reviews": 35, "playtime_forever": 1268, "playtime_last_two_weeks": 0, "playtime_at_review": 1268, "last_played": 1640091699}, "language": "english", "review": "Great game while it lasted. A shame it's been abandoned with no option to even host a private server. Why do devs do this? GIVE PEOPLE AN OPTION TO HOST PRIVATE SERVERS and bypass your STUPID in-game server browser. Such a shame.", "timestamp_created": 1640091833, "timestamp_updated": 1640091833, "voted_up": false, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.602059125900268555", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "70085310": {"recommendationid": "70085310", "author": {"steamid": "76561198099645466", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 1840, "playtime_last_two_weeks": 0, "playtime_at_review": 1840, "last_played": 1590914406}, "language": "english", "review": "I wanted to get back into the game...what happened? :(", "timestamp_created": 1590914477, "timestamp_updated": 1590914477, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.600683629512786865", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "67863744": {"recommendationid": "67863744", "author": {"steamid": "76561198071034028", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 517, "playtime_last_two_weeks": 0, "playtime_at_review": 517, "last_played": 1533269053}, "language": "english", "review": "I thought this game had promise, but I guess not! I didn't pay $30USD for a screensavor! Not even single player, and all the server shut down. Devs of any game making NEED to commit to the games they create!", "timestamp_created": 1587632844, "timestamp_updated": 1587632844, "voted_up": false, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.599685728549957275", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "44263352": {"recommendationid": "44263352", "author": {"steamid": "76561198023439890", "num_games_owned": 218, "num_reviews": 2, "playtime_forever": 84346, "playtime_last_two_weeks": 0, "playtime_at_review": 14988, "last_played": 1702335923}, "language": "english", "review": "Rend is a great game. The crafting is complex, the pvp combat is nerve wrecking and fun and the faction warfare creates a reason for community. Team work is a must. Give it a try.", "timestamp_created": 1534721044, "timestamp_updated": 1534721044, "voted_up": true, "votes_up": 13, "votes_funny": 2, "weighted_vote_score": "0.599619567394256592", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "43937784": {"recommendationid": "43937784", "author": {"steamid": "76561197980137515", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 1643, "playtime_last_two_weeks": 0, "playtime_at_review": 1632, "last_played": 1535614030}, "language": "english", "review": "I'm enjoying this game so far. There are a lot of complaints about how new players and griefers can throw the faction off track. This is a strength and a weakness. It's tough for a bunch of randos to coordinate well enough to run a good faction. There's a lot of freedom and shared responsibility. I don't think this is a problem with the game as much as it is a problem with the players. As the game matures, people will form clans (a feature built into thegame) on discord and coordinate meaningfully. A culture will emerge where people will understand what to do. Further, there are mechanisms that prevent new players from derailing an established faction (protected chests).", "timestamp_created": 1533431175, "timestamp_updated": 1533431175, "voted_up": true, "votes_up": 32, "votes_funny": 2, "weighted_vote_score": "0.599072635173797607", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44118214": {"recommendationid": "44118214", "author": {"steamid": "76561198047002838", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 15985, "playtime_last_two_weeks": 0, "playtime_at_review": 9048, "last_played": 1536229004}, "language": "english", "review": "The game in it's present state is not worth buying.  The pvp seems one sided. Some class's can glitch into and out of bases (tested). Personal bases are easily destroyed. Once you get behind in the game it's extremely hard to recover. Right now to many glitches and cheats being used in the game to make it worth while in it's present state. The concept is good but right now that's all it is a concept.", "timestamp_created": 1534164315, "timestamp_updated": 1534164315, "voted_up": false, "votes_up": 27, "votes_funny": 0, "weighted_vote_score": "0.598967015743255615", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "97832910": {"recommendationid": "97832910", "author": {"steamid": "76561198337882917", "num_games_owned": 163, "num_reviews": 60, "playtime_forever": 1110, "playtime_last_two_weeks": 0, "playtime_at_review": 1110, "last_played": 1545509144}, "language": "english", "review": "dropped game after less than 6 months and no way to play anymore", "timestamp_created": 1629337744, "timestamp_updated": 1629337744, "voted_up": false, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.597613394260406494", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "44020123": {"recommendationid": "44020123", "author": {"steamid": "76561198064539225", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 45393, "playtime_last_two_weeks": 0, "playtime_at_review": 32773, "last_played": 1651257683}, "language": "english", "review": "Newest Review: Changing my recommendation back to yes the devs seem to be starting to communicate with the players more and things are slowly moving to a better balance between building/crafting and PVP\n\nCheck out the new PVE and FFA game modes!\n\n\n\n\n((Last Review\nWell Im really sad I have to do this but i feel recent changes to the game are so bad i have to completely change my review =(. (original below)\n\nREND started out as a great mix between adventure, pvp, building and survival a lot of things needed work like the balance of how to achieve the win in a saga among so many other things that were understandable in such each stages of an EA. Due to the fact that I feel like they have taken 1 too many steps in the wrong direction I have to say I am unsure if it will end in a place I would be happy as a player.\n\n\nBefore the most recent patch even builder/gatherers such as myself admited that the winning goals needed to align more with the \"PvP' theme of the game. unfortunetly they tried to do this but not only did they do it in a way that makes building obsolete and gathering tedious, I feel that the changes they DID make will ultimatly not achieve the desired intent.\n\nMany of the builders i know logged on for an hour and now have all quit until further notice and i am fairly certain the crafters will be soon to follow. Im very sad because i had never seen a survival game create such a succesful synergy between PvPers/Crafters/gatherers/builders as REND had when it started. \n\nI hope they change this because the people who love to just go out and pvp need the builders and the crafters. they would just go out and pvp naked for the most part rather than build or craft.  \n\nHope to see this change back in the future =/ hope it isnt too late))\n\n\n\n\n((Original review: when i first logged on I thought \"great an ark clone\" but this game is so much better. I am not typically a PVP oriented gamer but the system in REND is so well done i actually enjoy it. We even have a decent number of people on our faction who dont pvp at all they just do the stuff they enjoy and it still works. I love the game so far I really hope the devs keep up the good work. \n\nThey could really use a much larger customer support team however =)))", "timestamp_created": 1533825646, "timestamp_updated": 1542851418, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.593879997730255127", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "51260397": {"recommendationid": "51260397", "author": {"steamid": "76561198242540404", "num_games_owned": 118, "num_reviews": 38, "playtime_forever": 1555, "playtime_last_two_weeks": 0, "playtime_at_review": 1555, "last_played": 1534858864}, "language": "english", "review": "Game kinda died immediately after launch, should have kept it in beta for a bit longer, patch things up.\n\nShame, was going to be a good game.", "timestamp_created": 1560706260, "timestamp_updated": 1560706260, "voted_up": false, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.593685626983642578", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "86957682": {"recommendationid": "86957682", "author": {"steamid": "76561198173604618", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 997, "playtime_last_two_weeks": 0, "playtime_at_review": 997, "last_played": 1533827621}, "language": "english", "review": "Rend could've been great, but the devs were too greedy and lazy to even bother with it . The devs were  quite committed to it in early access until one day they just decided they no longer wanted to work on the game, released it unfinished, and abandoned it. Please never purchase anything from Frostkeep studios; they don't care about their customers or games at all.", "timestamp_created": 1613658105, "timestamp_updated": 1613658105, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.592628538608551025", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "49710179": {"recommendationid": "49710179", "author": {"steamid": "76561198003447698", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 8090, "playtime_last_two_weeks": 0, "playtime_at_review": 8090, "last_played": 1549784242}, "language": "english", "review": "The faction mode stopped me from trying the game first. But on classic pvp an pve servers the game shows how great it simply is. I am not playing it in faction mode due to a lack of commitment and time.\n\nThe different tiers are well balanced. You keep being in danger and that makes it a real thrill. It keeps the thrill of a survival game through different tiers of developpment which most other survival games fail at. I can definitely recommend it as a solo or coop survival game. My playtime speak for itself regarding the amount of content besides the faction part.", "timestamp_created": 1553331339, "timestamp_updated": 1553331339, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.591929256916046143", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "71500947": {"recommendationid": "71500947", "author": {"steamid": "76561198169144450", "num_games_owned": 1149, "num_reviews": 34, "playtime_forever": 1118, "playtime_last_two_weeks": 0, "playtime_at_review": 1118, "last_played": 1547325798}, "language": "english", "review": "Underrated Game, would have played it if there were more players :/", "timestamp_created": 1593274542, "timestamp_updated": 1593274542, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.591823041439056396", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}}, "query_summary": {"num_reviews": 1, "review_score": 5, "review_score_desc": "Mixed", "total_positive": 519, "total_negative": 486, "total_reviews": 1005}, "cursors": {"AoIIPwAAAH2iuOAE": "Mon Apr 22 23:47:59 2024"}}
