{"reviews": {"158204255": {"recommendationid": "158204255", "author": {"steamid": "76561198019601657", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 1292, "playtime_last_two_weeks": 0, "playtime_at_review": 1292, "last_played": 1707796296}, "language": "english", "review": "First half of the game is very beautiful, good survival mechanics (though the crafting process lacks a an enormous amount of polish and QOL).\n\nSecond half of the game is the worst hallway / walking simulator Ive ever experienced, and it never gets any better. In fact, you have to back track tons of times. Literally 2+ minute long hallways that you have to walk back and forth to progress.\n\nYou're probably going to have more fun if you just assume the game ends when you warp the Normandy to the next sector. Just pretend that it warped you home.", "timestamp_created": 1707796481, "timestamp_updated": 1707796481, "voted_up": false, "votes_up": 30, "votes_funny": 2, "weighted_vote_score": "0.733573257923126221", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159489162": {"recommendationid": "159489162", "author": {"steamid": "76561198009653095", "num_games_owned": 1452, "num_reviews": 183, "playtime_forever": 1094, "playtime_last_two_weeks": 0, "playtime_at_review": 1094, "last_played": 1709147327}, "language": "english", "review": "Had the general gameplay been less tedious, i would probably have recommended the game.\nas a survival crafting game, one of the things it does do quite well is the slow progression of objectives, in the form of\n\"in order to complete this objective, you need to do these things, and in order to do those things, you need some other things\".\nIt continues this through most of the game, which was a nice progression in the game.\none of the biggest issues with the game is the slow movement, both in space, in stations and even on vehicles, everything just feels immensly slow, as all of the important areas are far from eachother, you will be stuck just slowing traveling to one area from the other with not much else going on.\nnot to mention weird design choices in regards to crafting and researching, some things will take 10 to 20 minutes to research and you just sorta have to twiddle your thumbs until it's finished.\nthere's an issue with the dialogue if you move too far into a new area or activate one of the generic voice lines, the first voice line will be cut off, this happening quite frequently and got annoying\nwhich is a shame because the story and humor is probably the better or at least more interesting part of the game\nthe gameplay also more or less changes style after chapter 3 and becomes a \"space flight\" game with the regular crafting mechanics whenever you enter a station, where for some reason you have to \nrun back and forth from your spaceship to craft stuff and where ever you need to use said crafted stuff, which just feels like padding.\n\nThere was also this weird bug where my entire hud was in the Acrylic alphabeth instead of english, so i understood nothing, but could still easily determine what did what from interaction throughout the game and the icons.\nthen after loading into the game another day, it was suddenly in english, so idk what happened. \n\nthere is a DLC, but it was just \"see how long you can survive in space\"\n\nthe humor in the game is hit and miss, since humor is subjective, how good it will be, is down to the individual.\nsome of it is fun, some not so much and some is just utterly confusing.\nthere might be something that you'd find funny, but probably also some you'd not.\n\nwhile i wouldn't recommend this one, i'm still fairly optimistic for their sequel and if they can flesh out some of the tedium with that, i'd definetly pick it up, as i enjoyed the story and comedy overall.", "timestamp_created": 1709148074, "timestamp_updated": 1709148391, "voted_up": false, "votes_up": 37, "votes_funny": 2, "weighted_vote_score": "0.705546200275421143", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159717159": {"recommendationid": "159717159", "author": {"steamid": "76561198975981501", "num_games_owned": 93, "num_reviews": 4, "playtime_forever": 785, "playtime_last_two_weeks": 0, "playtime_at_review": 589, "last_played": 1709575023}, "language": "english", "review": "If u want a game thats like subnautica but more story ish, then this is the game for u. Been playing like 10 hours non stop now and its so much fun. And i feel like ive got LOADS left before its finished. I really recommend getting this game, 100% worth it!", "timestamp_created": 1709413162, "timestamp_updated": 1709413162, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.630419492721557617", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161599352": {"recommendationid": "161599352", "author": {"steamid": "76561198053926269", "num_games_owned": 0, "num_reviews": 39, "playtime_forever": 1274, "playtime_last_two_weeks": 0, "playtime_at_review": 1274, "last_played": 1711561762}, "language": "english", "review": "I....just dont know.\n\nThis game wants to be subnautica in space and funny. Humour is subjective, most jokes are obscure references. There was one joke that made me laugh out loud tho. Because it references Subnautica and made me think that it is a better game in every regard.\n\nExploration:\nWhile subnautica uses its whole world, Breathedge uses new Areas for every chapter. While until chapter 4, you can always go back to previous chapters areas, you almost never need to. \nBUT: There is just an aweful lot of backtracking and grind. Subnautica solved this, by having a much more interesting world (space is empty) and the needed resources in every direction. There were enough parts of every vehicle to scan for example. Breathedge puts a ton of markers on your screen, so you just travel there, get a blueprint, return, get resources, craft, and then see that you need four instead of one, so you grind.\n\nTravel: Travel in general is way to slow. Expecially later in the game i found myself pressing W for some minutes, while scrolling reddit on my phone. No enemys, nothing to see, just empty space while you backtrack.\nIn later chapters, you walk a lot through space station corridors, at your goal, you need to craft something and you have all the ressources, but you need to travel back to your ships crafting bench, back to your goal,. back to your ship. At one point, the game even taunts you with a quick travel that does not exist. Why?\n\nCrafting: Is okay, but grindy. What i did not understand is, why the resource needed for batteries demanded a tool that needed batteries to craft, forcing you to scavenge for batteries in some scarce resource cache, while the needed resource was right there, taunting you.\n\nStory: It works with a lot of suspense by spoken promises that most of the time dont deliver, which gets stale after the third time.\n\nSo why do i still recommend it? Because in the later chapters, i had fun with the story. In the earlier chapters, there was so much potential, an many nice ideas for setpieces, But there is just so much...emptyness in between. Play in small doses.", "timestamp_created": 1711563920, "timestamp_updated": 1711564289, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.615406930446624756", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159475643": {"recommendationid": "159475643", "author": {"steamid": "76561198130658181", "num_games_owned": 786, "num_reviews": 249, "playtime_forever": 203, "playtime_last_two_weeks": 0, "playtime_at_review": 203, "last_played": 1709052266}, "language": "english", "review": "A fun game that helps you relax and have a good laugh.  Just recently remembered playing Voidtrain and this game gives just as much fun.", "timestamp_created": 1709133677, "timestamp_updated": 1709133677, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.586526691913604736", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159562983": {"recommendationid": "159562983", "author": {"steamid": "76561199025556581", "num_games_owned": 30, "num_reviews": 8, "playtime_forever": 260, "playtime_last_two_weeks": 0, "playtime_at_review": 127, "last_played": 1709246150}, "language": "english", "review": "We are engaged in a fierce grind in an incredibly beautiful outer space. Play in the story mode is a buzz, but the standard mode is terribly stifling the need to constantly extract oxygen, I can not imagine what happens at high difficulty level :)", "timestamp_created": 1709238964, "timestamp_updated": 1709238964, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.57055211067199707", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "157661418": {"recommendationid": "157661418", "author": {"steamid": "76561199153031929", "num_games_owned": 0, "num_reviews": 124, "playtime_forever": 57, "playtime_last_two_weeks": 0, "playtime_at_review": 44, "last_played": 1707155944}, "language": "english", "review": "played this game on Xbox like 3 years ago...excellent game, at least for the first half of the game...THEN it becomes a bit of a walking sim. I would have loved to see the building aspect taken a bit further like in Subnautica but for what its worth, its a great game. Try to get this on sale tho", "timestamp_created": 1707153398, "timestamp_updated": 1707153398, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.561845719814300537", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159652410": {"recommendationid": "159652410", "author": {"steamid": "76561197968691239", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 113, "playtime_last_two_weeks": 0, "playtime_at_review": 113, "last_played": 1709345608}, "language": "english", "review": "Other reviews mention the humor being the driving factor for enjoying this game, but the humor got on my nerves fairly quickly. It's offensively reddit tier. The restricted oxygen supply stressed me out. It's like a constant 100 sec timer I'm always trying to beat. Ended up refunding this game.", "timestamp_created": 1709346341, "timestamp_updated": 1709346341, "voted_up": false, "votes_up": 26, "votes_funny": 1, "weighted_vote_score": "0.558910191059112549", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160186463": {"recommendationid": "160186463", "author": {"steamid": "76561198069500987", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 448, "playtime_last_two_weeks": 0, "playtime_at_review": 448, "last_played": 1707860072}, "language": "english", "review": "I had very high hopes for this game, however unfortunately it has completely failed to make me want to continue playing it. The steam page and the reviews I saw for this game made it seem like it would be similar to Subnautica but in space, which I thought sounded great! However, in reality the game is more like Subnautica: Below Zero, but without the breathtaking scenery. \n\nSubnautica: Below Zero was a game I was really excited for as well, however what made that game fall short was how linear it was, it felt like I was constantly having to follow a linear plot when all I wanted was to have the freedom to explore. Breathedge falls flat in the exact same way. When you first start up the game it seems very intriguing, it sort of presents itself as an exploration-survival game, however you quickly realise that you can't really progress without following the linear plot and it just ends up feeling like being stuck in an endless tutorial. As soon as you feel like you're starting to gain some freedom and you begin settling into your base, the game suddenly throws you a curveball where you can't progress further without abandonning everything and moving to a new space because \"the plot says so\".\n\nOn top of all this the scenery is honestly pretty boring, there wasn't really anything that made me want to explore. It's all just the same kind of wreck pieces with the same things floating around and so I ended up feeling pretty unmotivated to do anything at all in the game. I think scenery is very important for a game like this, after all it's what made Subnautica: Below Zero somewhat tolerable, so the lack of scenery in Breathedge once again just makes it feel like an endless tutorial.\n\nThe humor in the game is also very hit or miss, you might like it but personally it made me cringe a lot. The humor can more or less be boiled down to \"haha boobs\" or jokes about the game itself which just makes the devs come off as insecure about their own game. It honestly just gets annoying since at points there's constant pop up messages that serve no point other than \"being funny\". The humor also feels very out of place and mostly just takes me out of the game, I get that they were trying to do something different but it honestly does not fit this game genre. Imagine playing Subnautica but the disaster you're in is just a joke, there's constant developer inserts and you have constant pop up messages on your screen every 10 minutes making boob jokes, it just doesn't work.\n\nBecause of all this I can't recommend Breathedge, I wish I could but the game honestly just feels disappointing and it really does not live up to expectations.", "timestamp_created": 1709994731, "timestamp_updated": 1709994731, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.554054081439971924", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159554956": {"recommendationid": "159554956", "author": {"steamid": "76561199471822271", "num_games_owned": 0, "num_reviews": 24, "playtime_forever": 474, "playtime_last_two_weeks": 0, "playtime_at_review": 436, "last_played": 1709482889}, "language": "english", "review": "An incredibly interesting game, just space). The developers very accurately conveyed the feelings of an astronaut left alone in this world, I know for myself. Thank you for this masterpiece!", "timestamp_created": 1709230782, "timestamp_updated": 1709230782, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.549444139003753662", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159795112": {"recommendationid": "159795112", "author": {"steamid": "76561198133011594", "num_games_owned": 0, "num_reviews": 23, "playtime_forever": 391, "playtime_last_two_weeks": 0, "playtime_at_review": 391, "last_played": 1709451838}, "language": "english", "review": "[b]Never trusting the top steam reviews ever again [/b]\r\n\r\n[h1] Straight-up disappointment [/h1]\r\n\r\nI could get into the brunt of it all in more detail, but I'm just going to say this:\r\n\r\n1. The humor\r\nI thought it could not get worse than Borderlands 3, boy was I wrong. Borderlands 3 \"humor\" is terribly dated and delivered in a very uninspired way. But this? This takes the cake. They leave you in silence for a sizable amount of time and then bombard you shitty joke after sloppy joke after shitty joke... again and again and again and again, and it feels like there's no end to it, until you reach that sweet moment of silence. 15 minutes pass. Out of left field another terrible joke hits you, it's PAINFULLY UNFUNNY!!!! Usually I do not really care, but when I'm bombarded with these terribly out-of-date eastern bloc millennial writer's jokes I really want to punch a hole in the wall. (*The \"humor\" consists of poop, pee, condoms, haha boobs, household appliances being used for purposes not originally intended.) I cannot understand how you can fuck up toilet humor this badly. But the writer for these knocked it out of the park.\r\n\r\n2. Pacing\r\n\r\nHoly shit, it is abysmally slow both in it's story delivery, movement and resource procurement. I cannot understand how some of the people in the reviews can compare it in a good way to Subnautica. The game does NOT take it self seriously even for a second and it does not respect your time as a player. There is almost zero need for you to explore. You're better of skipping all the exposition and just speedrunning to the end\r\n\r\nThe world, models, animations and moment to moment gameplay is fine otherwise.", "timestamp_created": 1709494035, "timestamp_updated": 1709494035, "voted_up": false, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.547945618629455566", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159686481": {"recommendationid": "159686481", "author": {"steamid": "76561197977840408", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 5, "playtime_last_two_weeks": 0, "playtime_at_review": 5, "last_played": 1709386247}, "language": "english", "review": "If you like serious survival games with a touch of humor to lighten things up (like Subnautica) don't consider this. It tries too hard.", "timestamp_created": 1709386614, "timestamp_updated": 1709386614, "voted_up": false, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.544389784336090088", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161553174": {"recommendationid": "161553174", "author": {"steamid": "76561198445217318", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 3989, "playtime_last_two_weeks": 0, "playtime_at_review": 3989, "last_played": 1711499507}, "language": "english", "review": "I completed breathedge tonight and wanted to give my two cents. I bought it on sale as I love the genre survival and crafting games. The game has a solid base featuring the essentials of any survival crafting game, a starting base, crafting bench with a stunningly beautiful space scenery ripe with debris and resources to gather.  As you progress through the chapters, particularly upon entering Chapter 4, the focus on survival crafting and exploration disappears as you move from one space debris to another to progress the storyline. The crafting progression depended on you finding the blueprints and I thought it was a bit slow. By the time I contemplated crafting a base or the small carlike vehicle, it was time to move onto the next chapter. Once you leave the chapter, you no longer have access to your base and resources. So I really didn't see a point in building a base. I also wish there were more/better storage options.\n\nThe visuals are stunning, immersing you deeply into your character's world. The AI suit/narrator acts as a companion and to help you progress through the story, although some of the humor occasionally teeters into cheesy territory— I found myself chuckling along regardless. The developers' quirky humor shines through, especially when you unexpectedly find yourself holding nothing but the steering wheel staring after what you thought was your only escape, lol The humor continues as you explore, as an example: https://i.imgur.com/X9Py2V0.png\n\nThe game's diverse gameplay elements, from space navigation to salvaging crashed ship pieces in later chapters, kept things engaging, although there was one moment that genuinely startled me. (Good one Devs!) I would recommend this game and I am looking forward to Breathedge 2 in the future.", "timestamp_created": 1711505629, "timestamp_updated": 1711505849, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.541778981685638428", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159562455": {"recommendationid": "159562455", "author": {"steamid": "76561198391225953", "num_games_owned": 185, "num_reviews": 152, "playtime_forever": 248, "playtime_last_two_weeks": 0, "playtime_at_review": 248, "last_played": 1709237945}, "language": "english", "review": "An interesting survival game with beautiful views of space. The game is constantly encouraging and does not let you get bored, adding a drop of humor", "timestamp_created": 1709238392, "timestamp_updated": 1709238392, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.536423861980438232", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160405592": {"recommendationid": "160405592", "author": {"steamid": "76561198024170676", "num_games_owned": 0, "num_reviews": 40, "playtime_forever": 87, "playtime_last_two_weeks": 0, "playtime_at_review": 87, "last_played": 1710270124}, "language": "english", "review": "yeesh ... just non-stop riffing. every description, every sentence has to have a pun. if the game would take itself, and it's players, the least bit serious it might have been nice. subnautica in space or something. but this ... bleh.", "timestamp_created": 1710270352, "timestamp_updated": 1710270352, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.533273935317993164", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160133435": {"recommendationid": "160133435", "author": {"steamid": "76561198031230612", "num_games_owned": 298, "num_reviews": 3, "playtime_forever": 3262, "playtime_last_two_weeks": 0, "playtime_at_review": 3262, "last_played": 1709855145}, "language": "english", "review": "This game is best described as \"Subnautica's slightly older, nutty Russian Cousin\", it has several elements of subnautica (resource gathering, exploration, a decent story line,etc) but it has a unique sense of humor intended for younger players. \r\n\r\nThe things I liked were the realistic environments (giant space rocks,etc), the space suit A.I. which is more of a narrator, the unique enemy concept that is apart of and contributes to the story line, the well thought out levels & scenery, and the design of the space station interior modules and shuttle craft/space ships.\r\n\r\nThe things I disliked about the game were: the limited number of internal space station modules that could be built within the space station modules, some resources were scarce compared to others,  the limited replayability once the story line had been played, the lack of customisation ability for the shuttles ( interiors and exteriors) the lack of scanners and repair tools within the game.\r\n\r\nWhile this is a good solid game, it feels like the developers could possibly add more content with DLC in the future, it would be nice to have customisable shuttles, more internal space ship modules, more resources to harvest and more space station/base options including buildable parts to make each space station/base feel more unique for the player.\r\n\r\nOver all I give this game a 4 out of 5, it's ideal for most players, but, some people may be turned off or bored by the comedy written into the scripts and story line intended for younger players", "timestamp_created": 1709932832, "timestamp_updated": 1709932832, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.527363181114196777", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160356113": {"recommendationid": "160356113", "author": {"steamid": "76561197992634158", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 557, "playtime_last_two_weeks": 0, "playtime_at_review": 557, "last_played": 1710197233}, "language": "english", "review": "I liked the jokes, but the rest of the game isn't as good. If you played Subnautica before playing this, you will be eventually disappointed with Breathedge", "timestamp_created": 1710197831, "timestamp_updated": 1710197831, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525547444820404053", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161724895": {"recommendationid": "161724895", "author": {"steamid": "76561198044933836", "num_games_owned": 759, "num_reviews": 304, "playtime_forever": 1219, "playtime_last_two_weeks": 0, "playtime_at_review": 1219, "last_played": 1711718150}, "language": "english", "review": "This game was hilarious and clearly a lot of love went into it, some great easter eggs and this game felt original, though it did feel that it dragged on a bit close to the end.", "timestamp_created": 1711718189, "timestamp_updated": 1711718189, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159881328": {"recommendationid": "159881328", "author": {"steamid": "76561198040802503", "num_games_owned": 7947, "num_reviews": 22, "playtime_forever": 2392, "playtime_last_two_weeks": 0, "playtime_at_review": 2392, "last_played": 1709608283}, "language": "english", "review": "good", "timestamp_created": 1709608365, "timestamp_updated": 1709608365, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159831551": {"recommendationid": "159831551", "author": {"steamid": "76561197998458618", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 1355, "playtime_last_two_weeks": 0, "playtime_at_review": 1355, "last_played": 1709541184}, "language": "english", "review": "I purchased this game at 70% off for $7.49. I can only recommend this game at or below that price.\n\nOverall it can be a fun distraction with a couple laughs here and there. The humor relies heavily on visual gags and references to the point where it can be detrimental. I recommend switching to the Russian dubbing w/ subtitles to go along with the soviet cosmonaut theme.\n\nOn gameplay: The game starts off strong with the key elements of any survival crafting game, small starting base, crafting bench, environment full of debris and materials. However as you progress through the chapters (specifically moving into chapter 4) survival-crafting-exploration is mostly dropped. Instead you get to pilot your ship to a handful of pre-marked stations that are completely linear to explore. These stations WILL waste your time by forcing you to backtrack through their linear hallways in order to craft arbitrary key items in order to progress. I didn't enjoy this portion of the game at all and I wouldn't recommend it if I paid full price.\n\nI've seen a lot of people compare this game to Subnautica which was one of the reasons I purchased it. The game is more enjoyable if you treat it as a parody of Subnautica in my opinion. You will be disappointed if you're expecting anything near that quality of survival / crafting / exploration / story from this game.", "timestamp_created": 1709543878, "timestamp_updated": 1709543878, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160295573": {"recommendationid": "160295573", "author": {"steamid": "76561198035458935", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 2276, "playtime_last_two_weeks": 0, "playtime_at_review": 2276, "last_played": 1710109364}, "language": "english", "review": "Nice start, but the humor gets more and more juvenile and borderline conspirancy theorist-like. Sometimes cringe worthy.\n\nIt has you going through hoops just to prolong the game; walk a long distance just to learn a new recipe for a specific solution you then have to walk all the way back to craft. And it happens several times.", "timestamp_created": 1710109766, "timestamp_updated": 1710109766, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.522058844566345215", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "162958907": {"recommendationid": "162958907", "author": {"steamid": "76561198001632671", "num_games_owned": 165, "num_reviews": 19, "playtime_forever": 1186, "playtime_last_two_weeks": 1185, "playtime_at_review": 1186, "last_played": 1713226969}, "language": "english", "review": "Man this game was dumb, but that is what I love about it. I loved so many times.", "timestamp_created": 1713226991, "timestamp_updated": 1713226991, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.52173912525177002", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160818823": {"recommendationid": "160818823", "author": {"steamid": "76561198119105840", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 1925, "playtime_last_two_weeks": 0, "playtime_at_review": 1925, "last_played": 1710732651}, "language": "english", "review": "Honestly a simple good time with  decent humor.", "timestamp_created": 1710732777, "timestamp_updated": 1710732777, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.52173912525177002", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "162708454": {"recommendationid": "162708454", "author": {"steamid": "76561199027893170", "num_games_owned": 322, "num_reviews": 27, "playtime_forever": 105, "playtime_last_two_weeks": 105, "playtime_at_review": 105, "last_played": 1712832811}, "language": "english", "review": "What a waste! The world is well crafted but man this game gets boring! Like who the hell thought this very low amount of oxygen is a good idea. I also didn't get the lousy humor and the spam I get from the suit. Sorry but not for me!\r\n\r\nStory: 2/10\r\nGraphics: 8/10\r\nGameplay and Mechanics: 6/10\r\nMusic: 2/10", "timestamp_created": 1712905683, "timestamp_updated": 1712905683, "voted_up": false, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.520188450813293457", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160442020": {"recommendationid": "160442020", "author": {"steamid": "76561197974175508", "num_games_owned": 148, "num_reviews": 10, "playtime_forever": 1811, "playtime_last_two_weeks": 0, "playtime_at_review": 1811, "last_played": 1710261288}, "language": "english", "review": "I recommend Breathedge for the sole reason of what it begins as, and what it's sequel could be if the developers learned their lessons.\r\n\r\nChapter 1-3 is an open world survival crafting game in space. The subnautica influences are directly in the game, so yes the influence in intended. Apart from the grind that drags on a bit, it's a solid game. Until it isnt.\r\n\r\nAt one point it is no longer a survival game. It just... stops. It then becomes a puzzle FPS. Oxygen isn't even a factor anymore for the last half of the game. You follow the objectives, follow the same formula. Walk down LONG hallways, find out you need to craft something at the end of the level, walk ALLLLL the way back to your ship to craft needed item, walk all the way back then leave. Repeat several times. \r\n\r\nTo reiterate the 2nd half of the game (give or take) feels like a completely different game, and it isn't a good game. I continued ONLY because the first half made me want to see the story through. It stopped becoming just playing the game and it turned into stubborn hate-playing. \r\n\r\nThe ending made me interested in what the sequel could be, and if they make the game more consistent and listen to the abundant feedback on this issue. \r\n\r\nSo, while I am recommending the game itself, I believe the game as a whole falls short. If Breathedge 2 is good, watch a playthrough on YouTube to find out the story without spending the time and money on the questionable first installment.", "timestamp_created": 1710327901, "timestamp_updated": 1710327901, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.519999980926513672", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "163021295": {"recommendationid": "163021295", "author": {"steamid": "76561198059456876", "num_games_owned": 226, "num_reviews": 4, "playtime_forever": 764, "playtime_last_two_weeks": 469, "playtime_at_review": 764, "last_played": 1713319975}, "language": "english", "review": "Just reinstall subnautica and play it again. If you want something much more padded and annoying then you could play this. The tools break so damn fast in this game. You know what would make it better? The Cyclops. But we cant have nice things. So when you're scanner breaks enjoy the 15 minute trudge back to your base to make another one.", "timestamp_created": 1713320233, "timestamp_updated": 1713320233, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.516248643398284912", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159857673": {"recommendationid": "159857673", "author": {"steamid": "76561198000464346", "num_games_owned": 0, "num_reviews": 42, "playtime_forever": 82, "playtime_last_two_weeks": 0, "playtime_at_review": 82, "last_played": 1709336936}, "language": "english", "review": "I only have 82 minutes, but that's just because I got annoyed and bored. I might get back to it at some point.\r\n\r\nThe game feels clunky. I didn't really experience satisfaction with any part of it. In fact, I felt the opposite with a lot of the game. The worst part was getting messages from Babe every five seconds, and they're horribly written with awful grammar, made it a nightmare to read. I get it though, the game even calls attention to it being the result of a poor translation device, but I'm not going to read a hundred thousand messages like that. Plus, she doesn't ever say anything useful. It's seriously all filler.\r\n\r\nThe crafting is meh. Some items are more specific about what they do, some are open ended and poorly named. The storage felt limited to a point that I couldn't gather many items for later use. I read that base building is a thing, and it would open up more storage. I don't know.\r\n\r\nNone of the jokes landed. They kept breaking the 4th wall, which isn't funny if you do it nonstop. \r\n\r\nThe gathering is probably the best part about this game. They did a great job filling the emptiness of space with a wide range of different sized pieces in the area you're supposed to be working through. While there isn't a tier system strictly in place, many of the resources are locked behind getting certain items. \r\n\r\nThe zero gravity felt decent, though entirely unrealistic. The accelerator being powered by farts was...I dunno. Like I said, the jokes weren't landing. While the type of movement was alright, the speed is absolutely terrible. It feels like a slog. I've read there are upgrades beyond the fart movement, but it's so bad I don't even want to play long enough to get them.\r\n\r\nOne great thing about the game is it doesn't hold your hand. If you don't explore, you will miss things. Discovery is almost entirely up to you.\r\n\r\nGet it on a steep sale.", "timestamp_created": 1709577097, "timestamp_updated": 1709577097, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.515644431114196777", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159925465": {"recommendationid": "159925465", "author": {"steamid": "76561198017700377", "num_games_owned": 378, "num_reviews": 1, "playtime_forever": 1546, "playtime_last_two_weeks": 0, "playtime_at_review": 1546, "last_played": 1709666157}, "language": "english", "review": "Got this game with a humble bundle and finally got a chance to try it out. Starts pretty good but then falls hard with too big of open areas and nothing in them. The developers add updates and address the community as \"attack helicopters.\" It gives of a vibe like a high schooler trying to convice his friends he has sex.", "timestamp_created": 1709667929, "timestamp_updated": 1709667929, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.509704709053039551", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158454443": {"recommendationid": "158454443", "author": {"steamid": "76561199153003757", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 893, "playtime_last_two_weeks": 0, "playtime_at_review": 893, "last_played": 1706028385}, "language": "english", "review": "[h1]Big disappointment[/h1]\n[hr][/hr]\nI don't normally write reviews, but this game deserves it, unfortunately in a negative way.\nBefore I bought the game I also read reviews where people wrote exactly this, but I figured it can't be that bad when they praise it in so many places.\nI finished the game because I wanted to know when it would reach its best stage. Unfortunately, that good stage is just at the beginning of game.\nIt was fun and funny for the first few hours, but after that the game became dull. After that, the wannabe jokes and allusions start to get boring and awkward, you'll rather say to yourself, I hope that was the last one (the jokes don't end even after the game is over). I don't know, I guess I don't understand this kind of (Eastern) humor. \nCrafting is tedious, so is traveling, and unlocking recipes is really illogical (např. twin air tank).\nThe quests are sloppy, about nothing and don't even make sense. You really can't do without a tutorial, I thought I could do without too.\nAccording to the reviews, it was supposed to be subnautica in space, but it is not, it cannot be compared to Subnautica. This game is mainly a parody of all quality games, especially Subnatica.\nThe last nail in the imaginary coffin is the end of the game  [spolier](after the boss fight) [/spolier], the spoiler [spolier] subnatica and the Death star [/spoiler]. Everyone who has finished the game knows what I'm talking about...\nI finished the game just so I wouldn't end up screwing it up right at the start. But it's a waste of time and money. I tried to find some positives, but there are really few.\n\n[h2]Summary: [/h2]\nI don't want to return the money, but mainly the time I spent in it. Better watch Family Guy instead.\nIf you can avoid this game as much as you can, you will only be disappointed.", "timestamp_created": 1708097887, "timestamp_updated": 1708098072, "voted_up": false, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.505449116230010986", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "157086940": {"recommendationid": "157086940", "author": {"steamid": "76561198454048448", "num_games_owned": 239, "num_reviews": 17, "playtime_forever": 14, "playtime_last_two_weeks": 0, "playtime_at_review": 14, "last_played": 1674789750}, "language": "english", "review": "sadly had to refund because the game kept crashing :(\ni dont think its my pc's fault either considering it can handle rdr2 and bg3\ndefinitely would love to play sometime in the future though if its not an issue", "timestamp_created": 1706490360, "timestamp_updated": 1706490477, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503816783428192139", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "93883347": {"recommendationid": "93883347", "author": {"steamid": "76561197995967575", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 3171, "playtime_last_two_weeks": 0, "playtime_at_review": 1864, "last_played": 1633461457}, "language": "english", "review": "Breathedge isn't a great game. It's two pretty good games sharing one title.\n\nGame 1 is just what it looks like on first glance: a free-roaming space survival game where you gather resources to build upgrades to increase how far you can safely travel. You can put plenty of hours into game 1 and have a grand old time, building up bases or puttering around on refurbished vacuum cleaners. It's pretty good. \n\nGame 2 kicks in kinda suddenly, though Breathedge does give you plenty of warning that you're about to pass a point of no return. In game 2, you leave behind any bases or vehicles you've built to engage in a largely linear story experience. Resources are abundant, but you don't really need them because there's no reason to actually build much of anything anymore. The gameplay takes a serious downgrade into full-on Walking Sim territory, but the writing takes a noticeable step up in quality now that it can just follow a linear ship. It's basically what you'd get if you took Portal 2 and removed all the puzzles. Not great. Pretty good. \n\nThis isn't an unfinished game. It's two unfinished games glommed together into one full-length experience. I give it a thumbs up because I had a good time, but the second half still left me rather disappointed at all the unrealized potential. Overall, it consider it worth the money and time I spent on it. Calibrate your expectations appropriately and you might enjoy it as well.", "timestamp_created": 1623899148, "timestamp_updated": 1623899148, "voted_up": true, "votes_up": 211, "votes_funny": 3, "weighted_vote_score": "0.9528617262840271", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "132320340": {"recommendationid": "132320340", "author": {"steamid": "76561197968255091", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 3028, "playtime_last_two_weeks": 0, "playtime_at_review": 2963, "last_played": 1676076322}, "language": "english", "review": "I really enjoyed this game. Right up until I didn't. \n\nThe first and second chapters are nice. A lot like Subnautica. You explore, survive, and craft, with a good mix of game mechanics. The humor is hit and miss - it made me laugh several times, and was never bad enough to get annoying, although it often walked that line. Everybody loves a good fart joke or a good breaking the fourth wall gag, but the game overdoes both. The environment is pretty. The story is... present... neither great or awful. \n\nIt is just challenging enough to make it interesting, at least in the early game. Survival itself is never really a challenge apart from oxygen in the early game, so it is very much like Subnautica in that regard. As you get upgrades they really feel meaningful and you start to feel more freedom, and the game does really well for maybe 20 hours. The end of chapter 2 starts to get a little tedious, because you no longer have to worry much even about oxygen, and are just exploring and figuring out the objectives, but it isn't bad. I still had fun with it. \n\nThe base building though...\n\nUnfortunately, despite the game giving you all kinds of options for base building, and being crammed full of little gag decoration items that you could put in a base, the actual implementation of the base is awful. The way objects despawn and respawn when you get far enough from the base interacts badly with the physics engine, so if you carefully place a bunch of furniture, containers, and decorations, it will look like it got hit with a tornado more or less every time you return to the base. There is a storage compartment you can build, but it is exactly the same size as a suitcase you can make much earlier in the game, and it can't be placed near the crafting table, so you invariably end up with a bunch of suitcases laying around to store things in. The base building part of this game is a massive disappointment and there is literally no reason to make anything more than the bare minimum you need with a pile of suitcases spread around on the floor, because anything you put time and effort into will just be destroyed by the game simply not working properly. \n\nAnd then you get to chapter 4. Ugh. Such a let down. \n\nIt is abundantly clear that something drastic changed in the dev team at this point. \n\nThe humor in the game takes a hard right turn into the sort of \"jokes\" that trolls use to try to \"trigger\" people in comments sections, and it's pretty blatant. The sort of mildly and deliberately offensive things that attention seekers say online to try to get a rise out of people. Not at all funny, not even really offensive, just sort of sad and childish shock jock nonsense and culture war BS. \n\nWorse though (because at this point I was already largely tuning out the humor) is that the game becomes a walking down the hall simulator in the worst way. Go here, walk all the way back, craft thing, walk all the way back, use thing, maybe fight something. The entire time these empty, boring hallways are crammed with resources you no longer give a damn about. You'll never have to worry about oxygen again, let alone food and drink. The game goes from being something I genuinely enjoyed, to the most blatant \"let's make the game play longer arbitrarily\" nonsense I've seen since my MMORPG days. \n\nIn conclusion, if you loved Subnautica and can get this game on sale, it is probably worth it, but brace yourself for the massive disappointment that the game becomes for the last few hours.", "timestamp_created": 1675693004, "timestamp_updated": 1675693004, "voted_up": true, "votes_up": 186, "votes_funny": 1, "weighted_vote_score": "0.92640918493270874", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "86684923": {"recommendationid": "86684923", "author": {"steamid": "76561198434338745", "num_games_owned": 134, "num_reviews": 4, "playtime_forever": 1806, "playtime_last_two_weeks": 0, "playtime_at_review": 585, "last_played": 1613797291}, "language": "english", "review": "Really fun in a lot of ways, and really tedious in others. There will be automatic comparisons to Subnautica, which is fair because they are so similar in some ways and yet polar opposites in other ways. Subnautica had an air tight sense of progression, while Breathedge's progression can feel extremely tedious at times due to how resources are allocated when building, how often you have to replace certain items, and how long it takes for you to achieve getting a device that expands your ability to explore. In Subnautica you always have a sense of being somewhat close to a major goal, while in Breathedge it feels so much more scattered and disorganized. Some of the building steps really needed to be streamlined or simplified to keep me going, because there are some parts where I just roll my eyes and can't believe I have to get more of this or build another thing to upgrade a certain thing. \n\nAs far as the humor goes, sometimes it works and sometimes it doesn't. Using condoms to breathe is kinda funny but not very clever to me if I'm being honest. I wish they had pushed the Soviet themes a bit further because some of it feels pretty half baked. For instance you can pee on anything, or use a chicken to plug a hole in a space station, but a lot of the time it feels like it's hurting the survival atmosphere. Random isn't always funny, at least to me. This part is entirely subjective so your mileage may vary. \n\nIt's a gorgeous game, and runs infinitely better than Subnautica (I still can't believe they used their own custom-made, completely garbage engine for that game). Props to the design team for embracing that retro-futuristic design language that works so well. On paper, this was a game that was supposed to be my bread and butter, but the tedious nature of the building process and resource retrieval as well as some of the somewhat tone-deaf humor really hurt my enjoyment of the game. I recommend the game for anyone to try as it might really click with you, and I will definitely support the developer for being unique and interesting.", "timestamp_created": 1613365389, "timestamp_updated": 1613365389, "voted_up": true, "votes_up": 341, "votes_funny": 1, "weighted_vote_score": "0.904998123645782471", "comment_count": 17, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "86288380": {"recommendationid": "86288380", "author": {"steamid": "76561197972541495", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 186, "playtime_last_two_weeks": 0, "playtime_at_review": 186, "last_played": 1611683125}, "language": "english", "review": "Subnautica in Space. There, I just saved you from reading someone else's 9 paragraph review :)", "timestamp_created": 1612897209, "timestamp_updated": 1612897209, "voted_up": true, "votes_up": 3154, "votes_funny": 556, "weighted_vote_score": "0.902277112007141113", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "47574222": {"recommendationid": "47574222", "author": {"steamid": "76561198041985869", "num_games_owned": 0, "num_reviews": 84, "playtime_forever": 256, "playtime_last_two_weeks": 0, "playtime_at_review": 234, "last_played": 1686535031}, "language": "english", "review": "Imagine if Subnautica was set in space and directed by Monty Python. This is that game. \n\nI really enjoyed the first chapter of this game, it's truly shaping up to be a masterpiece.  I love the story so far, the crafting is on point, and the fact that it has this silly aspect really separates it from the other crafting/survival games out there.  Great job on this beautiful game, I only wish I had more chapters to play! I'll be waiting!", "timestamp_created": 1544983304, "timestamp_updated": 1548972590, "voted_up": true, "votes_up": 133, "votes_funny": 7, "weighted_vote_score": "0.900335967540740967", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "75525688": {"recommendationid": "75525688", "author": {"steamid": "76561197965778706", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 470, "playtime_last_two_weeks": 0, "playtime_at_review": 325, "last_played": 1599374523}, "language": "english", "review": "I don't normally write reviews, but felt compelled to do one for this game. A lot of recommendations compare this to Subnautica (one of my favourites), and so picking it up seemed like a good idea...\n\nA few hours in, and I really can't stand the idea of continuing Breathedge.\n\nFirst of all, let me say this IS a well made game.\n\nIt's got great visual style, and you can tell a lot of effort has gone into building it. As of writing this, the game is still in early access, and just a couple months away from it's full release. I currently haven't seen a single bug or performance issue.\n\nIt's always refreshing to play a survival game (especially one in early access), that isn't a janky mess with bland art direction.\n\nThe game is clearly meant to be humorous. Unfortunately, it's dialed up to 11 from the beginning, so it's something you're either going to love or hate right away, there's no real in-between here. I wanted to like it, but ended up in the other camp...\n\nOne of the things about the humour that annoyed me the most was actually related to gameplay. Which is the single biggest reason why I can't bring myself to keep playing this game.\n\nFrom the start, the game makes fun of survival tropes by having you do arbitrary things and laughing at how pointless it is. This isn't a one off joke, but something that happens over and over again, either in the guided objectives themselves, or just general gameplay. It ends up feeling like one of the most pointless and arbitrary games I've ever played, and one of the most frustrating.\n\nWhich brings me to why I now can't stand this game-\n[b]Gameplay:[/b]\n\nLike most survival games, you'll spend your time in the early game gathering resources and unlocking new gear as you go. Unlike most survival games, the tools you use to do this are a joke (both literally and figuratively).\n\nSo far, I've found 6 different tools you will need to carry to collect different kinds of resources or complete objectives. And most are a variation of \"some junk duct taped to the end of a stick\".\n\nEach one requires different resources to craft, and each one breaks after only a few uses (this isn't an exaggeration, you'll be lucky to use a tool more than 5 times before it's dusted). When a tool breaks, it's gone for good. You have to craft a new one from scratch each time.\n\nI might be biased here in that I generally hate item \"durability\" as a gameplay mechanic in most games. It never feels realistic or satisfying for a knife to completely break after using it to craft a few pointy sticks, or a solid metal wrench crumbling to dust after repairing a few metal plates.\n\nThis game is by far the worst I've played in this regard. Tools break after so few uses, it feels like you barely get more resources out of using them than they take to build in the first place. Be prepared to fill your inventory with duplicate tools each time you go out.\n\nIn a move seemingly designed only to frustrate players, you have a grand total of only 4 slots to use equippable items (1-4 on the keyboard). When a tool breaks, you need to open the inventory and manually put a new one in the now empty slot. Oh, don't worry, the game doesn't pause when you access the inventory, so enjoy wasting oxygen while you faf around stuffing more junk into your pockets.\n\nThis brings us to the next most annoying part of the gameplay-\n[b]Oxygen:[/b]\n\nIt's an interesting mechanic, and I'm certainly not complaining about the concept being in a space survival game called \"Breathedge\"... It's just way too unforgiving in the first few hours of the game.\n\nStarting out you only have a single breath's worth of air to work with when you leave your ship. As you progress, you get upgrades to your oxygen capacity, and upgrades to an always too short-lived movement boost.\nPoints of interest are specifically scattered around the area just far enough away to be reachable (and returnable) in one breath. You need to visit these places to get the blueprints or specific resources to upgrade gear and progress. It's just blind luck that you find something that will make your life easier sooner rather than later. Too bad if the larger oxygen tank or the movement boost was in the last place you looked, even worse if you managed to miss it completely.\n\nA lot of these locations have some interesting dioramas of the final moments of the \"Unnamed\" ship's crew and passengers. Your spacesuit's AI will also say some cheeky remark about what you're looking at.\n\nIt's hard to really appreciate any of this, however. By the time you get to a place, you only have a few seconds of air to find what's worth grabbing and get back to the ship. The game actively punishes you for stopping to admire the environmental storytelling it's built, or when listening to the suit's banter. Strangely, the game does pause to let you read the wacky item descriptions of some of the things floating around these locations. So it's not like the devs didn't understand the issue.\n\nEventually you can slowly build little oxygen stations around the place to help get further away, but even those need to be re-supplied after a while. The early game is a lot of slowly floating to further away places, then slowly floating back, so you can then float a little further and back again each time.\n\nThere seems to be a lot of friction in space around this crash site too (I guess it's sticky dark matter or something floating around right?). Your spacesuit will quickly slow down and stop when you're not actively pressing W, and will almost instantly slow back to normal speed after the short-lived boosts you can do.\nThe \"boosts\" by the way, are caused by using gas from your own farts as propellant, and you can even unzip your fly and urinate all over things anytime you want, even in space! (beware of the cold). These are the kinds of quality \"jokes\" that everyone will love, I'm sure...\n\nI hear there's also base building and vehicles as you get further in the game. I might try and stomach going further to see if that makes things better. But I got to a point just after the game \"tricked\" me into building another literally useless item during chapter 2, and couldn't bring myself to keep going.\n\nIf the game is making a satirical point about how stupid and tedious these annoying survival mechanics are, thanks [b]Breathedge[/b], I read you loud and clear!", "timestamp_created": 1599372975, "timestamp_updated": 1599373397, "voted_up": false, "votes_up": 300, "votes_funny": 7, "weighted_vote_score": "0.896344304084777832", "comment_count": 28, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1614277404, "developer_response": "Hey there! Thanks for the extensive feedback, we too found these issues in need of balancing. The base oxygen level has been increased to 75 seconds (and we'll continue to tune it in the future based on player feedback) and the durability of some tools has been increased. \n\nAnd what's more, 1.0 is out, with 3 more chapters (and the game finale!) to explore. I'd be thankful if you could give Breathedge one more try, and share your feedback with us again."}, "58309600": {"recommendationid": "58309600", "author": {"steamid": "76561198085652670", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 2381, "playtime_last_two_weeks": 0, "playtime_at_review": 1981, "last_played": 1616960516}, "language": "english", "review": "To experienced gamers: Funny Subnautica in space.\n\nTo average gamers: Survival game where you collect materials(not very grindy) to create tools that help you advance in a funny story.\n\nTo noobs: The comedy in this game will likely not be enough to offset the amount of stress you get from trying not to suffocate in space. You have limited oxygen that can be upgraded as you progress.\n\nIf you're claustrophobic and hate planning small trips, Breathedge and Subnautica are not for you. Otherwise, these games are relaxing, entertaining, and super worth the money.", "timestamp_created": 1574894135, "timestamp_updated": 1574894135, "voted_up": true, "votes_up": 167, "votes_funny": 20, "weighted_vote_score": "0.896113336086273193", "comment_count": 14, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "90887515": {"recommendationid": "90887515", "author": {"steamid": "76561197968860508", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 4102, "playtime_last_two_weeks": 0, "playtime_at_review": 4102, "last_played": 1619251804}, "language": "english", "review": "I wanted to love this game. It seems to check off so many mechanics I like, offers the promise of being like Subnautica but in space. At first I was finding lots of the same enjoyment, \"diving\" into space to explore and gather resources before hurrying home to see what new things I could craft.\n\nBut, two things happened. I lost interest in the narrative, which just didn't seem very cohesive and good, and is scattered amongst random bits of humor, trying to be edgy but often just being uncomfortable. \n\nSecondly, the awaited conclusion of the game.. sucks. The entire format of the game changes, from being an open world survival craft exploration game to being a corridor shooter. A very, very bad one. All you have to look forward to is awkwardly shooting at a few turrets, two boss fights which both are simply red-light green-light running to designated spots. No more interesting exploration, no more habitat construction, no more foraging and gathering resources necessary. I stubbornly finished out the game, and am left very disappointed.", "timestamp_created": 1619343623, "timestamp_updated": 1619343623, "voted_up": false, "votes_up": 731, "votes_funny": 9, "weighted_vote_score": "0.892741501331329346", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "44756805": {"recommendationid": "44756805", "author": {"steamid": "76561198061084496", "num_games_owned": 642, "num_reviews": 73, "playtime_forever": 415, "playtime_last_two_weeks": 0, "playtime_at_review": 383, "last_played": 1548978605}, "language": "english", "review": "For only having one chapter, *and* being in early access, this sure feels like a finished game. Honestly my only complaints are that tools have a durability when the resources used to make them are seemingly finite, which means careless resource management can result in an unsolvable situation, and that the speed of the voice acting, and things in general could do well to be slowed down a little bit. I felt a bit overwhelmed by how fast the suit was talking at me, so much so I couldn't appreciate some of the dialogue.\n\nI would absolutely recommend this game. Even in early access, having just been released, it's already worth the price as is.", "timestamp_created": 1537059676, "timestamp_updated": 1537059676, "voted_up": true, "votes_up": 138, "votes_funny": 4, "weighted_vote_score": "0.886612117290496826", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "153305233": {"recommendationid": "153305233", "author": {"steamid": "76561198134333267", "num_games_owned": 117, "num_reviews": 8, "playtime_forever": 2570, "playtime_last_two_weeks": 0, "playtime_at_review": 1129, "last_played": 1703305700}, "language": "english", "review": "MUCH BETTER THAN I EXPECTED.  10/10\n\nI bought this game on sale and let it sit in my library for awhile. I finally started it a few days ago and WHOA! It's a little brutal at first, and a bit repetitive going in and out of your ship for air, but once you figure out the mechanics and upgrading process, the game offers you quite a bit and is actually quite fun. \n\nNEWER INTEL PROCESSORS WILL CRASH: (11th gen +)\n\nThere is a workaround posted by a developer at the top of the community forum for people with newer Intel processors who are experiencing crashes. Some may argue that they shouldn't have to apply this workaround, and to an extent I agree, however, it would seem that as of this review they still haven't patched it and applying the workaround is the only way to play it with newer Intel chips. \n\nHEY DEVS???? Patch your game. Too many people can't read or follow directions to apply the workaround. You're getting negative reviews because of something you could fix in an otherwise great game!\n\n7/10 because of the workaround. 10/10 if the DEVS step up and patch the game.\n\nEDIT:  12/21/2023\n\nGame is now 10/10 because the DEVS stepped up and updated their game. I was going to delete that part of my review since it no longer applies, but perhaps people should see that they cared enough to patch their game.  WELL DONE!", "timestamp_created": 1702221642, "timestamp_updated": 1703203001, "voted_up": true, "votes_up": 104, "votes_funny": 0, "weighted_vote_score": "0.873142838478088379", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "87494113": {"recommendationid": "87494113", "author": {"steamid": "76561198262251865", "num_games_owned": 462, "num_reviews": 350, "playtime_forever": 3208, "playtime_last_two_weeks": 0, "playtime_at_review": 379, "last_played": 1615505569}, "language": "english", "review": "This is only \"Subnautica in space\" if Subnautica made you re-craft the scanner tool every 5 minutes (literally). I supported this in early access, and I'm a little bummed this is what we get. \n\nPlease fix the balancing. Between the low oxygen (even after upgrades) and the low durability of every tool, I can barely get anything done and I've been playing for over 6 hours. I'm honestly about to quit, I have made at least 30 handy scrapper tools or whatever the hell they're called, and it's NOT FUN. It only has 35 \"uses\" before it breaks, and a simple piece of metal takes 6 hits. Other breakables take even more away. I want to progress and explore! Why the hell did you make a game, include a suggested difficulty, and then not allow the mechanics to let the player actually experience anything in the game?????\n\nHonestly I'm really liking the world and story and tone so far, apart from how I can't even get anything actually done in the damn thing cuz I'm too busy redoing crap I've already done. \n\nLet me be clear: It is so bad and so successful at ruining the experience here that I will 100% be using a cheat trainer so I can actually enjoy it, as soon as the darn thing updates from the 1.0 release. Definitely nuking tool durability entirely, and maybe then the laughable oxygen won't be such an insultingly tedious chore. \n\nPlease fix the oxygen and tool usage. It's awful.\n\nEDIT: I gotta complain about my biggest irritation--the \"metal\" most often comes in pieces you have to break with the scrapper, like I mentioned. Occasionally, there's single pieces you can pick up, but you get those first usually and there aren't many to begin with. Also, consider that each scrapper tool costs 3 metal pieces itself to craft. So, now imagine, you're out and about scrapping containers when your scrapper breaks. Shit! You don't have a spare! And you only have 1 piece of metal!!! ............Yup. You're basically screwed. You get to spend the next full hour of your gameplay re-scavenging areas you already went to, PRAYING that you missed a single floating piece of metal that you can use to make a scrapper---because you need the scrapper itself to mine meta and loot containers.\n\nHonestly, who allowed this???", "timestamp_created": 1614364581, "timestamp_updated": 1614365377, "voted_up": false, "votes_up": 1290, "votes_funny": 41, "weighted_vote_score": "0.872513651847839355", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1617110422, "developer_response": "Hey there!\n\nThanks for the feedback. There certainly were balance issues, and we’ve taken measures towards creating a better experience. The in-game tools have received a durability buff (Scrapper 35>50, many others 15>20), and fixed a number of bugs as well. There’s more info in our recent blog post here: https://store.steampowered.com/news/app/738520/view/3022451561583513184\n\nThe dynamics of survival in space should be more enjoyable now. Let us know what you think by sending a message to info@breathedge.com or visit our discord channel: https://discord.com/invite/eyURQXG."}, "96461702": {"recommendationid": "96461702", "author": {"steamid": "76561198115804969", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 1506, "playtime_last_two_weeks": 0, "playtime_at_review": 1506, "last_played": 1627396553}, "language": "english", "review": "Breathedge can approximately be summed up with the following;\n\nChapter 1; EXCITING! A test of your skills, introduction to important things and the beginning of the lore!\nChapter 2; A long, grindy affair, often requiring de-facto cow tools, did i mention everything is 5 km apart and you gotta travel in real time?\nChapter 3; EXCITING, a new set of skills, humor! Lore! A new quest and gadgets!\nChapter 4; Recreate the box art, several times, MORE LORE, a glorious trip and fun!\nChapter 5; Excellent, a good ending, and more silly antics.\n\nSo i'll give it a 4/5 really.\nI can recommend the game, but do beware of Chapter 2, it is LONG and often requires you to travel back and forth alot unless you read a guide and came crazy prepared.\n\nSpeaking of guides, read the one on how to get the space car, it will cut down travel time and save a very specific ressource, making chapter 2 more bearable.", "timestamp_created": 1627397414, "timestamp_updated": 1627397414, "voted_up": true, "votes_up": 99, "votes_funny": 2, "weighted_vote_score": "0.857085943222045898", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "102532692": {"recommendationid": "102532692", "author": {"steamid": "76561198114945375", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 698, "playtime_last_two_weeks": 0, "playtime_at_review": 698, "last_played": 1636478984}, "language": "english", "review": "Unexpectedly enjoyable spoof.\n\nIt seems unfair to tag this as similar to Subnautica, because it will get voted down due to unfulfilled expectations.\n\nIf you don't compare Breathedge to other games and assess it in its own right, you may find that this game can provide hours of fun with exploration, building and much sarcasm. \n\nIt does not take itself seriously, so if you are after a serious story you should look elsewhere. I found the lighthearted approach refreshing.", "timestamp_created": 1636544149, "timestamp_updated": 1636544149, "voted_up": true, "votes_up": 55, "votes_funny": 0, "weighted_vote_score": "0.848496615886688232", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "55646787": {"recommendationid": "55646787", "author": {"steamid": "76561197990258228", "num_games_owned": 0, "num_reviews": 47, "playtime_forever": 2308, "playtime_last_two_weeks": 0, "playtime_at_review": 1601, "last_played": 1675468115}, "language": "english", "review": "First let me say that the fact Steam's recommendation algorithms never once recommended this game to me means they are completely and utterly uselessly broken. I one day had the urge to dig through the favorably-reviewed sci-fi games for any hidden gems I might have missed, and this diamond of a game was what came up after a couple hours of digging.\n\nNext let me say this: Don't let the jokes on the store and news pages fool you. I was a bit hesitant, sometimes developers can get so absorbed in their \"could care less\" jokes like these that they end up treating their games the same way. The game itself is developed very seriously with lots of care, and lots of polish, not just for an early access game but for games in general. RedRuins (the developer) puts a lot of triple-A games to shame with the quality of their early access title.\n\nNow onto the actual game review itself:\n\nIt's amazing. I love Subnautica, and as others are saying this game is like Subnautica. Except, everything's better balanced, better polished, better written, better exploration, etc. The black humor the game is suffused in does break the hard sci-fi of it, but at the same time they willingly explain why your suit can't even hold a minute of oxygen un-upgraded (unlike Subnautica which just avoids the topic), why your flashlight has to recharge (because it's a piece of crap but at least you don't have to swap batteries out of it.) and etc.\n\nThe exploration is absolutely wonderful, and the suit's AI just makes it even better. The black humor primarily comes in as you explore and see the various ways other passengers on the crashed liner died in their final moments (because their suits only have 30 seconds of oxygen, of course.) but you also have to handle various puzzles to get into some places, which is FAR better than just using a laser cutter to make your way in.\n\nAlong the way, the afformentioned suit AI makes snarky, cynnical quips regularly. You come up to a person sitting in a chair that's been reduced to just bloody goop and bone, and the suit says: \"He must have been shaving with a chainsaw when the crash happened for I can imagine no other circumstance that would leads to this amount of damage.\" That's just one example, it would take me far too many words to properly convey how spot-on they've made the dialogue lines, and the voice actor is absolutely perfect for him too.\n\nOnto the elephant in the room: The black humor. Honestly it's difficult to imagine letting yourself find humor in the portrayal of a massive catastrophe in space, with thousands of dead passengers and your suit AI being your only company. I found the humor as palatable as the humor in BBC's Top Gear show (and Amazon's Grand Tour, I guess.) where a lot of humor is indeed drawn from its offensiveness. In other words, I really loved the humor in the game. Some of it is a bit much for me, but the little things don't detract from the whole here.", "timestamp_created": 1571348180, "timestamp_updated": 1571348180, "voted_up": true, "votes_up": 74, "votes_funny": 3, "weighted_vote_score": "0.848032951354980469", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "100533114": {"recommendationid": "100533114", "author": {"steamid": "76561198009990894", "num_games_owned": 742, "num_reviews": 59, "playtime_forever": 235, "playtime_last_two_weeks": 0, "playtime_at_review": 96, "last_played": 1633725881}, "language": "english", "review": "Do you like floating around with limited oxygen collecting resources with fragile tools you have to keep rebuilding? What about writing that is packed full of juvenile jokes at every opportunity? This is the game for you. If you want a more satisfying gameplay loop, story, and open world, play Subnautica instead.\n\nBreathedge is still an okay game on sale.", "timestamp_created": 1633399992, "timestamp_updated": 1633399992, "voted_up": true, "votes_up": 93, "votes_funny": 2, "weighted_vote_score": "0.835124731063842773", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "71119096": {"recommendationid": "71119096", "author": {"steamid": "76561197972977675", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 16390, "playtime_last_two_weeks": 0, "playtime_at_review": 5719, "last_played": 1658740453}, "language": "english", "review": "This is my first ever Steam review.   I felt compelled to make one since I'm enjoying Breathedge so much.\n\nSubnautica in space is a very good description.  The mechanics are very similar -- exploration, crafting, base-building, a mystery, and the constant worry about having enough air to make it to the next destination.   Yet Breathedge is a game that has managed to carve out its own niche in the survival genre.  The focus on breathable air is  more pronounced because there's no handy surface of the ocean to kick for.  In this game, there is only the vacuum of space with small islands of salvation.  \n\nHumor sets Breathedge apart from other games of the same type.  Puzzles have quirky solutions that are not annoyingly obscure.   I never felt that the game made it impossible for me to logically find a solution.   Bonus:  I enjoyed discovering the many inventive and hilarious ways that the passengers and crew of the \"Unnamed\" met their fate.\n\nAll in all, Breathedge is a great game.  So far,  I have enjoyed it as much as Subnautica albeit in a different way.  Without constant creature threats at every turn, I was able to enjoy the visuals and the wit of the game.   I look forward to the full release.\n\nThat said, Breathedge still has a lot of issues that I hope to see addressed before the full release:\n\n-- Quick slots:  four aren't nearly enough, considering the number of tools there are in the game.\n-- Tools:  they degrade too quickly.   Each tool should have an unbreakable recipe that needs to be discovered.  Combination tools should be available later in the game.  For example, I see no need to have separate scanners and analyzers.\n-- Equipment:  equipment should be upgradeable.  In my game, space has been cluttered with my discarded junk.  Make it necessary to use that old equipment in the creation of the new.  After all, I'm lost in space.  I nearly died to scavenge that stuff, I should be recycling wherever possible.\n--  Storage:  Breathedge is begging for some type of coffin-tech.  There should be a coffin object which serves as shared storage that can be accessed anywhere.  Bags that don't actually hold anything seem like intentional trolling. Storage 'comparts' appear to hold 4x more than than a suitcase.  However, they do not.  Why?  As a devout hoarder, I need more storage.  \n-- Communication: the spacesuit AI speaks too quickly.  I wasted a lot of oxygen trying to read transcripts of the stuff that I missed. Messages from the suit often stacked on top of messages from \"Babe\" so that I wasn't able to comprehend either.  By the time that \"Babe\" finally stopped speaking, I found myself hoping that she had suffocated to death.\n--  Exploration:  marker management needs to be simplified.  The game is beautiful, however, there is too much visual noise.  A simple toggle would have been nice.  (If the game already has one, I missed it.)  It would also be nice to toggle specific categories of markers as well -- oxygen locations, shuttles, and points of interest.  Once visited, locations should receive descriptive labels.  Better yet, allow me to label locations myself.  Finally, I hope that players will eventually be able to drop beacons anywhere that we like.\n--  Transportation:  vehicle progression needs to be better.   I was disappointed by the second vehicle option.  It didn't seem much faster than the first.  I finally had a constant, portable source of oxygen.  However, travel was still tedious.  It didn't feel zippy or fun.\n-- Sustainable living:  I founds seed and I have hope of growing my own crops in the future.  Please?   A reliable source of water would also be fantastic.\n\n\n\n\n\nFor those of you who love base-building, the following may be of use:\n\nIMO, habitat-building is the weakest point of the game.  I was looking forward to it.  Yet, now that I've tried it, I don't look forward to ever doing it again.  The system is unnecessarily finicky and unsatisfying.\n\nThere are two basic components to build a base, a module (an empty room) and a compart(ment) (things that can be placed in the modules such as beds, kitchens, and generators).  There are three different types of modules -- habitat, service, and transport.  They can be connected by corridors.   So far, so good.   Except, not really.  The modules are really hard to connect at any point other than the middle.  Hopefully, that gets fixed in the future.\n\nExcept for their exterior color, all of the modules are identical.  Therefore, I don't understand why each one needs different \"comparts\".   If I want to build a single-room base with power, O2,  a bed, and a processor in the middle, I can't.   Doors and windows aren't interchangeable either which is extremely annoying and a waste of time.\n\nThere isn't enough variety in building.  All \"comparts\" fit along the walls, that's it. The middle of rooms are generally saved for non-functional decor objects.\n\nIMO, the transport module should be the only specialized module.  As such, it should look different than the regular modules.   Hopefully, there will also be \"comparts\" that allow vehicles to be refueled and repaired while they are parked.  Body detailing \"comparts\" would also be welcome.\n\nThere is a very useful add-on to the service module which keeps track of available oxygen and power, as well as hull integrity.  I love the look of it.   It would be nice if that \"compart\" also could be used to scan for essential components within the vicinity -- at additional power cost, of course.\n\nAfter building a habitat,  I didn't find it particularly useful.   The original shuttle at the beginning of the game as well as the Normandy serve the exact same purpose.  If the game allowed me to build my own functional shuttle, I wouldn't bother with habitat-building at all.\n\nFinally, I found the habitats to be visually bland and unappealing.   I guess that their clunky, utilitarian appearance is in keeping with the style of the game.  However, my base never felt like a home as it has in other games of a similar type.  It felt sterile and unwelcoming, but that's just me.  Despite the amazing volume of memorabilia and tchotchkes to be found in the game.  I didn't feel secure enough to set them out.  I was afraid that, after careful placement, I would return to find them all over the place.  Carefully stacked suitcases also seemed to have a mind of their own and went \"walkies\" whenever I left the base.\n\n\nDespite all of the above, the game is still worth more than a look.  It should be experienced.", "timestamp_created": 1592731803, "timestamp_updated": 1592931728, "voted_up": true, "votes_up": 62, "votes_funny": 2, "weighted_vote_score": "0.832388937473297119", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "130082849": {"recommendationid": "130082849", "author": {"steamid": "76561198187531726", "num_games_owned": 45, "num_reviews": 8, "playtime_forever": 31, "playtime_last_two_weeks": 0, "playtime_at_review": 13, "last_played": 1697832458}, "language": "english", "review": "Update: Free to claim and own on Epic Games from APR 27th - May 04th 2023\n\n\nFree to claim on Twitch with Amazon Prime\nPromotion ends at the end of January 2023. You can only activate and play it via Amazon Games app, not Steam.", "timestamp_created": 1672808381, "timestamp_updated": 1682047976, "voted_up": true, "votes_up": 214, "votes_funny": 6, "weighted_vote_score": "0.82406318187713623", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "50534506": {"recommendationid": "50534506", "author": {"steamid": "76561198023006485", "num_games_owned": 323, "num_reviews": 22, "playtime_forever": 199, "playtime_last_two_weeks": 0, "playtime_at_review": 199, "last_played": 1537698187}, "language": "english", "review": "Extremely short, we know. We all know. I'm going to give it a recommendation anyway because I would be super annoyed as a dev if all the reviews were turning negative for the sole reason that my early access game doesn't have all its content yet.\n\nSteam reviews are getting to be almost as stupid as Amazon reviews these days. Rating this game poorly for not being complete is the same level of dumb as rating a product negatively because you ordered the wrong size. If you're going to buy early access, don't give a bad review for receiving an early access product.\n\nYou want frequent blog-like updates from the devs? Daily news? Great, that's more time taken away from actually developing the game. Just wait to rate, if you must, instead of dropping a negative review that says \"I'll change this later when updates happen,\" because doing that is harmful to the product.", "timestamp_created": 1557272756, "timestamp_updated": 1557272756, "voted_up": true, "votes_up": 95, "votes_funny": 4, "weighted_vote_score": "0.817118704319000244", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "98865827": {"recommendationid": "98865827", "author": {"steamid": "76561197994870343", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 259, "playtime_last_two_weeks": 0, "playtime_at_review": 259, "last_played": 1626922997}, "language": "english", "review": "Honestly I really wanted to like this game, the trailer really hyped me and the reviews I saw were good. But the thing is, asside from the snappy companion AI banters, I found the game, well... quite boring. \nYou spend most of your time travelling between points of interests, having only a few seconds of oxygen to spare to gather crafting materials, before you need to head back to your spaceship to avoid suffocating. Often times you miss a critical loot, and you get stuck in your progression because \"you didn't guess that breaking this particular box would give you that particuliar material that is found no where else in the game, which is required for reaching the next stage\".. ... \nI spend a bit more than 4hrs in this game, and probably only \"played 15 minutes in those\", the rest of the 3h45minutes spent moving around painfully slowly in empty space between places, with nothing to do beside looking at my oxygen reserve depleting.. \nI thought this would be like a space-themed subnautica (which I loved), with a twist of dark-humour. What I found instead was a \"float around in empty space simulator\" with a twist of dark-humour..\nI would have loved to love this game.. but my experience was just empty, boring and frustrating..", "timestamp_created": 1630901861, "timestamp_updated": 1672723066, "voted_up": false, "votes_up": 268, "votes_funny": 11, "weighted_vote_score": "0.816908478736877441", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "87545508": {"recommendationid": "87545508", "author": {"steamid": "76561197996650321", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 460, "playtime_last_two_weeks": 0, "playtime_at_review": 460, "last_played": 1614390217}, "language": "english", "review": "I really wanted to like Breathedge, but it's a pretty frustrating experience.  It's got all the interesting systems you'd expect in a Subnautica-style survival/crafting game.  The problem is that all those systems end up fighting each other rather than complementing each other.  For example:\n\n* The game's graphics and world design are great.  [i]But...[/i] the brutally-short oxygen gauge means you never have time to look at any of it.\n\n* The game puts a lot of effort into its jokes.  [i]But...[/i] they're delivered so fast that you don't have a chance to actually listen to them.\n\n* You've got a variety of tools to build.  [i]But...[/i] you have no way of knowing in advance what tool you'll need at a particular location, so you have to carry them all.  (And often, two of each, due to the low durability of each tool.)  This takes up the inventory space you were hoping to use for stuff you collect when you get there.\n\n* There's a good variety of resources to collect and play with.  [i]But...[/i] the early game has your resource storage split into several separate locations, leading to a lot of boring ferrying between stations.  A few hours in, you get a suitcase to store things in, which cannot be moved if it has items in it (?!).\n\n* Tonally and aesthetically, the game is really strong.  [i]But...[/i] it tries to be both a jokey survival farce and a dangerous-but-hauntingly-beautiful space simulator at the same time, and those two never gel together into a coherent whole.  The game is trying for a tone of \"whistling past the graveyard\", but the whistle and the graveyard never seem to be in the same place at the same time.\n\nYou can see the kind of game Breathedge wants to be: something like Portal, a difficult game punctuated by black comedy.  It never really gets there.", "timestamp_created": 1614436395, "timestamp_updated": 1614437724, "voted_up": false, "votes_up": 117, "votes_funny": 1, "weighted_vote_score": "0.813415408134460449", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "88058737": {"recommendationid": "88058737", "author": {"steamid": "76561197970668206", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 1473, "playtime_last_two_weeks": 0, "playtime_at_review": 1473, "last_played": 1615173081}, "language": "english", "review": "Just finished the game and watched the credit scene so here's my two cents.\n\nBreathedge is a game of two very distinct halves, the first half is the survival-crafting, exploratory phase, where you are flying through wreckage, salvaging usable components to crafting equipment, while wondering if you have enough oxygen left to return to base. This part is great and bears the most resemblance to Subnautica, which is the benchmark for how to make a fun survival crafting game. \n\nThe second half is where things fall apart. You are now stuck to exploring  space stations on fetch quests, traversing through lonely corridors that seemly exist to pad out travelling time. Running back and forth to craft - in the developer's own description - \"mandatory craps imposed by the design team\". There's one too many instances where you go to one part to get a blueprint for a device, then have to run back to your ship because that's where the crafting station is located, then have to return to where you got the blueprint to install the device just crafted. That is assuming you have all the necessary components on hand and don't need to spend more time scavenging. The game's pacing comes to a grinding halt right there. \n\nWhat made the first half work is that the things you craft have impacts on the gameplay : an oxygen tank that allows you to stay out longer, a suit that gives you access to high radiation area, or a weapon to deal with enemies. By contrast the second half you are just crafting McGuffins, they look different and have different descriptions, but for all intents and purposes they are just keys you need to open the next door. \n\nIf the first half of the game is about survival and exploration, the second half is nothing but busy work. \n\nThat being said, the game is ultimately a parody of a survival-crafting game. I enjoyed the first half and some of the jokes are quite funny. It's worth a try if you can get this on a discount.", "timestamp_created": 1615176415, "timestamp_updated": 1615176415, "voted_up": false, "votes_up": 83, "votes_funny": 3, "weighted_vote_score": "0.810809969902038574", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "47460411": {"recommendationid": "47460411", "author": {"steamid": "76561198071589126", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 193, "playtime_last_two_weeks": 0, "playtime_at_review": 193, "last_played": 1544533444}, "language": "english", "review": "Not saying it's as good as Subnautica, but it's as fun as Subnautica.", "timestamp_created": 1544533500, "timestamp_updated": 1544533500, "voted_up": true, "votes_up": 55, "votes_funny": 6, "weighted_vote_score": "0.806469440460205078", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44771587": {"recommendationid": "44771587", "author": {"steamid": "76561197967362880", "num_games_owned": 321, "num_reviews": 100, "playtime_forever": 356, "playtime_last_two_weeks": 0, "playtime_at_review": 288, "last_played": 1593894151}, "language": "english", "review": "I love this.\n\nThis is gaming 101... humour, fun and visually pleasing.. just as good as subnautica, but less content yet (of course, it took years for subnautica to be where it is now)\n\nYou should support this, in stead of a AAA games rehashed for the 253th time, with 15 paid DLC's and lootboxes.\n", "timestamp_created": 1537125023, "timestamp_updated": 1537125023, "voted_up": true, "votes_up": 65, "votes_funny": 4, "weighted_vote_score": "0.806103885173797607", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "91822682": {"recommendationid": "91822682", "author": {"steamid": "76561198001537536", "num_games_owned": 1016, "num_reviews": 234, "playtime_forever": 4701, "playtime_last_two_weeks": 0, "playtime_at_review": 4701, "last_played": 1620723760}, "language": "english", "review": "[h1]IN A WORD: [b]CHICKENS[/b][/h1]\n[h1]IN A NUTSHELL:[/h1]\n[quote=]\n[b]WHAT TO EXPECT:[/b] 3-act, story-driven. Action adventure. Set in space. Open-world sand-box. Unparalleled freedom to explore. Mundane travel and resource gathering. Extensive crafting inc. modular space-station. Upgradeable space-suit. Build and pilot zero-g vehicles. Unorthodox game design. Quirky, ironic comedy, Russian style. Gameplay can stall. Ends with a corridor style, sequentially, formulaic act. Can return to initial areas at game completion. Single-player.\n[b]ACHIEVEMENTS:[/b] OBSCURE. SOME ARE LABORIOUS.\n[b]STATUS:[/b] COMPLETE? ONLY THE DEVS KNOW.\n[b]WHEN TO BUY:[/b] BUY NOW.[/quote]\n\n[i]More info below....[/i]\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=2480719891\n\n[h1]THE LOWDOWN:[/h1]\nBreathedge is an open-world action adventure game played in outer space. Set in an expansive debris field it 'mind-melds' elements of survival and sand-box gameplay, unconventional design and quirky, ironic humour. Players take on the role of a lone protagonist who has miraculously survived the catastrophic demise of an Interstellar spacecraft en-route to a destination far, far away.\n\nExperienced from a first-person perspective, players find themselves Marooned in a self-contained cabin. Their first steps will be to explore the vicinity their oxygen capacity limits them to. As they swim around a zero-g sea of wreckage they must salvage available resources and find blueprints. In order to assemble numerous tools and craft tons of components to augment their space-suit's capabilities, taking them further afield.\n\nThe protagonist must stave off hunger and thirst, and sleep when health needs to be restored. There are several notable hazards in the Alien environment of space. Care must be taken to navigate these when exploring. Regulating the use of oxygen is critical. Extreme radiation, cold and other dangers are also present. Key locations are marked as the player approaches them. Drawing their attention as to where they should focus their investigations.\n\nA limited inventory must be managed to ensure hauls of resources are plentiful. Vehicles are requisitioned to reduce travel times and expand search areas. Portable oxygen tanks can be placed strategically to refill mid-flight. These require the appropriate specs to build them. \n\nAs the player reaches the final act, the game changes to one of a simple corridor shooter. Without much shooting. As the conspiracy at the heart of the Event [Horizon] reveals itself. Can the player overcome the overwhelming quirky and ironic humour to find salvation beyond this final frontier?\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=2480711985\n[h1]THE GOOD:[/h1]\n+ Wonderfully rendered sand-box environment enticing to explore.\n+ High quality production. Great visuals, voice-acting and soundtrack.\n+ Interesting story to experience and a conspiratorial mystery to unravel. With humours overtones.\n+ Massive debris field to search for resources that never run out.\n+ Never a dull moment. Lots to do. Craft tools, components and upgrade space-suits components. Build a space-station.\n+ Surreal experience. Lots of unusual things to see and discover. There's some weird stuff floating around in space.\n+ Quirky, ironic humour. Shades of Hitchhikers guide to the galaxy.\n\n[h1]THE BAD:[/h1]\n- Gameplay is repetitive in nature.\n- Some badly sign-posed objectives. Possible to miss obvious targets of attention.\n- Slow travel times. Prolonged action. Until better transport was found.\n- Copious amount of backtracking. To get something needed to craft and progress.\n- Can get temporarily stuck in a few interiors. Console commands to teleport not needed.\n- GPU fan overworked a number of times.\n- Long loading times onwards of midgame. Even with an SSD.\n- Some flickering lighting effects seem suspiciously epilepsy inducing.\n- On a v. few occasion items can fail to load. Suitcases full of resources. A reload solved this.\n\n[h1]AND THE REST:[/h1]\n* Very linear plot but with open-world freedom to explore. \n* Short gameplay arc. Prolonged by the need and freedom to explore at the players choice.\n* Good but imperfect zero-g physics.\n* Around 15h+ of gameplay across several chapters. Alot more by going off-road.\n* 4x game modes; Standard, Story, Impossible, Free. Adds replayability.\n* 19x classes of recipes. Each with dozens of individual items to construct.\n* Traditional fixed inventory used to ferry items from fixed containers from point A to B.\n* Numerous visual hazard effects. Would have liked to have seen more.\n* Many pop. cultural references and Easter eggs to find.\n* FOV is fine. The odd item jerked late into view with 8GB of RAM.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=2480710675\n[h1]ANALYSIS:[/h1]\nBreathedge's experience veered from side-to-side, like the Millennium Falcon pursued by tie-fighters. Providing contentment to those looking for an exceptional survival experience with seemingly endless exploration and crafting opportunities. At least for the first two acts. Those expecting more of the same in the final act will be disappointed in the X-Com Enforcer/ corridor-esque, tick-box exercise that was. We will never know if the devs scoped for more of the same but were forced to hurriedly complete the final act. Relying on the story's need and the game's characteristic humour to carry the player to a necessary conclusion.\n\nMarvellous visuals whetted the appetite to explore a beautifully rendered, vast zero-g environment. The scale of sand-box key to retaining engagement. Freedom amplified the desire to explore. While the wide-ranging soundtrack and audio supported the ambience, the excellent voice-over kept the experience from being an overly lonely one. I'm sure one of the tracks was a nod to Starman. One of my fav. films.\n\nThe dev's philosophy of poking fun at survival games should be obvious and applauded. It was full of tropes. Filled to the brim with McGuffins. With so many cultural references and associated collectables to er... collect. Anyone who does not enjoy quirky, ironic humour delivered in a hammy, uptight New York style, may be put off from even playing the game. It was central to the experience. Suspect it was some cleverly disguised Russian propaganda but this cannot be proved at this time. Ask me again during my next run, comrade. Those who manage to resonate with these key aspects will avoid a force style choke hold from ruining their fun.\n\nThe unorthodox design of its three acts proved an acquired taste. A first act perfect in execution led to a mostly satisfying middle act. Albeit one with flaws. Despite the fact that Breathedge can be sped-run in a few hours I found it was easy to lose focus. Causing progression to stall and some frustration to seep in. Travel times became laborious. As were finding a host of achievements. The final act morphed from enjoyable into a nightmare. Where no one can hear you scream. We are in space! Compared to the first two acts, it really was out of place. A let-down at best. At worst as criminal as the conspiracy at the heart of this game.\n\n[h1]VERDICT:[/h1]\nBreathedge was close to being S-T-E-L-L-A-R! Superb production values, amazing visuals, its vast sand-box and the freedom to explore were its greatest strengths. The copious travelling and backtracking, subjective humour and execution of the final act arguably its biggest concerns. I loved the freedom to travel and the range of crafting options as well. At least the original areas can be returned to once the main story ends. I really can't wait to try the other game modes.\n\nOverall this was a game of two halves providing a compelling experience, which unfortunately ended as a formulaic one.\n\n[quote=]Thank you for reading. | Follow my curator[url=https://store.steampowered.com/curator/40556040-The-Irregular-Gamer/] here[/url]. | Key provided by [url=https://steamcommunity.com/groups/ReviewersParadise]Reviewers' Paradise[/url] [/quote]", "timestamp_created": 1620742800, "timestamp_updated": 1632302022, "voted_up": true, "votes_up": 82, "votes_funny": 3, "weighted_vote_score": "0.804938971996307373", "comment_count": 12, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "87658355": {"recommendationid": "87658355", "author": {"steamid": "76561198020313592", "num_games_owned": 987, "num_reviews": 578, "playtime_forever": 1248, "playtime_last_two_weeks": 0, "playtime_at_review": 1248, "last_played": 1614524616}, "language": "english", "review": "[h1]The Premise[/h1]\n[h3]1.0 FULL VERSION REVIEW[/h3]\n[b]Breathedge[/b] is a first-person survival game set in open space, after a freighter owned by a funerary mega-corporation crashes into an asteroid field. As one of the remaining survivors, players will have to scavenge, craft and even fight their way to safety - with the ultimate target of returning to Earth.\n\n[h1]Quick Sum-Up[/h1]\n[table]\n[tr]\n[th]🟩 [b]The Pros[/b][/th]\n[th]🟥 [b]The Cons[/b][/th]\n[/tr]\n[tr]\n[td]\n1. Exceptional visuals & art direction.\n2. Compelling exploration mechanics.\n3. Very good gameplay variety.\n4. Sweet-sour narrative that doesn't get annoying.\n[/td]\n[td]\n1. Last story third (Chapters 4-5-6) is disappointing.\n2. Some quality of life issues.\n3. Balance problems with some elements.\n[/td]\n[/tr]\n[/table]\n\n[table]\n[tr]\n[th]🟨 [b]Bugs & Other Issues[/b][/th]\n[th]🔧 [b]PC Specs[/b][/th]\n[/tr]\n[tr]\n[td]\n- Players can rarely get stuck in some objects.\n[/td]\n[td]\n- Ryzen 3900X\n- RTX 2080Ti\n- 32GB RAM\n- NvME SSD\n- 1440p Display\n[/td]\n[/tr]\n[/table]\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=2409261383\n\n[h1]In-Depth Analysis[/h1]\n[h3]Pros[/h3]\n[b]1.[/b]\nThe way Breathedge represents a devastating space crash, along with the struggle of survivors that often die in horrible ways, is nothing short of extraordinary. Each and every location on the map has its own uniqueness - no two places will look the same, ever. The level of care and detail employed in shaping every piece of bent metal, debris, item, corpse and shipwreck is amazing. This is the main factor that makes the atmosphere so deep and involving.\n\n[b]2.[/b]\nAs the prime activity, exploration is an extremely addictive experience. Open-space without limits (except oxygen) is available straight out of the box, dotted with dozens of unique locations containing resources, collectibles and the thrill of the unknown. Quality level design ensures there is guidance in the form of visual cues, lights and landmarks, not holding players' hands too much but not leaving them completely astray either.\n\n[b]3.[/b]\nBe it item crafting-based puzzles, base building, combat or avoiding environmental dangers while exploring - there is always a lot of diverse things to do in Breathedge. More often than not, locations will be blocked by special item requirements or dangers that will incentive players to find new blueprints or solutions, which may involve completing other tasks. This is the central piece of a gameplay flow that proves varied, unexpected at every turn.\n\n[b]4.[/b]\nThe narrative has definitely a satiric, humorous tone at all times, with some darker moments here and there. Despite this, the \"puns\" and fourth-wall breaking references are almost always well thought out and genuinely enjoyable. Most of the time anyway, it will only be players and the calm background music while drifting in space - nothing else. Narrative and lore elements are paced very well, so they don't become overbearing or annoying at any point.\n\n[h3]Cons[/h3]\n[b]1.[/b]\nChapter 4, 5 and 6 constitute around 30% of the game content. In this part, Breathedge decides to ditch all the survival, base building and exploration mechanics that made it great so far, opting for a linear, story-focused \"walking simulator-like\" experience with only crafting and rare combat segments. While not bad, this part just feels a huge rollback from everything seen so far, as if the Devs didn't have any more time, ideas or whatever else to add.\n\n[b]2.[/b]\nSome interface and quality features feel missing for a survival game. For instance, UI markers of deployed oxygen stations or already-explored landmarks cannot be removed: this clutters the visuals. There is no crafting tracking for complex blueprints, and also containers can't be renamed / diversified for better base storage. Only four hotkeys for tools instead of nine as it's customary for this genre, also proves annoying.\n\n[b]3.[/b]\nAbout halfway through the game, the survivor will acquire hardware that will minimize or remove entirely pretty much any danger encountered, such as advanced suits or military-grade hardware that can contain ludicrous amounts of oxygen. Above all, the \"car\" vehicle is the most unbalanced thing, as it provides unlimited oxygen, defense against all elements and exceptional speed, while also low fuel consumption. After this point, the \"survival\" feel diminishes a lot.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=2409598564\n\n[h1]Gameplay Breakdown[/h1]\n\n[b]Exploration[/b]\nIs king in Breathedge, and is performed using the suit's propulsion system initially and later on with vehicles when available. The biggest concern at all times will be oxygen, very limited at first and allowing only brief runs before returning to safety. Eventually, oxygen stations can be deployed to build a \"refill network\", and also one-time consumables can be used to replenish it, other than certain \"safe zones\" which have an unlimited supply of it. Other dangers include electricity, heat and cold, which can be countered with special suits or clever maneuvers.\n\nExploring is fundamental to get enough resources to craft story-progression related items, but also find more blueprints to expand exploration capabilities (such as oxygen tanks). Hunger and thirst also are present, however they're not huge issues at any time.\n\n[b]Character Management[/b]\nIs done with a classic inventory menu where one can store all items found in the world, and then deposit them in containers or on the ground. Each item is permanent and will never disappear. The carry capacity is generous, but cannot be expanded further, it is definitely more than enough for large supply runs to be done anyway. Spacesuits and equipment can be changes on the fly from the inventory, by using the four hotkeys (1-4) or manually. Generally all items have instant use, while most tools have very limited durability and can't be repaired.\n\n[b]Crafting[/b]\nIs done at any Processor table, mostly found in safe zones like semi-functional shipwrecks or a custom base, when it's possible to make one. Except for the most complex machines, the quantity of resources needed is pretty small compared to the huge amounts found in the world - some are much more rare than others though and each needs specialized tools to harvest. There likely won't be a situation where players run out of a resource completely or soft-lock themselves, because there are so many. New blueprints can be acquired by Scanning a new tool or machine with a tool, or by researching them at a research station, present only in custom bases.\n\n[b]Puzzles[/b]\nAre generally about crafting and delivering the correct pieces to make something work, or understand the logic behind a closed gate or automated security. Some can be brute-forced (literally) while others will require some thought. Generally there is good guidance and none of them is overly obscure.\n\n[b]Combat[/b]\nIs a minor aspect overall, and plays out with the only available manual weapon, the blaster. It's a simple, arcade FPS style combat against enemies that won't prove much of a challenge most of the time, such as fixed turrets or robots. \n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=2409554354\n\n[h1]The Judgment: Very Good[/h1]\n[url=https://steamcommunity.com/sharedfiles/filedetails/?id=1989090445]Complete Ratings List here[/url]\n[i]It took me around 21 hours to complete Breathedge, taking time to explore and clear all secondary content I could find. For the price of 25€, this content amount is completely fair: I recommend buying for full price.[/i]\n\n[quote]Visit [url=www.saveorquit.com]Save or Quit[/url] for more great reviews posted daily.[/quote]\n\n[quote]Liked this review, and want to see more of the same quality? Check out [url=https://store.steampowered.com/curator/39323490]Tamaster's Review Archive[/url].[/quote]", "timestamp_created": 1614590821, "timestamp_updated": 1614590932, "voted_up": true, "votes_up": 132, "votes_funny": 4, "weighted_vote_score": "0.800915002822875977", "comment_count": 29, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "108343124": {"recommendationid": "108343124", "author": {"steamid": "76561198003943149", "num_games_owned": 0, "num_reviews": 353, "playtime_forever": 1200, "playtime_last_two_weeks": 0, "playtime_at_review": 1200, "last_played": 1642616650}, "language": "english", "review": "I was going to leave such a raving review for this game..\nIt was fantastic, gorgeous, atmospheric, and both relaxing and extremely stressful at the same time. In the first part of the game. Honestly just stop playing after chapter 3 and a bit of screwing around in chapter 4. \n\nThe first part of the game is just so much fun. It rewards exploration so well and is filled with jokes, discovery and satisfaction. It promises base building and quality of life upgrades. You will enjoy it.\n\nJust make sure to enjoy it while it lasts. Because once you have the final upgrades... YOU DON'T NEED THEM. WHAT?!\nThe game completely changes into another game and shockingly becomes just a bunch of walk here through a stupid linear corridor for 5 minutes, then go back to your ship to craft something that you should have been able to craft on the spot.\nAt some point towards the end you are not given an actual marker for what to do next and I have no idea how players are supposed to understand how to get the Microplasm on their own unless they accidentally run into it. I quit at this point.\n\nOf course there is the issue of tools being super flimsy but meh, that's not a deal-breaker.\n\nI've never had a game turn from one of the best I played to one of the worst. I still highly recommend it because the first part is a must play on it's own. Just give up and watch the ending on YouTube when you're tired of the bullcrap.", "timestamp_created": 1642617595, "timestamp_updated": 1642617595, "voted_up": true, "votes_up": 33, "votes_funny": 0, "weighted_vote_score": "0.795334339141845703", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "155786847": {"recommendationid": "155786847", "author": {"steamid": "76561198819248238", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 2916, "playtime_last_two_weeks": 0, "playtime_at_review": 2916, "last_played": 1705020636}, "language": "english", "review": "To start off, after playing Subnautica (which was like main-lining heroin, i COULD NOT put that game down) i went on a maniacal investigation for another game just like it. After trying out numerous games, some had scratched the itch of that survival craft concept, but nothing seemed to fill the void of ever finding a 36 hour, glued to the computer chair bender. Until one day i was desperately scrolling Reddit in search for another fix of endless material hoarding and fun crafting and came across a user mentioning Breathedge. After watching the trailer and reading reviews my spidey senses were exploding with excitement. I knew this had to be the one. 50 hours of gameplay later and here i am immediately writing this review seconds after finishing the game. The fact that i dont think i've ever written a review about a game in my life says alot. This game has so much personality that Subnautica was missing, and my cheeks are still sore from the constant full fledged belly laughter. With that said, i am now eagerly awaiting the release of Breathedge 2 and would HIGHLY recommend this to anyone in search of that Subnautica fix that i know everyone is dying to get a taste of!!!!!!", "timestamp_created": 1705023904, "timestamp_updated": 1705023904, "voted_up": true, "votes_up": 52, "votes_funny": 1, "weighted_vote_score": "0.794233918190002441", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "115970726": {"recommendationid": "115970726", "author": {"steamid": "76561198971559078", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 1974, "playtime_last_two_weeks": 0, "playtime_at_review": 1974, "last_played": 1653442337}, "language": "english", "review": "Overall, I enjoyed this game. It was a fun and humorous story.\n\nIt was more of a linear story, with some survival crafting elements. \nYou'd go to an area(s) to get some resources, which would allow you to craft something, would would allow you to progress to the next area.\n\nThe game did seems to be split up into different phases:\n1st quarter - Surviving. Go out, get resources, and get back before you run out of air.\n2nd quarter - Base building, exploring, gearing up, vehicles, finishing tasks.\nLast Half - Leave all that behind & proceed through the story.\n\nSince this was my first time playing & I didn't know what to expect, I approached this like a survival.\nI spent a ton of time collecting hoards of resources & building my base.\nThis all went to waste when I had to leave it behind.\nI even made the same mistake of hoarding resources for the last half of the game. \nI thought that I'd need to recover what I left behind or that i'd need them when I got back. NOPE.\nApparently, just craft what you need & don't worry about hoarding.\nI had dozens of suitcases filled with materials that I never needed.\nA super minimal base is fine. Though you could probably even get away without one.\nI do wish there was more to the base building.", "timestamp_created": 1653447098, "timestamp_updated": 1653447098, "voted_up": true, "votes_up": 41, "votes_funny": 0, "weighted_vote_score": "0.792088150978088379", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "79765495": {"recommendationid": "79765495", "author": {"steamid": "76561198202701192", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 545, "playtime_last_two_weeks": 0, "playtime_at_review": 386, "last_played": 1612490711}, "language": "english", "review": "This review is a CONDITIONAL recommendation.  I started with \"not recommended\", but there's so much other truly junk games out there, and this game shows promise.   But it needs some work, so here we go:\n\nThe game is promising, but needs some serious balancing and changes before I could recommend.   My thoughts so far with Chapter 1:\n1.  The announcer talks WAYYY too fast.  He's like the guy giving terms at the end of a car commercial.  Considering he's giving some critical hints, he doesn't need to talk that fast, since you can't absorb it while flying around trying to manage your limited air.  It's super annoying to have to go back later and read the text, and less useful out of the context of where you were, positionally in the game.  I missed the scanner for a long time, wondering how I would find a blueprint, because I was done and gone from its location before I figured out it was a hint.  TALK SLOWER.   FAST ISN'T FUNNY.\n2.  Reward the players when they are clever.   The hints are either blunt bludgeons (any idiot can follow a marker) or non-existent.   \"Hey, a cargo hold.. probably lots of good stuff in there.\"  Logically, yes.  A player would feel good finding extra stuff by searching what was pointed out as the cargo hold.  Nope.  Nothing there.   So why bother telling me it's a cargo hold, jerK?\n3.  By the same token, next steps should be a bit more intuitive.  I'm at the bridge being told I need to find a key and a code.  I spent an hour searching the area with the limited air mechanic trying to figure out where it might be held.  Logically, maybe a captain's cabin?  Nothing in the area or on the way like that.   \n4.  Combining #3 with the limited air mechanic is a serious turnoff.  Either give me time to explore without constantly having to worry about the air (more air upgrades in chapter 1), or make it a more logical progression as to where to find the next item.   I don't need you to tell me where, but it's got to be someplace that makes sense if you think.  For the whole game, I've just been randomly stumbling on what I need, so I don't feel clever, I feel just lucky at times, and that's not a fun game.   \n5.  It seems that there's really just ONE way to solve every puzzle and ONE route to get to the next step, so it's not as much of a 'sandbox' it might appear or as similar games.   I saw a comment by one player who put oxy stations in the wrong places, now he's out of the resources to make more to get to the next stage (because they barely seed enough resources and if you don't do things in the EXACT RIGHT ORDER, you have to start the game again... that's seriously bad game design).\n\nThe game has a lot of promise, but they really need to consider the psychology of games, rewarding cleverness, less fixed 'one way' solutions, a bit more of a sandbox with more solutions to get to the end result, etc  (study the structure of the first Subnautica!!!).   But right now, it's a disappointment.", "timestamp_created": 1606240801, "timestamp_updated": 1606251832, "voted_up": true, "votes_up": 65, "votes_funny": 2, "weighted_vote_score": "0.790995299816131592", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44774989": {"recommendationid": "44774989", "author": {"steamid": "76561198007148760", "num_games_owned": 546, "num_reviews": 29, "playtime_forever": 228, "playtime_last_two_weeks": 0, "playtime_at_review": 228, "last_played": 1537142325}, "language": "english", "review": "Beat the game in under 4 hours and I was taking my time. That aside, I really enjoyed the experience and I am looking forward to seeing where Redruins takes this. \n\nI didn't encounter a single bug, everything ran very smoothly and I had no qualms with the performance.\n\nI laughed out loud a couple times, which is rare for me in a video game so the humor is definitely there.\n\nPlays a lot like Subnautica which is an incredible game, but with just enough differences to make the experience seem relatively new. Thank you for the fun and the great price Redruins.", "timestamp_created": 1537142647, "timestamp_updated": 1537142647, "voted_up": true, "votes_up": 35, "votes_funny": 1, "weighted_vote_score": "0.78835451602935791", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "135984741": {"recommendationid": "135984741", "author": {"steamid": "76561198796204223", "num_games_owned": 1021, "num_reviews": 15, "playtime_forever": 1854, "playtime_last_two_weeks": 0, "playtime_at_review": 1854, "last_played": 1679436909}, "language": "english", "review": "Amazing first half with fun survival mechanics and plenty of humor but awful second half that ditch all crafting, survival and is extremely boring. Too bad it could have been a real gem", "timestamp_created": 1680466636, "timestamp_updated": 1680466636, "voted_up": false, "votes_up": 33, "votes_funny": 1, "weighted_vote_score": "0.788103461265563965", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "122516969": {"recommendationid": "122516969", "author": {"steamid": "76561197990978031", "num_games_owned": 715, "num_reviews": 51, "playtime_forever": 1169, "playtime_last_two_weeks": 0, "playtime_at_review": 1169, "last_played": 1663633551}, "language": "english", "review": "The game has a bit of an identity crysis and the jokes are hit and miss sometimes, but it has it's charm, it's a solid. Not great, not terrible.\n\nSome key points:\nThe \"Subnautica\" like gameplay ends at chapter 3-4? (They don't know either)\nDon't bother building too much of your base, it's abandoned half way through.\nAfterwards it becomes a bit more linear and the survival aspects are mostly dropped, so it's more like SOMA or something like that.\nIt's very tedious at times, I think on purpose. You sometimes have to backtrack through long winding corridors that are winding for no other purpose than to pad out game time. Literally snaking corridors like this:\n   ___\n    |  _  |\n    | |  |  |\n    | |  |  |\n    | |  |  |\n->_|  |_->\nStory is a bit... not exactly generic, but full of cliches.\n\nPop culture references are nice, I guess.\n\n\n", "timestamp_created": 1663633896, "timestamp_updated": 1663633896, "voted_up": true, "votes_up": 35, "votes_funny": 0, "weighted_vote_score": "0.786994338035583496", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "94729114": {"recommendationid": "94729114", "author": {"steamid": "76561198035246673", "num_games_owned": 0, "num_reviews": 28, "playtime_forever": 1850, "playtime_last_two_weeks": 0, "playtime_at_review": 1850, "last_played": 1624834678}, "language": "english", "review": "As mentioned by others in effect this is a game of two halves.\n\nFirst half is a great space based exploration survival game although the only real danger is running out of oxygen which can seem very limited early game but after chapter two becomes almost inconsequential.\nI loved the feeling of the first half in general with it providing a great space based exploration based experience and i really enjoyed the humor although it did start to highlight some of the 'unfinished' aspects of the game. \n\nYou only really need to build one basic module for your space as station as it is required for the story to progress and while i did experiment with other modules they felt pointless and uninspiring and didn't even bother with the decorative items as certain resources either take a long time to find or seem very limited and for the most part don't seem to respawn.\nUsing the regular comparison of Subnautica i would have great fun diddling around in my base making it look interesting or homely but there really is no point in this game.\n\nYou can park your vehicle in the transport module yet you can't repair or refuel it while parked and if you changed the icon colour so it is easy to find it defaults back to the original after being parked.\n\nThere's a kitchen module which i couldn't seem to change the recipe with and seemed pointless as you can make the food with the construction bench.\n\nThere's a 'water dispenser' which is actually a canned drinks dispenser and for decoration only.\n\nI didn't research most of the things on the research table as they weren't needed.\n\nThe oxygen stations are pointless after chapter one as there are fixed oxygen stations or places with oxygen at all points of interest.\n\nAll of which didn't really detract from the generally great experience of just exploring in space in the first half but they did lead to a feeling of missed opportunity and disappointment.\n\nWe then come to the second half. I note that i have played 30 hours in the game of which 28ish hours was in the first half and the remaining time was me trying to play the second half which i gave up on. Not for the commonly mentioned reasons that it is a generally different style of game, with it becoming more of a space based shooter with some more linear corridor based exploration, the fact that oxygen now becomes a complete non-issue or that everything you have done up to this point becomes effectively pointless but simply because of a basic control based issue which was game breaking for me.\nI was playing the game with a controller and i always use inverted y axis setting as that is natural for me. This was fine until you get to the second half where invert y axis doesn't work while flying the space shuttle but it does again when you leave the space shuttle (although it was often buggy if i had tried to change the setting while flying the shuttle.i.e. if i chose invert y axis while in the shuttle it would often be none-inverted when i exited the shuttle and i would have to reselect inverted again for it to work properly. \nI managed to deal with it generally until i started encountering the drones which i needed to fight in the shuttle. The combat didn't seem particularly difficult but i simply could not control the shuttle so i could either re-learn muscle memory i have developed over the past 30+ years of gaming or just give up and i gave up because it wasn't worth it and i have plenty of other games to play.\n\nIt is a shame something as basic as this made the game unplayable but i feel that really sums up the whole game really. At it's cores its a great game but it is a shame it wasn't polished which make you constantly feel disappointed at all the missed opportunities.\n\n", "timestamp_created": 1625054930, "timestamp_updated": 1625054930, "voted_up": false, "votes_up": 74, "votes_funny": 4, "weighted_vote_score": "0.786190032958984375", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "114731989": {"recommendationid": "114731989", "author": {"steamid": "76561198116365289", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 3078, "playtime_last_two_weeks": 0, "playtime_at_review": 3078, "last_played": 1650936220}, "language": "english", "review": "Verdict: 7/10\nBreathedge can be a fun game... if you are willing to suffer through it. As a veteran of games like Subnautica and The Long Dark, I enjoy slow-paced, relaxed games. However, Breathedge suffers from a couple of major issues that significantly tip the balance between work and fun toward the former:\n\n1. Poorly balanced difficulty mechanics: Sure, having but a few seconds of oxygen before you have to go back to the nearest 'breathing spot' is an incentive to explore and gather resources to get better gear that will let you venture further. However, by the time you upgrade or get stuff that mitigates this, you already need to go even further... and back again. This back and forth gets old, and a poor balance means that the time you have ALWAYS feels too short by the time you manage to upgrade your gear. The equipment that ultimately lets you get rid of all this work arrives way too late, and my guess is that all but the most dedicated players will have abandoned the game by then.\n\n2. Cool stuff arrives so late in the game and has such steep material requirements that it's not even worth using it: *MINOR SPOILER* As an indie developer, you'd expect they would have tried to maximize the fun while getting rid of assets and mechanics that will never be realistically used. Basebuilding is somewhat deep and complex, but unless you are dead set on engaging in it, you will find yourself building only the very basic you need to accomplish your goals, lest you suffer through hours and hours of back and forth gathering materials to install that one cute lamp. This is compounded by the fact that basebuilding arrives by the time your gameplay becomes highly nomadic... so what's the point of spending hours finding enough glass (super rare) to install nice windows on a place you will hardly spend time in before you need to move on?\nStorage space always feels extremely limited, so organizing your stuff is always HARD LABOR. Once you are finally ecstatic that you can build your first locker... you find that they have the same capacity as the pesky suitcases. That's right... after a massive effort finding blueprints, building your base and collecting materials, a whole wall of lockers has the same capacity as a suitcase, which is 1/100th the size. Why?\n\nIf you can get past that, the story is fun, some gags will probably have you chuckling and the visuals are beautiful. And MASSIVE props for not only straying away from all the PC agenda, but actually making fun of its most hypocritical specimens. In this day and age, it takes guts for an indie studio to go that way.", "timestamp_created": 1651339173, "timestamp_updated": 1651339173, "voted_up": true, "votes_up": 98, "votes_funny": 0, "weighted_vote_score": "0.785876035690307617", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "45378950": {"recommendationid": "45378950", "author": {"steamid": "76561198023119436", "num_games_owned": 463, "num_reviews": 2, "playtime_forever": 751, "playtime_last_two_weeks": 0, "playtime_at_review": 425, "last_played": 1661294042}, "language": "english", "review": "As someone who rarely ever finishes games this was ideal for me. Playing it casually, stockpiling supplies and investigating everything I finished it in about five hours. \n\nGreat game, no bugs and good humour!\n\nI would echo the comments of others to the developers about slowing down the voice of the suit. I generally found I had to get somewhere safe and then look through the log to see what he'd actually said, same for the other messages.\n\nFor £12.39 I'm very happy with the game and I'm looking forward to seeing what comes in chapter two.", "timestamp_created": 1540140105, "timestamp_updated": 1540140105, "voted_up": true, "votes_up": 43, "votes_funny": 0, "weighted_vote_score": "0.783565163612365723", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "129893661": {"recommendationid": "129893661", "author": {"steamid": "76561197981899149", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 826, "playtime_last_two_weeks": 0, "playtime_at_review": 621, "last_played": 1674339395}, "language": "english", "review": "Subnautica without the constant anxiety (if you have deep water phobia). Very chill game, simple crafting, exploring and humor. Fun story and silly. Reminds me of the old Space Quest games a bit (in terms of humor). Mechanics and gameplay are easy.", "timestamp_created": 1672613972, "timestamp_updated": 1672613972, "voted_up": true, "votes_up": 58, "votes_funny": 2, "weighted_vote_score": "0.783075273036956787", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "127792553": {"recommendationid": "127792553", "author": {"steamid": "76561198025912580", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 1336, "playtime_last_two_weeks": 0, "playtime_at_review": 1336, "last_played": 1670016925}, "language": "english", "review": "The game has a really nice start, it feels almost like Subnautica, but in space. Quirky humour all around - you know: condoms as oxygen tanks etc. I don't mind the the humour, but the first time you exit your shuttle, music changes to very calming and serious, you see the space and it feels like it's going to be a good game.\nThere is a clear progression in the world, new objectives, something to keep you moving forward in your own pace. You gotta be thinking about oxygen, (there is plenty food and water though). But the main focus is to find interesting places and find new things to craft. After some time you have opportunity to create your own base.\n\nBut then, game suddenly takes a different approach and that's where things start to go downhill:\nIn one of the chapters you leave that first area until the end of the game. Forget your base!\nNow we follow a series of very linear quests\n1. Fly with a VERY slow vehicle to point X (YOU LITERALLY CANNOT EXIT THE VEHICLE AND FREE ROAM)\n2. Enter point X\n3. Go in a series of linear tunnels till the end (Additionally they are filled with water, food and materials)\n4. Suddenly something blocks you and an item is needed, you get a new blueprint! Back to your vehicle by foot!\n5. Create the item and go back, clear the thing that blocked you and continue forward\n6. At the end you'll unlock something, (that gives you no benefits) go back to your ship and onto the next point\nThis literally is the game loop till the end.\n\nThis was such a chore, especially given that the vehicle is extremely slow, there are no batteries in this game so you have to re-create items when they break (imagine if they break at the end of points [crafting available only in your vehicle]), and most of them have very low durability. Game just gets so boring and it was painful to finish it and this is the main reason I do not recommend it.\n\nI understand that some of this is by design, because this game is a \"parody\", but it could've been a really good game, even with this type of humour. It feels rushed towards the end and like they created a bad game just to say \"haha we parodied bad games, but it's a joke bro!!!!11!!!!!!11\".\n\nI sincerely hope someone will create similar game without all of this unnecessary humour and bad parts, because a proper \"Subnautica in space\" would be really awesome.", "timestamp_created": 1670018261, "timestamp_updated": 1670018261, "voted_up": false, "votes_up": 65, "votes_funny": 1, "weighted_vote_score": "0.781915545463562012", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "93114457": {"recommendationid": "93114457", "author": {"steamid": "76561197993839679", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 597, "playtime_last_two_weeks": 0, "playtime_at_review": 597, "last_played": 1621298546}, "language": "english", "review": "I wanted to like this game but the experience it is not fun. You are barely given any oxygen to do anything at all and that severly impacts the exploration aspect of this game. Also the jokes the game is making start to annoy you when you have to constantly battle asfixiation. \n\nThe gameplay cycle goes like this: Need resources to build an oxygen station to recharge and travel further, then you need an oxygen generator to recharge the oxygen stations you´ve built. To explore further you need more oxygen stations, so what ends up happening is that you want to explore somewhere new but you can´t because the devs were to strict with O2.\n\nTo add insult to injury every so often you have to craft new tools because the one you have constantly break so then you either have two pairs of each tool as a back up taking a lot of inventory space or you will sometimes find yourself exploring but having to go back to recraft your tools. You know artificially prolonging the game, it even goes as far as to say it to your face literally during the game as a joke.\n\nIn short: It had potential but it was ruined by making it a chore to play.", "timestamp_created": 1622736455, "timestamp_updated": 1622736455, "voted_up": false, "votes_up": 131, "votes_funny": 8, "weighted_vote_score": "0.781028926372528076", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "61278385": {"recommendationid": "61278385", "author": {"steamid": "76561198055321541", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 1611, "playtime_last_two_weeks": 0, "playtime_at_review": 1231, "last_played": 1614679692}, "language": "english", "review": "likes\n- solid work building and story\n- environments are gorgeous \n- crafting system strikes a good balance between overly simplified and complexity\n- exploration is generally rewarded with something new or useful\n- fantastic interiors, a very eerie feel to the world\n- some witty flavour text here and there, plays a satirical tune then follows it itself while lampooning the situation\n- combat is kept to a minimal and simple, focus kept on exploration\n\ndislikes\n- transition between chapter 1 and 2 is a bit bumpy, with certain stations you can craft in the first chapter losing relevancy very quickly. not finding the next set of upgrades can result in a lot of back tracking\n- o2 usage tends to end up rushing your actions in the early game/mid game. missed out on a lot of dialogue and had to read back through the messages once returned to an area with o2\n- some tools have expensive costs but don't last very long\n\nsmall niggles\n- space friction, can't set and forget\n- fair bit of padding in the second chapter, but gets significantly better once you unlock a vehicle, which could be right away or 8 hours in depending on how you tackle/explore the open world\n- dialogue can start before the previous one is finished, happens extremely often when out in space due to o2 limits\n\nwants\n- o2 use paused/reduced when someone is talking\n- more interiors to explore (the ambience in these were great), more reasons to use the torch\n- pitch/yaw controls, third person view\n- radio in the player made station\n- colour options for space station interior\n- more storage options (especially in the station), closer (and more permanent than suitcases) to the workbench and larger to boot", "timestamp_created": 1578138425, "timestamp_updated": 1578138425, "voted_up": true, "votes_up": 31, "votes_funny": 2, "weighted_vote_score": "0.777180612087249756", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44802320": {"recommendationid": "44802320", "author": {"steamid": "76561198245100906", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 2455, "playtime_last_two_weeks": 0, "playtime_at_review": 623, "last_played": 1616883654}, "language": "english", "review": "---{Graphics}---\n☐ Masterpiece\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Will do\n☐ Bad\n☐ Awful\n\n---{Gameplay}---\n☐ Try not to get addicted\n☐ Very good\n☑ Good\n☐ Nothing special\n☐ Ehh\n☐ Bad\n☐ Awful\n\n---{Audio}---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Decent\n☐ Not too bad\n☐ Bad\n☐ Earrape\n\n---{Audience}---\n☐ 0+\n☐ 3+\n☐ 7+\n☑ 12+\n☐ 18+\n☐ 21+\n\n---{PC Requirements}---\n☐ Check if you can run the calculator\n☐ Potato\n☑ Minimum\n☐ Decent\n☐ Fast\n☐ Rich boy\n☐ Ask NASA if they have a spare computer\n\n---{Difficulty}---\n☐ Just press some buttons\n☑ Easy\n☐ Significant brain usage\n☐ Easy to learn / Hard to master\n☐ Not so easy\n☐ Difficult\n☐ Dark Souls\n\n---{Story}---\n☐ Epic\n☐ Lovely\n☑ Good\n☐ Average\n☐ Not great\n☐ Something is not nothing I guess\n☐ Does’nt have\n\n---{Game Time}---\n☐ Endless\n☐ Very Long\n☐ Long\n☐ Depends on you\n☐ Not too short\n☑ Short\n☐ Long enough for a cup of tea\n\n---{ Worth Buying }---\n☑ Buy now\n☐ Consider to buy it\n☐ Worth the price\n☐ Wait for sale\n☐ Maybe if you have some spare money left\n☐ Do not buy it\n☐ Do not throw money into a trash can\n\n---{Bugs}---\n☐ Never had any\n☑ Minor bugs\n☐ Few bugs\n☐ Some bugs\n☐ Can get annoying\n☐ Ruining the game\n", "timestamp_created": 1537306122, "timestamp_updated": 1537306122, "voted_up": true, "votes_up": 154, "votes_funny": 19, "weighted_vote_score": "0.776752769947052002", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "120038869": {"recommendationid": "120038869", "author": {"steamid": "76561198117349319", "num_games_owned": 228, "num_reviews": 53, "playtime_forever": 471, "playtime_last_two_weeks": 0, "playtime_at_review": 471, "last_played": 1645449952}, "language": "english", "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Difficulty }---\n☐ Just press 'W'\n☑ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second live for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☑ 7\n☐ 8\n☐ 9\n☐ 10", "timestamp_created": 1659602649, "timestamp_updated": 1659602649, "voted_up": true, "votes_up": 106, "votes_funny": 10, "weighted_vote_score": "0.775521636009216309", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "135833165": {"recommendationid": "135833165", "author": {"steamid": "76561198031284385", "num_games_owned": 892, "num_reviews": 40, "playtime_forever": 1054, "playtime_last_two_weeks": 0, "playtime_at_review": 1054, "last_played": 1680300649}, "language": "english", "review": "Subnautica but worse. Always have to run to crafting stations, always have to backtrack, just artifical lenghening of a not so great game. I finished it just out of spite. 6/10 at best", "timestamp_created": 1680300825, "timestamp_updated": 1680300825, "voted_up": false, "votes_up": 33, "votes_funny": 4, "weighted_vote_score": "0.769946515560150146", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "87588716": {"recommendationid": "87588716", "author": {"steamid": "76561197992740252", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 628, "playtime_last_two_weeks": 0, "playtime_at_review": 424, "last_played": 1614998198}, "language": "english", "review": "EDIT: I went back and played a few more hours after recharging my batteries, because it did seem like some new gameplay was opening up. Even with a vehicle and the ability to make new stations, my take remains the same. Tedious.\n\nA lot of other reviewers have done a good job of pointing out that, while it shares a lot of similarity with Subnautica, it is far, far more tedious. Low oxygen capacity means you're only able to focus on the task at hand and severely punishes any attempts at exploration, or even just lingering to take in the scenery. On top of that, there is a completely useless food/water management system - both are abundant, so it's just another series of button presses you are obliged to do every time you stop to refill oxygen. Health largely functions as reserve oxygen, as I have never been damaged by anything else, and initially it can only be restored by... resting in a bed. The game actually makes you sit around and watch your health meter go up as you rest.\n\nThe speed of a travel and vast distances make for a lot of time spent in transit. Several locations can be reached quite quickly from the starter base, but as your oxygen reserve increases, you are forced to cross ever greater distances, taking longer and longer to get anywhere. As of 6 hours in, I am not faster than when I started the game, despite acquiring to 'accelerator' upgrades - not sure what these are for if not to increase your acceleration and, I would hope, max speed. Another side effect of this is that, while some of the scenery is pretty nice, you quickly grow tired of it as you float slowly towards your destination.\n\nThe narrative is undermined by largely played-out absurdist, 4th-wall-breaking, self-effacing humor, and this is coming from someone who loved Sunset Overdrive. The fact that they acknowledge using bad game mechanics in the narration (like how the main character consumes absurd amounts of food/water) actually makes those mechanics MORE frustrating.\n\nIt did seem like the game was improving somewhat with time - the ability to construct your own bases and use vehicles seem like they would improve gameplay quite a bit. Maybe if these had arrived less than seven hours in I would have stuck it out.", "timestamp_created": 1614492568, "timestamp_updated": 1615302873, "voted_up": false, "votes_up": 54, "votes_funny": 0, "weighted_vote_score": "0.768235981464385986", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "91345828": {"recommendationid": "91345828", "author": {"steamid": "76561197972983447", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 2593, "playtime_last_two_weeks": 0, "playtime_at_review": 2572, "last_played": 1620038441}, "language": "english", "review": "This game has been BUTCHERED by the devs. I've bought the game in early access and finished chapter 2/3 having a blast with its survival-like gameplay similar to subnautica. Then the release came. They literally killed the game's orignal concepts and gameplay loops and change the pacing into some linear uninspired backtracking fest. No feeling of progression, no feeling of achievement, no struggle in space, no space building. Literally go to a structure/bulidng, follow corridors, backtrack couple of times listening to some well-worn jokes rinse and repeat. I treated this game as a hidden gem and now it's all but shattered.\n\nWHY? Why and when does this happened?", "timestamp_created": 1620038149, "timestamp_updated": 1620038149, "voted_up": false, "votes_up": 77, "votes_funny": 1, "weighted_vote_score": "0.76758342981338501", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "90689615": {"recommendationid": "90689615", "author": {"steamid": "76561197993212573", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 642, "playtime_last_two_weeks": 0, "playtime_at_review": 512, "last_played": 1677267751}, "language": "english", "review": "If you like dad jokes, subnautica, and space, you'll like this", "timestamp_created": 1619024800, "timestamp_updated": 1619024800, "voted_up": true, "votes_up": 71, "votes_funny": 7, "weighted_vote_score": "0.766180872917175293", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "137582007": {"recommendationid": "137582007", "author": {"steamid": "76561198271911347", "num_games_owned": 0, "num_reviews": 52, "playtime_forever": 1423, "playtime_last_two_weeks": 0, "playtime_at_review": 1423, "last_played": 1682217544}, "language": "english", "review": "subnautica in space for the first 8 hours and then hallway simulator for the last 4-ish, if you are interested enough in the story or like the shitty humor it will be enough to carry you through to the end, like a 7/10", "timestamp_created": 1682893568, "timestamp_updated": 1682893568, "voted_up": true, "votes_up": 23, "votes_funny": 1, "weighted_vote_score": "0.760244011878967285", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "88583034": {"recommendationid": "88583034", "author": {"steamid": "76561198038521779", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 1195, "playtime_last_two_weeks": 0, "playtime_at_review": 1195, "last_played": 1615977526}, "language": "english", "review": "tl;dr this is Subnautica if your tools broke every ten minutes but you also had all the resources you needed to make them thrown at you all the time in a painful irony that disrespects your time and patience.\n\nThis game is passable, but only due to its strong start. It has a very strong opening and if you stick your fingers in your ears and stop when you get into the spaceship pictured in the promos (at the end of Chapter 4 I think?), then it is excellent. It can be pretty frustrating with all the back and forth, not knowing what tools you need until you get somewhere, only to find the tool you need has 2 durability and you need three... it's a bit unforgiving in that sense. But that's nothing compared to the back end.\n\nUnfortunately, the back half of the game sucks. It's a linear corridor romp that forced in some really weak combat-like things. The ending was nice and made me smile and laugh from a story perspective, but I almost didn't get there. I had to give it a three-week break due to the tedium.\n\nWith that said, it did give me some belly laughs with its referencing and humour, but I still look back on it with a bad taste. Games are supposed to be fun and interactive, and this game just had me clicking on an inanimate object to break it at 6% of its health per click. Why? Because I might run out of tool durability during it and have to go back to make a new one... This is an inexcusable tactic for artificially drawing out the playtime.\n\nIf you do want to play it, here are a few non-spoiler tips:\n- Don't bother building a good base. It doesn't matter.\n- Don't bother filling up your inventory with tools. You will always be missing the one you need.\n- Don't bother giving time to this game if you don't have much to spare. It doesn't respect your time, even with the lowered difficulty modes.", "timestamp_created": 1615981008, "timestamp_updated": 1615981008, "voted_up": false, "votes_up": 40, "votes_funny": 3, "weighted_vote_score": "0.759867966175079346", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "100623219": {"recommendationid": "100623219", "author": {"steamid": "76561197970319447", "num_games_owned": 0, "num_reviews": 53, "playtime_forever": 48, "playtime_last_two_weeks": 0, "playtime_at_review": 48, "last_played": 1633454971}, "language": "english", "review": "Playing Breathedge is like hanging out with someone who thinks they're really really funny. Every second they're trying to tell a joke, or yell a witticism at you or simply just point at something and say \"Ain't that funny!\".\n\nNow if you're into their sort of humour then this is fine, but if you're not then from the very second the game begins you're in for a bad time, cause it NEVER shuts up!\n\nPersonally speaking the humour in this game seems like it was written by your average person who's really into fart jokes. It doesn't at all seem like a professional writer/comedian had been consulted at all or an attempt was made to make the comedy more broad. Instead it feels very much like this is just what the dev team finds funny, with no consultation with others outside of their small group, and they were so into it they could not resist filling every single moment of the game with \"comedy\".\n\nAnd again, that's fine if you're into it. I however was not into it and so could not bare to play, what could've been a game on par with Subnautica, one more second of it over the limited time i had already.", "timestamp_created": 1633533511, "timestamp_updated": 1633533511, "voted_up": false, "votes_up": 119, "votes_funny": 6, "weighted_vote_score": "0.758771419525146484", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "87130627": {"recommendationid": "87130627", "author": {"steamid": "76561198008531750", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 5194, "playtime_last_two_weeks": 0, "playtime_at_review": 1643, "last_played": 1688482200}, "language": "english", "review": "This game is an absolute palate-cleanser among contemporary survival-crafting games.\n\nWhen I first picked up Breathedge I had just finished Subnautica and was all emotionally invested in the genre. Breathedge rubbed me the wrong way. It was snarky and relentlessly self-deprecating and the recipes didn't make sense (because dropping some rocks and unadulterated rare earth minerals into a magic molecule-rearranging box to get a laser cutter totally does). I didn't want funny, I wanted real desolate first-person grimdark immersive solitude. The Forest and Stranded Deep were too low-tech and I wasn't interested in the likes of Ark.\n\nFast forward a year. I have played every survival-crafting game that even looks remotely worth it on the surface. I sink hundreds of hours into Satisfactory and Factorio. Food tastes like ash in my mouth. There is no joy in gaming any more.\n\nNow, in my darkest hour, I am ready for you, Breathedge.\n\n[b]Pros:[/b]\n\n* The AI dialog is hysterical.\n\n* There is a rich and diverse comedic subtext even in the placement of non-interactive props. The various ways in which your fellow engineers have perished is a prime showcase example of this.\n\n* The things you actually do to get the game to tell you the story are as ridiculous as the story itself.\n\n* Exploration and progression require putting yourself in danger.\n\n* Graphics engine performance is tip-top at ultra detail on my dinosaur video card.\n\n* Base-building is satisfying.\n\n* Every junk item is worth picking up and spending a few moments reading the caption and inspecting it visually. There is a ton of attention to detail in the environment.\n\n* There is not a plethora of information available about this game out there on the Internet. You can watch some YouTube videos, but if like me you resent modern society for forcing you to watch a video to get a piece of information instead of being able to quickly skim a text document somewhere (ok boomer), you will have to experiment with the environment and reload saves and get real close to stuff and do that old school trial-and-error approach in order to un-stuck yourself. This adds an entirely new dimension of enjoyment in a time where games are often completely data-mined and dumped for the world to see before they're even released, and you are expected to spoil yourself on how to progress before you're even required to have that knowledge.\n\n* For some reason, I really like the sound that plays when you click a recipe in the constructor that you don't have enough materials to build. It's the ultimate \"NO YOU FAILED TO DO THAT\" sound.\n\n* Though combat exists, it is sparse. The game is focused on survival, exploration, and story-telling.\n\n\n[b]Cons:[/b]\n\n* Tool durability could stand to be tweaked over time. By the middle of chapter 2/3 I should not have to make a pile of drills to go Aluminum farming. Making tools all the time ends up becoming a bit of a chore, and occasionally results in having to revisit areas in order to acquire tech that you missed because there were more scannables than you had Scanner charges. \n\n* There are some things that are super obvious in retrospect but could use some extra context (i.e. where discharge cells come from), others that are not obvious enough (i.e. how one enables themselves to pull Breathedge energy cores or harvest Lycoplasma).\n\n* I would really enjoy an option to turn off or modify the O2 alarm klaxon in some fashion. Even with the Military O2 Tanks and over 4 minutes of available O2 buffer I end up organizing my activities to ensure that I'm back in an oxygen-rich environment before the alarm goes off. That thing is obnoxious. \n\n* It's not finished yet.\n\nBreathedge is the epitome of \"labor of love\" survival-crafter games and is a standard by which other games in the genre should be held. Thanks for an awesome journey RedRuins, I can't wait to see the rest of this amazing game!", "timestamp_created": 1613868925, "timestamp_updated": 1613927991, "voted_up": true, "votes_up": 103, "votes_funny": 8, "weighted_vote_score": "0.758068501949310303", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "115274456": {"recommendationid": "115274456", "author": {"steamid": "76561198049132687", "num_games_owned": 0, "num_reviews": 34, "playtime_forever": 425, "playtime_last_two_weeks": 0, "playtime_at_review": 425, "last_played": 1571584273}, "language": "english", "review": "I love survival games like The Forest and Subnautica, but Breathedge failed to keep me hooked. Decent comical writing at times, but gets annoying after several hours.  The world is boring to explore and I could not bother to complete the game.", "timestamp_created": 1652222957, "timestamp_updated": 1652222957, "voted_up": false, "votes_up": 109, "votes_funny": 2, "weighted_vote_score": "0.757255911827087402", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "54970019": {"recommendationid": "54970019", "author": {"steamid": "76561197993429739", "num_games_owned": 0, "num_reviews": 74, "playtime_forever": 2159, "playtime_last_two_weeks": 0, "playtime_at_review": 896, "last_played": 1633659754}, "language": "english", "review": "Edit: And the free DLC they added is good too! Scratches some of that survival itch, if anyone wanted more yet.\n\nEdit: Just completed the full game, and my recommendation still stands! At a point, the surviver-crafter-scavenger gameplay gets dropped for more linear gameplay, but what was already delivered was well worth the price alone, and the amazing humor persists throughout! Great fun, 8/10, would beat myself with a pile of useless crafting items again.\n\nJust finished chapter 3 of their expected 5 (last I read). The game is fantastic! The quests feel fulfilling and the humor is grand. A game like this lives or dies on how satisfying the progression feels, and your \"progression\" is upgrading your suit so you can fly just a BIT farther before you have to desperately swim back to home base before you suffocate to death. The creators spaced everything out just perfect such that it's challenging and progression feels satisfying, and it's simply hard to put down!", "timestamp_created": 1567658179, "timestamp_updated": 1635379936, "voted_up": true, "votes_up": 39, "votes_funny": 4, "weighted_vote_score": "0.754174649715423584", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "141791653": {"recommendationid": "141791653", "author": {"steamid": "76561197984430372", "num_games_owned": 649, "num_reviews": 124, "playtime_forever": 1825, "playtime_last_two_weeks": 0, "playtime_at_review": 1825, "last_played": 1689027779}, "language": "english", "review": "great game, wish it forced you to build out your \"private base\" more, and didnt force u into unnecessary warpppoints, where your first base wasnt, i always had to move my loot to the next base, which i disliked, and also farmed way too many materials that i didnt end up using.\n\nstill great game, recommendation.", "timestamp_created": 1689027935, "timestamp_updated": 1689027935, "voted_up": true, "votes_up": 32, "votes_funny": 1, "weighted_vote_score": "0.750697553157806396", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "90840326": {"recommendationid": "90840326", "author": {"steamid": "76561198111956371", "num_games_owned": 1027, "num_reviews": 120, "playtime_forever": 2169, "playtime_last_two_weeks": 0, "playtime_at_review": 2169, "last_played": 1618328511}, "language": "english", "review": "[h1][b]Space hearse blasts off![/b][/h1]\nI wanted to play [b]Breathedge[/b] since I found out that it finally released out of early access because its combination of space exploration, survival mechanics and humour looked appealing enough. Yet, in the end, I was surprised that I enjoyed its comedic aspect the most, which hooked me up right from the beginning.\n\nAs a passenger of a massive spaceship, you are delivering your grandfather’s body to a funeral, along with hundreds of other people. You are also taking care of grandpa’s chicken, as that was his dying wish. Its survival is apparently crucial, yet it is only dumbfoundingly looking at you. As if it were judging you. Nevertheless, a sudden explosion tears the ship into pieces. Luckily, you survived! Everyone else seems to be dead, though. It looks like you are all alo-🤖: [i]“Do you really think that your readers care about the story in a videogame, human? Do you watch porn for the plot too? Tell them about the action. Now!”[/i].\n\nWell, it seems that our talkative AI companion, who provides both guidance and comedic relief, decide to intervene here as well. Breaking the fourth wall type of humour is its speciality, meaning that it realizes its presence in the game. And in the review, too, I guess. In any case, I actually thoroughly enjoyed the AI’s presence for the whole time, and I had several laughs. Beware that it talks a lot, as it comments on every action you do. It also occasionally insults your character, who messes up everything he touches because he is dumb as a rock.\n\nYou are not going to spend your time mindlessly floating around, as you find out soon enough that a spaceship called Normandy might be your ticket home. It is pretty far from you, though. To survive this long and dangerous journey, you will need to get better equipment, as well as enough food, drinks and oxygen. Satisfying these basic needs of yours can be done via consumable items or by building small refilling stations. Thus, exploration and collecting various materials will become your routine. While common resources, such as metal or nutritions, are harvestable by your bare hands, the rarer ones, like aluminium, requires craftable tools, a drill in this case. Sometimes there might be environmental obstacles, such as dangerously cold areas or electricity. To get rid of the second one, you can use that chicke-🤖: [i]“When I told you to describe the gameplay to your readers, I did not mean that you should promote animal cruelty!”[/i].\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=2466531993\nEven though this gameplay loop of constant collecting, crafting, and upgrading is quite simple, it is still satisfying enough to motivate you in continuing. However, what I loved the most was the exploration itself. There are tons of spaceship’s debris, asteroids and dead bodies for you to discover. Finding out about your crewmates’ last moments might be hilarious or creepy. Apart from that, there are tons of various references and easter eggs. The exploration stands out more due to the marvellous audiovisuals, which create a dense and gripping atmosphere. Sometimes you might even stumble upon pieces of art that remind me of soviet retrofuturism, and at times you can even hear Russian compositions. 🤖: [i]“They finally managed to do it! Russia is economically stable and is the leader of space exploration. At least in a video game! ”[/i].\n\nAs you slowly upgrade your stuff and explore further, you suddenly get contacted by a new person. Oh, it is your Babe! Wait, who? That does not matter, as she belongs to you now! She constantly sends you messages in broken English abou-🤖: [i]“It seems that your so-called review was written by her at times then. This Babe also has her boobies as a profile picture, which is why this reviewer fell for her so quickly.”[/i]. Hush! Well, let me just say that she offers a bit different [i]view[/i] on this whole situation.\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=2466543913\nNow, you might think that the constant jabbering from these two characters might get annoying or stop you from enjoying the gameplay. The opposite is true because the number of monologues balances the gameplay loop itself, so it feels as if you were actually progressing even though you just collected some new materials. I loved their presence, as they made the world more alive. I was about fifteen hours in, and I thought that this experience would stay great.\n[h3][b]Do not count your chickens before they hatch…[/b][/h3]\nAt this so-called peak of the game, you can finally start building your own base and even beautify it with furniture. You even get access to smaller vehicles, which make travelling a bit easier and faster. By now, I mostly had everything I needed, so the surviving aspect started fading away and collecting the same resources became a bit tiresome. This issue accompanies an unexpandable inventory system, which forces you to backtrack quite a lot to your base. I was willing to overlook these issues, as I still enjoyed the exploration a lot.\n\nHowever, once you reach a certain point in [b]Breathedge’s[/b] last third, the gameplay suddenly becomes linear. There are no longer new resources or blueprints to find, and the game hands to you everything you might need on a silver platter. The exploration disappears too. You realize that everything you have done so far, including building your base, was useless and a waste of time. It turns into a walking simulator, a boring one, and it honestly felt like a slap in the face. From now on, you just galavant from one plot point to another. While the story was enjoyable as ever, the gameplay dragged it down to the point that I was forcing myself to finish it. 🤖: [i]“One of the issues is that I, a poor AI, constantly jokes about reoccurring gameplay tropes and issues. Yet, you have to play through these problematic parts in Breathedge too. When you, a player, are humorously told that some design decisions are terrible, and then you are forced to experience them for the rest of the game, it is not a clever satire. It is a dumb, atrocious and hypocritical design decision.”[/i].\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=2466536525\nThe game tries to spice up this terrible linearity by focusing more on combat with robots and spaceship’s defensive systems. When I think about action in games, I imagine it should be something enjoyable. Well, it is a boring mess in here. My projectiles sometimes did not do any damage at all, and I even witnessed enemies committing suicide. As if even they realized they could not take this any longer. Well, these combat sections are just horrendous and unintuitive, and I wished for them to end every time I got into one.\n\n[h1][b]So…?[/b][/h1]\nHonestly, if I did not enjoy its story, I would not even bother finishing [b]Breathedge[/b]. The last third, which lasts about six hours, feels like a worse undeveloped experience that devoured my initial enjoyment, like when a black hole swallows a star. However, it would not be fair to give it a negative rating. A vast majority of this title is still great, and I can recommend it to anyone who wants to explore outer space for a bit. I would just wait for a sale and keep these issues in mind. 🤖: [i]\"And you also should know by now whether you will like the game's humour or not!\"[/i]\n\n[b]PC Specs and Performance[/b]\n[quote]I played it with an [b]i5 8300H[/b], [b]GTX 1060 6GB[/b], and [b]16GB RAM[/b], at highest settings, at stable [b]60[/b] frames per second, at [b]1920x1080[/b] resolution.[/quote]\n[b]Acknowledgement[/b]\n[quote]This game was provided for review purposes by the developers via [b]DitD[/b]. Thank you![/quote]\n[b]Curator link[/b]\n[url=https://store.steampowered.com/curator/41545671][quote]🤖: “Follow my curator, [b]Blue Lips and their Quips[/b], to confirm that you are capable of reading, humans.”", "timestamp_created": 1619273270, "timestamp_updated": 1637653060, "voted_up": true, "votes_up": 84, "votes_funny": 8, "weighted_vote_score": "0.747448921203613281", "comment_count": 21, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "114987570": {"recommendationid": "114987570", "author": {"steamid": "76561198090084538", "num_games_owned": 1323, "num_reviews": 268, "playtime_forever": 1355, "playtime_last_two_weeks": 0, "playtime_at_review": 1141, "last_played": 1651897517}, "language": "english", "review": "I haven't gotten all the way through Breathedge, and although it is certainly not for everyone, I recommend it to anyone who would enjoy its strengths and can also appreciate its humor: Some parody-type references, a few memes, dev mocking, and once in a great while 4th wall breaking jokes.  I think it is important to bust some misconceptions about the game and poor approaches to it:\n* The game is only like Subnautica in that they are both hand made Open World Survival Craft (OWSC for short) games with base building that depends on oxygen for player survival. Throw everything else out the window to manage your expectations, but that doesn't mean that the game mechanically is weak.  In fact, I may have experienced fewer technical issues playing this game than Subnautica.\n* Do not expect a deep story, but unfortunately many people tie a game's significance to how elaborate its story is because Subnautica. Do not put significance in something that was never the purpose of the game to begin with, or else you will be set up for disappointment, as this game was not meant to be taken seriously. Speaking of serious...\n* The game's humor is consistent in its delivery and themes, at least somewhat akin to \"I'm 14 and this is funny\" or 15 year old Dead Pool comedy as someone else put it.  Whether or not someone likes it is a matter of personal preference.  So its not like the game is being criticized because the humor is inconsistent.\n* It is not necessary to horde tons of resources, as gathering some resources during normal exploration is sufficient, but I would argue that its best not to because you will want to progress to different areas.  The different areas have enough diversity of resources. You can if you want, but like many OWSC games, the intent is to keep moving forward in exploration and gathering more resources along the way as opposed to staying in one place or backtracking.  If the game not want forward exploration, then there would not be buildable (in addition to scattered): Oxygen stations, vehicles, buildable bases, etc.\n\nI will update or re-post this review when I complete the game.", "timestamp_created": 1651759157, "timestamp_updated": 1651759157, "voted_up": true, "votes_up": 34, "votes_funny": 1, "weighted_vote_score": "0.74583059549331665", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "137991422": {"recommendationid": "137991422", "author": {"steamid": "76561198013703910", "num_games_owned": 384, "num_reviews": 17, "playtime_forever": 1778, "playtime_last_two_weeks": 0, "playtime_at_review": 1778, "last_played": 1683192140}, "language": "english", "review": "[h1]What is Breathedge?[/h1]\n\nBreathedge is basically Subnautica, but in space. You’ll start as a lone survivor of a spaceship crash and need to find food, water, and a few resources to craft the basic survival equipment. From there you start exploring your surroundings, find new resources and start crafting better equipment. Later on you also need to build a base and find the truth behind your family and the explosion of the giant spaceship.\n\n[h1]Who is Breathedge for?[/h1]\n\nIf you’re into exploration/survival/crafting games, Breathedge is the game for you. The story starts out strong, the atmosphere is great (at the beginning at least), and it especially the sound feels like you’re stranded in space.\n\n[h1]Are there annoying/negative aspects I should know about?[/h1]\n\nYes, quite a few: The first two of four chapters are really great, but once you start with base building, things get rough: There are graphical glitches, and once you’ve finished your base, it is basically useless. It feels like a lot of potential is wasted.\n\nIn chapter 4, the story also gets really weird and the great humor from before is gone. You also have to walk through artificially enlarged tube systems, which are made to increase the playtime. That’s annoying and simply a bad design choice.\n\n[h1]Should I buy Breathedge?[/h1]\n\nI am not sure. I had fun for the first 25 to 30 hours, but after that the game started to annoy me. If you’ve loved Subnautica 1 and 2, and you can’t wait for the 3rd Subnautica to come out, Breathedge might give you a bit of the atmosphere you’re looking for.\n\nMaybe pick it up in a sale.\n\n[h1]What games are similar to Breathedge?[/h1]\n\nSubnautica, Subnautica: Below Zero, Raft, The Forest, Green Hell, Valheim, Stranded Deep, Grounded, The Planet Crafter, No Man’s Sky", "timestamp_created": 1683539713, "timestamp_updated": 1683539713, "voted_up": true, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.743693888187408447", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "92887771": {"recommendationid": "92887771", "author": {"steamid": "76561198011305508", "num_games_owned": 711, "num_reviews": 27, "playtime_forever": 1583, "playtime_last_two_weeks": 0, "playtime_at_review": 1583, "last_played": 1622395768}, "language": "english", "review": "I'm leaving a positive review but honestly it's more of a neutral one. \n\nSadly, I think the best way to sum up Breathedge is that it is a second-rate Subnautica. \n\nI don't mean to say that Breathedge is a bad game. It looks great, controls well, and I don't think I encountered any bugs while playing. It was fun enough to get through and the gameplay changes a surprising amount as you move between chapters. All that said, some of the basic design just drove me crazy, and the gameplay could be very tedious in places.\n\nMy main gripes with the game would be:\nThe game holds your hand way too much and a lot of the sense of exploration is lost.\nScavenging in the game feels punishing because you are constantly having to use materials just to travel or loot. On top of this resources are finite in the world, and so each trip costs you more time and more resources than the one before.\nWay too much of the game is holding down W for extended periods.\nObviously this is subjective but the humor rarely landed with me, and it felt way too forced. This was the most painful when the game is poking fun at itself for legitimate gameplay issues it has. Though I will admit a few moments made me chuckle.\n\nUltimately I think this game is decent if you are a fan of the genre but nothing special. For this game to really shine I think you need to be a fan of the type of humor that it offers as it really is a big focus of the game.", "timestamp_created": 1622400440, "timestamp_updated": 1622400440, "voted_up": true, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.742445826530456543", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "45078761": {"recommendationid": "45078761", "author": {"steamid": "76561197967700234", "num_games_owned": 3007, "num_reviews": 51, "playtime_forever": 396, "playtime_last_two_weeks": 0, "playtime_at_review": 274, "last_played": 1671162030}, "language": "english", "review": "Hi!\nI purchased this game because of it's overwhelmingly positive reviews, good graphics and general quality, because  currently there is no survival game with crafting in open 0 G space and because I deemed this game might reach double it's current price once it's better known among a bigger audience.\nIt does indeed pull off some hilarious jokes, got a decent graphics quality and is really short currently.\nI wish there was more serious game content in between the jokes though, there is no real crafting, surviving, learning recipes/blueprints as it is all a linear story and most of the resources you can harvest or gather are only used in a single recipe... in fact the first placeable structure you are able to craft turns out to be namely \"Some crap the developers made up\" and once you try to place it it drops to the ground and turns out to be only of artistic value.... which did make me laugh, but I wished for some actual serious content, it also makes the jokes more fun when they are placed well in a seriously mindcatching story.\n\nSo if the upcoming episodes don't drift too much into slapstick comedy and actually provide new gameplay mechanics and content, this game will be really good.", "timestamp_created": 1538592927, "timestamp_updated": 1538592927, "voted_up": true, "votes_up": 29, "votes_funny": 3, "weighted_vote_score": "0.742039024829864502", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "88264659": {"recommendationid": "88264659", "author": {"steamid": "76561198010239921", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 6753, "playtime_last_two_weeks": 0, "playtime_at_review": 6753, "last_played": 1615495128}, "language": "english", "review": "Right, I normally do not write reviews, but wow, did this game disappoint when it was completed... The first 3 chapters were very, very good! Yes, a bit subnautica in space, and a bit frustrating at times, but if you managed your resources and time well, and continued to explore, it was very doable, and also rewarding. I do not agree with some comments about the oxygen time and tools durability, because the in game upgrades sort that out as you play (bigger oxygen tanks, unbreakable handy scrapper). It was a very nice base building/craft/exploration combo, with good humour and nice graphics...\n\nNow, for the 3 new chapters and the end of the game: SPOILER ALERT\n\nBAD, BAD, BAD, from the beginning to the end, I don't even know where to start... loads of resources everywhere, but no more base building options... AT ALL... You get to fly the ship around (Normandy), shoot some robots, walk along never ending base corridors, craft some small objects, warp your ship, and shoot some more... the story looses interest and focus fast, it is poor, gameplay is boring, and at times nausea inducing... \n\nI was waiting with a lot of hope for the last 3 chapters, where I would get to build another base somewhere else, with a nice shuttle airlock, to do space exploration in style aboard the Normandy... ZERO... the shuttle airlock serves no purpose, and no where in chapters 4 -6 can you actually get out to space in your space suit, and build a base... You can only exit the Normandy when you dock in an airlock, and there are only preset airlocks in the game, no freedom, no customization of gameplay experience, nothing...\n\nSo very much disappointing... So much potential wasted... I think if this is the outcome of RedRuins Softworks getting a publisher (HypeTrain Digital), they were better off taking their time, and going solo...\n\nUtter rubbish, stay away from this game!\n\nPS: The storage locker module is a joke, 3 doors, 1 storage cabinet only, and there is an annoying bug where you cannot scan a glass panel with dead hamsters that unlocks a display module (for those who like to collect and display, it is very annoying, particularly because this has been flagged several times during the early access version, and wasn't fixed for the release version... sloppy).", "timestamp_created": 1615496499, "timestamp_updated": 1615497002, "voted_up": false, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.736918628215789795", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "90939677": {"recommendationid": "90939677", "author": {"steamid": "76561198038688690", "num_games_owned": 933, "num_reviews": 156, "playtime_forever": 1184, "playtime_last_two_weeks": 0, "playtime_at_review": 1184, "last_played": 1619422904}, "language": "english", "review": "Game stops being fun long before you reach the end. While the crafting and exploring is great at first, once you start exploring the main station it just becomes fetch quests that make you traverse long stretches of empty hallways. The game even jokes about it at one point, offering you the option to fast travel to skip these long boring walks, then laughs and denies you it forcing you to continue walking. \n\nDear games devs, pointing out a flaw in your own game and then refusing to address it doesn't make you clever. It makes you an ass.", "timestamp_created": 1619423070, "timestamp_updated": 1619423070, "voted_up": false, "votes_up": 37, "votes_funny": 6, "weighted_vote_score": "0.736326217651367188", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "45579496": {"recommendationid": "45579496", "author": {"steamid": "76561198032262033", "num_games_owned": 0, "num_reviews": 37, "playtime_forever": 3003, "playtime_last_two_weeks": 0, "playtime_at_review": 290, "last_played": 1636803008}, "language": "english", "review": "I didn't know much about this game outside of the premise before playing it for the first time, and I have to say overall, I absolutely loved it and look forward to seeing further development. Keep in mind that it is an early access game that, at the time of writing this review, has only been available for 2 months. \n\n[b] What I enjoyed: [/b]\n[list]\n[*]The look of the game is striking, unique, and absolutely gorgeous. It feels vast and desolate, and the music that plays while you space walk instills a sense of awe at the sheer scale of your surroundings.\n[*]It's a really funny game with a unique humour all of its own. It made me laugh out loud several times at the silliness or ridiculousness of a particular situation or event.\n[*]The voice acting is really high quality in both English and Russian. \n[*]So is the music!\n[*]The inventory system reminds me A LOT of the inventory system in the very early days of the \"We Happy Few\" builds. Personally, I really like it!\n[*]There's a lot of world building at the beginning of the game, it makes you want to keep finding out about this universe you're playing in.\n[/list]\n\n[b] Observations / suggestions / \"in the middle\" thoughts: [/b]\n[list]\n[*]There are heavy soviet themes from your status bars to the menu design to the music that plays in your shuttle, but for some reason I didn't feel like the player character fit into this. I'm almost certain this is because of the voice acting. While excellent voice acting, I feel like it would have benefited from a more 'Russian' feel. Perhaps further in development there will be more that helps this, but overall I don't feel like it impacts the game in any considerable way. (Playing with Russian audio definitely helps this)\n[*]The game at the moment is very short and linear. Buying at this point is an investment into the game and a statement of belief in the developers. This isn't a complete or polished game yet, but it looks like it's had a lot of work and love put into it until this point. If these developers continue into the future with what they've done in the past, this will be a fantastic game.\n[/list]\n\n[b] Negatives: [/b]\n\nWhile I don't actually feel like these were things that ruined or spoilt my enjoyment of the game, I feel like these are things that definitely need to be worked on just a tiny bit in order to get the most out of the game.\n[list]\n[*]At the beginning of the game, your understanding of how to get resources and from where is a little bit of an issue. In particular, the \"Handy Scraper\" comes up a lot when encountering objects floating around that you think will give you the materials you need. A little bit of extra assistance at the very beginning of the game might help dumbasses like me figure out what to do and where to go. I can see this happening through highlighting or guiding to the initial materials you need, or preferably pointing out the guidebook tab which helps you figure it out, too. Either way, it was about 5 minutes of frustration trying to figure it out for me, that I think could be avoided for other players with a little bit of jiggering.\n[*]The sudden change in music when going in and out of oxygen-rich environments and space can be a little bit jarring, especially when there's no door on said oxygen-rich environment.\n[/list]\n\nOverall this was a really fun and pretty short little game, and I'm really excited to see how the mechanics, story, and gameplay progress and develop.", "timestamp_created": 1541153597, "timestamp_updated": 1541153597, "voted_up": true, "votes_up": 22, "votes_funny": 2, "weighted_vote_score": "0.735718309879302979", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "59528134": {"recommendationid": "59528134", "author": {"steamid": "76561197977595788", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 27965, "playtime_last_two_weeks": 0, "playtime_at_review": 3684, "last_played": 1636683038}, "language": "english", "review": "Pro: I found a dead cow in space, dragged him back to my space station, and propped him up as decoration.\n\nCon: I cannot put a fancy hat on my dead cow.", "timestamp_created": 1575847085, "timestamp_updated": 1575847085, "voted_up": true, "votes_up": 70, "votes_funny": 134, "weighted_vote_score": "0.733351349830627441", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "86490174": {"recommendationid": "86490174", "author": {"steamid": "76561198051275977", "num_games_owned": 71, "num_reviews": 1, "playtime_forever": 2317, "playtime_last_two_weeks": 0, "playtime_at_review": 1564, "last_played": 1642602463}, "language": "english", "review": "\"Subnautica in space\" - I've seen this statement a lot before playing Breathedge, and there is a lot of truth to it. If you liked Subnautica, give Breathedge a shot, it's by far the game most like it. But even if you didn't like it, Breathedge might still be worth a try.\n\nWhile Breathedge plays really similar, it's far from a 'clone'. The atmosphere is completely different - there is no wildlife, no Reapers to hunt you down. Just you, your AI, and an oxygen bar that never seems to last long enough for everything you want to check out. It creates a relaxed atmosphere that goes really well with the games humorous approach. It's really a great game to relax at the end of a day.\n\nPlaying in late early access, the game ran great and I barely encountered any bugs. Apart from the last few chapters still missing, it doesn't feel like a game that isn't v1.0 yet. I'm truly looking forward to the rest of the story being released later this month.\n\nIf you like games set in space, survival games i general, or enjoyed Subnautica, you should definitely take a closer look at Breathedge!", "timestamp_created": 1613160383, "timestamp_updated": 1613160383, "voted_up": true, "votes_up": 76, "votes_funny": 1, "weighted_vote_score": "0.732590854167938232", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "46269544": {"recommendationid": "46269544", "author": {"steamid": "76561198124786907", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 3161, "playtime_last_two_weeks": 0, "playtime_at_review": 228, "last_played": 1615570511}, "language": "english", "review": "If Subnautica was intended to be funny instead of terrifying. And in space.\n\nThe game has a great sense of humour, though sometimes a bit puerile. As for playing the game, it's a great 3~4 hours to pretty much relax and collect stuff, with no real risk besides losing some ressources if you die. The game is indeed short, 4 hours was me taking my time and attempting to explore all of it.\nI would say that, besides the short lifespan and slight lack of content of the game, it is a truly enjoyable experience, great if you want to relax and float in space.\n\nGreat game, would stuff a chicken into a leaking air pipe again.", "timestamp_created": 1542887624, "timestamp_updated": 1542887624, "voted_up": true, "votes_up": 21, "votes_funny": 1, "weighted_vote_score": "0.731932282447814941", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44717795": {"recommendationid": "44717795", "author": {"steamid": "76561198001507954", "num_games_owned": 3200, "num_reviews": 302, "playtime_forever": 285, "playtime_last_two_weeks": 0, "playtime_at_review": 285, "last_played": 1536831461}, "language": "english", "review": "[h1]Breathedge[/h1]\n\nTake a MIR-era looking Russian cosmonaut, throw him into a dystopic future of space travel, ad agencies and space-funeral corporations, add a bit of delirium (and probably vodka) then throw in an undying chicken for good measure. Breathedge is an absolutely unexpected survival trip into the sci-fi realm.\n\nA marooned space vessel in the process of transporting the remains of your dearly departed father sets the stage for a tense environment of survival. Will you and your only family heirloom, your father's beloved pet chicken, be able to utilize the scraps of wreckage around you in a Zero Gravity playground of destruction and death to make it out alive?\n\n[h1]Story/Setting/Weirdness[/h1]\n\nA completely satirical take on the vibrant retro visions of Sci Fi stories and dystopic corporate space-age futures, Breathedge may present itself in a serious and very cinematic manner but the tale it tells is completely out of the ordinary. Parodying the grim intensity of both modern games and sci-fi cinema this is a game that goes above and beyond in the comedy department, slapping the player in the face with a sudden hilarious and unexpected twist at the most intense of moments.\n\nAngrily spitting at a villain only to have the wet loogie smack against the inside of your space helmet, and then even getting the option to clumsily try it again are just one of the many anecdotes you get to come across and interact with during dialogue.Even explaining the story here in Breathedge would be quite a task to do while not looking like an over-exaggerating loon. It really is that nuts.\n\n[h1]Gameplay[/h1]\n\nIn terms of the survival and crafting-centric gameplay, Breathedge feels like a sci-fi comedy take on the Subnautica concept. Your base of operations is a pre-made space-station sort of setting that plays center-stage to the story, and the actual exploring and gathering takes place in the wreckage-filled outskirts of outer-space. With a very limited starting oxygen supply you scour the nearby ruins of crashed vessels, picking and scavenging for what's needed to upgrade to better, stronger gear.\n\nThere's honestly some pretty intriguing and intricate mechanics here as far as survival games go and they play perfectly well into the humorous nature of the whole thing. Mechanics like, uhh, urinating into a special reversed space-toilet to relieve your full thirst meter to receive life-saving materials when in dire situations.\n\nJust like Subnautica there's a lot of carrot-on-a-string upgrading and crafting here. Your trips are limited at first, and you gather to your heart's content and your equipment's ability until you've gathered enough to make significant upgrades to your equipment. Upgrading your equipment allows you to explore deeper into the wreckage, and in turn scavenge for rarer materials, to craft even better equipment for even RARER material and so on and so forth. Survival veterans will be very familiar with this formulaic gameplay loop, and Breathedge handles that loop very well with a serious flair of its own humorous style.\n\n[h1]Final Thought[/h1]\n\nAn incredibly solid and addictive crafting and survival system is already in-place with Breathedge, as well as its fantastic vision of a humorous sci-fi setting and the environments surrounding it.\n\nI'm really digging this one, I've never been too much of a timesink-er when it comes to crafting games and usually check out early so naturally I thought I'd just hop in to get a glimpse of the off-the-wall story and setting. Surprisingly enough I stuck around long and good for the engaging space wreckage environment and all of the rich little set-pieces and lore it offers, and the clever and often purely comedic crafting recipes just seal the deal in this out-of-the-ordinary and otherworldly survival title.\n\nUnfortunately, being in Early Access only the first chapter of this ambitious and ridiculously entertaining storymode is available and clocks in at about three hours. An incredibly solid and enjoyable three hours, to be sure, that will just leave you salivating for more. Excited to see where this one goes.\n\n[i]This review made possible through the generosity, consideration and contribution of [url=http://store.steampowered.com/curator/11739878-ReviewExperts/]Review Experts(REXnetwork)[/url] and the developer/publisher. \n\nEmail contact@dnbmedia.co for requests & promotions[/i]", "timestamp_created": 1536870182, "timestamp_updated": 1537216413, "voted_up": true, "votes_up": 37, "votes_funny": 5, "weighted_vote_score": "0.731440246105194092", "comment_count": 3, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "130001115": {"recommendationid": "130001115", "author": {"steamid": "76561197965771164", "num_games_owned": 581, "num_reviews": 89, "playtime_forever": 2051, "playtime_last_two_weeks": 0, "playtime_at_review": 2051, "last_played": 1672719140}, "language": "english", "review": "Subnautica... IN SPACE! WITH CORPSES! (so many corpses!)\n\nThe game is roughly broken into three or four parts. First, you start off in your shuttle, with no equipment or resources - it's basically Subnautica, if you could only restore your oxygen in your escape pod. Eventually, you'll make your way to the second chapter, where you'll upgrade your equipment to drastically increase your oxygen capacity, ability to and duration of your thruster burn, and eventually get vehicles that allow you to move at 5x and 10x your initial movement speed; drastically increasing your range. It's actually rather fun going back to the initial area - things that required multiple oxygen waypoints and additional supplies are easily accomplished in just a single air tank.\n\nThankfully, there are multiple areas in the second section where you can recharge your oxygen, so you're not stuck constantly going back and forth from your shuttle. You'll also get oxygen candles that can entirely refill your supply, giving you the ability to stay somewhere that doesn't have a handy recharge station while you look for whatever resources / mission objectives you need.\n\nYour inventory is your constant enemy. The game is great in that, while it is _better_ to put things into containers, you can totally just dump all your crap onto the floor and it'll stay there. The biggest problem is that both food and water inexplicably take up 2 slots each in your inventory, and the game gives you _tons_ of the stuff. You'll routinely find yourself dumping bottles of water and/or packets of food to grab two more shards of titanium.\n\nSpeaking of, it's worth noting that although you've got both food and water bars, the only time you might (_might_) end up starving or dehydrating is the very, very, very start of the game. There's just too much ice and water goblets (which are used to make food and water), and just straight up food packets and water bottles lying around for it to ever become an issue. It's not unrealistic - you're exploring the wreck of a luxury liner, of course there's going to be plenty of food and water around - but it does almost entirely eliminate that survival aspect of the game.\n\nAfter you've played the survival simulation for a goodly amount of time... it ends. You enter a working ship and blast off into the walking simulator portion of the game. It's sort of funny, because the game is still technically a survival game, so the game dutifully makes sure that there's plenty of food and water scattered throughout the maps you're walking through. They also don't assume that you've kept any of your tools, so there's _so many resources_ scattered everywhere. If you're a packrat like me, you'll probably end up with multiple suitcases full of crap in your spaceship - way, way more than you'll ever need.\n\nFinally, there's a boss battle (technically, there are several, but only one of them is actually difficult). Luckily, the game gives you about half a dozen medkits before the fight. As long as you're not like me and prioritize the medkits over the refined metal (sweet, sweet refined metal), you'll be good.\n\nThe game tries to be \"funny\"... I'd say that it misses the mark more often than it hits it. It also tends towards the juvenile. Still, your companion AI does manage to keep up a good stream of quips and remarks that, at very least, manage to drown out the oppressive silence of deep space.\n\nFinal tally: First part was good. Second part was great. Third part was underwhelming. Forth part was annoying until I went back, dropped all the crap I was carrying and traded it out for medkits. Worth a purchase.", "timestamp_created": 1672721818, "timestamp_updated": 1672721818, "voted_up": true, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.731131672859191895", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "60162687": {"recommendationid": "60162687", "author": {"steamid": "76561197993824256", "num_games_owned": 498, "num_reviews": 58, "playtime_forever": 1336, "playtime_last_two_weeks": 0, "playtime_at_review": 950, "last_played": 1656151859}, "language": "english", "review": "[h1]Pressing W for 5 minutes for a sarcastic joke.[/h1]\nor\n[h1]Subnautica, but dead and slower.[/h1]\nAlternative, terrible, but more accurate titles for this game.\n\nBreathedge is both amazing and disappointing at the same time.\nWhich is the reason my review is so long... I honestly think these devs are cool, just read the steam page and some of their updates. Sadly that doesn't change my gameplay experience.\n\nAlmost everything in there is good quality:\n- awesome graphics, very nice aesthetics... everything just looks great with realistic and ridiculous designs mixed together perfectly,\n- awesome soundtrack,\n- the humour is nice, but can be too much for some, I personally like it,\n- progression and equipment you get are nice (although the pacing of them is NOT).\n\nThere are also problems, but they're not as apparent at first as its awesome graphics or cool soundtrack.\n\nIn a nutshell your time outside is painfully limited, and most of it you'll spend by just pressing W.\nAlso space is dead.\n\nWhile some of these problems might seem minor, or even ridiculous complaints, I'd like you to keep in mind that the devs are aware and even make fun of ridiculous game designs and mechanics.\nThey added an objective which specifically makes fun of missions/mechanics that are only in a game to artificially extend gameplay without adding actual content, and yet for the majority of Breathedge you're just flying through empty space.\n\nAt the beginning you get 50 seconds outside, but most of the important things are 15-20 seconds away. So you'll spend 30-40 seconds flying, and 10 seconds actually doing something. This ratio will only get worse, because you get bigger O2 tanks, but things will also be farther away. You'll be flying for 1-2 minutes and do stuff for 10-20 seconds at best.\n(there's no radio to listen to in your space suit, and you can't even set a course and a get a glass of water because there's space friction, you can't even open your inventory)\n\nAnother big problem is that some of the progress you make is nullified/waste of time, because at some point in the game you can research items that you would find outside at debris. So first you spend time to grind the resources for the research, then you finally make yourself go out and fly through space for 2 mind-numbing minutes just to realise the debris you're at has the item you already researched. Not only a waste of time, but makes you think that you might've bypassed certain elements of the game, basically took the easier way to progress.\n\nThis limited oxygen really discourages progression for a new player, since you have to use consumable items to complete objectives, but you also have limited resources, and absolutely no idea what's gonna happen when you actually progress.\nTaking risks either with your life (after which you need to load) or by exhausting your resources (might need to to restart the whole game) would be less of an issue if you didn't need to do the exact same things 5 million times throughout the game... if it needed some skill. But this combination of mindless repetition and being forced to risk your run is very bad.\n\nBasically devs shooting themselves in the foot with the limited oxygen mechanic:\nYou can't enjoy the beautiful environment, soundtrack and the witty commentary of the AI they created, there's just not enough time at the beginning. I mean your oxygen is running out so you just have to scan, collect and progress as fast as you can, often cutting voicelines, because the alternative would be to fly another minute back and forth. When you finally do get enough oxygen the novelty is already gone.\n\nO2 recharge is unnecessarily slow, especially at manual recharge stations, where you have to press left-click for seemingly hours for a full tank. Why? It serves no purpose.\n\nIt's easy to miss some of the upgrades, which really amplifies the problems I described above.\n\nCompared to Subnautica:\n- While the distances and travel times are similar in both games, the in Breathedge you have small bubbles of O2, instead of having the whole surface of an ocean, which severely slows down progress.\n- No wildlife to look at, no enemies to be afraid of. With all the ridiculous (but funny) ideas they put in the game, spacemonkeys and spacesharks in there wouldn't really stand out.\n- Crafting is clunky in Breathedge: you can't open your inventory while moving, you can't walk away from the Processor while crafting items, you can't build multiple processors to craft faster.\n- For hours there's nothing that would ease your gameplay in Breathedge. As you get better items, you'll need to go father, always stretching your O2 supply. In Subnautica the Seaglide or even a basic O2 tank felt like a gamechanger and you also get a Seamoth in just a few hours in. In Braethedge there's no cool upgrades, you just get the bare minimum.\n\n\nWhat could help:\n1. For starters they could increase the actual speeds to what the UI shows. Your spacesuit is supposedly capable of 12 m/s, while the actual speed is closer to 6 m/s.\n2. Communicate more clearly which resources are renewable. That would make certain consumables more appealing.\n3. Don't let us waste time on research if we gonna find the blueprint 3 minutes later. Don't make the need to explore and the need to research mutually exclusive.\n4. Don't draw O2 while the AI is talking. Yes, it's stupid and it's unrealistic, but unless we get more time outside, I just don't have time to pay attention to that guy. You designed the game in a way that I have to hurry.\n5. Let us do something while flying through space. Add a spacesuit radio, or let us open inventory, or remove space friction from the player's base movement (only for the 12m/s speed, the accelerator effect should still wear off)... anything, really.\n\nEither one of these would be a great addition, although the 1st change by itself would solve most other issues.", "timestamp_created": 1576836101, "timestamp_updated": 1576836101, "voted_up": false, "votes_up": 189, "votes_funny": 7, "weighted_vote_score": "0.730118095874786377", "comment_count": 11, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1614277721, "developer_response": "Hey there!\n\nThanks for your feedback, many good points made there. Now that the game is fully released, we hope you could give Breathedge one more try. We've boosted the base O2 level to 75 seconds, improved some tools durability, fixed the speed indicator, and much more - not to mention three new chapters and the game finale."}, "100789336": {"recommendationid": "100789336", "author": {"steamid": "76561198000195367", "num_games_owned": 174, "num_reviews": 5, "playtime_forever": 2517, "playtime_last_two_weeks": 0, "playtime_at_review": 2085, "last_played": 1667149737}, "language": "english", "review": "If you liked subnautica, play this, if you didnt like subnautica go see a doctor.", "timestamp_created": 1633794270, "timestamp_updated": 1633794270, "voted_up": true, "votes_up": 90, "votes_funny": 95, "weighted_vote_score": "0.729928970336914063", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "108592591": {"recommendationid": "108592591", "author": {"steamid": "76561198046603247", "num_games_owned": 360, "num_reviews": 32, "playtime_forever": 2365, "playtime_last_two_weeks": 0, "playtime_at_review": 2365, "last_played": 1642916310}, "language": "english", "review": "Sadly, I can't recommend this game. I wanted to enjoy it really bad, but I simply couldn't.\nYou will read a lot in other reviews that this game is \"Subnautica in Space\", but this is exactly the problem with this game: It tried too hard to be Subnautica, and it failed miserably in every aspect of it.\nSome mistakes are just too grotesque, like the sheer quantity of useless items that you will learn to create and will serve to almost nothing, for example, there is literally one item that you create to open one single door the entire game, but as you never know when the game will ask again for that item, you end up carrying that thing around \"just in case\". The oxygen system is a mess as well - It's too freaking hard in the beginning, and just a nuisance later, and it's something that is basically forgotten halfway through the game.\nThe game lacks focus, it lacks commitment, and you are left with a mess of a game that is full of awesome concepts, but never deliver it right.\nAnd again, this is really sad. You can see that they COULD HAVE been \"Subnautica in Space\", but it's just a project of some guys making fun of everything, all the time, without thinking exactly where this is leading. I won't even comment the story of the game... Or the writing. I feel dumber after playing this.\n\nApart from that, the art and design team should receive a prize, it's the true highlight of this game. I loved the graphics, the soundtracks were right on point, and you can see that they goddamn knew how to model all those props. Everything looks good, even sometimes when people are dead - They are a frozen art of gore. But they decided to be too gore for their own sake as well. Anyway this doesn't take away their merit, they were awesome. But then again, it's kinda sad that the level design didn't exactly match the survival aspect, there is not so many places where you go \"ohhh, this is a perfect place for me to build a base!\", but then again, this game is not a good survival game.\n\nTo sum up, I think that, if the art team had a better director and a better writer, this game would be worth it. But the game looks like a conglomerate of ideas rotting due of lack of decisions and commitment. And this sucks.", "timestamp_created": 1642918599, "timestamp_updated": 1642970299, "voted_up": false, "votes_up": 41, "votes_funny": 3, "weighted_vote_score": "0.728495121002197266", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "98804997": {"recommendationid": "98804997", "author": {"steamid": "76561197978330367", "num_games_owned": 4138, "num_reviews": 176, "playtime_forever": 1072, "playtime_last_two_weeks": 0, "playtime_at_review": 1072, "last_played": 1630810003}, "language": "english", "review": "Breathedge is a story-driven survival crafting game with a couple of unique twists: it takes place in space and has a lot of humor. The first part is executed pretty well. There's something really tranquil about floating around in space, searching through debris and looking for blueprints and resources. The early game is pretty annoying, as it is in most survival crafting games, because you're constantly on the verge of running out of oxygen and you float really slowly through space. This makes exploring a bit of a chore. However, as you craft new equipment, your ability to explore is greatly enhanced and the game becomes much more enjoyable.\n\nThe humor, on the other hand, mostly falls flat. It's conveyed primarily through collectibles and your sarcastic suit AI. There's a lot of self-deprecating humor, in addition to pop culture and videogame references. Unfortunately, most of it just isn't funny. There are a few moments that will make you chuckle but they're far and few between.\n\nThe game's biggest failing is the late game. Exploration and crafting take a backseat to linear corridor crawls and poorly executed combat sequences. It quickly becomes a drag and makes most of what you crafted earlier redundant. It might have felt more engaging if I cared about the story or lore but the game doesn't really give you any reason to invest in either of those because it all feels so random and irreverent.\n\nI give Breathedge a tentative recommendation because it's really enjoyable when it's at its best. It's just that this only happens in the midgame after you've slogged through an annoying early game.  The endgame is basically skippable unless you really care about the story and that's very unlikely. If exploration and discovery are your priorities, you'll find some fun in Breathedge. If story and writing are your priority, you're better off elsewhere.", "timestamp_created": 1630810846, "timestamp_updated": 1630810846, "voted_up": true, "votes_up": 24, "votes_funny": 0, "weighted_vote_score": "0.727727949619293213", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "133608118": {"recommendationid": "133608118", "author": {"steamid": "76561198013990301", "num_games_owned": 0, "num_reviews": 229, "playtime_forever": 1557, "playtime_last_two_weeks": 0, "playtime_at_review": 1557, "last_played": 1677354667}, "language": "english", "review": "It's like [url=https://store.steampowered.com/app/264710/Subnautica/]Subnautica[/url], but much worse. And in space. It's really a space-floating and station-walking simulator with a silly/funny/stupid commentary. The game is super boring.\n\nIn the first chapter, you fly 6m/s and have to constantly return to your crashed shuttle. You are super happy when you build a jetpack and can occasionally fly 10m/s. But then you have to fly further, so you have to build some rechargeable oxygen stations to refill on your way, effectively taking all your improvements away.\n\nIn chapter two, you get access to a mini rocket to fly 40m/s, but everything is even further away, again reducing the impact of all the new things you researched.\n\nAs you finish chapter two, you will have a mini space station built, and you will be super happy to discover a shuttle that you can fly - only to abandon the area...\n\nIn chapter three, you don’t float around anymore. You fly your shuttle and dock to stations, only to walk very, very long corridors back and forth. Door you cannot open? Go back to the shuttle to build a key, then run to the door. Oh, the door has a missing piston so they can’t open? Run to the shuttle again to build a missing part. And so on...\n\nAnd there is no fast travel or even auto walk!\n\nInventory management is really bad. What seemed like a big backpack at the beginning, becomes really small when you have to carry 10 different tools with you. You have to pick up all items manually, even if you destroy a bigger piece of something (by hitting it 10 times, always, no upgrades), it spawns 3 pickable items so that you have to look around and pick them up 1 by 1 again. Buildable containers? Pretty much non-existent. You can only build a suitcase that you can throw on the floor and fill with items, that you will keep accidentally kicking around whenever you walk nearby it.\n\nEven simple things like crafting or sleeping takes 3 seconds of progress bar moving. What for? It’s a single player game!\n\nInconsistency between opening containers sometimes with LMB and sometimes with RMB was another thing that was driving me crazy.\n\nI kept playing, hoping that it will get better, but it only gets worse. At some point, while I was exploring the station (and running back and forth), I got killed at the very end, only to discover that no auto save had been made when entering the final room with a boss. And I have enough running.\n\nIf you are into Open World Survival Craft games, this game has almost nothing to do with this genre.", "timestamp_created": 1677355577, "timestamp_updated": 1677355824, "voted_up": false, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.727120578289031982", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "146373256": {"recommendationid": "146373256", "author": {"steamid": "76561197982744438", "num_games_owned": 395, "num_reviews": 27, "playtime_forever": 1011, "playtime_last_two_weeks": 0, "playtime_at_review": 1011, "last_played": 1693882931}, "language": "english", "review": "Way too plodding.  The environment is not interesting enough in the long run, the crafting is tedious in spite of the low complexity, the survival elements are meaningless except for oxygen, and the basebuilding is an afterthought.  Oxygen is your main progression gate to getting around, which would have been fine if the game was more interesting, but instead it feels frustrating.  The dialogue is persistent and tries to be humorous, but is mostly pretty bland; some of the visual humour is a bit more amusing, though hardly a draw.  For positives, I liked how they designed visual cues to facilitate exploration in a directed way, and it's a visually interesting space setting (for a little while, anyway).  Couldn't bring myself to finish it - I think I made it about halfway to two-thirds into the game.\n\nA meta joke about how developers pad their games feels like twisting the knife rather than a funny gag when your game is boring.", "timestamp_created": 1694833677, "timestamp_updated": 1694833677, "voted_up": false, "votes_up": 36, "votes_funny": 0, "weighted_vote_score": "0.723589003086090088", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "131324065": {"recommendationid": "131324065", "author": {"steamid": "76561197979934786", "num_games_owned": 0, "num_reviews": 39, "playtime_forever": 214, "playtime_last_two_weeks": 0, "playtime_at_review": 214, "last_played": 1672491557}, "language": "english", "review": "I loved Subnautica. Found recommendations for this game. Bought it.\nThis game feels like a high school group project: the graphics are great and realistic,\nthe story/content however is stupid (wannabe-funny). Like, you are on a space suit, and you need to increase the Oxygen capacity, so you can build something out of a condom and some wire... \nI liked the \"realistic\" approach of Subnautica, and really hated this one.\n\nIt really feels like the work was stopped half-way, the developers left, after making the graphics, and then the CEO's 13 year-old nephew came in and took over, and filled it with unfunny immature jokes as content.", "timestamp_created": 1674377411, "timestamp_updated": 1674377411, "voted_up": false, "votes_up": 104, "votes_funny": 8, "weighted_vote_score": "0.723718822002410889", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "110749539": {"recommendationid": "110749539", "author": {"steamid": "76561197978600652", "num_games_owned": 0, "num_reviews": 212, "playtime_forever": 995, "playtime_last_two_weeks": 0, "playtime_at_review": 995, "last_played": 1645501228}, "language": "english", "review": "Lets start simple, whatever you might *think* Breathedge is, it isn't.  I had to read a few of the positive reviews before writing this and I'm definitely going to be criticizing the game for seemingly all the things other people \"liked\" about it.  It's odd, there are positive reviews explaining that the game is tedious, poorly structured, and superfluous *but* it's funny.  I agree.  I found it to be tedious, poorly structured, and superfluous: that's precisely the reason I didn't like it.  It's not even hard to articulate why: everything in the game is an excuse to get to  irreverent non sequitur commentary delivered by your spacesuit.\n\nIt's like, I get it.  The joke is that it's a bad game.  The developers are self-depreciating, the game frequently quips at how meaningless or stupid many of its decisions are and I'm nodding my head.  At one point the suit AI literally goes, \"Does this game even have any mechanics?\"  No, it doesn't.  That's the joke.  Ha ha.  Would be *nice* however, if it did.  The game this most reminded me of was that Devolverland promotional game made for E3 a few years back with crafting mechanics bolted on.  It's not that Breathedge is bad.  It's not incompetent enough to be bad.  At the same time though, it has a careless feeling rather than a carefree one.\n\nFor example, there's this running chicken gag.  I mean, the game certainly says there is but it seems to have forgotten to have it *be* a running gag.  The chicken is used once at the beginning and then to short out electric currents sometimes and then at the very end.  If the chicken had been a prominent character, been involved in more cutscenes, maybe was responsible for some of the many failures you experience then it could make sense.  But nope.  The game just *says* it has a running chicken gag and I guess that's the part where I fall over laughing until I cry.  It definitely feels like no one cared or even noticed.\n\nLest you think this is a quality only of the writing, no.  For example, the thirst and hunger mechanics.  You find food and water everywhere you go and it takes forever to run out: so why is it here?  Because survival games have these mechanics hur hur hur?  I'm not even sure that's it.  Early on you can craft a \"better\" helmet.  Spoiler alert: you just paint the helmet entirely red and can't see anything when wearing it.  It's funny, but here's the truth of the game: radiation is also a non-issue.  You just have to complete the quests, the actual rating doesn't do anything.  Again, hur hur so subversive.  The game is seemingly making fun of itself, and yet it's still just just about achieving the goal of being precisely what it's mocking.  In my opinion, it fails to meet its own low standards thanks to aspiring to nothing more than minimal competency.\n\nSo no, I can't recommend Breathedge.  I can praise it for it's technical feats, but being basically playable and looking nice is the bar games are expected to clear.  As far as unique selling points it has a nice pulpy sci-fi aesthetic and I can at least admit a few lines made me chuckle, but as a complete package I guess the joke is that anyone like me would actually play it to the end and be disappointed.  It's hard to critique something that is knowingly bad, Breathedge is basically just Sharknado in game form: it aspired to be mediocre in pursuit of a premise but I'm not going to give it a thumbs up just because it knows it's dumb.", "timestamp_created": 1645505313, "timestamp_updated": 1645505313, "voted_up": false, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.718464016914367676", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "91443813": {"recommendationid": "91443813", "author": {"steamid": "76561198030201204", "num_games_owned": 0, "num_reviews": 52, "playtime_forever": 2432, "playtime_last_two_weeks": 0, "playtime_at_review": 2432, "last_played": 1614657265}, "language": "english", "review": "Subnautica, if Subnautica was developed by Russian 13-year-olds.\n\nIt has some pretty big flaws. It has base building! But only really at the end of the game, when it doesn't provide any help with your biggest issues (junk storage and sorting), and you lose resources if you take things apart after building them, so it's just bad when compared to Subnautica's easy to do, easy to tear apart, provides-convenient-storage-and-power-and-food-growing-in-the-mid-game.\n\nIt has a pretty long, cynically funny story! But the last third of the story is a terrible railroad, with no real thinking or planning but instead a lot of \"go build this thing, make your way all the way back through all of the empty hallways to your ship to make it, then come back through all of those empty hallways to get back here and use it.\" Also, the story likes to veer into bathroom humor. A lot.\n\nOverall, it's got an okay story, awful voice acting (the narrating computer talks too fast to be understood a lot), sad base building, wonky combat you should avoid whenever possible, a terrible third act, but a generally good \"explore areas to find parts and ideas so that you can open up new areas to explore for parts and ideas\". \n\nBut it's also under $20, so, eh. It falls on the side of \"sure.\"", "timestamp_created": 1620164952, "timestamp_updated": 1620164952, "voted_up": true, "votes_up": 30, "votes_funny": 3, "weighted_vote_score": "0.711088299751281738", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "95688952": {"recommendationid": "95688952", "author": {"steamid": "76561198371500615", "num_games_owned": 172, "num_reviews": 20, "playtime_forever": 1673, "playtime_last_two_weeks": 0, "playtime_at_review": 1525, "last_played": 1651225078}, "language": "english", "review": "Fun like Subnautica, but a bit tedious at times. I enjoy the survival and crafting aspect of this game. But a repair wrench breaking after 50 uses doesn't make much sense to me. I was surprised to see the addition of base building added to the game. It's a fun game with tons of references to iconic films, video games, and internet memes. A fun sense of humor, like when the hero tries to fire a laser to cut through a blast door, but sneezes and accidentally cut the ship in half. A story that sounds a bit ludicrous, but ends up being good in the end. My only complaints really is that the limitation of travel due to a short air supply gets tedious at times. Additionally, tools that are as durable as cardboard or power tools that must be powered by a potato. This means you'll be stopping everything your doing while exploring a wreckage so you can replace your broken metal rod with a clump of metal on the end. I can understand having to build or fix tools...but causing me to stop everything and run back through the shipwreck for 5 minutes to craft a new tool is a bit much. Adding a few places to craft new gear while exploring a large structure would have been nice. But no, put everything on hold and run for 5 minutes, then find out you're missing one piece of metal for the build and pray that you don't have to leave the area to find it.", "timestamp_created": 1626214197, "timestamp_updated": 1626214197, "voted_up": true, "votes_up": 23, "votes_funny": 2, "weighted_vote_score": "0.709031462669372559", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "102726425": {"recommendationid": "102726425", "author": {"steamid": "76561197981405537", "num_games_owned": 0, "num_reviews": 42, "playtime_forever": 1866, "playtime_last_two_weeks": 0, "playtime_at_review": 1866, "last_played": 1636777539}, "language": "english", "review": "As I was playing through this game, I tried to come up with a good way to summarize the experience. The best I can say is that it's kinda like writing a term paper while your annoying roommate watches a Family Guy marathon in the background.\n\nThe game tries really hard to be funny, but whether or not it succeeds largely depends on how much you like shallow juvenile humor and incessant self deprecation.  If you don't, your experience may be somewhat enhanced by going into the volume settings and turning the voice slider down to 0.\n\n\"Humor\" aside, the game starts off as basically Subnautica IN SPACE!  You're the sole survivor of a spaceship crash, and you have to explore your (beautifully lonely) surroundings, upgrade your gear, try not to starve or suffocate, and slowly uncover the backstory while looking for a way home.  The second half of the game throws all that out the airlock and gets progressively more linear until by the end it's almost a straight FPS.  The survival elements are pretty downplayed: food and water can't be farmed (as far as I could tell) but is quite plentiful, and once you get to the point where you can build a base you really don't even need to except for one specific module that's required to proceed.  Then you jump to a whole other map, making whatever effort you put into building your base and collecting supplies all for naught.\n\nOverall, I give it a weak thumbs-up.  It's a decent game for what it is, but you have to overlook the numerous flaws to really enjoy it.", "timestamp_created": 1636828972, "timestamp_updated": 1636828972, "voted_up": true, "votes_up": 19, "votes_funny": 4, "weighted_vote_score": "0.706162691116333008", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "131308055": {"recommendationid": "131308055", "author": {"steamid": "76561198045761256", "num_games_owned": 0, "num_reviews": 23, "playtime_forever": 307, "playtime_last_two_weeks": 0, "playtime_at_review": 210, "last_played": 1674418929}, "language": "english", "review": "So tedious and boring. Clunky & slow UI. Just interesting enough to get you past the 2 hour refund window. Then you're stuck floating back to base for 15 minutes to make another harvesting tool for the 5,000,000th time.", "timestamp_created": 1674352372, "timestamp_updated": 1674352372, "voted_up": false, "votes_up": 49, "votes_funny": 5, "weighted_vote_score": "0.704801440238952637", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "44989617": {"recommendationid": "44989617", "author": {"steamid": "76561198121018313", "num_games_owned": 224, "num_reviews": 61, "playtime_forever": 978, "playtime_last_two_weeks": 0, "playtime_at_review": 141, "last_played": 1631722029}, "language": "english", "review": "I don't think i've seen any other game try to do a serious yet comedic sense like this. This game has done it perfectly and in my opinion is perfect. The ONLY suggestion i have is that when starting off, you need to make materials more easier to find. I spend like 20 minutes trying to find Lead Paint and i'm not going to lie its kind of annoying. Apart from that this game is perfect. Good job! By far one of the best games i've played.", "timestamp_created": 1538168769, "timestamp_updated": 1538168769, "voted_up": true, "votes_up": 19, "votes_funny": 2, "weighted_vote_score": "0.698652029037475586", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "128140199": {"recommendationid": "128140199", "author": {"steamid": "76561198049557732", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1718, "playtime_last_two_weeks": 0, "playtime_at_review": 1718, "last_played": 1670472921}, "language": "english", "review": "Don't waste anymore of you money on Hypertrain products. They do not complete any of their games or update them. They are only taking your money.", "timestamp_created": 1670473039, "timestamp_updated": 1670473039, "voted_up": false, "votes_up": 46, "votes_funny": 0, "weighted_vote_score": "0.692302942276000977", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "51014118": {"recommendationid": "51014118", "author": {"steamid": "76561198410083830", "num_games_owned": 1063, "num_reviews": 12, "playtime_forever": 270, "playtime_last_two_weeks": 0, "playtime_at_review": 177, "last_played": 1566309495}, "language": "english", "review": "NEW CONTENT HAS BEEN ANNOUNCED, LOTS OF IT.\nyou can check it out here:\n\nhttps://steamcommunity.com/games/738520/announcements/detail/1606009229964077125 \n\nstop whining and giving the game negative reviews because the devs actually care about their game, aren't rushing out unfinished and buggy content and aren't a massive company like Ubisoft who have thousands of people working on the tiniest things. i am so excited for the new content", "timestamp_created": 1559484451, "timestamp_updated": 1559484571, "voted_up": true, "votes_up": 36, "votes_funny": 6, "weighted_vote_score": "0.691903948783874512", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "89496928": {"recommendationid": "89496928", "author": {"steamid": "76561198165288832", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 2976, "playtime_last_two_weeks": 0, "playtime_at_review": 2976, "last_played": 1615629509}, "language": "english", "review": "In the first chapter your goal is to upgrade your equipment, build your base, gather resourses, explore new locations, all that Subnautica-like stuff. Lots of fun!\n\nOh, and then you'll need to grind your way through walking sim with no gameplay to speak of. Well, sometimes you'll have the opportunity to shoot at things.\n\nStill, the game is fun and enjoyable. First chapter - 10/10, rest of the game - 5/10.", "timestamp_created": 1617285200, "timestamp_updated": 1617285200, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.687851846218109131", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "66884574": {"recommendationid": "66884574", "author": {"steamid": "76561197971161229", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 2915, "playtime_last_two_weeks": 0, "playtime_at_review": 1483, "last_played": 1614877207}, "language": "english", "review": "This is the best Space-survival game I've ever played. If you like Subnautice style elements, with a unique humor that's could be your favorite game.", "timestamp_created": 1586346555, "timestamp_updated": 1586346555, "voted_up": true, "votes_up": 20, "votes_funny": 1, "weighted_vote_score": "0.686788439750671387", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "99061438": {"recommendationid": "99061438", "author": {"steamid": "76561197975214377", "num_games_owned": 4035, "num_reviews": 35, "playtime_forever": 4306, "playtime_last_two_weeks": 0, "playtime_at_review": 4306, "last_played": 1631211320}, "language": "english", "review": "Pros:\nBase building and survival crafting that's totally ripped off from Subnautica. This is a very good thing. :)\nMore direction than in Subnautica, so you're never unsure of what to do next.\nYou can actually shoot stuff.\n\nPotential cons (or more pros, if these are your thing):\nSophomoric humor.\nCartoony gore.\nThe story gets pretty macabre.\n", "timestamp_created": 1631211589, "timestamp_updated": 1631211589, "voted_up": true, "votes_up": 28, "votes_funny": 1, "weighted_vote_score": "0.685757040977478027", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "44759589": {"recommendationid": "44759589", "author": {"steamid": "76561197997814982", "num_games_owned": 2038, "num_reviews": 22, "playtime_forever": 106, "playtime_last_two_weeks": 0, "playtime_at_review": 106, "last_played": 1537074356}, "language": "english", "review": "Well.. the game is gorgeous.. and the jokes are funny for the first 5 minutes but then fall flat. Other reviews have called this a sort of \"Deadpool\" style of humor and I love Deadpool. Not this.\n\nThis game has VERY suspicious reviews - a lot of people have played this for maybe half an hour and more or less called it goty... weeks ago.. and have never played it again since their play time has not changed. Way too many.\n\nYou get tossed into the game and there ulimately no guidance besides \"go\". Normally this doesn't bother me and is fantastic in a exploration type of game.. but EVERYTHING you make in this game has the smallest durability I've ever experienced in a survival game. ALL resources are finite. A lot of the resources you need for gear that you can make for upgrades are found in obscure containers that you need to beat down with your \"wrench\" and not just.. open. That wrench? Costs 3 metal. 35 durability. Each metal notes gives maybe 2 or 3 metal... and uses about 5 durability. You do the math. What's the point?\n\nUltimately you're left wanting to explore the game more in a very quiet, ambient setting... and deal with contiuously dwindling resources in a world that offers no real reason to explore... while on the smallest leash you can imagine because the already limited resources you can use to explore are needed to do ANY exploring. Nothing is renewable. No farms, no solar panel, no food, no building, NOTHING to possibly make this even slightly enjoyable. You can travel out in one direction on your starting oxygen for about 20 seconds, and then 20 seconds back. Find an upgrade nearby? Great - now its about 35 seconds out and back... Apparently there's another but almost the ENTIRE MAP is either covered in a radiation zone or too cold... and the only way to upgrade your suit is to get lead from places on the map that are about 600 meters away from the starting area. That's a pretty long way from the start considering you move at a max of 12m/s without what's essentially an afterburner that boosts you to 20m/s for maybe 5 seconds. That 50 second trip? That's 100 points of oxygen, MINIMUM, more than what you can reasonably have in a tank. You can make oxygen refill stations.. that don't refill on their own.. and use a lot of resources to be able to refill. Like the metal. That's finite. See the cycle yet? No upgrades, no real \"resupply stations\", no bases, very little rewards for exploring and just.. a grind.\n\nSeriously disappointed. I wanted something like Subnautica (which I LOVED and beat multiple times.. supported it very early in EA) but I was really just left feeling like I have to wait for some other game to get me thrilled to explore again. Maybe this one will get updated.. but probably not since it has been months with little change and the game is looking to be \"episodic\" anyways.. For an exploration game. What??", "timestamp_created": 1537075487, "timestamp_updated": 1537075487, "voted_up": false, "votes_up": 62, "votes_funny": 2, "weighted_vote_score": "0.684219002723693848", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1614277844, "developer_response": "Hey there!\n\nTo address your concern about the O2 level - the base level of O2 has been increased to 75 seconds, and on top of that, the game is fully released now - with 3 new chapters, new game mechanics, and tons of things to do. We’d be delighted if you could give it another try!\n"}, "89050512": {"recommendationid": "89050512", "author": {"steamid": "76561197990830521", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 7970, "playtime_last_two_weeks": 0, "playtime_at_review": 1996, "last_played": 1682192532}, "language": "english", "review": "Basically, this game is what would happen if the writers of Robot Chicken decided to make a survival horror game in space.  You've got a live chicken on a stick being used as a multitool, you've got text messages from a space babe that keep you guessing as to who the space babe is even after the game is played through, you've got a horny diagnostic computer that yells at you about pushing buttons, mutant space cows, an army of undead robots (literally they made that work), space mayo, base building and crafting, and the ability to piss on anything duke nukem style.  I don't think I've ever chuckled as much at a game as this and every plot twist just is weirder and weirder.  Lots of \"Come to this scene, do the detective work, WTF until you're nearly out of oxygen, go back, think about what you just saw, go back, look\".  The only complaint is there's not much replay value once all the jokes are told, but it's well worth the money and 30-40hrs of play time.", "timestamp_created": 1616667346, "timestamp_updated": 1616667346, "voted_up": true, "votes_up": 21, "votes_funny": 1, "weighted_vote_score": "0.683880984783172607", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "120542301": {"recommendationid": "120542301", "author": {"steamid": "76561198028054478", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 12940, "playtime_last_two_weeks": 0, "playtime_at_review": 2348, "last_played": 1661900141}, "language": "english", "review": "I'm almost 40 hours in and I'm still just in the middle of chapter 2. It's not taking me this long because it's hard, I'm simply enjoying the game so much that I'm in no rush, I'm exploring everywhere. The graphics are beautiful, I'm loving the humor and the story, and I'm already planning a second playthrough ASAP when I reach the end. \nMy only complaint is the storage options aren't great - it's a little cumbersome.\n\nI give it a solid 9/10.", "timestamp_created": 1660374598, "timestamp_updated": 1660374598, "voted_up": true, "votes_up": 22, "votes_funny": 0, "weighted_vote_score": "0.683655500411987305", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "60505167": {"recommendationid": "60505167", "author": {"steamid": "76561198307615811", "num_games_owned": 0, "num_reviews": 181, "playtime_forever": 1087, "playtime_last_two_weeks": 0, "playtime_at_review": 318, "last_played": 1630032721}, "language": "english", "review": "I'm making this review after finishing Chapter 1.\n\nSubnautica in space with Borderlands humor. \nThe crafting is very similar to Subnautica's. There is no base building as your bases are pre-built with an infinite oxygen supply. Very easy to run out of oxygen in space trying to travel from one place to another. Also freezing sucks and will make you blind if exposed for long periods.\nYou can build oxygen stations which allow you to travel long distances as long as you remember to fuel them with oxygen  generators after 4 uses, 5 and they're empty.\n\nThe graphics are very smooth on ultra but nothings made me exclaim woah yet. It's really nice looking and better than some games but it's not the best looking graphics in the world.  You are in a gigantic meteor belt infront of a small blue sun/star and a greyish earth like planet about the size of Saturn with an orbiting moon. I was hoping for more colorful planets, solar systems, space eye candy. Maybe that'll change if vegetable aliens attack. Chapter 2 looks to have more light than 1 as we are moving closer to the sun/star.\n\nIt's still being developed so things may change and so will this review after I play more and the game gets added to.\n\nYes you should buy this game, it's fun and great to dump a few hours into. If you loved Subnautica this will be right up your alley. It has some great dark humor in it some jokes even lead up to hidden achievo's.", "timestamp_created": 1577259011, "timestamp_updated": 1577259011, "voted_up": true, "votes_up": 15, "votes_funny": 2, "weighted_vote_score": "0.68232417106628418", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "87485222": {"recommendationid": "87485222", "author": {"steamid": "76561199011262401", "num_games_owned": 369, "num_reviews": 53, "playtime_forever": 2591, "playtime_last_two_weeks": 0, "playtime_at_review": 51, "last_played": 1622190451}, "language": "english", "review": "I just read this game is like subnautica in space...\n1) First thought:       I love subnautica.\n2) Second thought:  I love space.\n3) Decision:              Bought it.\n4) Result:                  I was not disappointed. Awesome game!", "timestamp_created": 1614354267, "timestamp_updated": 1614354267, "voted_up": true, "votes_up": 16, "votes_funny": 3, "weighted_vote_score": "0.682113468647003174", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "53893073": {"recommendationid": "53893073", "author": {"steamid": "76561198398979020", "num_games_owned": 1049, "num_reviews": 32, "playtime_forever": 207, "playtime_last_two_weeks": 0, "playtime_at_review": 182, "last_played": 1572364261}, "language": "english", "review": "I really liked the game. Great humor especially. But it is still very short, and I am really looking forward to new chapters. For a long time I thought that the game would end on this, but I was very happy when I saw that there would be at least two more chapters that are likely to be much longer than the first.", "timestamp_created": 1562489862, "timestamp_updated": 1562489862, "voted_up": true, "votes_up": 17, "votes_funny": 2, "weighted_vote_score": "0.681747317314147949", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "87508923": {"recommendationid": "87508923", "author": {"steamid": "76561198025448561", "num_games_owned": 1042, "num_reviews": 13, "playtime_forever": 3401, "playtime_last_two_weeks": 0, "playtime_at_review": 3321, "last_played": 1636292270}, "language": "english", "review": "A game very much like Subnautica in many ways but without the horror elements.  Instead you have a very witty game which isn't above poking fun at itself and others.  Well worth a playthrough if you were impressed by the trailer.\n\nNow if you don't mind.  I must fly back to my space station on a improvised vacuum cleaner to fill in a tiny hole in the hull with chewing gum and I only have so much air left in the condom I use as an air tank.  And yes.  Those are all things in this game.", "timestamp_created": 1614383858, "timestamp_updated": 1614383858, "voted_up": true, "votes_up": 29, "votes_funny": 9, "weighted_vote_score": "0.67756187915802002", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "145508633": {"recommendationid": "145508633", "author": {"steamid": "76561197968720578", "num_games_owned": 2018, "num_reviews": 31, "playtime_forever": 736, "playtime_last_two_weeks": 0, "playtime_at_review": 736, "last_played": 1693645325}, "language": "english", "review": "Subnautica in space, with Eastern European humour. You can or cannot appreciate it, there is no middle.", "timestamp_created": 1693645399, "timestamp_updated": 1693645399, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.676703929901123047", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "122014911": {"recommendationid": "122014911", "author": {"steamid": "76561198325858654", "num_games_owned": 0, "num_reviews": 57, "playtime_forever": 3948, "playtime_last_two_weeks": 0, "playtime_at_review": 3853, "last_played": 1688973652}, "language": "english", "review": "This is a campy, solo, story-based, space adventure.  It has so much to offer it is hard to choose the best part.  The only way to learn the Drill is to take the blue print into your backpack. \n\nGraphics = Great\nStory line = Absurdly Exaggerated but Great\nHumor = Pushing the limits of PG13\nDifficulty = Challenging at first but Balanced late game.\nBugs = I could not find any. I did have difficulty launching the game after an update, but they have since resolved that issue.\n\nTips:\nStarting off, holding your breath to acquire materials is tedious, but as you upgrade your oxygen tank and learn where the refill areas are it becomes significantly easier to manage.  The first air tank upgrade is directly down from the starting ship.  \n\nEven though most resources are finite, this game is not intended for hoarders.  There are ample supplies as you adventure and there is no real advantage to wasting time transferring resources between chapters.  Each chapter has more then enough resources to complete the chapter.  At most it is handy to have a box of food and water on your ship, and perhaps a second box to dump your back pack from time to time.  Do not be afraid to use candles or other resources to advance as there are tones to replace what you use.  \n\nCollectible can also take up space.  In order to get credit for finding something it only has to enter your backpack.  After that you can discard the item and view it later via the menu.  In Fact, it is a good habit to take every unique item and then discard it if you are not going to use it to decorate your ship or station.  Poster, notes, and pictures can be reattached to walls, and the trophy case displaces all the toys and underwear you find.  Be careful stacking things as they tend to wiggle a bit due to the physics engine.   \n\nIn Chapter 3 the best place I found to create a base is directly behind the electrical core.  It is fairly central to most other locations and there are more then a number of advantages to placing your base there.  It is also useful to make a flat base.  A layered base might look neat but it can sometimes be annoying to navigate from the inside.  Glass can be found near the hydroponic area (Cow area) and electronics can be salvaged by capturing the scavenger bots (near the large rolls of tape).\n\nRegardless of your play style there are hours of campy fun to be had, the suit AI is hilarious, and there is so much to find that you would have to be a pro-scavenger to find it all without help.  I have no problem recommending this game to my friends.  I hope you enjoy.", "timestamp_created": 1662789737, "timestamp_updated": 1662789737, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.67663806676864624", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "74108151": {"recommendationid": "74108151", "author": {"steamid": "76561197985096849", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 1966, "playtime_last_two_weeks": 0, "playtime_at_review": 266, "last_played": 1619142536}, "language": "english", "review": "So I have dumped many hours into Subnautica. I've only played this game for about 5 now and it's already reminded me of the \"discovery\" and unknown feels I got during Subnautica... although with a healthy dose of humor and sarcasm that's quite enjoyable. I'm also getting very strong feelings akin to the latest Prey game. Granted, there's not the acute danger elements like in Prey, but the feeling of being out and space, exploring, drifting, not knowing if there's active danger ahead, floating through auras and slip-stream like particles. I can't put my thumb on it, but both Prey and Subnautica truly made me experience an immersion I haven't found in other games up to this point. All that to say, any game that can reignite or spark those is a win in my book.", "timestamp_created": 1597104008, "timestamp_updated": 1597104008, "voted_up": true, "votes_up": 17, "votes_funny": 1, "weighted_vote_score": "0.676123142242431641", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "131047419": {"recommendationid": "131047419", "author": {"steamid": "76561198077270879", "num_games_owned": 759, "num_reviews": 161, "playtime_forever": 1188, "playtime_last_two_weeks": 0, "playtime_at_review": 1188, "last_played": 1673982910}, "language": "english", "review": "its great, buy it,  there is a really sh*tload of jokes, but good ones\nsimilar to subnautica or space engineers(kinda) or prey(without scary stuff)\n\ni have experienced no crashes nor bugs\n\ni really dont see the hate for this game\nfor me it was hidden gem", "timestamp_created": 1673983766, "timestamp_updated": 1673992627, "voted_up": true, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.675826847553253174", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "125426576": {"recommendationid": "125426576", "author": {"steamid": "76561198048996374", "num_games_owned": 773, "num_reviews": 28, "playtime_forever": 461, "playtime_last_two_weeks": 0, "playtime_at_review": 461, "last_played": 1668364373}, "language": "english", "review": "At first I found that it was not playable for me because of my Intel 11th Gen CPU. No, this is not the fault of Intel or Windows, it is the fault of the developers. The developers have known about the problem for several years and have done nothing. But okay, there is a \"temporary\" hotfix to work around this bug. This made it possible for me to start the game.\n\nBut now I can't play the game at all, because every few minutes the game crashes with a LowLevelFatalError. There is no way to fix this error or continue playing the game. All the things I tried did not lead to any success. \n\nThe developer is no longer active. I can only warn against buying the game.", "timestamp_created": 1668365401, "timestamp_updated": 1668365401, "voted_up": false, "votes_up": 17, "votes_funny": 3, "weighted_vote_score": "0.675166070461273193", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": "", "timestamp_dev_responded": 1672072015, "developer_response": "Hi there!\n\nWe’re now looking into the crashing issue, and it’d be a great help if you could send your DxDiag file to info@breathedge.com.\n\nHow to get it:\n\n1) Press the Win + R keys to bring up the Run command\n2) In the \"Run\" command box, type in \"dxdiag\" (without quotes)\n3) Press Enter\n4) Once the DirectX Diagnostic Tool appears, click on the Save All Information button at the bottom\n5) Save the file\n\nThanks in advance!"}, "87462288": {"recommendationid": "87462288", "author": {"steamid": "76561198104330300", "num_games_owned": 415, "num_reviews": 123, "playtime_forever": 1006, "playtime_last_two_weeks": 0, "playtime_at_review": 227, "last_played": 1614589297}, "language": "english", "review": "[Original review at 3 hours, edited at 13 hours, I have now finished the story]\n\nBreathedge has not been fun to play.\n\n\nI wrote those words at the beginning, and I stand by them now. I bought BE purely to see who in the review sections are right: those saying it's a hilarious subnautica sidegrade, those who claim it's rough at the start but really opens up after the 12 hour mark, and those who say it's an unfunny waste of time and money.\nMy first impressions were that BE was bad, but it might pick up at hour 12.\nAt hour 12 I knew the game did not pick up.\nNow that I have finished the story, I am not happy.\n\n\nBE's first 20 of gameplay are bad. really bad. \"I'm glad 20 minutes qualifies for Steam Returns\" bad.\nThe comedy, in the first \"chapter\" at least, is... non-applicable? I say this because the comedy fails in three ways at once.\n1. The content of the humor is little more than pop-culture references or poop jokes. If you find the Big Bang Theory funny, you'll enjoy this.\n2. All jokes are delivered, or reinforced, by the Suit AI voicelines. There is no passive comedy, every single joke is something a single voice says to you in remark to something you see\n3. Every. single. object. has a joke. opening the door is a joke. collecting water is a joke. getting to a new debris chunk is a joke. There is no downtime whatsoever, which ensures that the very few jokes that could be funny, are smothered immediately.\n\nWhen you progress to chapter 2/3 there is a dramatic dropoff in the amount of jokes thrown at you, to the point where I was beginning to think they threw out the \"comedy\" aspect when they were developing it. But there are still a few jokes, and they're just as bland as the rest. This chapter has the most interesting game mechanics, but is summed by \"fly here to see a problem, fly somewhere else to find the solution, fly back and fix it\". With resource gathering thrown in for \"spice\".\n\nBut then you do it! you get to the thing and and you're rewarded with:::::: A Map.\nand four more locations you're going to have to go through.\nThe first stop on that map is a truly uncomfortable experience dealing with a fully voice-acted horny female AI moaning and gasping in your ear for 20 minutes straight.\n\nFrom there, the last 5 hours of BE are a linear space adventure game. No open world, no resource management, no base building, no comedy. It ends on a 5 minute cutscene filled with explosions and fisticuffs and huge space battles. What in the fucking hell?\n\nMy first thought about BE was \"This game needs and editor\". Someone needed to tell the devs \"No\". This game is every thought the devs had during early access put directly into the game. every flat joke, every outdated reference, every obtuse game mechanic, every goddam genre! I have never seen a game that was so obviously Early Access and so obviously had devs who got bored and wanted to make a different game halfway through.\n\nThis game is bloated, underdeveloped, and lacks ANY form of cohesion. The references and comparisons to Subnautica are insulting.\nDo NOT buy this game.", "timestamp_created": 1614324536, "timestamp_updated": 1614589873, "voted_up": false, "votes_up": 78, "votes_funny": 1, "weighted_vote_score": "0.674957394599914551", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "87460866": {"recommendationid": "87460866", "author": {"steamid": "76561198023602037", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 751, "playtime_last_two_weeks": 0, "playtime_at_review": 545, "last_played": 1614399166}, "language": "english", "review": "I came into this game reading reviews comparing it to subnautica in space. I loved subnautica, however the only similarities these two share are exploration, scanning, and crafting.\n\nThe gameplay loop is scan for more equipment/blueprints, upgrade, push forward. The space-map is riddled with wrecked ship parts and dead bodies. The environment changes very little so there are no cool biomes, no interesting asteroid-caves, and there isn't even any actual ships you can explore. \n\nI burnt out after 9 hours of scanning objects and spending 10 minutes going back and forth. I understand space is empty, dead, and vast. I expected more action from the trailer, I got none of that.", "timestamp_created": 1614322200, "timestamp_updated": 1614322200, "voted_up": false, "votes_up": 48, "votes_funny": 0, "weighted_vote_score": "0.67483818531036377", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "47673901": {"recommendationid": "47673901", "author": {"steamid": "76561198004468758", "num_games_owned": 0, "num_reviews": 280, "playtime_forever": 192, "playtime_last_two_weeks": 0, "playtime_at_review": 180, "last_played": 1591684138}, "language": "english", "review": "The jokes are pretty dumb, yet somehow manage to be funny from time to time. The devs know how to take a serious situation and make fun of it without pushing it too far (usually). The game isn't really all that long, which bothers me, but it also somehow manages to make me eager to see the full release. If you're into crafting survival games, you could do a lot worse than this. That said you could also do a lot better. Hopefully the full release adds more to the concept than what we've seen here, but even if it doesn't I suppose that more of the same wouldn't be the worst thing that could happen.", "timestamp_created": 1545389022, "timestamp_updated": 1545389022, "voted_up": true, "votes_up": 20, "votes_funny": 2, "weighted_vote_score": "0.67478257417678833", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}}, "query_summary": {"num_reviews": 30, "review_score": 6, "review_score_desc": "Mostly Positive", "total_positive": 3896, "total_negative": 1447, "total_reviews": 5343}, "cursors": {"AoIIPwD6J3zNntcE": "Mon Apr 22 23:47:32 2024"}}
