{"reviews": {"157756493": {"recommendationid": "157756493", "author": {"steamid": "76561199071173350", "num_games_owned": 98, "num_reviews": 3, "playtime_forever": 1098, "playtime_last_two_weeks": 0, "playtime_at_review": 1098, "last_played": 1680225418}, "language": "english", "review": "When this game first came out, it was pretty fun.  There wasn't much to do at all in it.  Just fly around, gather crap, build.  Do a few bosses that were all soloable.  They tried to add a quest line and daily repeatable quest that turned into mostly a grind.  You didn't get much from the daily quests.  \n\nWe started on xbox with this game and moved to PC.  Wife tried to play official servers which are laden with abuse and people who column the whole map claiming buildings and essentially blocking whole sections of the server off.  I would avoid official PVE servers at all cost if you buy this. \n\n$40 dollars is too much.  This game is no longer in development by this group and it doesn't have enough to really keep you engaged more than a month.  They never opened it up for modding either.  They released one DLC which was pretty much a new empty map with the SAME bosses as the original map.  Like cut'n'paste and increase HPs.  I died a little inside when they did this. \n\nNow they are just cash grabbing.  I'm surprised its still as much money as it is.  Please for the love of all that is holy avoid this game.  You will get no support, no updates, no content, and when you go to the discord to get help, mostly shrugged at with the attitude of \"Welp we got your money sucker\".", "timestamp_created": 1707279833, "timestamp_updated": 1707279833, "voted_up": false, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.669722139835357666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "157792063": {"recommendationid": "157792063", "author": {"steamid": "76561199146561994", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 12156, "playtime_last_two_weeks": 0, "playtime_at_review": 12156, "last_played": 1707189102}, "language": "english", "review": "DO NOT BUY THIS GAME\nThis game had great potential.   But the dev team has squandered any hope of revival.  It has been abandoned  They will dangle carrots of future QoL updates.... but let me assure you.... i have first hand knowledge...no such plans or roadmap exists.   The Official maps are overrun by single players that go unchecked.  Pillaring is allowed making many maps unplayable to anyone new.    If you are unfortunate enough to mistakenly pay for a private server...you might have more control over trolls but dont expect any dev support if there isba real issue.  My last support ticket was pending for over a year before it was even acknowledged.   This game only limps on as a cash grab so they can reallocate the money into Slender or directly into their pockets.   Dont feed the monster!   Let Blue Isles slowly choke to death on soap box of being a \"small team\" (as if no other dev team runs lean and mean and is able to support the games the create).  They wont even open it up to modders.  There are much better games put there for this price point.    They give a bad reputation to good hard working dev teams everywhere.", "timestamp_created": 1707325326, "timestamp_updated": 1707325326, "voted_up": false, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.641056180000305176", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "157365161": {"recommendationid": "157365161", "author": {"steamid": "76561198067387154", "num_games_owned": 478, "num_reviews": 26, "playtime_forever": 1866, "playtime_last_two_weeks": 0, "playtime_at_review": 1866, "last_played": 1590446806}, "language": "english", "review": "Wait...... They still want 40 bucks for this game?  Like the rest of these types of games. There was a ton of potential blah blah... Steam needs a section in my game library called.... Abandoned By Developers...", "timestamp_created": 1706826376, "timestamp_updated": 1706826376, "voted_up": false, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.626333832740783691", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158386430": {"recommendationid": "158386430", "author": {"steamid": "76561198008021032", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 5610, "playtime_last_two_weeks": 0, "playtime_at_review": 5610, "last_played": 1623555056}, "language": "english", "review": "Fun game. Cool concept. Like the art style.\n\nUndercut by the decay system allowing randoms to lay claim to the things you spent hours working on. Never saw another person in the server but magically my base is claimed because I went on vacation. Not bringing a laptop on vacation to keep my base. Seems to have been abandoned and has 16 players in a week. Not worth 39.99", "timestamp_created": 1708015854, "timestamp_updated": 1708015854, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.587972104549407959", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "157594321": {"recommendationid": "157594321", "author": {"steamid": "76561197975080875", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 244204, "playtime_last_two_weeks": 4, "playtime_at_review": 240898, "last_played": 1713678960}, "language": "english", "review": "For a long long time, I honestly thought this was the best game ever, build massive bases and destroy them, or play pve and create cities. cool music, decent graphics and a thriving community. Then it died. Half arsed efforts at upgrades, Long term bugs not addressed and what can only be described as a complete joke of an 'add on' (turn everything purple and bump up the hit points of the existing bosses, (sure we wont notice) The game has died a slow painful death, and has long been abandoned for a new effort of a game, which has also died..... WTG Blue isle. The fact you still have the gall to ask for $40 us or $56 Australian is a total joke, and to be fair should be reported to steam as a blatant rip off. Despite what your community manager says about you still working on it Its long been abandoned and is a real shame as it could have been a great with the right support. I've tried it again recently and am bombarded with constant UE4 errors and crashes. Such a shame. Oh well what could have been eh. I'd love to give it a thumbs down, but in fairness back in the day I along with a lot of others had a ball, so you get the thumbs up. If you are considering buying this, it is long dead and dont part with your hard earned cash, unless its massively on sale. However if you do, enjoy playing with the 7 or so players who still grin and bear it.", "timestamp_created": 1707069427, "timestamp_updated": 1707069427, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.549248754978179932", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161194406": {"recommendationid": "161194406", "author": {"steamid": "76561198448657193", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 3790, "playtime_last_two_weeks": 0, "playtime_at_review": 3790, "last_played": 1685404614}, "language": "english", "review": "Its the studios most expensive game but its abandon, make it make sense. i love the game but its suck if you buy, buy at 10$", "timestamp_created": 1711143270, "timestamp_updated": 1711143270, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.514563083648681641", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161959797": {"recommendationid": "161959797", "author": {"steamid": "76561199655848331", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 54, "playtime_last_two_weeks": 0, "playtime_at_review": 54, "last_played": 1711253222}, "language": "english", "review": "One of the BEST games I have EVER played. However, the devs gave up on it very early on which in my opinon was an awful decision. This game would easily be up there with ARK, Rust, Dayz and all the top Survival games if they had allowed modding or just not given up! The gameplay mechanics are absolutely amazing and the mounts and pets are really well done. You get to ride a freakin dragon, but first you have to take it and it feels much more exciting to tame than in Ark. Again, these devs could be millionaries by now if they had not given up. This game updated would be a 10/10. For years Rust has been my #1 game, but I have always wanted this game to top it AND it will if they would put their damn time back into it.", "timestamp_created": 1711987102, "timestamp_updated": 1711987102, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.511533200740814209", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "35521686": {"recommendationid": "35521686", "author": {"steamid": "76561197991425651", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 124237, "playtime_last_two_weeks": 0, "playtime_at_review": 46978, "last_played": 1570824519}, "language": "english", "review": "This game had HUGE amounts of promise and was extremely fun in the beggining.  So much fun that I actualy made 3 level 60 characters and keeps for all three of them.  Its EA and there are bugs.  The blue isle team was diligently working on them for a while and then things turned sour.\n\nThere are roughly 3 reasons people want to play this game.  \n\n1- The building of bases and fortresses.\n2-  The flying\n3-  The pets and dragons you can tame and ride.\n\nReasons 1 and 2 were completely amazing untill one of their Dev team whom I will call Eggbert, decided to completely change the dynamics of gameplay to totaly ruin the fun that they had once generated for every one.  Apparently Eggbert thought that flying slower than walking speed would be fun for every one, but before that the speed was exileratingly fast.  Good job Eggbert, you have singlehandedly ruined Flying.\n\nThe building system was realy cool & people were creating beautiful castles and keeps that were  mind blowing.  But the problem is all this building generated lag and server crashes on every server.  They tried to find and eradicate the inferiour coding causing this but apparently that was too hard, Eggbert decided to just make all the high end building require an insane amount of regular matterials and now require vast amounts of time to gather copious quantities of special matterials and fight for these same special materials to harvest them before others on your server do, and apparently you have to wait for the server to crash before they respawn.  Thats not such a problem as the servers crash mutliple times each day and they still have no idea how to fix it.  All this is done just to slow down the building to a snails crawl speed.  It literaly takes forever to build 1 wall section now.  And you are building the same wall section you had built before with no additional upgrades for the HUGE jump in resources and time now required.  Good job Eggbert, you ruined the fun in building.\n\nRiding a dragon is super cool.  And it still is super cool as i write this.  The process of making a dragon or pet is called taming.  Having tames has always and still has tons of negative bugs.  From having them just disapear to crashing your game and loosing hours of harvested matterials they were carying, the guantlet is huge on the bugs they have been riddled with. From day one the dev team has been trying to fix these bugs, and they have come a long ways.  But it would appear the bugs are now morphing into more powerful bugs causing more fatal errors.   But still, even after all the frustrating bugs with mounts, flying a Black dragon is an experience that I loved.\n\n(Edited on 10-11-2017:  Riding dragons has been ninja nerfred.  They no longer travel at wonderous speeds.  They removed the sprint ability and have been effictively slowed wayyyyy down.   Its is painfully slow to ride the Black dragons and Infernals now.   Way to ruin the marvel of what once had been known only as dragon flight Eggbert !!!) \n\nThe crafting system in the game was pretty cool.  They have been chipping away to improve it since release.  But there is a downside.  When crafting is completed for each item, it is placed in a disposable bag.  This bag WILL always disapear after a server is reset or crashes and reboots.  Server instability is horrible.  I repeat HORRIBLE.  If people are playing on the same server, IT WILL CRASH and CitadelUSEast41 crashes mutliple times a day.  If you are crafting and server crashes.  You will lose EVERYTHING.  I have lost countless high end materials in the 600 plus hours i have played.  It is so dang exasperating to have to try and hunt down days of resources to just lose them all in an instant AGAIN, and AGAIN.\n\n((Edited on 10-26-2017)  they have solved the disposable crafting problem.  You no longer lose all your matterials & crafted item you had spent hours to find when the server reboots/crashes.  Eggbert, you did something wonderful.  Attaboy !!!)\n\nThen when you try and bring up these issues on the forums the moderators give you some pat propaganda answers.  Thats ok, i know they are only lowly moderators and have no power to actualy fix things.  I am ok with that.  But when more and more people voice concerns and offer helpful ideas, the moderators get confused.  They start to ban people who are saying things they dont want to hear.  And remove all posts these people have made.  WOW. Talk about censureship.  How about you just fix the bugs, stop ruining what could have been an amazing game and heavy handing your customers Blue Isle?  \n\nI can not recomend this game or ANYTHING made by Blue Isle.  There flim flam tactics are not something i can put up with or stomach.  And to be honest, i realy hate the game play Eggbert is driving this game to.  Eggbert realy should be kept away from touching anything Blue Isle is trying to code.   Who knows, he may be an amazing window cleaner......\n\nI am done with it.  I hope you find this information helpful so you can spend your time doing something more productive and experiencing something more pleasant than to waste your time on Citadel:Forged with fire.\n\nIf some one were to ask me what to name Citadel: Forged with fire.  My response would be:\n\nIt feels like this game should be called \"Pedestrian Mage: Flying Air slugs\" as a dead on discriptive name for this game.", "timestamp_created": 1507305210, "timestamp_updated": 1509030999, "voted_up": false, "votes_up": 458, "votes_funny": 43, "weighted_vote_score": "0.917402327060699463", "comment_count": 34, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1584886479, "developer_response": "This review is pretty old and out dated. Flying still feels fast and the game has very few bugs at this stage. This player may have fundamental issues with game design decisions that were made, but over the course of EA we did our best to listen to player feedback while creating a fun and fair experience for everyone."}, "36440076": {"recommendationid": "36440076", "author": {"steamid": "76561198027149047", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 10929, "playtime_last_two_weeks": 0, "playtime_at_review": 8879, "last_played": 1572790909}, "language": "english", "review": "It’s really sad to see how many negative reviews this game has… I don’t think it’s a fair assessment of the current situation. I've got already 100+ hours in the game and still a lot to do!\n\nI would say, don't be afraid of the mixed reviews - it seems that an early access launch was really rough, and therefore it influenced the current rating, but the dev team has done a great job of squashing the bugs that earned this game so many negative reviews early on.\n\nAnyway, I would like to lay out some pros and cons of this game, so at least you can have a better picture what to expect from this title.\n\n\n** PROS **\n\n1. The world is truly beautiful, shall I say - almost magical in feeling. It gives you a sense of immersion and the atmosphere is very chilling... Varied biomes - starting from swamps, moving over the forests, plains and ending in the high mountains. I love a very clear map/navigation system - it shows all the tags of visited places (quite similar to Skyrim approach).\n\n2. This is obviously totally open world survival game, so you can go anywhere and do whatever you want.\n\n3. You can tame most of the creatures in the game! You can make an ad-hoc army from wolves while adventuring if you fancy. For a long term companion use scrolls which are extending the loyalty of the creature. You can tame horses, tree-men, dragons, demons, and what not :) Taming is much easier and not as time consuming like in other similar games.\n\n4. Flying! Yes, you can fly in this game not just on a mount but also on a broomstick or just simply with a flying potion. Obviously you can still go back to more “traditional” way of flying - on a back of your very own dragon!\n\n5. Build your house wherever you want. You can build a majestic wizard tower in hard to reach places, or maybe you fancy a more impressive castle - your imagination is your limit. The building system is really good! I would even risk and say, that it is one of the best in comparison to other similar games. The pieces you are building with, they fit together very well, and let you build really complicated shapes as well (e.g. curved walls, etc.). Variety of materials and different furniture packs additionally spicing things up.\n\n6. I really like crafting system, which has a bit of RNG in it, but it gives you a sense of polishing your perfect armor or weapon. RNG is not bad, because if let's say armor pieces have the statistics you don't want, you can put them into deconstructor and regain most of the valuable resources and re-craft! \n\n7. Magic! This is after all a WIZARD GAME! There are 4 different types of weapons which dictate what kind of spell you can slot: Wands, Staves, Gauntlets and Melee. I really like this approach, with some reservations though, about which I will mention in CONS section. You can swap two weapons in-battle so that gives you 4 different spells you can use during the fight. In terms of abilities themselves, some of them are projectiles, some semi aoe, instant dots, channeled beams - the variety is really outstanding. You can easily choose the specific skill to match your preferred type of strategy.\n\n8. Knowledge system - I also like how you improve your abilities. There are 60 levels in the game (so far). Every level you get knowledge points, which in turn they can be invested in different \"trees\". You can’t max everything out so you need to work with others, or reset your skills from time to time with a potion.\n\n9. Developers are active in the Steam community - they inform what is in the pipeline, reply on any reported bugs - they just listen to the community. Thumbs up.\n\n\n** MIXED **\n\n1. No proper end game yet, however there’s a lot of caves and mini dungeons scattered around the world, so the sense of the adventure is there, nevertheless what is missing, is a reward that would excite you. I know though that very recently devs announced a content drop that will give us new dungeons with a proper challenge vs reward - looking forward to it!\n\n2. AI of the creatures… It’s rather bad, you can see that they are trying to avoid your projectiles, they are strafing, but at the same time sometimes they can just stuck and becoming sitting ducks.\n\n3. Sound -  while music is really great in the game (however we need more tracks), the sound is not great. For instance, I hate very abrupt and non-climatic explosion of fireball (kind of a shot gun sound). Also some of the sounds are too loud or are being triggered at the wrong time. There’s a lot of improvement needed in this area.\n\n4. Optimisation - while not bad anymore, it still needs more work. Especially for bigger buildings / constructions the game can be really sluggish, even on a good PC spec.\n\n\n** CONS **\n\n1. Learning new spells - I like how currently spells are divided between different types of weapons (with a couple branches independent of the weapon). However, how you acquire them is very… shallow for a \"wizard sim\" type of game. For me this is the biggest complain.\n\nI would love to see the system where you need to study spells (mini games maybe?), during the study let's say you discovered that there is a way to increase effectiveness of fireball but you need to get a really rare ingredient, or control a specific place of power in the word, etc. As a magic user, a player should feel a sense of progression in his or her arcane study. There are no magic experiments - they could add a bit of flavour to the game - e.g. the more dangerous the experiment is, when failed, would give a player some debuffs for a while, but if done right, would give nice bonuses to study new spells, etc. Obviously spell crafting from Oblivion would be my dream come true :) (but no overpowered combinations, please).\n\n2. PvP needs some kind of ''in-world struggle system'' - maybe capturing the resources or places of power? At the moment the only incentive of PvP is raiding the bases and stealing resources - not very innovative.\n\n3. Still long loading times when you first log into the game.\n\n4. No support for economy between players. Maybe addition of marketplace mechanic, where players could visit a town market to buy missing resources from other players’.\n\n5. Animation system - recently much improved, there’s still a lot of room for improvement - e.g. swimming animation which looks a bit silly at the moment.\n\n6. No story driven content. I personally don’t want traditional quests in the game though… What would be great to have, is some kind of procedural generated events that are happening in the world. What would be even better, if these events would influence the world somehow...\n\n7. Game definitely needs more players, hopefully content-drops at some point will lure some population back.\n\n8. Minor bugs\n\n\n** CONCLUSION **\n\nReally great game! I have easily already got my money's worth for the price tag. Very immersive game, very believable world, amazing building system, sense of progression (but not fully there yet) and when fully fledged dungeons will be added with an upcoming content drop - it will be a really nicely done game. \n\nOn the other hand, if you expect more story driven content - this is not a game for you. You need to organise yourself and decide what to do in this vast and diverse world.", "timestamp_created": 1510398208, "timestamp_updated": 1512379636, "voted_up": true, "votes_up": 273, "votes_funny": 9, "weighted_vote_score": "0.907000482082366943", "comment_count": 9, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "33938853": {"recommendationid": "33938853", "author": {"steamid": "76561197985274600", "num_games_owned": 439, "num_reviews": 10, "playtime_forever": 1313, "playtime_last_two_weeks": 0, "playtime_at_review": 1257, "last_played": 1560572281}, "language": "english", "review": "Lets be clear, I HATE that I bought another Early Access Survival game. \n\n-BUT-\n\nAfter a decent bit of time with the game, I can go over a few things for potential buyers.\n\nSome of the other reviewers have gone over this but I think I should emphasize a few things.\n\nWe all know how hesitant people are with Survival early access games. I have been at the forefront of successful survival games like minecraft alpha & Rust Alpha. But I too have been burned by games like Conan Exiles, Dark and Light, and Starforge.\n\nIn my experience thus far, I have already felt some of the feelings I had in those successful survival games. The framework we have here is beyond amazing. There are a lot of things to add and finish, but this game is leagues above what I experienced with Dark and Light. (Specifically server structure and management)\n\nI can safetly say while playing in the last few days, its been patched about 3 times and devs are on top of the community. There are nerfs where needed, buffs where needed, and gameplay improvements all in a few days instantly. The same thing Notch did with his game and same as Garry from Rust. I have amazingly high hopes for them.  \n\nAs for the genre of the game? I'd accurately describe it as a Micro-MMO Base Building Survival. The building system is fantastic, the mmo aspect needs to be fleshed out, and the servers need stabilization. Other than that, $20 was already justified for me.\n\nThanks for reading.", "timestamp_created": 1501546804, "timestamp_updated": 1501728882, "voted_up": true, "votes_up": 282, "votes_funny": 18, "weighted_vote_score": "0.879410445690155029", "comment_count": 10, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "56192481": {"recommendationid": "56192481", "author": {"steamid": "76561197962368812", "num_games_owned": 697, "num_reviews": 57, "playtime_forever": 762, "playtime_last_two_weeks": 0, "playtime_at_review": 762, "last_played": 1572115117}, "language": "english", "review": "Definitely not worth it for solo/single player.\n\nThe spell variety is pretty limited, there's ~25 direct damage spells in total and about half of them are very minor variations on a theme. \n\nFor example, you have:\nArcane Beam - a continuous damage beam\nFire Beam - a continuous damage beam with a minor burn DoT effect. \nIce Beam - a continuous damage beam with a minor slowing effect\nLight Beam - a continuous healing beam \nNature Beam - a stronger continuous healing beam with a very short range\nDark Beam - a continuous damage beam that costs HP instead of mana\nStorm Beam - a continuous damage beam with minor chaining damage.\n\nThat's 1/4 of your combat spells.\n\nThere's little in the way of debuffing or synergising between spells, so most combat against the AI boils down to picking your most mana efficient spell/weapon combo and running backwards/in-circles whilst hitting them with the same spell over and over, hoping their HP runs out before your mana does. Even on basic mobs you'll want to focus on mana efficiency because basic mana regeneration is achingly slow and crafting mana potions is just more grind, so if you want to engage in back-to-back fights without waiting you'll want to ration it out carefully.\n\nEnemies are... Average. There's a decent number of -technically- different varieties, although they're mostly pretty one-note, you have the flying ones, the melee ones, the ranged ones, the big slow melee ones and when you really push into the end-game you have the teleporting melee ones, the flying ranged ones, and the melee ones that also sometimes fire a ranged spell. Hit boxes and AI pathing are both clunky as hell too, and almost none of them can deal with a player flying directly above them, the only downside of which is the heavy mana-cost of doing both at once.\n\nThe grind as a single player is ungodly, so much so that even after cranking the rate of everything to 500% in server options, I still ended up using console commands to largely skip the mid-game when it became obvious that the progression through the tech tree was simply \"More of the same, but bigger numbers\"\n\nThe building looks pretty enough, but is largely useless to a solo player short of having somewhere to place crafting stations and store your junk. It's also pretty expensive, so of course the default is an ugly cramped box rammed full of crafting stations and a respawn circle.\n\nThe 3 end-game dungeons were also not well balanced for solo play either. You will need an immense stock of mana/health potions if you want any hope of depleting the massive health pools in the allotted time before the dungeon kicks you out, and even then expect a boring too-long fight running in circles slugging it out with the final boss at the end.\n\nExploring was underwhelming, there are a good few \"biome\" styles around the map, but everything felt a bit lifeless. And the NPCs constantly scattered in random little empty stone huts, asking you to \"kill/tame/harvest X of Y for an XP/item reward\" being pretty much the only interactive NPCs on the map outside of the tutorial is pretty lackluster.", "timestamp_created": 1572638902, "timestamp_updated": 1572638902, "voted_up": false, "votes_up": 346, "votes_funny": 20, "weighted_vote_score": "0.862795591354370117", "comment_count": 24, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1584886622, "developer_response": "Just so you know, the Godking's Vengeance just came out which improves the single player experience with a campaign."}, "43918034": {"recommendationid": "43918034", "author": {"steamid": "76561198020950285", "num_games_owned": 69, "num_reviews": 17, "playtime_forever": 263727, "playtime_last_two_weeks": 0, "playtime_at_review": 106763, "last_played": 1660144684}, "language": "english", "review": "Ok, so at the 4k mark I guess I can make a constructive thing again, two parts, first what we have and second, what we could have.\n\nSo here's the short and sweet on why I don't recommend the game: how they advertise vs actual product that's the issue. With that out of the way here goes what we have:\n\nA grind fest, with infinite resources. Sounds a bit contradictory doesn't it? Well if you're the most powerful clan on a server you will have infinite resources as long as you bother picking it up, that's upsetting the balance quite a bit in general since unless you have the 24h-no life attitude you will not in anyway manage to compete or even just survive. They will have the gear, the resources and all the tasty goodies to smack you at any time and you can suck it up, or quit. Which mean people quit. The best way to fix this would obviously be to make the world bigger so people could migrate away and come back, instead of migrating to new games.\nThis might sound like I'm salty that it happened to me, but no, I'm in the other end doing it to people so I see what it's doing to the game.\n\nAny base you build can be melted into nothing within 20 min if you're not there to defend.  Spent a week honey combing the shit out of it? Pointless. Hundreds of reformation stones? Wasted, they won't keep up. Shields and turrets? The shields will block your turrets firing, you turrets will stop shooting for minutes on end for no reason giving raiders ample time to breach.\nHaving sieged hundreds of bases there are no up and coming players that can in any way keep up. And you can't hide, we know every single bump, hole and canyon on the map. We know where you are, or we will find you within tops 45 min.\n\nTaming is pointless, if you're on a PvP server your pet will be dead before you can even open the menu to attempt to save it. No joke, with 10-13k crits and 1.3 sec cooldown with a good cycle you can kill a lv 100 Infernal Dragon with the best buffs and gear in 3.7 sec. To make matters worse, their combat AI is so bad it's a pain to watch. The black/northern dragons can't fight at all in the air.\n\nSo what about the PvP? Boring as ass. Might be fun for some people but when it all come down to \"I crit first and can pump the most potions\" then it's 100% boring. If you want to win a PvP fight you have to go for dmg spec or your damage will be outhealed by the other chugging potions, and then we come back to \"who crit first\". I do my best to always avoid PvP because of how predicable it is, there's at no point you run into someone who has a different take on how to PvP, there are dmg specers with the identical high end armour and then there are dead people. Tic-tac-toe have more tactical depth.\n\nSo let's do quests then, let's have an adventure in this world... Hahaha... Good one. To be honest, despite having done the questline several times (yes, I hate myself and all my freetime) I have no clue what it's about. Strange too since I've read every single book in Skyrim, and even know a lot of them by heart, so why not here? Is it a boring story?\n\nEh... Honestly I have no clue. Really. I don't know a single thing about the story here. Because while the quest giver prepares to roll out his parchment, clear his throat, correct his sleeves, find a good spot on his chair, smooth the table cloth, light the candle, brush the hair out of his eyes, pat all over the robe to find his glasses, polish them, and delicately place them next to his feather pen, I've already picked up his to-do list and left the senile idiot to his fate. Or to be frank, the text crawl is so slow I get bored of reading every single word five times before the next one has appeared. There's NO way to speed this up!\n\nSo that's what we have. Of course since I'm still here I'm somewhat breaking expectations with how everything is run, but it's because I have more patience than the PvPers have destruction potions.\n\nSo for the second part, what could we have with very little work?\nHunts: Rare monster spawn randomly attempting to leave the map, giving special loot for special trophies, or as cool mounts.\n\nCustomizable pets: Feed X before it levels up to boost a specific stat.\nCombat pets: Give ->USEFUL<- armour, 600 is utterly pointless when your enemy has a DPS of 20k. \nSwarm pets: Return a controlled duplication of low tier creatures.\n\nDeep history: Add hidden/flavour texts out in the world around ruins and in caves. Bonus point if you make some of it in an ingame language that can be translated.\n\nCustomizable gear: Just make the top tier armours and effects costumizable already. Take armour 1 and armour X and get access to the effects and looks of other things and make the gear look the way you want it to look. Or just transfer the stats from one to the other.\n\nDebuff spells: (Curses) \nBeam: Flight removal. (Umbrus debuff).\nAoE Focus: (Large Sanctuary spellike dome) Poison Potion, The effect of a potion is draining what it's supposed to replenish.\nBlast: Crush armour, Damage Durability by 10-20% per hit.\nProjectile: Enfeeble, Damage debuff.\nSelf: Mana plague, if killed you inflict damage equal to 1/4 of your total mana to the attacker.\nUtility: Forced dominion, place a beacon that temporarily prevents enemies from building, similar to a house control area.\n\nIf they add these things, I will consider changing the review to positive.", "timestamp_created": 1533338359, "timestamp_updated": 1616851381, "voted_up": false, "votes_up": 363, "votes_funny": 31, "weighted_vote_score": "0.846400082111358643", "comment_count": 28, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "34278807": {"recommendationid": "34278807", "author": {"steamid": "76561198067636094", "num_games_owned": 0, "num_reviews": 49, "playtime_forever": 6051, "playtime_last_two_weeks": 0, "playtime_at_review": 6038, "last_played": 1565409544}, "language": "english", "review": "Was a fantastic game I would have recommended to everyone. But it turns out they don't like people to raid or have fun in the game so they made that mechanic expensive to persuade from raiding everything. Otherwise known as large tribes will wipe the map and small tribes will have no hope of ever raiding. What a great mechanic that nobody thought about at all.\n\n\n*EDIT*11:57am 8/16/2017\n \nAfter posting this review on the patch page I was provided with this message\n\nBan notification from a Citadel: Forged With Fire developer\t— Just now\nYou have been banned from Citadel: Forged With Fire Discussions\nYou have been banned from Citadel: Forged With Fire Discussions by a Citadel: Forged With Fire developer for your post in \"Citadel: Forged With Fire General Discussions\":\n%text%\n\nBan Reason:\nSpamming\n\nPlease review the Discussions Rules and Guidelines.\n\nThis ban will expire on Sep 15 @ 11:56am. Until then, you will not be able to post in Citadel: Forged With Fire Discussions.\n\nYou are not allowed to post a message under patch notes or they will consider it spam worthy since it tells people the truth. Just gave me the final checkbox I needed to uninstall.\n\n*Edit* 11/3/2017 as expected the game is dead from all the steam reviews. Shame it never got to see the glory it could have become.", "timestamp_created": 1502898791, "timestamp_updated": 1509720484, "voted_up": false, "votes_up": 526, "votes_funny": 43, "weighted_vote_score": "0.8434295654296875", "comment_count": 41, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "55685116": {"recommendationid": "55685116", "author": {"steamid": "76561197969041727", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 9595, "playtime_last_two_weeks": 0, "playtime_at_review": 9595, "last_played": 1571566661}, "language": "english", "review": "Immerse yourself in a world of magic and adventure with multiple sets of spells and equipment at your disposal. You can build massive beautiful structures, tame great beasts, and craft amazing quality equipment. \n\nSounds great, right?\n\nOnly it's not. I spent days crafting, taming, and building my way through this game. All to realize that this has the laziest programming I have ever encountered in a sandbox MMO. Unlike most games, building doesn't prevent things from spawning. In my case, they often spawned under my floors or on top of my building and did massive structure damage despite having no aggro. The crafting system is 100% RNG based and there's no way to guarantee good outcomes. The NPCs do not aggro on anything except for players. To the extent that they will literally fly from out of render distance to you to attack you rather than attacking your pet. \n\nI give this game a solid 3 out of 10. Save your money if you're thinking about wasting it on this. I'm sure it'll end up on humble bundle eventually since nobody else in their right mind would pay for it.\n\n-edit-\nIn regards to the \"misinformation\" that the developer accuses me of spreading, perhaps you should fix your game rather than trying to slander people who review it. Several times creatures spawned on top of my tower and then began blowing it up to try to attack me in a complete different part of my castle. \n\nCreatures will NEVER attack your pet over you. I tested this time and time again. I could tell my pet to attack things and literally just stand there watching and the majority of enemies would go after me rather than my pets. \n\nThe magic find stat does not guarantee good outcomes from crafting. In fact, as far as I've been able to see it has literally no impact on crafting at all.\n\nPerhaps rather than trying to slander people that review your product, you should put more time and effort into making it function as you intend rather than saying that I'm spreading \"misinformation\" because of the experiences I had with your poorly put together game.", "timestamp_created": 1571567184, "timestamp_updated": 1573686122, "voted_up": false, "votes_up": 756, "votes_funny": 66, "weighted_vote_score": "0.82552492618560791", "comment_count": 8, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1572619337, "developer_response": "There's a lot of misinformation in this post. We absolutely check if you have a structure and prevent spawns. If this happened, the player may have encountered a bug. \n\nWe're subbing new patches very frequently so many bugs that contribute to negative reviews in early access are a part of the past.\n\nCreatures absolutely will attack your pet, but will often prefer the player. This is because the player often does more damage and is perceived with higher threat.\n\nRegarding crafting, there is a magic find stat the player can invest in which improves the quality of items you craft."}, "33823732": {"recommendationid": "33823732", "author": {"steamid": "76561198099107783", "num_games_owned": 238, "num_reviews": 13, "playtime_forever": 6206, "playtime_last_two_weeks": 0, "playtime_at_review": 5656, "last_played": 1657830293}, "language": "english", "review": "tldr; The game has it very obvious optimization issues but it's overall content in terms of gameplay, world building/discovery, character progression and etc. make it somewhat justifiable for the low price of 20$. This game is fun playing with your friends. Avoid playing in your own private servers for now as it turns out that hosting and running the client by using the \"Custom Game\" option is proven to DOUBLE the amount of resources the game uses on your pc SIGNIFICANTLY reducing FPS. \n\nIf you play on any official/rented servers, or simply anything that isn't your own personally hosted server, you should be fine.\n\n--------------------------------------------------\n\nEDIT #2: So turns out if you look in the discussions for this game you'll find a guide on how to set up a dedicated server. In my opinion so far this is the best method in terms of hosting if you can't afford/choose not to use a rented server. It's still pretty resource heavy but atleast the hosting isn't killing my fps anymore. Results may vary so take it as you will.\n\n\nEDIT: Some people seem to be under the impression that I'm misinforming people? I have clearly stated numerous times that optimization is a big issue and if you're concerned you should definately wait. But my review isn't a copy and paste of the countless boring ones complaining about the same optimization complaints over and over again. \n\n\nWITH THAT BEING SAID,   C L E A R L Y  (notice the capslock so you can make sure to not overlook the millions of times I have to repeat this) the optimization is  P O O R. I personally recommend WAITING if you're concerned about optimization. \n\nTo not expect there to be some form of unstability on the LAUNCH of an EARLY ACCESS SURVIVAL GAME is a bit ignorant don't you think?\n\n--------------------------------------------------\n\nThis is an EARLY ACCESS game, if it wasn't blatantly obvious it's going to have bugs then you clearly need to do some research on what that term even means. I'm not trying to justify the bugs or poor optimization in anyway. I don't condone that crap but for a game STILL IN DEVELOPMENT, I'll let this one pass considering it has actual content for once. \n\nSo far in terms of content, I could say this game has more than the hundreds of dead survival open world EA games that have been in development and never left beta for 3+ years. \n\nIs this the best game in the world? Hell no. Is it a good game? Sure. In the numerous hours I've played I've had tons of fun. Obviously my only complaints would be the optimization but that's an issue currently being worked on and will probably be fixed over time.\n\nSo what is it that I actually like about this game? The world is beautiful and vast. There are a variety of things you can do and different playstyles to suit your needs. It's clearly got that ARK: survival evolved formula in terms of the progression grinding but it had it's own spin on it with magic. The spells, weapons and armor you can craft feel more powerful the more you level up/craft better gear. The enemies always feel like they'll give you a challenge once you hit higher tier enemies (30+, 40+ 50+)\n\nIt feels awesome to take down a massine mountain giant with a group of friends even though you're overwhelmingly under leveled and one or two hits would prob destroy you. It feels awesome to build up a nice fortress and even go on clan/guild/faction wars with other players. \n\nHunting down that asshole player who killed you and stole your shit after grinding your ass off and getting yourself better skills/weapons/armor? Feels good man.\n\nIt feels good when you can tame ANY ENEMY in the game and even strap a saddle onto a FUCKING DRAGON and fly his ass where ever you want. The absolute adrenaline you feel trying to escape as you accidentally find yourself in the middle of a lvl 55+ dungeon when you're only lvl 25. Coming back to challange towering demons in an attempt to find awesome loot. \n\nThe sense of discovery is strong in this game. I spend plenty of time just wandering around, getting lost and discovering new enemy camps, caves and so on. Time and time again I found myself saying \"What the fuck is that?\" when an enemy i have never seen or fought before lunges an over powered attack at me. My fight or flight instincts battling each other while i hesitate only to get one shot and respawn several kilometers away. \n\nI've raged, I've screamed, I've laughed, and fist pumped in glorious accomplishment as I took down my first Pyrant. This is the kind of game that is amazing with friends but isn't that bad alone either. The content is there people. You just have to actually play the damn game to get there. Stop quitting on a game after 30 minutes and crying that it didn't hold your hand.\n\n--------------------------------------------------\n\nIn terms of reviews I don't do rating systems since I think they're stupid. However, I do think this game is worth 20$. It's a decent price for the kind of content it currently has. If you're so worried about the optimization then wait a while.\n\nFor once I'm confident this game won't turn out as bad as the numerous other trash survival EA games that plague steam. \n\nI don't usually write reviews for games, But it's sad to see people get deterred from something that's actually pretty decent for once.\n\n\nI hope this review has somehow helped you in some form and if you decide to actually get the game, I wish you a good experience.", "timestamp_created": 1501128270, "timestamp_updated": 1501315779, "voted_up": true, "votes_up": 169, "votes_funny": 8, "weighted_vote_score": "0.81605839729309082", "comment_count": 15, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "43926592": {"recommendationid": "43926592", "author": {"steamid": "76561198021008185", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 6032, "playtime_last_two_weeks": 0, "playtime_at_review": 3327, "last_played": 1664516165}, "language": "english", "review": "I was waiting to try out the new updated version of the game before posting my review. I've played the old and the new now. Soooo... here's my thoughts:\n\nI can't in the current state really recommend the game. It was a little grindy before with some interesting if a little bit meh combat. The one major boon to the game was being able to make fantastic structures.\n\nNow it's become a lot more grindy, the combat feels the same but with some minor added complications (which I'll get to), and the one major boon? The prices on construction have been multiplied which only adds to the grind. \n\nI do like the idea of going out and getting materials to get new spells on weapons. But there are only so many charges before you're needing you put that spell back onto you weapon. Which means you will need to remember the spell recipy. It isn't that big of a deal, but it's just one more extra pain to what is an already painful process. \n\nAnd this is ultimately why it is I can't recommend this game at this time. Games should not be a pain. They should be an enjoyable experience. Or in someways, as this was to many, an experience in virtual artestery expressionism. \n\nI do want to see this game take off and do well. It has a great deal of promise. It really does. This update though feels like a step backwards and sideways. \n\nThey did add a lot of new shiney spells an effect. However, those new shiney spells and effects take extra steps to attain. They added new building charicteristics. Buuuut they also, for reasons that escape me, made it more expensive to make things? \n\nFor every step forward they took a step backwards. \n\nTo the devs this is what I recommend doing:\n\n1. Make a quick patch to decrease the building costs in construction so it's at least set back to where it once was. I'm not that into building myself right at the moment (I knew the patch was coming and didn't want to jump into that knowing what I'd be making would be undone) but for those that are this is a MUST to keep them on in the player base. They have to remake their art, and at the moment with extra costs? That is like saying to you to remake your game not in Unreal but instead in Unity. \n\n2. Make it so after the charges on the spells are lost, the spells stay on minus the bonuses. This should make the happy medium for those looking to get that added boost and those who just want the spell. Although if you really want to go that extra mile this is what I would REALLY do instead. Make it so you can add the ingredients with a special pedistal, maybe multiply the cost, so you can add a perminate spell effect to a weapon. Making the spell fixed and unchangeable for that weapon as well. Some people might complain about balancing later on, but at this stage of the game I don't think balancing should even be in the top ten of concerns (pvp wise that is. Pve.... there's some concernes there. Major ones).\n\n3. Really think about at least adding one more spell slot per weapon. 2 per weapon is limiting. And when I think about a game that should have wizards flying around throwing castles with waves of their hands (which was what drew me to this game by the way) limiting should NOT be part of the vocabulary when describing the game or it's mechanics. Don't limit your players. Expand instead on what they can do. \n\nPersonally I think the idea of connecting spells to weapons at all limits the potential of the game.  Why put yourselves and your players into that box when you don't need to? Having to apply spells to weapons instead of having a hotkey to bring up the spell just adds unnescary painful steps. When I was playing this part of me was thinking I might as well be playing Skyrim with flying mods. \n\n4. Expand on your world. Make a story. Right now when a person enters in they are molded out from fire which is an epic enterance. And then.... they aren't given anything else other then that. Would be nice to see non-wizardy folk at work in magic guarded towns. That right there could give some reason right there alone. The reason why we were created? To fight the fight that the mortal nonwizardy folk can't. To collect food. To build defences. To help them expand against the forces of.... Bob the Destroyer or something. Even if it's just in dialog and there's a 'portal' or gate that the players can't go through that the 'people you are protecting and fighting for' are waiting in, that least is something.\n\n5. Remove item durability,  make it so players are able to deconstruct things from thier inventory, and/or make it so players can delete items that they have in thier inventory. All the broken and items and clutter from gathering materials before getting the draw essence spell is just ugly.\n\nI apologize if this has been long winded. If you've made it this far then props to you. And to the devs and other players or would be players I want to make this clear here before I go:\n\nI WANT to like this game. I see the potential here. Wizards with flying castles carving the land as they see fit. Some good, some bad, and other in the middle. Armies of undead made by some wizards fighting it out with sword wielding mage nights leading dragons or bears or whatever. I'd love to see wizards inthralling others to work for them via mind control or getting npcs to join their cause against that rascal Bob the Destroyer and his armies of zombie rabbits. \n\nThis... is not that game. \n\nNot yet. \n\nKeep an eye on it.", "timestamp_created": 1533383522, "timestamp_updated": 1533383522, "voted_up": false, "votes_up": 78, "votes_funny": 4, "weighted_vote_score": "0.812164664268493652", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1584887191, "developer_response": "Just wanted to mention that a number of these points have been addressed. Players can have up to 4 weapons for added spell variety, build prices are cheaper than the time of this review and the game contains a story campaign with side quests."}, "59530933": {"recommendationid": "59530933", "author": {"steamid": "76561198002129284", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 2882, "playtime_last_two_weeks": 0, "playtime_at_review": 2882, "last_played": 1574555560}, "language": "english", "review": "A+ if you are an exploit, use a combination of Blink and Pounce to get inside other people's base no matter how many layers of walls they have. \n\nBut if you care about keeping your stuff, don't bother building anything until bug fix. \n\nUntil then prepare for exploits to teleport directly into your base. Bug has existed for more than a year. If you warn others in gen chat, exploits and kow-towers will blame you for \"making the exploits more alert.\" \n\nSummary: It's like an abusive relationship. Fun at first; Then you get trashpanda-ed. \n", "timestamp_created": 1575851624, "timestamp_updated": 1575851624, "voted_up": false, "votes_up": 87, "votes_funny": 12, "weighted_vote_score": "0.809856951236724854", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1584887500, "developer_response": "FYI that exploit has been patched and can no longer be done."}, "55754463": {"recommendationid": "55754463", "author": {"steamid": "76561198086819487", "num_games_owned": 0, "num_reviews": 135, "playtime_forever": 2198, "playtime_last_two_weeks": 0, "playtime_at_review": 360, "last_played": 1572217299}, "language": "english", "review": "A very interesting open-world RPG.  The start of the game is VERY crafting-heavy.  Not much story yet.  Your job is to get to level 25 (about five hours) to unlock all the good weapons to begin.  But of course, you get to LVL25 by picking things off the ground (rocks, wood, gems, more wood) and killing boars (which fall to the ground at which point you'll need to pick them up too).  You then use all that crap to forge interesting items that keep you from dying.\n\nAt 25, you can start taking on legit enemies and enjoying the larger world outside of the three immediate spawn zones.  I highly recommend building your base somewhere near one of the fast travel portals as your direct-to-base portal comes much later.  Also, hold onto everything you can and max your carry items skill until you get to 140 lbs.  Then rush the box-o-stuff so you can store TONS of rocks and wood.\n\n[Must Have Magic Spells]\n- wand + base essence + beam = walk backwards while bear chases you constantly doing damage until it dies.\n- wand + light essence + utility = tame injured animals (mounts)\n- axe + nature essence + beam = allows you to farm resource nodes magically preventing axe damage (a HUGE benefit)\n\n[Fast Leveling Tips]\n- First, run to the red portal in your starting location and unlock it.\n- Next, run to the nearest tower avoiding every single creature and unlock the red portal there.\n- Remember this tower, as this is where you should build your first base (no building allowed at starting points).\n- Visit all three starting locations and collect the gems, rocks, and wood at each to RAPIDLY shoot up to 12; also, you can do the same tutorial quests three times at each location.\n- Head to acid and mana pools and axe the crap out of the glowing orbs you see there for the essence they hold.\n- Attach nature essence (from acid pools) to axe so you don't need to build/repair so often.\n\n[Build Tips]\n- Skip jewelry and armor\n- Rush wand to 3 and axe to 2 to unlock the first two craftable uniques\n- Unlock workbench and other base construction stuff\n- Avoid the pretty stuff like flags and furniture until you are established\n\nThe key to understand here is that a) this review occurred during early access, and b) the game gets MUCH better after you are no longer glorified bear food (LVL 25).\n\n[Things I'm Hoping to See in the Future]\n- more creativity in crafting; let me add resources during forge/workbench to make truly unique weapons\n- an explanation that lets me know if adding resources to a magic recipe will actually do something\n- a change to the \"level\" reading on enemies, as a \"lvl 8\" enemy will own your ass when you are level 17\n- a really, really, really obvious glowing beam of light indicating where your loot fell when you died (especially if you died while swimming away from a bear)\n- when I tame one of the flying falcons/hawks, don't leave him hanging up in the air where I can't interact with him\n- let me outrun a bear if I use magic speed (wand + standard essence + self)\n- less resource requirements for a farm, no sprinkler, and instead a 24hrX4 grow cycle\n- building a bridge or base should require wood support posts (pylons) on all floor panels, not just the first couple.\n- snap the support posts to a grid (right now, they are free-floating which is a pain)", "timestamp_created": 1571973352, "timestamp_updated": 1572047624, "voted_up": true, "votes_up": 124, "votes_funny": 10, "weighted_vote_score": "0.809777438640594482", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "86367726": {"recommendationid": "86367726", "author": {"steamid": "76561198017280837", "num_games_owned": 188, "num_reviews": 13, "playtime_forever": 4487, "playtime_last_two_weeks": 0, "playtime_at_review": 3126, "last_played": 1649894481}, "language": "english", "review": "How to ruin your mediocre pseudo-survival game in three easy steps AND guarantee a lack of refunds:\n\nStep 1: Spirit of Flight\nStep 2: Spirit of Frost\nStep 3: Spirit of Fire\n\nBONUS: Create a bare bones skeleton update to add artificially difficult endgame by denying players the use of most of the tools, powers and tames they've earned. Bonus points if it tricks newer players into thinking your game is alive and pisses off older players for having made them wait so long for nothing.\n\nMost importantly, have a free weekend and make suckers out of people with your deceptive early game so they can't get refunds when they eventually realize your game is a boring, horrendously unbalanced trainwreck with dead servers. Don't be me. Don't be a sucker.", "timestamp_created": 1613002925, "timestamp_updated": 1613002925, "voted_up": false, "votes_up": 138, "votes_funny": 18, "weighted_vote_score": "0.809004485607147217", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "33898531": {"recommendationid": "33898531", "author": {"steamid": "76561198026384668", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 13802, "playtime_last_two_weeks": 0, "playtime_at_review": 8182, "last_played": 1520112146}, "language": "english", "review": "8/15 update - 16 days later. An update has rolled out every Weds (at least) for the last few weeks. Server stability has improved and more content is being added on a regular basis.\n\nThis game has some early access bugs but is otherwise an excellent time.\n\nPoint of reference. I play on a small private PvE server most of the time.\n\nAs of 7-30-17... These aspects are based on the game itself, not your particular server where player characters in a pvp setting (yes there is a pve only option too) may affect your individual experience or your particular pc and its different hardware/software configurations which may cause their own issues. This review assumes the game worked for you in its current state at the time this review was written.\n\nThe Best:\n-You feel like a budding Sorcerer King with every step of the journey and progression. The spells all have great impact and when you cast them you really feel like you're wielding elemental wrath (at least with the staff, that was my weapon of choice). \n- The building system is beautiful. Whether you're making a nice wooden house or a sky scraping wizard's tower your place can be absolutely gorgeous and striking.\n-The beasts you can tame are likewise well modeled and excellent to utilize.\n-The Company has realeased several patches and some new content over the first few days after the early access launch. these folks care about their game and want to make it worth your while.\n\nThe Worst:\nIt's early access so there are many emergent problems.\n-Server stability (which has gotten much better over the last few days) is good but expect you may have the odd crash as you are out in the world going about your business.\n-Voice communication is currently choppy and hinders RP\n-Frame rates and server latency can cause some combats to be jumpy and enemy AI is very basic\n\nThe Future:\nThere are a few fates in store for this game\n1- Early access reviews will slap the 'Mostly negative'/'mixed' stigmata on the game's rating and there will not be enough players to maintain the company's revenue and the game will slowly collapse.\n2- Continued development, steamlining, content increases, and bug fixing will make this game into a stable magical experience to quicken the blood and make your dreams of being a Socerer King among mere mortals come true.\n\nShould I buy it? :\n- Do you love the fantasy sandbox genre and have a few bucks to spare and some time?    \n--- Then yes you should. For the price of a movie and a meal you'll get more hours of entertainment out of this than those same respective purchases\n\n- Are you just really excited after seeing an intro video or a streamer?\n--- Add this game to your wish list and keep your eye on it carefully. Read its news page for the next few weeks and watch the patch notes. Keep watching the videos and the streamers\n\n- Are you hung up about this game and its competition (which was released a few days before this game) and don't know which one to get?\n--- If you want to support the underdog indie studio try to make something special then get this one. If you want to get something which was a bit more polished at launch but whose company is a bit laggard in development then go with the competitor.", "timestamp_created": 1501397847, "timestamp_updated": 1503442348, "voted_up": true, "votes_up": 62, "votes_funny": 5, "weighted_vote_score": "0.802461862564086914", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "69102335": {"recommendationid": "69102335", "author": {"steamid": "76561198822276602", "num_games_owned": 0, "num_reviews": 41, "playtime_forever": 3844, "playtime_last_two_weeks": 0, "playtime_at_review": 3498, "last_played": 1656135104}, "language": "english", "review": "*****AUG 2022 UPDATE: \nRecently there was an event that got a lot of passionate people up in arms, and I completely understand because I love this game too. In short a Dev posted that the event was not a cash grab and that there is a QOL update in the works with no specifics or deadlines. (you can see as to why we are suspicious) The dev also claimed the game wasn't abandoned (though updates and community contact has been nil) but did admit there are no more \"major updates\" which feels really undefined but atleast its communication. \n\nI just want to put my thoughts (and what i believe thoughts of other players)  in an understandable statement:\n            DEVS: Though people say \"add more content\" we are not asking for a \"major update/expansion\" though no-one would hate that. We mean the world that exists and is advertised feels empty and dry. Add more NPC spawns and have them walk around more, Have roads, and move maybe add some more towns across the land.\nThere's also alot of issues with combat just not flowing correctly and bags when dead floating in the air. As listed below there are even NPC's that are so difficult to hit with spells or melee weapons because of their wonky flight system and the fact they fly through walls and floors. \n\nNo-one would be mad if there wasn't a \"Major Update\" if thats defined as an expansion or more content as from farming to combat and building there is a bit to keep people interested. I think what most players want and what will cause counts to spike is fixing what you already have. >> I dont think any player would agree with devs that this game is complete or out of early access.<<\nThanks for reading if you did devs. A lot of people are really passionate about your game so please don't take their frustrations too hard, they feel betrayed. To the community thanks for all the likes and awards for the review :)\n\n****** END OF UPDATE\n\nI have played this game for countless hours past a year or two and have really had a ton of fun. My friends and I enjoy it a lot and I really hope devs see this review to help address the main issues of the game. That being said this review will be vary detailed (I will keep this updated when I can :D)\n*Yes I know it says 50hrs on record. IDK why, but this is a very accurate description.\nPros:\n-Crafting for the most part never feels too expensive\n-Graphics (Bloom in this game is annoying and vary odd)\n-Overall game-play and world design is nice and enjoyable\n-Unique spell crafting system that is fun to play with\n-You can tame almost anything\n-Building is really nice, except when placing floor items such as benches/chests you can only snap them in certain places instead of trying to squeeze them together for organization(Fallout 74's base-building would be better for how this game works), These snaps are also in really odd positions.\n\nCons:\n-Character customization has sliders, but they are absolutely useless. the default settings are the only ones that make your character even resemble a human. Hair styles are limited but I enjoy how you can edit skin to odd colors like green\n-Pets dont seem to do much damage and when you level them their stat progression seems too low. (Leveled everything from dragons to rabbits)\n-An entire quest line has been added and it starts off really nice, but around 30 and up it just has you crafting items and making plants that have specific seeds (so they aren't used except for the quest at the time of receiving them) So in essence its just a way to extend game-play time because you have to plant this quest specific item and wait. This method is re-used a lot and you continually pop up to where you have to craft useless items. A couple like this wouldn't be bad to teach the player how to plant and so on, but this really just feels like they are trying to keep you in the game.\n- Endgame gear requires a lot of rare items (to be expected) but because the dragons are bugged its super difficult, and you only get 1 scale per. Also the lack of population outside of camps makes it difficult to farm gear too. This is especially difficult in reference to abominations (which are rare to find) and their super rare drop.\n-Lack of creatures just in the open, this is okay around spawn areas but other areas are completely lifeless still only exception is camps and dungeons.\n-There is no melee build. Starting off you can still wack things and use melee spells, also spells that drag the target to you, but late game these are useless as anything that flies will never land and will glitch into anything it can possibly hit, when it swoops in to attack finally even if you used a ranged beam spell its hitbox is so bugged that its ridiculous.\n-Lack of content and updates. You'll see \"patches\" occasionally but they never seem to fix anything at all. I do appreciate the effort, but it doesn't feel like this games updates is progressing at all. Which leads to:\n-Bugs, So many bugs from simple to complex that have not been fixed for years;\n     *Tames that are set to follow will walk around and sometimes trail super far behind you like it doesn't know what path to take. I have also ported to another end of the map and the tame didn't port to me for a long while.\n     *Lootbags from death being unreachable even though they are right in your face\n     *Enemies vanishing mid-fight at times (super annoying late game)\n     *Flying enemies refuse to land or have any flight timer (re-addressing from earlier)\n     *When using \"Beam\" Spells on flying enemies the hitbox is buggy. My line will be hitting them for a few seconds before it ticks damage (I dont think this is ping related)\n     *When equipping weapons I can't put them into the slots I want. I will drag them to \"1\" and then drag a wand to \"2\" or \"3\", but it will always go into the \"1\" spot. This seems to only be a problem with the wands. It would probably be better to label they keys in the inventory too, when you dont have anything equipped they just turn into red squares.\n------------------------------------------------------------------------------------------------------------------\n------------------------------------------------------------------------------------------------------------------\nAs of now I will say don't purchase this game unless its on sale. I have had tons of hours of fun but all the fun in my opinion is in leveling. As soon as you reach end game there's just not enough content and crafting the gear is too tedious with current bugs. \n\nI really hope these things are addressed and the devs ramp up their efforts to patch these issues. As a player I don't see any big new content to put off these issues. I apologize if things are being worked on in the back ground but I hope you understand :)", "timestamp_created": 1589434928, "timestamp_updated": 1660371010, "voted_up": false, "votes_up": 99, "votes_funny": 8, "weighted_vote_score": "0.797712206840515137", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "56246221": {"recommendationid": "56246221", "author": {"steamid": "76561198012841374", "num_games_owned": 605, "num_reviews": 19, "playtime_forever": 1736, "playtime_last_two_weeks": 0, "playtime_at_review": 1736, "last_played": 1568290144}, "language": "english", "review": "there is no hope for this game.\nyou released THAT out of early access?\nthere are still bugs that were there from the beginning. Servers are dead, you dont listen to the community and now a price INCREASE ahaha good luck with that", "timestamp_created": 1572680869, "timestamp_updated": 1572680869, "voted_up": false, "votes_up": 161, "votes_funny": 19, "weighted_vote_score": "0.783582508563995361", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1584888674, "developer_response": "Yes when a game receives 2 additional years of development and gets released as a full title it is natural to increase the price. There are very few bugs in the game at this stage and there are servers with many players."}, "89814954": {"recommendationid": "89814954", "author": {"steamid": "76561198192812858", "num_games_owned": 201, "num_reviews": 12, "playtime_forever": 6299, "playtime_last_two_weeks": 0, "playtime_at_review": 5039, "last_played": 1617953872}, "language": "english", "review": "This game is fun and has a ton of potential, but it's not worth the $40 until they add more. There's many issues with the game and most of them feel super lazy. The world is huge and gorgeous, but it feels super empty. There's lots of areas that look super cool but there's nothing interesting actually in those areas. The main quest is bland and just feels like a tutorial with a ton of back and forth. There are small bugs that I've noticed when I played around a year ago that are still there, like the cave noises continuing when you're no longer in a cave. Rifts will spawn out of bounds, hair clips through clothing.\n\nI feel like they could add more elements to use for magic, the whole game is about magic and it feels like there are so many missed opportunities with the \"essences\" that they could have added. Maybe more dragons or creatures to tame. The end game content that you do once you reach level 60 is waaay to difficult. It's like it was meant for raid parties to go complete, except the game is dead and it doesn't even feel like it's worth completing since you've already done pretty much everything in the game at that point anyways. It just feels like they got lazy and could add more to the base game that you play before end game.\n\nAside from all that, the concept is really cool. Magic and stuff is fun and unique. If you've got 40 bucks to throw around, it's worth a buy. But if you're not sure, wait for a sale or something until more gets updated.", "timestamp_created": 1617695550, "timestamp_updated": 1618194458, "voted_up": false, "votes_up": 40, "votes_funny": 0, "weighted_vote_score": "0.781179130077362061", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "69621503": {"recommendationid": "69621503", "author": {"steamid": "76561198093064201", "num_games_owned": 764, "num_reviews": 7, "playtime_forever": 7741, "playtime_last_two_weeks": 0, "playtime_at_review": 7741, "last_played": 1582418768}, "language": "english", "review": "The game has something particularly unique in the survival genre. Everyone is a wizard, doing wizarding things and fighting mobs, monsters and bosses that either roam or sit on their unearthly thrown in their respective dungeon.\n\nI absolutely love the Base/Castle/Citadel building system. It is truly amazing and something the game devs got right very early on.\n\nHowever, the method to leveling up in the world, since the start of the game's EA Launch, has been terribly boring and dull. Sure, doing it the first time while discovering the game in its entirety is super fun the first month of playing, but after that. Everything is a grind. Hey, go stand by that tree for a minute to harvest, hey, go stand by those rocks to harvest. And to level up through killing things is quite mindless as well. Just wack things with melee or with a spell with left or right click and boom, they fall over. And you have to do it FOR HOURS. Very little thought gets put into grinding up your levels and it makes the replayability of the game very boring.\n\nI want this game to do well. I really love the concept and want to participate in the game more. But that boring grind gets you pretty quick. I will leave my review as positive because I do believe its a good game. I just hope it eventually becomes a great game.", "timestamp_created": 1590174399, "timestamp_updated": 1593138665, "voted_up": true, "votes_up": 33, "votes_funny": 0, "weighted_vote_score": "0.776483297348022461", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "137796311": {"recommendationid": "137796311", "author": {"steamid": "76561198088592005", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 991, "playtime_last_two_weeks": 0, "playtime_at_review": 991, "last_played": 1612669846}, "language": "english", "review": "Very mixed. Always such a shame to come back and see this game stagnant and dead. It has wonderful foundations for a really cool experience with a good degree of immersion, but with the inability to mod the game as well as no active developers making content, it really is a bummer. Maybe someone could take this game from Blue Isle and let them update it to UE5 and open up mods for personal servers like Valheim. Something to revitalize a fun spin on survival.", "timestamp_created": 1683231916, "timestamp_updated": 1683231916, "voted_up": true, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.771790206432342529", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "33866883": {"recommendationid": "33866883", "author": {"steamid": "76561198064106555", "num_games_owned": 4626, "num_reviews": 542, "playtime_forever": 3057, "playtime_last_two_weeks": 0, "playtime_at_review": 3048, "last_played": 1512230617}, "language": "english", "review": "+++ UPDATE ON 08/03 +++\n\nA new update came out yesterday which was supposed to fix the lag and the high ping on servers. Since this update I get a lot of strong lag and \"Server is not responding matches\". On the other hand it got a bit better than it has been before.\n\nAs of now the game still has a huge ping and lag problem, on my private dedicated server I rented as well as on the official ones. Let's hope they will fix it on another update. The last one did not really to the trick.\n\nStill good and motivating game. But those problems I can still not recommend the game.\n\n\n+++ REVIEW AFTER 22 HOURS & 2 DAYS AFTER RELEASE - 07/29 +++\n\n\nFirst things first: this game is fantastic, from the fantasy theme of sorceres and magicians to the massive map with infinite building options, hundres of monsters a plenty of spells, weapons and equipment. \n\nThe Early Access start was impressively well done. In 22 hours I only had 2 crashes. \n\nTo get it out of the way: performance needs still optimization and the netcode seems to be not ideal, since I have a ping on my own Frankfurt based server (Germany, center of Europe) of 60 ms. On official servers it is almost unplayable for me at the moment. Developers working however hard to improve the netcode, they say. Let's hope to see here improvements in the coming week.\n\nGame is a survival sandbox where you can build simply everywhere huge castles and fortresses. You play as a Battlemage which is able to fly around with a Broomstick. The setting is fresh. The mechanics take the best of the genre. Good news, you do not have to take care of hunger, thirst, cold, etc. The only ressources you need are mana and HP.\n\nSince the game wants you to have fun, you can modify the servers for unlimited ressources for example. So no need to grind. Insofar, not grinding but spell fights are the stars of the game. And to get into it  you do not need to first grind 100 hours.\n\nEnemies are okay. At the moment it lacks a bit of variation, but I see where they going to. We can expect the whole fantasy, fairy tale scheme of monsters. I am super excited. I saw for now Goblins, Unicorns, Wolfs, Bears, Tree-Monsters, faries, etc. \n\nFight-mechanic is easy, but makes a lot of fun. However the netcode needs to be improved in order to give you a feeling of more direct controls. At the moment there seems to be some delay.\n\nYou have plenty of weapons for different playstyles, from melee to socerers staffs, wards and gloves. Very cool. Those weapons can be equiped with different spells.\n\nBesides of this you can craft or find in caves our treasures boxes further equipment, medals, amulets which change the points of your different attributes.\n\nMultiplayer seems to be the masterpiece of this game. At the moment I was mostly playing solo on my own server, but see where the mp is going to is very exciting. \n\nDevelopers will soon publish a roadmap: we can expect more weapons and equipment, endgame content, more monsters, even a bigger map, more interesting map points, events, etc. And of course hard work on the performance of the game.\n\n+++ CONCLUSION +++\n\nVery impressive Early Access game that comes already very polished concerning game mechanics and graphics. And so a way better start then RUST, ARK or H1Z1. Still some work has to be done on optimization and netcode. Definitely a game you can already buy now to have hundreds of hours of fun. Beware it is addicting. I will definitely stay with the game for quite some time. Since I got myself a server I feel like even getting more into it. Feel free to join me on my server \"mrorange\" (research in the menu).\n\nVERY MUCH RECOMMENDED EARLY ACCESS TITLE !!! ABSOLUTELY WORTH THE 17 EUR !!!\n\n[i] Twitch Channel : https://www.twitch.tv/mrorange55\nYoutube Channel : https://www.youtube.com/channel/UC1UE5TPoF0HX0HVpF_E4uPQ/videos?view_as=subscriber [/i]", "timestamp_created": 1501280011, "timestamp_updated": 1514724306, "voted_up": true, "votes_up": 138, "votes_funny": 6, "weighted_vote_score": "0.765429139137268066", "comment_count": 22, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "84951702": {"recommendationid": "84951702", "author": {"steamid": "76561198083671030", "num_games_owned": 79, "num_reviews": 11, "playtime_forever": 11262, "playtime_last_two_weeks": 0, "playtime_at_review": 6320, "last_played": 1705331020}, "language": "english", "review": "The game play is great, it is a fun game however the player base is so low that there is little to no player interactions. The game would be better if there was a mega server(s) instead of 50 man servers.\n", "timestamp_created": 1611021022, "timestamp_updated": 1613848411, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.757427871227264404", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "69462323": {"recommendationid": "69462323", "author": {"steamid": "76561198014537537", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 49433, "playtime_last_two_weeks": 0, "playtime_at_review": 48992, "last_played": 1590154059}, "language": "english", "review": "Nice game to kill few days, maybe weeks if you buy it on discount for few bucks. Sologame is ok but gets borring after 1 day, PvE is fine but gets borring with nothing to do after 5 days, PvP Server (EU and only one) is owned by big russian clan that blocked all resources and you cant build anything to defend yourself, even if you manage to collect something and build nice base they will come with 20 players and bomb you down,  American clan is of 10 players that destroy lowbies basesat starting area and tamed pets from offline players. Turks clan glitching through walls and looting players without devs banning them, Devs abandoned game and there is nothing you can get from this game anymore. Stay away from this.", "timestamp_created": 1589959058, "timestamp_updated": 1589959393, "voted_up": false, "votes_up": 49, "votes_funny": 7, "weighted_vote_score": "0.756834089756011963", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "95882457": {"recommendationid": "95882457", "author": {"steamid": "76561198051373816", "num_games_owned": 314, "num_reviews": 43, "playtime_forever": 4157, "playtime_last_two_weeks": 0, "playtime_at_review": 4100, "last_played": 1644118035}, "language": "english", "review": "Its so... sad.\n\nIt has potential, and the concept is great but.. its just not there. it lacks any sort of server tweaking or mod support, so if you want to fix something up about the game that bugs you, you just can't.\n\nI could go into a long winded rant but, let me give you an example of one problem with the game.\n\nTo tame a creature, you make a channeling spell to tame it. the less hp it has the easier it is to tame, but the effect is minimal. theres ways to increase its effectiveness with bonuses and stats, but again, the effect is minimal. theres also no way in singleplayer or serverside to increase the speed, and for better tames it can take a really long time to tame them. they can also freely move and attack you with no hinderence during the entire process. so... this leads to you needing to use cheese tactics like building on top of them in order to be able to tame anything remotely decent. it just ends up with you holding down left mouse button at a dragon for 30 minutes while you chug mana potions and wonder if the pain in your fingers is something you might need a doctor for.\n\nthis translates to alot in the game. this isn't the only problem, but it mirrors alot of problems in the game.", "timestamp_created": 1626499554, "timestamp_updated": 1626499554, "voted_up": false, "votes_up": 38, "votes_funny": 3, "weighted_vote_score": "0.754131674766540527", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "44570048": {"recommendationid": "44570048", "author": {"steamid": "76561197988249990", "num_games_owned": 298, "num_reviews": 26, "playtime_forever": 4479, "playtime_last_two_weeks": 0, "playtime_at_review": 4322, "last_played": 1573895267}, "language": "english", "review": "This game has great potential, It really does.\n\nMy biggest problem is with the game is that the animations for everything are so damn awful including enemies. The AI is really weird too. An enemy will have its back to you and if you get close enough they will spin round in 1 frame and then sprint full speed at you. It just makes for really clunky crappy gameplay.\n\nIt also runs like crap, it used to be worse until the recent update. The update is good in some respects but it is also the reason i will never play  this game again. \n\nThey rebalanced the game to make it 100% unfriendly to fresh spawns. You will now have to collect x5 times the amount of  materials for crafting potions which are a staple to being able to keep your mana going for combat. \n\nNext up is building. You can do loads of stuff and its fairly easy to do. You can even get experience from it! Great right? Wrong. Its rediculously expensive. You will spend literal hours on harvesting boulders to get enough to make a 4x4 room. Sure you can just stick with wooden shacks, then thats only an hour two of harvesting trees. FUN RIGHT?\n\nNot for me. Maybe in a few years when the game is more developed.\n", "timestamp_created": 1536082900, "timestamp_updated": 1536082900, "voted_up": false, "votes_up": 33, "votes_funny": 2, "weighted_vote_score": "0.750877439975738525", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "75668307": {"recommendationid": "75668307", "author": {"steamid": "76561197971574625", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 163853, "playtime_last_two_weeks": 0, "playtime_at_review": 156622, "last_played": 1694450081}, "language": "english", "review": "Ok so I've played this for over 2600 hours through beta etc and somehow keep coming back in the hope its better and some of the minus points have been remedied. Overall I enjoy playing - look at the played hours!, but there are some things that for me kill the player base on maps and restrict player numbers, with many players hopping servers looking for a good one to exploit.\n\nExploit?, yes unfortunately so. The game does not encourage social game play so many anti-social players that have exploited a free server for a while end up treating the 'free' server as their own personal space. They do this by linking bases all over the map with pillars and build bases close to all of the known mutant spawns etc allowing them to have an assist via the base defences to kill the spawn before anyone else has the opportunity. The pillars also restrict other player by expanding using a similar method due to you being unable to build anything close to one of their pillars (so they can effectively cut off whole sections of the map). BlueIsle for their part view the game as finished and are unwilling to remedy this as they fear player backlash (so essentially they are paying for a few players to monopolise servers. From their viewpoint its £30 well spent as they don't have to pay for the upkeep themselves). Dont get me wrong, there is still room to build a base and a large one, but you wont be able to do so all over the map and a significant portion of the server build limit is used by very few players that have been on the server for some time.\n\nThe game unfortunately encourages this as after level 60 there is nothing much to do except try and get max level gear (good luck finding a group to go dungeon crawling with) and build, build and build some more.\n\nBe aware that on PvE servers, despite being a 'survival' game. Other than throne decay your base is safe as you dont really have to worry about mobs destroying your build. Its player vs. environment, where the environment doesn't fight back (unless your base attacks the mob). This again makes defensive turrets and shielding pointless (unless you go for an assist killing tougher mutants as above). Again I think this is a shame as players would at least have to maintain their base if they build in the higher level areas - no risk vs. reward.\n\nTaming dragons is practically impossible (unless you exploit the landscape) for the higher level ones unless you have more than 1 person and the dragon is on the ground. This is a pity and has never been rectified as so much of the movement in game involves flying potions, broomsticks and pets the first 2 tick away at your mana supply and if you run out you fall, if you get hit in the air you also fall (but can click to fly again). Mobs in the air are very difficult to hit as your spells dont auto-track and they duck and dive, meaning you have to try and predict where they will be and manoeuvre whist keeping an eye on your mana. Conversely they usually don't have the same issue with you, so overall fighting dragons in the air is generally ill advised.\n\nIf you are looking for something to play to chill now and again, or for some short term enjoyment then give this game a bash. If its longevity you are looking for though, its good for dipping in and out of, but raiding the group dungeons is not really possible unless you have a group of friends. I'm also not sure if they have fixed the group mechanic as it used to be that if you died you appeared at your spawn point and received a message saying the dungeon was occupied if you tried to get back in.\n\nAlso worth mentioning is that they changed the Throne timer from 16 days to 8 days on fast servers (Nov 2019), so if you intend playing on a fast server and go on holiday for 2 weeks. Then your base will be gone when you return.", "timestamp_created": 1599601141, "timestamp_updated": 1606354096, "voted_up": true, "votes_up": 29, "votes_funny": 0, "weighted_vote_score": "0.750117719173431396", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "55324893": {"recommendationid": "55324893", "author": {"steamid": "76561198292026523", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 23743, "playtime_last_two_weeks": 0, "playtime_at_review": 8586, "last_played": 1632668940}, "language": "english", "review": "I  want to like this game but in it's current state it's just not there yet. I'ts visually a nice game but the character creator could do with a bit of an overhaul a few more options would be nice everything seems very generic, i also find the combat system is a little annoying at times especially the hit boxes!!! instead of a hot bar of abilities you basically have to switch between weapons being an axe,wand,staff & gauntlets etc each weapon can be progressed to a higher tier but can only have two equipped spells at a time per weapon. I find the spell system rather frustrating too you have to roam the world collecting essence's to craft within certain schools of magic to which you then have to memorise which essences make which spell, they worked on this in a previous patch and changed it all but i still feel its not quite there and has so much more potential to make it a lot more interesting. The game does seem to have a good Dev team who are constantly throwing out patches/updates all the time, whether they actually listen to what their player base want/need I'm not 100% sure, the servers seem do be dying a slow death. I hope they get it right but just now for me it's a thumbs down.", "timestamp_created": 1569706357, "timestamp_updated": 1569706866, "voted_up": false, "votes_up": 55, "votes_funny": 2, "weighted_vote_score": "0.749562263488769531", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "62477327": {"recommendationid": "62477327", "author": {"steamid": "76561198035655467", "num_games_owned": 285, "num_reviews": 50, "playtime_forever": 781, "playtime_last_two_weeks": 0, "playtime_at_review": 357, "last_played": 1703980891}, "language": "english", "review": "Gotto say , I bought this game early in its development and I had very low hopes - half expected it to be abandoned. \n\nHowever, the game is now a very clean, and a smooth experience overall. \nI'm playing solo, and I'm enjoying the chilled out grind for better stuff - servers are available and very well populated, which I was happy to see, and I'll join a server after my Single player romp.  \n\nMore spawn points for creatures would be good (outside of designated areas), if you really want to find enemies , they're pretty much all marked on the map as Enemy camps or Caves and there are a lot of those.\n The south part of the map is almost devoid of creatures outside of the camps and caves. \nBut enemy spawn rates at the camps are fairly frequent , so the game is tailored to that kind of farming. \n\nI can safely say I'm happy with my purchase at this point, and the Devs are doing a great job! \nUpdates are still coming in \n\nWorth the price - if you like Magic and you like building - \n\nPS. you don't have to eat or drink to survive :)\n", "timestamp_created": 1580076061, "timestamp_updated": 1580076061, "voted_up": true, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.746867656707763672", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "118544605": {"recommendationid": "118544605", "author": {"steamid": "76561198008540168", "num_games_owned": 258, "num_reviews": 16, "playtime_forever": 1488, "playtime_last_two_weeks": 0, "playtime_at_review": 1488, "last_played": 1573352948}, "language": "english", "review": "game is dead and abandoned, sad could have been great.", "timestamp_created": 1657417069, "timestamp_updated": 1657417069, "voted_up": false, "votes_up": 36, "votes_funny": 1, "weighted_vote_score": "0.746094226837158203", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "38315664": {"recommendationid": "38315664", "author": {"steamid": "76561198052261797", "num_games_owned": 0, "num_reviews": 23, "playtime_forever": 17086, "playtime_last_two_weeks": 0, "playtime_at_review": 17028, "last_played": 1597516046}, "language": "english", "review": "If you dont feel like reading my long review, and want a recommendation- Ill save you some time. DONT GET THIS GAME. Wait till they fully release the game. Till then, go play Ark (VERY similar game with much more to offer). \n\n\nThis forge is cold, people! Nothing to see here, but read on if you like!\n\nThanks for reading! :) \n\n9/12/2018 update:\n\nA lot of changes, and I had a feeling things would remain the same. The \"Reignited\" patch offered farming, spellcrafting, and a handful of UI changes. Spellcrafting is neat- if it was crafting. Theres no freedom-just a mold to fill on a weapon slot. Farming is more hastle than yield. They changed Magic Find and it works now. Just craft a set of magic find gear real quick and get yourself a set of top tier gear. The quests they added are much like a work order than an actual adventure. I played this game to the end again after the server wipes- Level 60, dungeons, rare gear and items etc. I'm fairly certain a lot of people have caught on that this game doesnt really have much to offer (And wont have much to offer) which is why the servers are now dead (again). A handful of the issues I had addressed in my previous review have been fixed, but the \"Reignited\" patch was only but a spark- not a flame. \nTo paint a picture for you, just imagine crafting, killing (terrible AI) NPCs, and grinding the same cave 50-100 times to get max level and soloing the end game dungeons. Thats it. No terrible storms to survive through. No random NPC raids. No (real) quests. No Story. No solid lore. No economy. No goals. No legit rare loot you can keep to brag about... \nThe developers intended for this game to make itself. They provide the foundation- this empty husk of a game and the players populate the servers to create the rest of the fun. Im guessing griefing? Maybe farming the map clean and holding the servers resources hostage till the next spawn? Hell if I know... Sadly the servers are dead, and will remain dead unless theres some sort of challenges, incentives, or goals for playing. \n\nYou craft a hut, get level 60, and do a dungeon. End game.\n\n\n(Old)\nIll be going back from time to time- In hopes that things have magically changed for the better. I really want to like this game. There will be a large wipe and content update coming towards then end of June 2018. I would like to change this review into a recommend and maybe with farming, spellcrafting, cooking and the HUD overhaul, I just might (Or because Im a millenial who has a huge green thumb). Ill be playing on Luminous- Come troll me ;)\n\n(First Review) Im going to try and sum up this game all that I can in as little as possible starting from the top and most important- Specs. \nThis game's minimum rig specs are not as specified. You will need a bit more. However, even with more than specified, you will lag. Graphics will not render properly or at all at some points. Spells will be cast, and continue to float there indefinitely. Mobs will flicker and float into the sky. You think something is in front of you? Guess again, it decided to render 300m behind you. You want to avoid a fire ball? You will! It'll still hit you 100m away from impact. Generally, I believe this is development side's fault. This game needs heavy optimization, which wont come because the Dev is too focused on more content. Cant build a house without a foundation and you cant get drapes without windows. \nThe next most important is the lack of content. (I know I said that the dev is too focused on making more content, but optimization is foundational should come first. With what little content there is... it should be atleast functional) The main purpose of this game is to Craft like a sweatshop slave or aimlessly kill anything and everything. When I mean everything, I mean even end game enemies that are 50 levels higher than you. There are no quests. Really, there is no goal to this game. You play just to grind, build, and grief (if on a pvp server). There is no reason to gather and store supplies. Nothing is valuable since it can be gathered almost immediately. Which means there is no real economy in this game since nobody needs anything.\nLast but not least: The bugs. The bugs are pretty comical. You will laugh when you see a Giant die and then float into the sky. You will get angry when you see your dragon disappear under the map. And you will cry when you see your own home become, \"Abandoned\" even when claimed with a throne. A LOT of the bugs in this game are not typical for a game that has a price tag. They are borderline sloppy to the point of wondering if the devs even cared to finish their game. Some bugs were so apparent that they could have been caught in less than an hour of playing through the game. Just by that observation, I dont even think the Devs played their own game. (Not displaying item count in chests correctly when there is a counter, for example) \nJust a little insight into what level I am and how far I've gotten: I am currently 44 and crafted almost a full set of Epic Gear (Highest quality possible atm) and tamed a few dragons. Now, leveling consists of: Having 15 forges crafting the same items for the next 5 hours, sweep the same cave 10 times, and gather in between. All to get 1 level. Ive kept tabs on a handful of players (Who I have befriended) and they have shared with me how they are leveling or how they got to 60. The level 60s on my server are the only players that have played non-stop. One is a game developer (Who plays games specifically to test numbers and push stats) and the other has no life commitments. I, on the other hand, have been playing for over 100 hours, and have yet to reach level 45. I know this sounds harsh, but realistically, this game is a life commitment. You need to play for hours just to accomplish even the smallest of goals you set. I will update this later if the game improves. \n\n(Second) 12/14/2017 Worst update: Feels like some players were complaining about how easy dungeons were, so Blue Isle slapped out a lazy lack of thought patch to accomodate them. Unfortunately, the game is now unbalanced in the opposite extreme. Things were too easy to kill, now they are near impossible to kill. Giants should not be 2 hitting players. Skeletons in the forests should not be the new newbie zone troll. And Dragons should not follow players for over 3000m to their bases. \nHonestly, my impression of this game was that it was just getting started and had a few kinks to work out. Now, it feels like Blue Isle doesnt actually know what they are doing. Doesnt seem like they really tested this update out. Instead, it feels like they wanted to do a christmas update, but also throw something extra in there at the last minute. Now I know that the bugs, lack of content and poor optimization are actually due to poor development. \nAfter putting in over 100 hours into this game, I will be posting a review that reflects major issues- Not the simple ones that normally should be fixed BEFORE a game is put on the shelf. EVEN for early access. Main mechanics should not be buggy.", "timestamp_created": 1513310029, "timestamp_updated": 1536803809, "voted_up": false, "votes_up": 122, "votes_funny": 19, "weighted_vote_score": "0.745243608951568604", "comment_count": 18, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1584887678, "developer_response": "A lot of points in this review have been addressed with the game's official launch. It is now a far more solid offering."}, "33889223": {"recommendationid": "33889223", "author": {"steamid": "76561198101303551", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 1301, "playtime_last_two_weeks": 0, "playtime_at_review": 1301, "last_played": 1501616806}, "language": "english", "review": "The reasons this is getting some bad reviews:\n\n1) Servers are currently experiencing problems due to the quickly rising popularity of this game, which they did not expect and will fix soon.\n\n2) The AI is not the best at this time.\n\nThis game is amazing, fun to play and will get you hooked. It reminds me a bit of skyrim and his a similar play-style of rust, but be aware that it is a level-based game and you will have to farm a lot. My advice is to wait and get this in a couple of weeks when they have fixed the bugs. POTENTIAL.", "timestamp_created": 1501359445, "timestamp_updated": 1501359445, "voted_up": true, "votes_up": 98, "votes_funny": 8, "weighted_vote_score": "0.740704357624053955", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "35502065": {"recommendationid": "35502065", "author": {"steamid": "76561198025865105", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 126990, "playtime_last_two_weeks": 0, "playtime_at_review": 27701, "last_played": 1675354316}, "language": "english", "review": "Firstly, I have played 460 hours of this game. I am considering uninstalling at this point. Here is todays experience which has happened 3-4 times this week. I spent 6 hours of gathering with is BORING and TEDIOUS, i place it on the crafting bench and swim away, BAM server crash !!!  I lose all my work and die while waiting to load back into the game.. cause I was swimming when it crashed. 6 hours of bordem with NO reward. I could have better spent my time petting my dog for 6 hours.\n\nThis happens often. When flying my dragon mount BAM server crash. When coming back into the game (if i dont die while loading) my dragon interface no longer works so, YES ONCE AGAIN, you lose everything he was carrying. I am tired of losing items add nauseum. \n\nThe game has FANTASTIC potential but...     the next BIG THING, means nothing if the server keeps crashing...", "timestamp_created": 1507230547, "timestamp_updated": 1507230547, "voted_up": false, "votes_up": 41, "votes_funny": 4, "weighted_vote_score": "0.739037036895751953", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1584887817, "developer_response": "The game is now out of early access and is far more stable than it's ever been. I'd encourage you to give it another shot. Seeing the number of hours you played, it looks like you enjoyed it when things were working."}, "53956635": {"recommendationid": "53956635", "author": {"steamid": "76561198087919000", "num_games_owned": 112, "num_reviews": 2, "playtime_forever": 12289, "playtime_last_two_weeks": 0, "playtime_at_review": 11639, "last_played": 1604556021}, "language": "english", "review": "I haven't played this game in a long time. Yet there are times when I just really wish I could.\nBack when the servers were active, and clans roamed the land of PvP, it was incredibly fun. Not only was it enjoyable, but it was entertaining, relaxing, satisfying, and when playing for the first time, was a smooth experience with plenty of immersion and captivating combat to go around. \n\nBut that was a while ago. Now, the game is mostly dead. The content itself is there, and for the dev team, at the time (1-2ish years ago) the content was good. But they slowly began to pay less and less attention to it (from a consumer's standpoint), and it eventually became dead. [i]Now, there are 10 people at most on the NA East servers, and they typically sport an empty NA West server. [/i]\n\nIt really saddens me to see so many good games and great concepts that are either poorly executed, or forgotten. This was one of them. [i]HOWEVER[/i], the game is still good fun if you have someone to play with. Forget PvP and large clan gameplay-- if you have someone you can play with, there's plenty to explore, fight, claim, and build:\n[b]Pros[/b]\n[list]\n[*] Large map with plenty to explore\n[*] Atmospheric\n[*] Visually appealing\n[*] \"Customizable\" combat and tame systems\n[*] Fantastic building and great modeling\n[/list]\n[b]Cons[/b]\n[list]\n[*] It's dead.\n[*] Can be a bit grindy\n[*] Slower paced -- not for everyone\n[*] Still dead.\n[/list]", "timestamp_created": 1562571754, "timestamp_updated": 1562705669, "voted_up": true, "votes_up": 34, "votes_funny": 4, "weighted_vote_score": "0.738618135452270508", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "34075557": {"recommendationid": "34075557", "author": {"steamid": "76561198042579918", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 3288, "playtime_last_two_weeks": 0, "playtime_at_review": 3286, "last_played": 1504932845}, "language": "english", "review": "I have played this game quite a bit over the past week or so and these are my conclusions.\n\nPros:\nBeautiful world\nBuilding mechanic is really well done\nFlying mechanic is amazing(other than the amount of mana it takes)\nActive Devs working on fixing game breaking bugs\n\nCons:\nEverything to do with combat\nNPC mobs have a low aggro range, do little damage and have a high attack delay(You can just stand out of their aggro range and attack them, they dont respond)\nMost of your combat spells either don't work or do almost nothing(everyone just spams the same 3 spells [mainly fireball])\nPVP is basically just 1 or 2 shotting everyone, their level and gear doesnt make that much of a difference\nMaterials even the high end ones are so easy to get that they are basically worthless\nIf you are into building and on a PVP server when you leave expect your base to be destroyed\nIf you are into griefing, destroying peoples bases is so easy that you will probably get bored\nAlmost everything is bugged, server/lag issues etc.(its early access that is kind of expected)\n\nOverview\nThis game seems incredible at the start, the visual effects, exploration and flying are really fun.\nIf you enjoy building and hate combat/rpg then this game is for you and I suggest picking it up. (Seriously it is beautiful and you can make some epic buildings)\nIf you are looking for any kind of challenge then this game offers nothing for you. \nThe game is really more for casual instant gratification gamers and offers nothing for survival/rpg/pvpers.", "timestamp_created": 1502086080, "timestamp_updated": 1502086080, "voted_up": false, "votes_up": 124, "votes_funny": 3, "weighted_vote_score": "0.737985551357269287", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1584887974, "developer_response": "A few things have been implemented to address your cons:\n- Time zone based raiding means you can go to sleep and come back without fear of being raided.\n- PVP combat is far more balanced\n- Full questline campaign.\n- Improved mob AI"}, "118785812": {"recommendationid": "118785812", "author": {"steamid": "76561197980443144", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 24063, "playtime_last_two_weeks": 0, "playtime_at_review": 16534, "last_played": 1710625114}, "language": "english", "review": "I've played this game for nearly 300 hours at this point. I think most of that was in around 2018 and 2020 (100+ hours maybe) and again a little 2022. Between 2020 and 2022 I would say numbers on servers have dropped significantly, but that being said I think the game has a lot to offer. \n\nIt's a GREAT game if you want to design, craft, build in a BEAUTIFUL world setting, whilst a good amount of questing to keep it interesting. A game you can play socially with others while largely getting on and doing your own thing. As the servers are quieter, it's like having a private server while occasionally \"bumping\" into someone. \n\nIn the early times of the game, the slow slow grind was a pain and has now been sorted with Fast and Very Fast servers. This is a game I still come back to time and time again to get some creative energy out of me whilst exploring the large map for new and interesting places to create a home. I particularly like the  atmospheric game noise and music. \n\nNot well suited to those who ant very deep stories and story arcs more like FF14 or WOW etc. or large group raiding continuously. \n\nIt's a great game, still one of my top 10 most played in last 5 years I think.", "timestamp_created": 1657779859, "timestamp_updated": 1657780163, "voted_up": true, "votes_up": 31, "votes_funny": 1, "weighted_vote_score": "0.737149477005004883", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "69771761": {"recommendationid": "69771761", "author": {"steamid": "76561197992278259", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 15120, "playtime_last_two_weeks": 0, "playtime_at_review": 7240, "last_played": 1592052420}, "language": "english", "review": "GREAT SOLO GAME! -/-/\\-\\- THE WORST MULTIPLAYER!\n\nI really enjoy the game. The mechanics are great from crafting your gear, customizing spells, taming monstrous or cool beasts, building amazing great looking structures. Quests, and neat little things to find and explore in the world.\nIt's hours of amazing great fun... for a solo player.\n\nAs a solo player, in 60 hours I have pretty much explored most all the game has to offer in terms of end game content, so if you can pick this game up for 1/2 price I recommend it whole heartedly.\n\nThe problems that can't be ignored are with multiplayer, and those problems come in two flavors, based on the game mode being played...\n\nPVE: Okay with friends. At best inconvenient with strangers.\n1) The content that you played through solo for 60hrs is reduced in challenge and shorter by the addition of your friends. It may be more fun, but you'll be pretty much done with the game in a week, with nothing more to do.\n\n2) If you are on a populated PVE server, playing with strangers, there seems to be a tendency for those strangers to find fun in the game by building their indestructible structures over the top of spawns and resources that a low level player may want access to. This is not a game ender, but very inconvenient, and it takes some of the fun out of the exploration.\n\n3) There is a hard cap on the number of building pieces that can be placed in the world... so the more populated the world is, the more likely it will be to hit that cap.\n\n4) We'll get more into this in the next section, but even in a PVE setting it is very easy for other players to loot farming plots or items on crafting benches while you are AFK. The IRL time commitment to obtain these items makes this very frustrating when it happens.\n\nPVP: Is just not fun.\n1) Power scales rapidly from level 1 - 60, and is very gear-based. After playing for 60 hours on a PVP server, the one combat I was in with a real live person, ended in 2 seconds. They attacked me, I destroyed them with an AoE spell before even knowing it was another player (I thought it was an NPC Sprite). So in the event that you are lucky enough to participate in actual PVP, win or lose, it's not very satisfying for either player.\n\n2) Like PVE, player structures litter the landscape, however these structures are covered with automated turrets that can one-shot a player who has not hit level-cap at long range. These seem to be auto-hostile by default.\n\n3) Building your own structure is great, but even with defenses, it is easy for another player to either glitch into your structure through a wall or sneak in with stealth or breech your defenses.\n\nIt is this weakness that really takes multiplayer for Citadel from \"meh\" to \"the worst\"... the game itself is grindy and very crafty/item based with IRL hours invested in obtaining materials from rare drops or literally ...watching... plants... grow. When playing solo, that progress... feels like progress... when playing in multiplayer avoiding that grind is the main driver for PVP.\n\nWith no leaderboards, no real kill stats, or rewards for killing other players... the prime motivator becomes killing for the sake of looting.  ...but why risk that, when you can glitch into a player base, loot all you want and never put yourself in harms way? ...or deliberately build structures at areas where the environment transitions from one tier of materials to another... so that your auto-turrets can kill players heavy with crafting loot?\n\nThe mechanics of the game drive an incentive system for players to choose not to play competitively against one another directly but instead to exploit the game or the effort of other players, most often while that player is offline or you are.\n\nThis issue also occurs in PVE, but less often... typically with a higher level character releasing a tamed high level monster in a place where low level players reside... waiting for the monster to kill them and then collecting the loot\n\nThe game is fun, but the weaknesses in multiplayer are too vast to be ignored.", "timestamp_created": 1590399673, "timestamp_updated": 1590399673, "voted_up": true, "votes_up": 23, "votes_funny": 2, "weighted_vote_score": "0.737030267715454102", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "39141683": {"recommendationid": "39141683", "author": {"steamid": "76561198025691369", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 35784, "playtime_last_two_weeks": 0, "playtime_at_review": 9065, "last_played": 1630187292}, "language": "english", "review": "This game is still in the baby stages, but has a lot of potential. They have frequent updates and Blue Isle listen to their fanbase. They are slowly improving the game, but there are still a few kinks they should work out:\n\nPros:\n1.BUILDING!!!! Building, building, building! That is what this game is all about! Absolutely love that about this game!\n2. No quest!!!! Since this is a Sandbox openworld game there are no quests and you can freely do what you want (mostly).\n3. Raiding!!!! Raiding has been improved drastically now that you require seige potions to raid.\n4. Flying!!!! You can fly in this game and it is wonderful - no restrictions as to where you can fly and where you can go!\n5. Taming Creatures!!!! One of the largest reasons aside from building is that you can tame ANY creature in the game and ride them around. Specifically dragons!!\n\nCons:\n1. Lag/Network errors: Some people build huge monstrocities which lag out the entire server because everytime you log on it has to load it all over again especially if they have any kind of turret system.\n2. PVP: PVP is difficult because you cannot see the icon/lvl of the person you are fighting.\n3. Spell Bar: You can only have two spells on the item bar and although you can switch out weapons it's a pain in the behind. They've also dummied down a few spells like Telekinesis (Rip structures and doors) and Shadow Blast (used to knock mobs out of the air).\n4. Mobs: For whatever reason there is no specific area in which a certain lvl of mobs roam. You can easily find lvl 30-40's in the start zone making it hard to walk around without dying.\n5. Centering Problems: I am inherently OCD and this is probably the biggest issue I have with the game. A lot of the building is NOT centered. Meaning that if I want to place a window it will not be placed in the center of the wall, but off to the side.\n6. Map Size: Generally large, but when you discover it all and are higher in level the map becomes small really quick.\n\nImprovements:\n1. More building content: They've recently added Marble to the game which was fantastic, but it's about the same as Ornate. I do hope in the future they will add more decorative options because it is very limited.\n2. Deconstructor: This is a pain to use as you have to drag one item instead of an easy \"send all\" button to deconstruct everything.\n3. Trading: Normally you drop the item on the ground, but that is not the saftest option as sometimes the bags will drop \"underground\" to where you loose the bag. There should be a trade window.\n4. Stacking items: In chests this is no problem, but there is no way to grab how many items you want unless it's one by one or you take the ENTIRE stack out, slide the bar (which should be changed to adding the # instead of a sliding bar) to the number you want, DROP it, place whatever is left in your pack back in a chest, then PICK UP the stack you dropped.\n5. Dismissing the Pet: You should be able to dismiss your pet from wherever you are instead of having to meet your pet everytime!\n\nOverall this game is amazing and yes there are a few things that need to be improved, but Blue Isle is definitely trying to make the game more enjoyable with every update.", "timestamp_created": 1515303869, "timestamp_updated": 1515304073, "voted_up": true, "votes_up": 40, "votes_funny": 3, "weighted_vote_score": "0.736980259418487549", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "102974067": {"recommendationid": "102974067", "author": {"steamid": "76561198052574541", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 929, "playtime_last_two_weeks": 0, "playtime_at_review": 929, "last_played": 1637212592}, "language": "english", "review": "As of writing this review this whole game feels... unbalanced and unfinished. \n\nThe game looks nice, but all the post processing in the world isn't going to save this one once it moves. It might stand up to a little scrutiny... in 2011. So lets get to the meat of it. You have 4 faces and 4 hairstyles to choose from, go ham.\n\nThe spell system is a really cool concept and I loved applying unique and modified spells to my various weapons to see how they changed or acted differently and you can apply up to 4 weapons at a time so you can scroll between 4 sets of magic abilities and spells- problem is your magic drains extremely fast and regens extremely slowly so you won't be taking on anything massive without a buff or a group (of Players). I played this completely solo so I had to crank a lot of things up to the 5x area to manage to get anywhere. \n\nProblem number two I noticed right away is that the taming system is... unbalanced? Your tames are so incredibly weak they aren't even worth the effort. You'll be literally wasting mana left right and center trying to keep them alive and frankly you're player character is more effective than they will ever be. They get in the way, they block your spells and they die constantly. \n\nIf you're riding them you can't cast spells from their backs so you are actively discouraged from bothering with the task. Get a broom. It's less of a waste. (Most of the time your pets are going to get stuck on terrain. Small rocks, tiny branches, a 45 degree incline, inside rocks... Just. Just don't.) \n\nThe game does have a main quest but you get blocked every other five feet by this or that. Items you need to complete the quests are frequently in areas 20 or 30 levels above where you're going to be at the time of accepting the quest and guarded by things with AI so deliciously Aim-Botty and wild you'll be lucky to approach alive. \n\nIf the game had it it's way you would spend the first 10 hours of your game killing boars. I'm not kidding. I spent 6 hours running around trying to figure stuff out and do these quests before I even put down a temp home. \n\nAnd that brings us to how insufferably grindy the game is. It's just so bad. Even at 5x so I could pretend I had a group it took forever and trying to explore I went from level 12 areas to level 30+ just across the street and it was awful. \n\nAnimations are not polished at all. Animal, Mob, and Tame AI are not polished. Tames are exactly the same as when you tamed them so they suck at doing anything. Flying tames are useless even for flying around because they die so easy and you can't cast from their backs. Running anywhere is painfully slow even sprinting. \n\nI wanted really badly to like this game because the spell system and the magic system is so damn cool but the rest of the *entire game* drags it down so hard and so far I will likely never play it again. The grind. The useless tames. The tedium of quests not recognizing you already did something. I couldn't even get to the caves and decided I probably haven't missed anything because it'll be the same Dead Brain AI Tank and Spank Watch My Pets Die garbage being int he overworld was. \n\nSave your money. The screenshots are cool and that's about it.", "timestamp_created": 1637214195, "timestamp_updated": 1637214195, "voted_up": false, "votes_up": 35, "votes_funny": 2, "weighted_vote_score": "0.736572027206420898", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "93845829": {"recommendationid": "93845829", "author": {"steamid": "76561198019502894", "num_games_owned": 2695, "num_reviews": 47, "playtime_forever": 3504, "playtime_last_two_weeks": 0, "playtime_at_review": 2995, "last_played": 1624478641}, "language": "english", "review": "-Very low player population. (( 17.06.2021 ))\n\n-Very poor character creation.\n\n-Lack of pve content.Lots of very tiny caves without any other kind of variation.A few world bosses.Boring quests such as kill x amount of that , cook x amount of these.\n\n-Lots of graphical bugs such as sometimes doors replace with walls , hoods show heads for other players or when you gather the resource , it still shows that resource from the distance\n\n-Ground mounts sometimes stuck on trees and such.\n\n-You can only cast 2 different spells unless you carry 4 weapons because only 2 spell usable per weapon.\n\n-Lack of inner decorations.There are very a few to decorate.\n\n-No mod support", "timestamp_created": 1623839463, "timestamp_updated": 1623926905, "voted_up": false, "votes_up": 48, "votes_funny": 1, "weighted_vote_score": "0.736185431480407715", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "37805623": {"recommendationid": "37805623", "author": {"steamid": "76561197983398577", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 3156, "playtime_last_two_weeks": 0, "playtime_at_review": 1038, "last_played": 1610404808}, "language": "english", "review": "I only have about 6 hours in the game thus far so this will be more of a first impressions review, i'll add to it later.\n\n\nFirst off, this is more of an open world RPG then a survival game. There is no food/water meter, no sickness or sanity etc.\nPersonally i find this refreshing, let's be honest, after the first few hours of a survival game food/drink are never an issue anyway, just another chore to do. Plus it's nice to be able to go to the bathroom or talk to my wife for 5 min and not come back to a dead char because i starved to death inside my base.\n\nThis game is like if Skyrim and Ark had a baby. It feels and plays like a coop, multiplayer RPG.\n\nBase building is nice and though i don't have them yet, there seems to be a decent amount of styles.\n\nThe crafting is solid and pretty intuative. \n\nCombat kinda feels like Skyrim. Find a good spot, spam your spells till it starts running at you, back up/dodge while attacking till one of you is dead. Which isn't to say it's easy, most things will kill you in a few hits, at least early on.\nThe AI is lackluster, but hell, even large studios have trouble with this, it's a known issue and should improve over time.\n\nWhile i have experienced a few bugs, i've yet to find anything game breaking or rage quit worthy.\n\nIn general it's a solid game, At the very minimum it's got the bones to be a great game! It's very playable and i'm thoroughly enjoying myself atm. There is end game content arriving at the end of this moth and i'm sure they will only continue to improve and flesh out the game.\n\nOn a side note, i wouldn't put to much stock in the negative reviews. If you actually read them, most are one line throwaways that are probably part of a review bomb. The rest are complaining about bugs... it's an EA game.\n\nThe only legitimate negatives i've read complain about server populations. \n\n1: this will improve as the game gets better and word of mouth spreads.\n\n2: this really only matters on pvp servers. \n    Personally, i hate crowded servers in a game like this. All the good base spots are taken and you have to compete for resources. I prefer to play on a private server, or on a low pop one with a few friends\n\nTLDR: \n\nSolid, stable, fun game even in it's current form. It'll only get better", "timestamp_created": 1511804713, "timestamp_updated": 1511805003, "voted_up": true, "votes_up": 29, "votes_funny": 1, "weighted_vote_score": "0.736013948917388916", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "40433867": {"recommendationid": "40433867", "author": {"steamid": "76561198124704924", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 7734, "playtime_last_two_weeks": 0, "playtime_at_review": 5676, "last_played": 1542881593}, "language": "english", "review": "I'm writing this as of Feb 2018 after playing the game for 2 weeks. I read a lot of comments nitpicking the game, the issues are minor, it's actually a pretty good game. I play PVE, so PVP may be very different.\n\nPros\nlooks good\nprogression seems about the right pace\nbuilding system is one of the best I've seen\ngathering pace is about right\nflying is fun\nmap is a decent size\ncrafting is the right speed\nskill system is basic but well done\n\nCons\nthe AI isn't the best, you can cheese kill mobs\nthe servers are very quiet\nthere is a bit of graphics lag and network lag, not game breaking though\nthis shouldn't be on the list but it is, no way to split stacks of items!\n\nYou could play this casually for a couple of months and do all the content. It's similar to a mainstream MMO, but more of a single player feel with MMO elements. I don't really get why the servers are so quiet, I'm thinking there's way too many and probably a lot of singleplayer only private servers.\n\nWell worth the money you pay, trust me I've bought a lot of steam games that are a buggy unfinished mess, this isn't one.", "timestamp_created": 1519722940, "timestamp_updated": 1519722940, "voted_up": true, "votes_up": 45, "votes_funny": 1, "weighted_vote_score": "0.732123136520385742", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "85858772": {"recommendationid": "85858772", "author": {"steamid": "76561197981614900", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 41376, "playtime_last_two_weeks": 0, "playtime_at_review": 24734, "last_played": 1620356390}, "language": "english", "review": "I would say I've had countless hours of fun, except steam counts them.  Therefore, I'll just say: it's fun.", "timestamp_created": 1612322001, "timestamp_updated": 1612322001, "voted_up": true, "votes_up": 33, "votes_funny": 46, "weighted_vote_score": "0.731758058071136475", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "33869786": {"recommendationid": "33869786", "author": {"steamid": "76561197998050806", "num_games_owned": 0, "num_reviews": 90, "playtime_forever": 4034, "playtime_last_two_weeks": 0, "playtime_at_review": 3755, "last_played": 1617303170}, "language": "english", "review": "This is my first Early Access review. Single player felt empty. I explored the island some, got lost. I died and returned to the start. I decided to build a base and things started to get interesting...\n\nThe enemies roam the land and you can get some pretty interesting visitors and random situations developing as you're minding your own.\n\nThere is no quest system yet and the game lacks progressive content, but the framework is there. The world is enormous with a lot of mystic-like areas that feel like they're part of a bigger picture. The magic is fun and engaging and fits any play style. My only complaint is the complete lack of any sort of dodge, however that's completely negated by the fact there's a blink teleport which is a dodge if you're any good...This game made me feel like a hairy wizard.\n\nI can't wait to see a better char creation with more features and story content....and in the mean time, I'm going to go fly a broom!!!!!", "timestamp_created": 1501291416, "timestamp_updated": 1501291482, "voted_up": true, "votes_up": 55, "votes_funny": 5, "weighted_vote_score": "0.729173064231872559", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "33827360": {"recommendationid": "33827360", "author": {"steamid": "76561198110877684", "num_games_owned": 333, "num_reviews": 12, "playtime_forever": 5959, "playtime_last_two_weeks": 0, "playtime_at_review": 4724, "last_played": 1690833664}, "language": "english", "review": "Citadel: Forged with Fire Review\n=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\nUPDATE 2 (05/08): First week out on EA and the game is steadily being fixed. FPS is much better but there are still issues with PING. Server List Menu has poor functionality but game is now at least playable. Devs have been actively sorting issues out and seem to be off to a good start addressing issues/suggestions.\n\nUPDATE 1: The latest patch has made the game quite unplayable for me atm. I would hold off until the game-destroying bugs are fixed. :)  #fatalerror\n\nI played the beta, so I already have enough hours experience to write this review for the current state of the game (which is what we have to go on, not what could be implemented in the game).\n\nOverall, I love the concept of this game. A sandbox mmo with the feel of a better Rust, a little more optimised Ark (I can actually get on and play, although I did notice there are a number of folks having issues with fps) and all without the survival elements that make those games very tedious - you don't have a stamina bar that requires you to rest, you don't have to drink or eat to satisfy thirst and hunger. Massive plus.\n\nBuilding:\n=-=-=-=\n\nThe building in this game allows your creativity to flow, in a similar style to Rust building placement. This with more creativity and with more options, without the really horrible, tedious Ark building system (where you have to craft the items first, then drag those items into hotbar for placement). No, this game allows you to have the regular and traingular foundations BUT ALSO rounded walls for higher tier building. Building is now fun for me.\n\nBugs and Issues:\n=-=-=-=-=-=-=-\n\nThat said, there are a number of issues in its current state. It takes a while to find a server that isn\\t full and there isn't nearly enough EU servers. There are a ton of US servers so you have more options. Enemies are buggy, they often become static when attacked which doesn't provide any significant challenge. 40 player limit (for now) and not enough servers means, at least on launch day (and as was the case for beta), waiting a while to join a server that is best for your region and even then, there were network issues on a few servers (your ping will be advertised as 100 but jump to 1000 when joined). \n\nThe game is buggy, but it is not unplayable when you eventually find the right server for you and the experience is very rewarding, even in its current state.  I don't have the beefiest of pc's compared to current gen, I sport 16GB RAM, GTX970 and i5-6500. And the game averages 40 fps at high settings. Although there are dips at times to the 20s.\n\nConclusion:\n=-=-=-=-=\n\nAlthough this review is for the current state of the game, I am hopeful that things will continue to improve with a host of bug fixes and I am happy to contribute to this Early Access title because I love watching games, with genre's I like, grow and develop, with a small voice that may or may not get to influence change to form a game that I truly love.\n\nThat's as honest as I can be. :)", "timestamp_created": 1501145722, "timestamp_updated": 1501917016, "voted_up": true, "votes_up": 43, "votes_funny": 3, "weighted_vote_score": "0.728442728519439697", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "36340887": {"recommendationid": "36340887", "author": {"steamid": "76561198021384510", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 961, "playtime_last_two_weeks": 0, "playtime_at_review": 886, "last_played": 1572958475}, "language": "english", "review": "Baught this game recently even after reading the reviews and im glad i did.  \n\n\nFirstly --\n\nYou get to fly on a freaking broom!!!! what more do you want\n\nOf course its early access so i expected bugs and crashes and lag and so on.  Happy to say so far i have had none of these issues.\n\nThe game play is fun, i really like building system and the combat system is pretty fun. Im not high level yet o i cant comment on pvp.\nActually love the game world its a very pretty game, though maybe the character creation could be a little more in depth. \nThe actually game world is really nice. The mobs are actually working well, other EA games ive played have very buggy mobs or broken mobs that do nothing.  \nIn this game mobs runtoo youand attack, otehrs run away, trolls (ogres?) thorw rocks at you if you are flying about. And these were just mobs in the starter area i havent made it to any high level mobs yet. \nI tamed a deer, the taming system seems pretty fun cant wait to try more animals and see what else i can catch.  \n\nMy only real cons so far is that the games population is pretty small.\nI would really like thr devs to market it more, offer some free weekends, permenantly reduce the price while its in EA, do some dev streams. Get people interested.  \nIf it wasnt for my madness of looking at nearly every game on steam i wouldnt have found Citadel and thats a problem.\n\nI dont regret spending money on it at all but i have friends who would play but not at the current cost / state so they wait for sales. If teh price could be lowered or free trials given then maybe we can all help the gaem grow,\n\nDid i say you get to fly a broom?", "timestamp_created": 1510054386, "timestamp_updated": 1511607246, "voted_up": true, "votes_up": 36, "votes_funny": 3, "weighted_vote_score": "0.727864086627960205", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "55794376": {"recommendationid": "55794376", "author": {"steamid": "76561197977731571", "num_games_owned": 0, "num_reviews": 28, "playtime_forever": 256, "playtime_last_two_weeks": 0, "playtime_at_review": 256, "last_played": 1572022607}, "language": "english", "review": "It's...bland.\n\nIt's basically a Rust/Ark/Conan Exiles game, with some changes, a VERY interesting idea, the spell creation, but riddled with a semi-bland atmosphere, some annoying 3rd camera issues, super grindy and unfulfilling resource gathering, topped with bland animations. Jumping isn't great, but swimming is downright bad, in terms of animation.\n\nGraphically the colours are there, but they are slighly garish.\n\nAlso the map, or at least what I saw of it, didn't feel interesting.", "timestamp_created": 1572072403, "timestamp_updated": 1572072403, "voted_up": false, "votes_up": 79, "votes_funny": 2, "weighted_vote_score": "0.724784791469573975", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "100863130": {"recommendationid": "100863130", "author": {"steamid": "76561198200903390", "num_games_owned": 131, "num_reviews": 3, "playtime_forever": 2383, "playtime_last_two_weeks": 0, "playtime_at_review": 2383, "last_played": 1612731424}, "language": "english", "review": "Extremely fun with lots of potential, but when there is no system to prevent the max leveled players from roaming into the lower level players region and destroying them all there's no incentive to even try. They already have borders in place that determine level requirements suggestions for fighting the AI. If they could also scale down higher level players for leaving the higher level areas it would make it a much fairer fight for the lower levels just trying to get started.", "timestamp_created": 1633897849, "timestamp_updated": 1633897849, "voted_up": false, "votes_up": 39, "votes_funny": 5, "weighted_vote_score": "0.720849454402923584", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "38712308": {"recommendationid": "38712308", "author": {"steamid": "76561197970997894", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 16195, "playtime_last_two_weeks": 0, "playtime_at_review": 8942, "last_played": 1666365889}, "language": "english", "review": "I don't usually write reviews, but I feel that there are a lot of unfair and/or misleading reviews left for this game which I would like to address.\n    -This is an early access game and as such suffers from some bugs and glitches that can negatively impact your in-game experience. I have seen NPC clipping, texture smearing of both terrain and NPC skins, crafting menu glitches that require you to log out and back in, and slightly inconsistent NPC aggro ranges. Try to keep in mind that this is a fairly new game, it is in early access and honestly, for how young it still is, it is in pretty good shape.\n    -This is a slightly grindy game, but that can be adjusted by simply cranking up the player XP multiplier when creating your game session or server. The amount of resources required to create things (gear, consumables, and buildings) scales well as the complexity of the items increases during the course of you leveling your character. Very rarely have I experienced a problem obtaining the required materials to craft a piece of gear or new structure for my base. The overall level of grind to get to that feeling of being powerful is a little high at first, but evens out as your u become familiar with the way the games world works.\n    -The powers that are currently available are fun, but will eventually require some rebalancing due to the fact that I can ride a broomstick around and kill pretty much anything I want from relative safety. The different weapons offer some variation in gameplay style and certain powers are only available for specific weapons (which is a nicely executed way of preventing someone from becoming an uber-wizard-god).\n    -The building system is easily one of the best parts of this game, the mouse controls are very intuitive and there are a lot of choices when building your base. There are multiple types of materials that you can choose from, each offering some benefit over the other (obviously the higher-tier materials are better for their HPs but require A LOT of preparation to obtain). It would be nice to be able to build a structure that hangs underneath an overhanging rock formation, but that is really the only negative thing I can say about this part of the game.\n    -A lot of users complain about crashing and overall performance issues. I run this game at the lowest possible visual settings because my laptop is from 2014, and I have only had it crash three times, all of which happened within the first two hours of me opening the game. I am not saying that it is perfect, but I wouldn't take performance issues into consideration when trying to decide on buying this game, just be smart and know your computers limits. If you are having crash-issues, try lowering  view distance or turn down the shadows at least until the game gets some more stability/optimization updates.\n    -Some people are having community issues and write negative reviews based on that. This is not a valid complaint to have about any game that has a PvP aspect. What people do in games is not governed by the developers, but their is a responsibility on the devs part to make their intentions known to the players as far as the type of gamer interaction they are attempting to foster in their games. With Citadel, there is an incentive to attack another players base which is pretty much standard in any base-building game, on any platform. The best way to play this game is with a friend or group of friends, multiple players can tackle harder obstacles earlier, which enables the players to level up faster. Furthermore, multiple players, working together can build a much bigger, much better base more efficiently. Having said that, I have logged some solo hours and enjoyed flying around, killing monsters, and exploring the map on my own.\n \nI hope that this review has been helpful and informative. I am enjoying this game very much and I am looking forward to seeing better reviews and continuing support from the devs and the community to help this game live up to its great potential. If you are still cautious, put it on your wishlist and wait for a sale!\n\n[Updated Comments as of 21 Nov 2018]\n\nSo here we are quite some time later and the developers are continuing to add features and balance systems and items in the game. It is a little underpopulated and the PvP servers are not fun at all if you are solo. Best advice here would be to join a House (guild) if you're playing on a PvP server. Otherwise, the PvE servers are a little more friendly and less stressful if you are looking to learn about the game and its mechanics without the fear of losing everything you own to someone else while you are offline.\n\nMy previous closing statement still holds true, add it to your wishlist and when it goes on sale buy a few copies for you and your friends because it is a good time when you have people you know to play with.", "timestamp_created": 1514322866, "timestamp_updated": 1542868852, "voted_up": true, "votes_up": 40, "votes_funny": 0, "weighted_vote_score": "0.719884097576141357", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "34385829": {"recommendationid": "34385829", "author": {"steamid": "76561198045734310", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 2065, "playtime_last_two_weeks": 0, "playtime_at_review": 1938, "last_played": 1506705507}, "language": "english", "review": "The developers took a wrong turn with raiding... Only level 35 players can raid bases... and we are now defenseless again their \"5000%\" seige spells... and you cant even try to get your stuff back until you have these spells aswell. WILL CHANGE REVIEW WHEN THEY FIX THIS.\n\n*UPDATE*\nDevelopers checked siege spells to level 15 for the lowest one. I put in some research and I still find this to be a very very poor choice. The items needed for one of these attacks means you have to kill 3 dragons. No level 15 is going and killing dragons. So my review stands. Except where I thought it would be a few level 35's running around griefing, it turns out servers are run by houses of lvl 45 and above going around destroying all structures (and killing all dragons to get seige spells). Which they still might try to do without the spells but it would take much longer and they wouldn't have the ability to destroy entire bases as easily. I did find out however that stone holds up a little better against these spells. I was talking to a lvl 45 griefer and he recommended just letting them blow up my wood houses until I was high enough level for stone houses. BS\n/endrant\n\nBottom line:\n-Seige spells remain bad\n-lvl 15 can't hunt dragons\n-clans of lvl 45+ run servers\n-we just have to listen to the stonger players until we can hide in our stone bases... and MAYBE they wont use their endless supply of seige spells that they got from killing all of the dragons in the server to kill our bases.", "timestamp_created": 1503279549, "timestamp_updated": 1503595488, "voted_up": false, "votes_up": 54, "votes_funny": 1, "weighted_vote_score": "0.719581842422485352", "comment_count": 13, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1584888540, "developer_response": "Raiding has been overhauled since the time of this review.\n- Siege is level 30 now.\n- There are also raiding time-zone based restrictions so players can sleep\n- Spells are more balanced and encourage structure-based siege investment such as siege turrets and raider's stones."}, "49055232": {"recommendationid": "49055232", "author": {"steamid": "76561197973193893", "num_games_owned": 0, "num_reviews": 105, "playtime_forever": 7683, "playtime_last_two_weeks": 0, "playtime_at_review": 7371, "last_played": 1563836920}, "language": "english", "review": "This game has potential, but the dev process is terrible. Based on comments from others, over a year ago the game was virtually bug free. Since I got it, every update takes out content and introduces more bugs. The updates are followed up by \"hotfixes\" which break even more stuff. Right now the game has several gamebreaking issues that make it unplayable.\n\n- Stuttering is a problem, you feel a microstutter whenever you switch weapons (which is during virtually every battle). You also feel it every time you try to run/fly anywhere.\n- Unexplainable building decay. Decay should only happen when you don't have a throne attached to your building, yet this is getting worse with every update to a point that right now random parts of your buildings just vanish. On my server most people lost their throne, meaning their building was free to be looted by anyone or worse, someone can just put down their throne and take over the building.\n- Enemies have a really long spawn delay. The world is essentially empty. Whenever you enter a new area you need to camp there for 5-10 seconds before mobs face spawn in front of you. You can't look for dragons to tame while flying around because they don't spawn unless you stay in the area for a while. The same is true for any other enemy.\n\nThe dev has serious issues. If you dare point out that the updates make things worse and list out the issues, you just end up getting banned from the hub and your posts deleted.\n\n@SOuNDSNC you may have failed to notice, but other people agreed with the issues and the need to change the current patch process where untested patches are continuously released and break the game further. We want to see the game get better, but you are currently rolling downhill blindfolded.", "timestamp_created": 1550417569, "timestamp_updated": 1550423651, "voted_up": false, "votes_up": 43, "votes_funny": 3, "weighted_vote_score": "0.717415690422058105", "comment_count": 10, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1563995628, "developer_response": "Just want to clarify that none of the issues mentioned in this post exist in the current version of the game. Our patch process has also been modified with additional checks to ensure less issues crop out in our releases."}, "125123626": {"recommendationid": "125123626", "author": {"steamid": "76561198162634156", "num_games_owned": 0, "num_reviews": 21, "playtime_forever": 6269, "playtime_last_two_weeks": 0, "playtime_at_review": 6269, "last_played": 1621290767}, "language": "english", "review": "Game could have been great but the devs gave up on it and didnt let modders do there thing. shame. game is dead as hell and it could have been as big as valheim and Ark.", "timestamp_created": 1667856928, "timestamp_updated": 1667856928, "voted_up": false, "votes_up": 39, "votes_funny": 1, "weighted_vote_score": "0.716512978076934814", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "42570373": {"recommendationid": "42570373", "author": {"steamid": "76561198070828583", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 160, "playtime_last_two_weeks": 0, "playtime_at_review": 160, "last_played": 1501298179}, "language": "english", "review": "Paid full price for half a game when it released. Fine, I thought. I'll come back next year. Here I am. Still half a game. Do not recommend in current state.", "timestamp_created": 1528434923, "timestamp_updated": 1528434923, "voted_up": false, "votes_up": 83, "votes_funny": 10, "weighted_vote_score": "0.715514302253723145", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1584888053, "developer_response": "We've exited early access now; I recommend giving the game another whirl."}, "33936181": {"recommendationid": "33936181", "author": {"steamid": "76561198329654314", "num_games_owned": 73, "num_reviews": 4, "playtime_forever": 2439, "playtime_last_two_weeks": 0, "playtime_at_review": 2119, "last_played": 1641335164}, "language": "english", "review": "I'm usually super critical of games, specially 20$+ early access titles, but im going to drop a recomend on this title. Here's why:\n\n I fell like this game has massive potential. If you're into survival sandbox types like Ark or Rust this is a must watch for your list. My first day pulled me into a no life 15 hour grind fest. And yes it is a bit of a grind fest, BUT the progression is rewarding enough that it doesn't feel stale or boring. The map is HUGE with plenty of exploring and discovering to be done. Of course there are the various early access problems you encounter with most rushed to market titles. server issues are abundant, the AI is a bit underwhelming, raiding needs huge balances, and more items and spells would deffinitley be a welcome sight. \n\n All of that aside the main reason im actually giving my thumb of approval on this title comes down to a few simple thing. \n1) the game brings a whole new dimension and feel to the \"survival sandbox\" genre.\n2) even with the issues it has it still managed to draw me into a no life session consuming an entire day.\n3) and most importantly in the 4 days this game has been there have already been multiple patches trying to adress some of the issues i mentioned above. The devs seem to legitamitley care for our experience in this game and seem like they are going to put in the effort to take it where it needs to be.", "timestamp_created": 1501535816, "timestamp_updated": 1501535816, "voted_up": true, "votes_up": 30, "votes_funny": 1, "weighted_vote_score": "0.71189582347869873", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "43923861": {"recommendationid": "43923861", "author": {"steamid": "76561197970600995", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 3396, "playtime_last_two_weeks": 0, "playtime_at_review": 3383, "last_played": 1600593843}, "language": "english", "review": "Picked up this game with the release of the new update not really knowing what to expect given some of the negative reviews.\n\nI'm pleasantly surprised and really enjoying the game. Playing with my partner on a PvE server.\n\nIt's a cross between ARK, Dark and Light & Harry Potter. Essentially a sand box server based MMORPG with a strong focus of spellcasting and building. It doesn't have typical survival elements like hunger / thirst / temperature but requires you to manage your health and mana levels. Most games would have these regenerate naturally but not Citadel. You need to craft meals, potions or find \"mana pools\" to keep your spell force topped up. \n\nIt is level based, with each new level allowing you to spend skill points to unlock new blueprints for items, weapons, armour, meals and building parts. The spellcrafting system is quite fun requiring you to combine various essences (dark, light, nature, storm, etc) with your weapon and different magic schools to determine what spells you can use. You can then supplement these essences with other materials found in the game (such as herbs) to boost the spells power.\n\nThe building has so far been quite easy to get to grips with but there are relatively expensive material costs. I see people have been screaming about 55 wood for a basic platform. It really isn't that much compared to the grind in some other games and I think we managed to get a nice wooden cottage sorted in about an hour. It gives a sense of accomplishment without alienated solo players.\n\nThe graphics are pleasant and I've had no FPS issues at all. Very smooth.\n\nFor the current price it is a bargain and I forsee me spending a lot of time on this game. \n", "timestamp_created": 1533371276, "timestamp_updated": 1533371276, "voted_up": true, "votes_up": 28, "votes_funny": 2, "weighted_vote_score": "0.710908949375152588", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "43143080": {"recommendationid": "43143080", "author": {"steamid": "76561198041515031", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 9257, "playtime_last_two_weeks": 0, "playtime_at_review": 9257, "last_played": 1525263110}, "language": "english", "review": "Citadel: Forged with Fire development team seams to be more focused on cosmetic additions rather than expanding the rudementary gameplay. I have played for 150 hours, and the majority of that time has been dedicated to building. If I were to have spent that time doing anything else, I would probably have less than 10 hours in game.\n\nThe crafting/construction system works fairly well, I found it more polished than Ark was in its earlier iterations. It works well enough.\n\nIn a game that is supposed to capture fantasy and magic, was the building/crafting system what drew you toward this title? For me it was not. It was the hope of a engaging and diversified magic system with the added bonus of crafting.\n\nCombat is a joke. You can bind 2 spells to a weapon, and have the ability to hot swap to another. In total that means you have access to 4 spells on command. There is nothing enjoyable about alternating right-click/left-click until a mob dies. The devs could have spent time working on a magic system akin to Magicka or Gauntlet or Invoker(DotA2) but instead we have right-click/left-click spam. Good choice devs /s\n\nSkip this one. It's not worth the ticket price.", "timestamp_created": 1530232734, "timestamp_updated": 1530232734, "voted_up": false, "votes_up": 33, "votes_funny": 2, "weighted_vote_score": "0.705319404602050781", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "78850593": {"recommendationid": "78850593", "author": {"steamid": "76561198074137981", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 35869, "playtime_last_two_weeks": 0, "playtime_at_review": 28790, "last_played": 1673917203}, "language": "english", "review": "This game was fun but now its over ran by cheaters and exploiters. We tried reporting them but the Devs clear have stopped monitoring the game", "timestamp_created": 1604707704, "timestamp_updated": 1604707704, "voted_up": false, "votes_up": 58, "votes_funny": 1, "weighted_vote_score": "0.704462230205535889", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1607365379, "developer_response": "Hi there lokixcrow, I'm sorry you think that the dev team has been lacking in support, I can assure you we've been dealing with all cheating and hacking reports. If you'd like to submit a report about players abusing the system we would love for you to open a ticket in the Discord so we can take action against these players. \n\nhttps://discord.gg/t3BgfPT"}, "59965761": {"recommendationid": "59965761", "author": {"steamid": "76561198253554404", "num_games_owned": 128, "num_reviews": 12, "playtime_forever": 40924, "playtime_last_two_weeks": 0, "playtime_at_review": 40897, "last_played": 1577921974}, "language": "english", "review": "Do not buy this game look at my hours all that work can be taken from you in minutes due to exploiting or shitty mechanics.", "timestamp_created": 1576514108, "timestamp_updated": 1576514108, "voted_up": false, "votes_up": 58, "votes_funny": 3, "weighted_vote_score": "0.702394366264343262", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1584888382, "developer_response": "We have fixed every exploit brought to us and are not currently aware of any exploits at the time of this response."}, "72756182": {"recommendationid": "72756182", "author": {"steamid": "76561197982065119", "num_games_owned": 228, "num_reviews": 24, "playtime_forever": 10967, "playtime_last_two_weeks": 0, "playtime_at_review": 10707, "last_played": 1613334110}, "language": "english", "review": "Needs more advertising. The player base is VERY limited. Would LOVE to see more people.", "timestamp_created": 1594851804, "timestamp_updated": 1594851867, "voted_up": true, "votes_up": 24, "votes_funny": 1, "weighted_vote_score": "0.702202498912811279", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "43998717": {"recommendationid": "43998717", "author": {"steamid": "76561198033510015", "num_games_owned": 0, "num_reviews": 41, "playtime_forever": 4612, "playtime_last_two_weeks": 0, "playtime_at_review": 4563, "last_played": 1558834534}, "language": "english", "review": " Guess they gave up? Abandonware.\n\n--------------\n\nReview below is old, haven't played in a long time. But I have seen them updating often enough that I would consider it reasonable effort, so I'm changing my review to give them the benefit of the doubt.\n\n Will actually update review when I give a shit enough to reinstall. #LazyAF\n\n--------------\n\n\"Citadel - Reignited\"? More like \"Citadel - Extinguished\"\n\n So let me get this right, you've added Quidditch, You've revamped the spell system, but you still haven't fixed mob AI? Grinded to 20 just hitting stuck mobs in caves on official in no time, just dumb.\n\n Then to top it off you took a building system that people enjoyed and turned it into another survival game grind to build anything? \n\n What the hell were you thinking?\n\n Fix what you have, then revamp/expand. Start at the core, don't make wild changes when what you already have doesn't work. Don't change things people like, what sense does it make to take something you did right and change it? Because you want people to work together? WE'RE WIZARDS, we're shut-in recluses that think everyone else is trying to steal our magic, we don't want to work together.\n\n Spell revamp is cool, interesting idea, \"Lets give them the illusion of depth, that'll work\". Where did the cool spells go? The spells that made me purchase this game in the first place? I get it, things don't always work out, sometimes the situation changes. But don't give me some old ass crunchy bread with tomato sauce and cheese on top trying to call it a pizza. Add a real spell crafting system with some depth, or go back to what you had. Essences should be able to be combined for next teir spells, I know this, everyone else knows this, you knew this. Don't be lazy. \"Explore the art of spellcrafting\", explore what? 42 spells, that is the total amount of spells. 42. The entire game is about magic, and you give me only 42 spells? That's just insulting. Ain't nobody told you to choose wizards as your theme, you made your own bed with that one. Anything less than 112 spells is a joke, when the ENTIRE GAME IS ABOUT WIZARDS.\n\n What is this, Minecraft? All my shit constantly breaking, my spells breaking, my armor breaking, my weapons breaking... How many god damn things do I need to be running maintenance on around here? Whole damn place is falling apart around me, gotta craft a whole new set of everything just to leave the damn house. If you're gonna make me buy a whole new outfit every time I leave the house the least you can do is give a girl some money. (Stop trying to nerf resource gathering, where the hell did all the metal nodes go?)\n\n I've said it before and I'll say it again, I'm a fucking Dragon riding, Mythic Armor wearing, Element weilding force of fucking nature. Why the hell am I still gathering shit 1 or 2 at a time with a piss ass nature spell when I can smite Balrog?\n\n Take a step back, look at this project as a whole, and fix yo'selves. Ya'll need some gaming Jesus up in here.\n\n Rydel is O-U-T this ma'fucka.", "timestamp_created": 1533725812, "timestamp_updated": 1656289797, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.700564146041870117", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "97330942": {"recommendationid": "97330942", "author": {"steamid": "76561198061954870", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 3587, "playtime_last_two_weeks": 0, "playtime_at_review": 3587, "last_played": 1628649964}, "language": "english", "review": "I could write about the ultra-glitchy creature AI (\"Oh, I can't catch that speedy mage?  Set course for the other side of the planet!\"  \"Master is healing me?  Freak out and run away!\"), the depressingly small array of spells after various reworks, the incomprehensible \"quest\" design (\"I need you to go kill a bear five hundred miles away then come back here\"), and the lack of anything resembling a real story to the \"main quest\" line.\n\nInstead, I'll just note how the devs have decided that anyone who joined a sparsely-populated PvE server to enjoy with a few friends, who has spent hours building up and was just about to hit 60 and start enjoying the high-end stuff needs to get screwed and have to start all over on an intentionally more crowded server.  Nevermind giving them nothing in exchange for nuking all their time and effort thus far and throwing them in with servers THAT ARE ALREADY THE MOST FULL.  At least they gave a little advance warning so I can stop wasting my time now.", "timestamp_created": 1628650447, "timestamp_updated": 1628650447, "voted_up": false, "votes_up": 34, "votes_funny": 1, "weighted_vote_score": "0.700501203536987305", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "56170470": {"recommendationid": "56170470", "author": {"steamid": "76561197996763508", "num_games_owned": 0, "num_reviews": 29, "playtime_forever": 2430, "playtime_last_two_weeks": 0, "playtime_at_review": 803, "last_played": 1573150752}, "language": "english", "review": "The game still needs work. Specifically the models and animations. The crafting is pretty solid. The pet system works but it's buggy - My main gripe is when you have more than 1 following you, they tend to stack on top of each other. Making it hard to select one to give a command/use as a pack animal. Horses look too small to be rode so after you tame one it's like andre the giant riding a pony. Sometimes after you fully mine a node and it disappears, it will re-appear as you walk away, only to disappear when you get close to it again.\n\nThe game is coming along nicely but still needs work.\n\nToday after I cleared an orc camp one of my direwolves stood in the fire while I was looting/not paying attention and subsequently killed itself.", "timestamp_created": 1572626674, "timestamp_updated": 1665856098, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.700417995452880859", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "33879783": {"recommendationid": "33879783", "author": {"steamid": "76561198106858785", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 6042, "playtime_last_two_weeks": 0, "playtime_at_review": 5486, "last_played": 1556483365}, "language": "english", "review": "Suprisingly good for an early access title. \n\nThis is basically Ark + rust, set in medival times with wizards. What more could you possibly want. \n\nSandbox with rpg aspects, its basically my dream game. \n\n3 patches in 2 days to fix bigs and add content, its looking positive!", "timestamp_created": 1501331461, "timestamp_updated": 1501331461, "voted_up": true, "votes_up": 49, "votes_funny": 5, "weighted_vote_score": "0.698958456516265869", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "129075925": {"recommendationid": "129075925", "author": {"steamid": "76561198064936037", "num_games_owned": 271, "num_reviews": 17, "playtime_forever": 8257, "playtime_last_two_weeks": 0, "playtime_at_review": 8104, "last_played": 1712014183}, "language": "english", "review": "Great game , needs devs to wake up and see what they have in front of them!\nCould do soo much with this goldmine", "timestamp_created": 1671778697, "timestamp_updated": 1671778697, "voted_up": true, "votes_up": 17, "votes_funny": 3, "weighted_vote_score": "0.69873201847076416", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "140167111": {"recommendationid": "140167111", "author": {"steamid": "76561197984829540", "num_games_owned": 254, "num_reviews": 6, "playtime_forever": 6606, "playtime_last_two_weeks": 0, "playtime_at_review": 6524, "last_played": 1686959286}, "language": "english", "review": "Do not bother with this game it is dead. \n\nIt had potential and was completely wasted.\n\nThe concept is great but the execution is bad in multiple areas.\n\nThe Spells are lackluster:\nThe spell creation process had some good ideas like the spell essences and harvesting and amplifying them but instead of making a spell book they linked the spells to weapon types which is not only redundant in some cases but utterly useless as well. You can equip four weapons and each one has 2 spells on it instead of just having one weapon and a hotbar of spells from 1-8. The spells themselves are small variations on each other and poorly designed. Don't expect anything big or satisfying like Dragons Dogma or anything where you can construct your own unique spells. It's all so bland that you just end up left clicking dark bolt with 5 bones in it.\n\nThe Building has issues:\nNot so much in the actual process of building the structures but with the lack of limits and how they work in PVP. The mana node system is just poor. It used to be lines and is now bubbles but would be much easier to use if the power was just an on/off icon above the mana using items. The structure damage and raiding times are both badly designed systems imho. Just have it so you can always pvp on a pvp server and make the game with that in mind so you can set up defences when not online. The raid damage bubble thing is stupid. So is the potion to make your spells do structure damage. Why couldn't they have made actual spells for the purpose of damaging structures? There is also the issue of walls being placed across the map on PVE servers. Have some build limits. Like a build limit slider for how many blocks squared a base can be.\n\nThe Map and Dungeons, plus loot:\nCreature variety is very limited compounded by the world being largely empty and the dungeons being rather small linear affairs. The POIs like camps and caves are unimpressive to say the least. The map itself is fairly big though and has some great vistas and if fun to explore while flying around. The loot you get is all RNG and is useless junk a lot of the time. Compounding the RNG loot issue is the fact that even the stuff you craft is all RNG and feel like a horrible way to do that system. Just let me make epic stuff with the materials and make it cost more or something. The loot was awful and so was crafting it.\n\nTaming:\nA great concept but when you actually do it is just annoying and the creature variety is woefully small. You can also only have 4 tames and 10 stored. This system feels like it never got fleshed out and was just half baked. The abilities for the mounts are laughable too. This doesn't even come close to something like Ark. Even the act of taming something is hoping you get a dragon that stays on the ground and gets stuck or use the terrain to make it get stuck and then wait forever clicking your tame spell after beating the thing to low health. The entire process process is monotonous and unsatisfying. Your a wizard of great power why not just be able to summon powerful creatures? You could have put in necromancers who create minions too. Just bleh.\n\nThe entire game is like playing in a huge sandbox barely filled with sand to the point where patches of it are just no sand at all while wielding an old stick as a wand and wearing a bath towel as a cape and pretending to be a wizard in a magical world.\n\nAfter playing games like Ark, Conan Exiles, and many others this has to be one of the worst survival games and it's an absolute shame since I love the wizard and fantasy theme behind it.\n\n \n\n", "timestamp_created": 1686933972, "timestamp_updated": 1686933972, "voted_up": false, "votes_up": 22, "votes_funny": 0, "weighted_vote_score": "0.697270512580871582", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "35477312": {"recommendationid": "35477312", "author": {"steamid": "76561197986641201", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 205888, "playtime_last_two_weeks": 0, "playtime_at_review": 51583, "last_played": 1623210862}, "language": "english", "review": "After nearly 900 hours playing the game, I'm uninstalling it today.\n\nI did enjoy my time in the game for a (long) while, and I feel I have had my money's worth from it, but am now unwilling to give it any more time, for reasons as follows;\n\nAlthough I have played many early access games, and I understand the nature of early access games, what I cannot tolerate is a heavy handed approach from developers who can't see the faults with their project and treat their customers unfairly, in any way.\n\nWhen the game, after the last few patches, became too unstable to enjoy any more, I started to post on the forums here, about both my specific problems, and my suggested remedies on how some of the issues might be addressed.\n\nAt no time was I rude. Being British I have no need to be rude to get a point across, I can be scruplessly accurate instead in my native language. The two developers I had reply to my threads both responded quickly, a point in their favour, but likewise both their replies weren't really to do directly with the points being raised, so ultimately useless.\n\nFor me, the game is broken now, I am unable to play for more than a few minutes at a time without some UE4 exception fault or another happening and crashing out the game.  I asked in one thread for help or at least advice on how I might remedy the problems introduced with their last 3-4 patches, and got none.\n\nIn the other thread, I identified for them how seriously underpowered their game servers are, leading to a terribly sub-par experience on the only European pvp server left with ANY population left worthy of the word. All the others having 0, 1, or occasionally 2 people left playing. The second developer tried to refute this, but didn't offer any quantifiable data to back up his insistance that things were fine, when they are quite obviously not.\n\nWhen lightly pressed for some kind of specifics as to the actual specifications and supposed requirements of a server for this game, I was left ignored.\n\nIn the end, my comment to him was exactly this \" Steam numbers down 90% in last month. GG Denis.\" This was making the final point that if everything was fine as he espoused, then people wouldn't be leaving the game faster than rats during a building burning.\n\nThis comment got me banned from their forums for being \"unnecessarily rude\".\n\nThis game is broken in its current form. The developers, such as they are, seem unable to fix it, and unwilling to acknowledge how broken it is.\n\nThere is no end-game past leveling to lvl60. There is no meaningful pvp left, just offline ninja-raiding. This has turned the end-game into a tower defense game instead, but to build anythig that can survive in your absence overnight against even 1 or 2 determined players is ultimately self-defeating as the servers they use can't handle their sub-standard, laughably optimised, buggy coding.  If you build something that can survive such a ninja-raid, then the game breaks.\n\nGG Denis.", "timestamp_created": 1507139888, "timestamp_updated": 1507139888, "voted_up": false, "votes_up": 128, "votes_funny": 12, "weighted_vote_score": "0.696455717086791992", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "33888410": {"recommendationid": "33888410", "author": {"steamid": "76561198023307252", "num_games_owned": 112, "num_reviews": 21, "playtime_forever": 1248, "playtime_last_two_weeks": 0, "playtime_at_review": 1069, "last_played": 1543789861}, "language": "english", "review": "I wasn't gonna leave a review yet, but I have some things to say that I believe are relevant if you are considering buying this game right now:\n\nFirst of all, the biggest issue this game has is that people are leaving negative reviews on an EARLY ACCESS game solely because the game has some server issues or bugs, which are being fixed DAILY by the devs. Every day this game has been out so far it has received a patch aimed at fixing it's issues and stability. The devs obviously care about this game and plan to make it work.\n\nBuying an early access game and giving it a negative review for the reasons mentioned above is like getting what you asked for on Christmas but throwing it away because you didn't feel like unwrapping it. This game has been fun and interesting in the little bit of time I have played it and I can tell it has a lot of potential, not just because of the concepts and features in it but again, because the devs care about it.\n\nI personally am glad I bought into the TESTING EXPERIENCE so that I have the chance to help this game become as good as possible by giving feedback and helping the devs out as much as possible. If this isn't your intentions when buying into an early access game, you probably shouldn't buy early access games. I could see negative reviews being appropriate if the game just had bad ideas or things in the game weren't making sense or fun (assuming you could play it without server issues or bugs), but almost all of the negative reviews are just people complaining about the server issues and bugs, which if I had to guess will be fixed soon and I highly doubt those people will change their reviews after that happens.\n\nIn the end, if your PC meets the spec requirements and you want a game as described on Citadel: Forged with Fire's store page, and to be a part of it's development process, then this early access game is probably for you.\n\nI personally highly recommend this game, as I see nothing bad about it. Just an early access game having a rough start but also has a lot of potential and will be a lot more fun once the bugs and server issues are resolved.\n\nI will say if you want to jump in an enjoy it right away, as I originally did, that might not happen due to the issues I've experienced. However you may have a different experience than me and right now I am waiting for some more fixes and patches, but I am still very optimistic about this game.\n\nEDIT: I'd also like to mention, since a lot of people are comparing Citadel: Forged with Fire to survival games, that this is NOT a survival game. You won't die no matter how long you stand around, unless something attacks you. There is no \"food\" or anything like that. There is however health and mana potions you can craft, but that still doesn't make it a \"survival game\".\n\nWhat you actually end up doing is farming experience and crafting materials while also unlocking spells, building shelter, crafting gear and exploring/fighting enemies/looting.\n\nI have played this game a bit more since I originally posted my review, and the more I play the more it seems I am enjoying this game.\n\nEDIT: this review is still relevant. People still haven't a clue what \"early access\" is meant for.", "timestamp_created": 1501356998, "timestamp_updated": 1501700389, "voted_up": true, "votes_up": 28, "votes_funny": 2, "weighted_vote_score": "0.693368017673492432", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "102743907": {"recommendationid": "102743907", "author": {"steamid": "76561198060665470", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 4799, "playtime_last_two_weeks": 0, "playtime_at_review": 4799, "last_played": 1614137547}, "language": "english", "review": "I immensely enjoyed this game. Me and my girlfriend played it together in basically every spare moment for a solid few months. The only reason we stopped playing is that once we got to max level (and were still unable to consistently beat the damn phoenixes...) there wasn't really much to do; we weren't really into the very specific kind of end-game pvp they have and there aren't any other options for content.\n\nStill, the journey to max level was long and hugely enjoyable. Highly recommend.", "timestamp_created": 1636854462, "timestamp_updated": 1636854462, "voted_up": true, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.692443549633026123", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "60547828": {"recommendationid": "60547828", "author": {"steamid": "76561198007053935", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 79771, "playtime_last_two_weeks": 0, "playtime_at_review": 8168, "last_played": 1652968538}, "language": "english", "review": "I had a bad experience on a server that had some weird rules about crafting. Since then I have played on official servers with fast leveling rules and I have had a very enjoyable experience. I recommend this game.\n\nIn my opinion the first part of the game where you level from level 1 to level 60 is fun because of the leveling. After level 60 the game changes and you need to find new goals to keep enjoying the game. There are still extreme challenges to be had after level 60 but you will probably find the most enjoyment by working with other players to help them achieve their goals. Join a house. Form parties for cooperative play. Form raids to take on the high level dungeons that the game allows you to unlock.\n\nMy best experiences though have come from helping other players. This has resulted in friendships and a lot of fun. Buy this game and do not neglect the social aspects.", "timestamp_created": 1577306082, "timestamp_updated": 1587518816, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.6919516921043396", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1579726816, "developer_response": "We work really hard to protect player data, if something happened to your character for whatever reason, please reach out to our support channels. We're very active on discord and will work to help you restore what you had."}, "44439138": {"recommendationid": "44439138", "author": {"steamid": "76561198067120865", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 27252, "playtime_last_two_weeks": 0, "playtime_at_review": 26283, "last_played": 1533276021}, "language": "english", "review": "Having spent hundreds of hours in this game I can give you a very qualified oppinion.\n\nIf you are thinking of investing time into this game, you will be wasting your time.\n\nI started this game, being assured by developer representatives as well as community, that there will be no wipes.\n\nThen the first wipe was anounced, after I have spent about 300 hours leveling up to the maximum level of 60. The anouncement was also that there will be legacy servers, servers where players keep their progress.\n\nI moved to one of these servers, and spent a huge amount of time yet again to build a large home and level up to 60 again. Only to find out that the developers yet again changed their mind. They now decided to wipe all servers due to a toxic part of the community complaining that this is not fair.  A request to at least preserve player levels or re level players up to their original level was completely ignored.\n\nFurthermore there are a lot of game breaking bugs. However, those were not addressed, or very cheap workarounds selected, such as the \"fix\" for the problem of big structures causing server lag,which is simply to make it ten times harder for players to build. The developers were more interested in making it even more difficult to level up and to force you to have to deal with food now, which lead to the wipe.\n\nDont Bother investing time into this game, it seems great at first, but is a huge frustration in the end, with a very toxic community that uses any and all exploits they can, griefing new players, etc. It is really not worth it.", "timestamp_created": 1535529389, "timestamp_updated": 1535529389, "voted_up": false, "votes_up": 53, "votes_funny": 3, "weighted_vote_score": "0.690241694450378418", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "33829847": {"recommendationid": "33829847", "author": {"steamid": "76561198065548095", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1636, "playtime_last_two_weeks": 0, "playtime_at_review": 1636, "last_played": 1513643427}, "language": "english", "review": "Disclaimer: I don't write reviews much, its 4:50 am, and I logged off because of the server telling me too, (not communicating?)\n\nMost neg. reviews here are for the optimization and not the game play or mechanics, and I guess that is okay. This game is early access and just hit within the past 24 hrs of this review, so bugs are to be expected. So far I personally haven't had any game crashes, major game stopping bugs, or MASSIVE framera-p-e.  BUT these flaws do exist, my two friends whom have joined me have had MASSIVE framera-p-e, and constant fatal crashes.  So now on to the pros / cons - yada yada.\n\n-PROS:\n~~This is like Ark's sister game and therefore is essentially the same concept. The cool part here is that instead of Dino's, and cave man gear we get Mythical beasts and spells and stuff yo. \n\n~~THIS GAME'S BUILDING IS ACTUALLY GOOD!?!?! Hassle free easy snap mechanics that function quite well for just releasing, and with a bit of touch up will easily surpass many other sandbox style games building. Not to mention the items you can build look cool AF, and the stuff isn't insanely hard to make / learn / use.\n\n~~Combat* This games combat is actually heading down a decent path, albeit it is bad... (but this is the pros section, bad combat stuff is in cons)\nThe combat functions like a more simplified version of Skyrims Lmb / Rmb attack functions, has two consumable slots on the hot bar, a activateable triken slot, AND a button for switching between an offhand weapon with its own set of Lmb / Rmb attack options.\nAside from mechanics, I personally liked running around  lazering / smashing / fireballing / magic missling things to death, I just hope the devs soon release monster mechanics instead of just ranged and melee bullet sponges. (which aren't overly spongey.)\n\n~~Skill / Talents / Character Builds\nThe skill / knowledge tree is actually pretty fleshed out and amazes me with the possible build paths. Tank, melee dps, ranged dps, hybrid, its all there you just have to get gear and skills set right. It's cool. The greates acomplishment here IMO is that I never feel like Im getting cheated on the tree, I get enough points to learn something useful and that next unlock is right there, giving me something to push for. My biggest hope for this game is an even bigger knowledge tree!  MOAR TINGS GUD!!!!\n\n-Cons: (More than just optimization?! Whoa!)\n\n~~Combat* (Yeah its here in the cons too... )\nThis game really scratches my itch for coop skyrim, but man are these animations AWFUL, and that is OKAY -EARLY ACCESS GAME -\nSome hits miss / don't connect ---> Early access game\nThe mobs are pretty much the most plebian lvl newbs ya can fight, not really mechanically all there I'd imagine and they all look the part too, but that Pyrtitan looks cool AF\n\n~~Crafting\nKinda intensive as far as\n- Can't que differnt items to build, (I.E can only have one going then have to manually start a new project, but can do multiples of one item at a time.)\n-The storage containers are horribly small therefore the hoarder player is going to need a seperate warehouse just for storage containers.\n-The UI could use a touch of clean up  (Small details make life better)\n- Need MOAR THINGS, --- obviously that will happen in time, I just want more now :P\n\n~~THE WORLD / Loading things / gathering\nSo I imagine this probably isn't to big a deal, but there is a rather annyoing thing where sometimes you go on down to loot an area and pick a plant but don't get it, thats cool, then suddenly all the trees / rocks / and resources go poof!\n(It's most likely because someone looted the area, and when you activate something the area updates to the servers real time and everything hasn't respawned yet.)\n\n~~ Optimization  -- Yeah its bad... for other people, mine hasn't dropped below 30fps, and normally it sits at 55 - 63 fps\n(Im running a pretty good laptop) \nBUT like I said earlier this game has isses with Lag, disconnects, connects, crashes, errors, rendering, just getting good frames, and such. But they are not nearly as bad as the neg. reviews say.\n\n\nTL:DR - Just buy the game for 20$ try it for 2hrs and return it if you don't like it. Its a fun game, it just hit steam Early Access, it is actually better than most early access games right now, and some full launched games as well! I'm sure the devs are going to load it full of content and I'm super stoked to see where it goes. \n\nALSO FLYING IN THIS GAME IS SO MUCH FUN OMFG I CAN FLY ALL DAY AND MESS AROUND IN THIS GAME. ITS LIKE HARRY POTTER SIMULATOR (10/10 would recmmend the flying is AMAZEBALLZ)\n\n-- IF you read this far and have questions about THIS GAME Pm me, I will try to answer ASAP", "timestamp_created": 1501154453, "timestamp_updated": 1534479683, "voted_up": true, "votes_up": 32, "votes_funny": 3, "weighted_vote_score": "0.689792871475219727", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "33882914": {"recommendationid": "33882914", "author": {"steamid": "76561198001794713", "num_games_owned": 0, "num_reviews": 428, "playtime_forever": 546, "playtime_last_two_weeks": 0, "playtime_at_review": 546, "last_played": 1501337288}, "language": "english", "review": "Its a good game, but for now I dont think there is much to do. You see the major flaws that the game has way past the 2 hour line.\n\n[h1]Pros:[/h1]\n\n+ graphics are nice\n+ controls are intuitive\n+ nice UI and item management\n+ skill trees have good variety\n+ no food or thirst meter\n+ level up system is good\n+ taming of animals, as well as enemies in general\n+ some animals can be mounted\n+ taming only lasts for 30min and can be extended with scrolls, a good mechanic in my opinion\n+ fly with a broomstick like a witch\n+ magic and spells are well implemented\n+ gathering resources isnt as tedious as in other games, you can even gather stuff with magic from a distance\n+ party up with people or let them join your guild\n+ the building is really good and easy, no tedious crafting of building materials\n+ caves that sort of resemble dungeons you can go through to get better loot at the end\n+ dragons in various forms\n+ huge map\n+ unique resources and crafting recipes\n+ you can play it in singleplayer\n+ fast travel towers, where you can teleport between them\n\n[h1]Cons:[/h1]\n\n- the leveling up and exp rate is super slow on standard, even on 3 times the rate it feels slow to level up\n\n- the best way to level up is to kill animals and enemies, but at some point it gets boring, because there are just a few enemy types in the game so far and you will be killing harmless horses without even collecting their loot.....\n\n- having an animal as a mount is pointless, its not really faster than sprinting by foot (which you can do infinitely) and its useless because flying with the broom gets you up hills and mountains and is a lot faster\n\n- the games performance is awful, GTX 1080 and the game runs from 30 to 60 fps constantly jumping and being more in the 30 than I want it to\n\n- you cant repair your buildings, I guess this is going to be fixed, but even when its supposed to work, you gotta unlock the repair skill which you get way past your building stuff and inbetween that time, you cant repair your damaged walls at all\n\n- it gets boring real fast, the map feels the same no matter where you stand, there arent any cool points of interest other than the dungeon, which can be super difficult to master if you play on your own, some absolutely can only be done with a group\n\n- weapons break down without any meter telling you when its going to break\n\n- its buggy, had several crashes and game breaking bugs, like enemies not fighting back\n\n- you can only equip 2 spells to one weapon (left and right mouse button) which is super annoying as you have to constantly switch out spells, like the taming spell with the gathering spell, back to the damage spell\n\n- PVP can get unbalanced if you dont pick the right weapon, an axe for example has a short range spell and good melee damage, but has no chance against the super fast wand that has a long reach and \"machinegun\" spells, almost every player I encountered had this weapon\n\n- PVP battles can drag forever, as there are no cooldowns on potions\n\n- right now, you can just log out during a fight to avoid death, there is no timer on logout\n\n- you always have to create a mage/wizard character, there is no real barbarian warrior melee option here\n\n- character creation is very limited, with only 4 faces and hairstyles\n\n- enemy NPCs attack you, while you are in your home, attacking the outside wall, as if they know you are in there.....\n\n- on some points of the map there are literal mana and health pools, where you can swim in and regenerate your health and mana, but its so unbelievably slow, its like every 2 seconds you recover 1 point, its tedious when you go there with 150/400 health points\n\n- enemies have no ragdoll, they die in fixed animations, which is a huge letdown for me\n\n\nLike I said, the game is actually quite good, but I wouldnt recommend playing it right now, as other games in this genre give you way better gameplay and content. The magic to be honest didnt really do much difference in the long run. Instead of flying on a dinosaur you fly on a broom. Instead of firing a pistol, you fire your magic shots. Keep an eye out on Citadel, maybe it gets better with time, for now, save your money.", "timestamp_created": 1501341019, "timestamp_updated": 1501403194, "voted_up": false, "votes_up": 64, "votes_funny": 4, "weighted_vote_score": "0.688522398471832275", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "119875465": {"recommendationid": "119875465", "author": {"steamid": "76561198033427960", "num_games_owned": 711, "num_reviews": 69, "playtime_forever": 4022, "playtime_last_two_weeks": 0, "playtime_at_review": 4022, "last_played": 1658999212}, "language": "english", "review": "While it's true the game is dead, if this were on sale for <$20 I think it has some single-player value to be had, especially if you like building.\n\nIf playing single player though, don't play normal. Just max everything out or at least drastically increase it in your favor, attack/defense/health/crafting, all of it. Honestly even with this sort of god mode you can still die from higher level creatures and can play through the game normally without much hassle. The very end game dungeons also still have a decent level of difficulty if solo with god-mode stats.\n\nSo if you're into the whole survival/crafter/builder more as a chill out, relax type game, and less a sweaty multiplayer pvp/pve fest, this honestly isn't a bad choice for under $20. Maybe if it had lots of servers and dev support you could MAYBE justify $40, but no way is it worth that at this point. Get it on sale.\n\n7/10 Would go from Harry Potter broomstick to Death Eater smoke again.", "timestamp_created": 1659351415, "timestamp_updated": 1659351415, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.685403048992156982", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "39600676": {"recommendationid": "39600676", "author": {"steamid": "76561198238122588", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 536, "playtime_last_two_weeks": 0, "playtime_at_review": 305, "last_played": 1664555169}, "language": "english", "review": "DO NOT BUY IF YOU USE AMD IT WONT WORK. Dirty little secret no one seems to mention, AMD users get fucked out of playing due to low level fatal error, i can't even load the game. The worst part is this has been an issue since at least august of 2017 and there is still no fix for it. Early access or not selling a game for 25$ without mentioning in the requirements that AMD users wont have a funtional copy is bullshit....This should be a top priority to fix considering the amount of people who use AMD but clearly the devs aren't doing anything about it. Probably a fun game but NOT IF YOU USE AMD.", "timestamp_created": 1516871144, "timestamp_updated": 1516871144, "voted_up": false, "votes_up": 173, "votes_funny": 18, "weighted_vote_score": "0.684436559677124023", "comment_count": 16, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "37136324": {"recommendationid": "37136324", "author": {"steamid": "76561198062461341", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 25007, "playtime_last_two_weeks": 0, "playtime_at_review": 14992, "last_played": 1614064471}, "language": "english", "review": "I want to love this game, there are some really great aspects to it such as the crafting and building. Devs are actively updating and adding to it. Hope it gets more love and support.", "timestamp_created": 1511456698, "timestamp_updated": 1511456698, "voted_up": true, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.684348762035369873", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "141568354": {"recommendationid": "141568354", "author": {"steamid": "76561198174223797", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 368, "playtime_last_two_weeks": 0, "playtime_at_review": 368, "last_played": 1687440622}, "language": "english", "review": "An abandoned hot mess that had so much potential.", "timestamp_created": 1688784160, "timestamp_updated": 1688784160, "voted_up": false, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.683085441589355469", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "118071481": {"recommendationid": "118071481", "author": {"steamid": "76561198007042683", "num_games_owned": 1314, "num_reviews": 216, "playtime_forever": 6, "playtime_last_two_weeks": 0, "playtime_at_review": 6, "last_played": 1604038052}, "language": "english", "review": "Abandoned Citadel: Not Forged, No Fire", "timestamp_created": 1656778596, "timestamp_updated": 1656778596, "voted_up": false, "votes_up": 29, "votes_funny": 8, "weighted_vote_score": "0.68100351095199585", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "60276139": {"recommendationid": "60276139", "author": {"steamid": "76561198054729515", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 38913, "playtime_last_two_weeks": 0, "playtime_at_review": 36667, "last_played": 1615633798}, "language": "english", "review": "This game has not support. Even in PvE server you can get destroyed by griefers.", "timestamp_created": 1576970861, "timestamp_updated": 1576970861, "voted_up": false, "votes_up": 44, "votes_funny": 4, "weighted_vote_score": "0.680444240570068359", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "34243434": {"recommendationid": "34243434", "author": {"steamid": "76561198047606293", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 17055, "playtime_last_two_weeks": 0, "playtime_at_review": 15639, "last_played": 1512444897}, "language": "english", "review": "I've put in a lot of hours in this game. I am also a small streamer that streams this game on Twitch to help it gain interest. But I paid for this game and expected more...\n\nThe game grows on you until you get punched in the face by it's issues.\n\n**Update October 5th**\nWith the latest update, this developer has decided to make building in the game more difficult by increasing resources required AND having to use the Forge to make materials just to build walls. Instead of sticking with more basic materials like stone, they have forced the player to farm precious stone, combine that with regular stone in the Forge and create bricks one by one. What use to take less than 10 seconds to build a wall, now takes over a minute...for one wall.\n\nSo instead of adding real content to the game, the developer is adding grind to end game base building. Turning the only thing that was enjoyable in the game as it stands...base building...into a job of endless grinding just to build basic end level structures. \n\nIn addition, the developer community manager decided to turn on the community,  deleting posts and banning players posting their negative feedback about this latest patch. Hardly a game you want to invest in given the lack of direction, lack of content, and treatment of their player base.\n\n**Update August 21st**\nThe developer has changed the Raid system and introduced Siege Spells. These are the only spells that can damage base walls now. However, the shields and turrets are still not effective for base defense and can be damaged by normal character spells.\n\nI still stand by my review as it's fair and will hopefully give players an idea of what they are investing in.\n**\n- If you are a base builder and enjoy pvp, stay away. You can build amazing bases but there are zero defenses you can put in place that help fight off base raids. Shield domes that do nothing, turrets that do no damage to high level players, top tier rock walls that can be melted in seconds.\n- The higher level spells are so overpowered that players and bases on PvP servers have no chance. (**See Update Above**)\n- The resources and 'treasures' in the game are so easy to obtain that storing them away in your base hardly matters. Raiding has no purpose when all the resources are easily obtained. Raiding is only to destroy, and it's way to easy to do that right now.\n- PVE? There are only like 10 mob varieties in the game. And they repeat across the map, just have more HP and deal more damage in the 'higher' level zones.\n- There is currently no real objectives. No dungeons(just caves), no neutral NPC hubs, no purpose other than explore a small map and fight repeated mobs that respawn in a predictable pattern and timeframe. There is a leveling system and skill tree, but you can only use those skills to fight other players and have a challenge. The AI mobs are not a challenge.\n\nThere are public and private servers. You can rent your own server. No solo play unless you password protect your own, private server. \n\nThere are plenty of server issues that still exist as of this review. You will also get a couple restarts of the official servers daily to clean up issues...and respawn chest and resources...Yes, that doesn't occur naturally all the time.\n\nOverall, 6/10. I hope it improves as it has some great core gameplay elements.", "timestamp_created": 1502744435, "timestamp_updated": 1507263237, "voted_up": false, "votes_up": 78, "votes_funny": 2, "weighted_vote_score": "0.680166959762573242", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "33855928": {"recommendationid": "33855928", "author": {"steamid": "76561198032152902", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1998, "playtime_last_two_weeks": 0, "playtime_at_review": 1998, "last_played": 1709207181}, "language": "english", "review": "The game could be fun, but DONT buy it now. you might get a good 24 hours out of playing it, but everyone eventually gets the bug where your character becomes stuck and you can't access the menu so you can't reset your character. Server restarts do not fix this, so your only solution is to chose another server - once this is fixed i will recommend the game most likely, but currently this is simply a bug that occurs due to playtime that is not fixable.\n\nAside from that, the combat is great and will be very fun once the ping issue is resolved - if server is up for more than an hour then ping usually spikes to 500 immediately at the hour mark and increases from there. I recommend playing on an hourly restart server, as official servers only restart 2 times a day or when they crash which is unreliable.\n\nDon't play this like Ark or Rust - Currently top level bases are able to be broken into by the first staff spell that you unlock, so you can't get a cache of useful items unless your base is well hidden - for example, place foundations in the water and put a box there to store your things. Hiding is better than large buildings as it takes 3 mana pots to break tier 3 walls. with the level 30 staff.", "timestamp_created": 1501248985, "timestamp_updated": 1501248985, "voted_up": false, "votes_up": 116, "votes_funny": 7, "weighted_vote_score": "0.678522288799285889", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "47222065": {"recommendationid": "47222065", "author": {"steamid": "76561198025257424", "num_games_owned": 64, "num_reviews": 2, "playtime_forever": 7244, "playtime_last_two_weeks": 0, "playtime_at_review": 3519, "last_played": 1575140502}, "language": "english", "review": "Right off the bat, this game is in early access. You must go in knowing some things might change. We had a recent xp path, messed with our points. They were reset, all is well. New things added, things tweaked. The game will change so go in expecting it.\n\nNow for what has been done so far? It's great! It has a similair feel to ARK but there isn't a food or thirst bar. You have health and mana, and food and drinks replenish those in varying amounts. The flying is a bit to get used to, it's slow but feels realisitc. And it does feel like the more you play the longer you can fly. \n\nMost of the creatures in the game can be tamed and it is great. Adventuring on a horse makes land fly by, but an eagle or a dragon is just 10/10, opens the world up. Until the Infernal Dragon that stalks my home swoops down and nukes my face.\n\nThe building is incredibly easy to understand, and while I feel like there should be some more options (such as roof angles), it is very satisfactory to build a wonderful home.\n\nI hope there will be more character customization and armor options in the future, but you can get some amazing gear early on and challenge things far above your level. Fighting a flame dragon by running in a circle and dodging it's fireballs is a thrilling experience, and makes me feel like a crafty bastard when I best it.\n\nI will say, it is a game for friends. While there is single player, resources burn up pretty fast when building, and you can't go as gung ho into battle alone. Just 1 or 2 more people really adds so much more. Especially if you weave a story with what you're doing (so far we have the adventures of the bog witch and the OCD architect. It's amusing)\n\nI've put so many hours into this game already, and I've bought it for 3 friends. I would say it is worth it. Especially if you got it at the 55% off price. Give it time to work out the kinks and keep moving forward, go in knowing it will be broken in some areas and they will get fixed, but also go in knowing it is FUN\n\nTL;DR:\n\nIt's great, it's fun, perfect for small groups of friends. If you're a fan of ARK but want magic and less starvation, it's the game for you! (I would suggest PvE serves if you're not a fan of murder however)", "timestamp_created": 1543629695, "timestamp_updated": 1543629855, "voted_up": true, "votes_up": 16, "votes_funny": 2, "weighted_vote_score": "0.6781882643699646", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "61056781": {"recommendationid": "61056781", "author": {"steamid": "76561198036617922", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 8424, "playtime_last_two_weeks": 0, "playtime_at_review": 5268, "last_played": 1596798043}, "language": "english", "review": "If you was like me and sitting on the fence about this game, go and watch some playthroughs on Youtube then you'll be able to decide if this game is for you. I orginally saw it for sale in GAME for the PS4 and I had never heard of it. I am a big fan of survival games, and I also am a big fan of magic and dragons. I play single player and as my character grows stronger, gets better gear, and gets stronger tames my enjoyment in the game has been increasing. \n\nI have explored the majority of the map and the world is very pretty plus the map size isn't overwhelming, also there are fast travel points so you don't have to spend forever auto-running/flying. The creature designs are cool and the array of spells available are interesting, although I am greedy and would like more. One thing I have found annoying when fighting creatures on land with projectiles is it feels like they have a seeking element - dragons charge up fireball attacks and I have used Blink to dodge out the way (and I was a fair distance from my original point) and it still hits me. \n\nI like how descriptions on reagents can give you clues about where to find them. You do have a choice whether you want to be a proper wizard in a robe or play as a battlemage with heavy armors and melee spells, however you might need to respec for this as heavy armors are available at higher levels. I like how the game feels fair when you die because you do not loose what you have equipped but you will loose what is in your inventory (make sure you go pick a plant or something before heading out to retrieve your inventory, otherwise you will then drop your equipped gear). I also really enjoy the soundtrack in-game it reminds me of Elder Scrolls. \n\nThe game has potential to be a lot better and I wish you could provide them feedback on their website. However this isn't stopping me enjoying my time upgrading my 'castle', adventuring for loot, collecting materials and dreaming about the day when I will tame myself an Infernal Dragon. It definitely is becoming one of my favourites.", "timestamp_created": 1577883795, "timestamp_updated": 1577883795, "voted_up": true, "votes_up": 15, "votes_funny": 2, "weighted_vote_score": "0.67581552267074585", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "113854592": {"recommendationid": "113854592", "author": {"steamid": "76561197976712260", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 992, "playtime_last_two_weeks": 0, "playtime_at_review": 992, "last_played": 1501562478}, "language": "english", "review": "Abandonware\nI made an exception to my no-EA titles for this game because of friends. Never again. Congrats Blue Isle on 'launching' the game then running with the money.\n", "timestamp_created": 1649963910, "timestamp_updated": 1649963910, "voted_up": false, "votes_up": 24, "votes_funny": 0, "weighted_vote_score": "0.675435125827789307", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "33814955": {"recommendationid": "33814955", "author": {"steamid": "76561197999613929", "num_games_owned": 406, "num_reviews": 161, "playtime_forever": 54, "playtime_last_two_weeks": 0, "playtime_at_review": 54, "last_played": 1501255315}, "language": "english", "review": "Citadel is, on face value “yet another” sandbox survival game in early access – thankfully this games has a couple of cool ideas that are interesting, unique and wholly amazing, but also gets dragged down in to the early access pit of “needs more time”.\n\nVideo:\nhttps://www.youtube.com/watch?v=YBNLfdjQrkU\n\nText:\nA summary never does a game justice and I always urge you to watch the video for the greatest level of detail. The playtime is shown incorrectly, its closer to 15 hours.\n\nCitadel, at its core has a few components that make it very enjoyable, even in its current state – and that’s the primary notion to convey: The issues with this game aren’t core design problems, they are development time and priority problems, which are currently very much an issue, but not an insurmountable one. \n\nLets starts with the most enjoyable part to me – building stuff. You might think I’d get sick and tired of building yet another castle, but truthfully with Citadel I’ve never had a dull moment or grindy annoyance. There is something wholly amazing in having a building design that does’t frustrate. It works. The pieces all fit together nicely, there are no annoying bugs and you don’t suddenly fall through the floor if you misclick. \n\nVery much a great system to build your mountain castle. In a cave.\n\nA fast second is the progression system, that uses a combination of solid rewards for gathering, exploring and building combined with combat to provide leveling experience. This translates to points you can spend on your stats (such as damage output) and points you can spend on skills, spells and abilities. You decide where you want your focus to be – Crafting, Animal Taming, Combat spells, Jewelry. This progression allows natural paths and rewards their execution in new flows of XP. \n\nOh, did I mention there is no Food, Drink, bullshit-time-wasters mechanics? Just raw, enjoyable world and game. That alone gives this game a step up over its competitors.\n\nNow, the bad… Performance. Its…. Very bad. Even on lower settings hitting 60FPS is hard, and that’s running the latest and greatest in hardware. While the game doesn’t crash, having it dip to sub-20 FPS isn’t uncommon and frankly… unplayable. \n\nAlso, where the building is great, the combat dips it into horrid. With stilted animations, disconnected attacks, bad telegraphing of attacks and overall weak monster Ai, its probably the part of this game that needs massive work.\n\nThat all said, I enjoy it, but as always with early access  - don’t buy into what might be, only buy the game for that which it has right now and that’s a choice you need to make yourself. Can you deal with horrid performance, to enjoy great crafting?\n\n\nIf you enjoy the review - [url=http://store.steampowered.com/curator/11617580/]do follow my curator feed![/url]. Or check out the various other reviews on [url=https://youtube.com/c/guylogicgaming] YouTube ![/url].", "timestamp_created": 1501094054, "timestamp_updated": 1501095536, "voted_up": true, "votes_up": 184, "votes_funny": 4, "weighted_vote_score": "0.673355937004089355", "comment_count": 41, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "35939141": {"recommendationid": "35939141", "author": {"steamid": "76561197970818881", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 13434, "playtime_last_two_weeks": 0, "playtime_at_review": 13240, "last_played": 1505266927}, "language": "english", "review": "200+ hours played.\n\nThe only aspect of the game that actually held interest was the base building and the risk of those structures to PvP.  You needed to build in obscure corners, build defenses, be clever about how you arranged your structures, etc.  \n\nThe serve list to actual player population is hugely off.  There are hundreds of servers and most only have 3-4 players (instead of 30-40) each.  It's exceedingly rare to even encounter actual players on most servers.  Those once-in-a-blue-moon servers that actually have 20-30 players (usually the result of a group of people who know each other already), the servers start to struggle to handle them performance-wise.\n\nOn PvP servers that are actually populated, I found that every one of them (approx 7 differenct servers over the time I played) quickly developed one overwelming \"gang\" that dominated the server with no chance to compete against them.  Griefing newer players was extremely common.\n\nThe PvP was laughably imbalanced to the effect of One-Shot kills and a near-impossibility to actually have a fight or employ any tactics/strategy... Higher levels stomp on you, and if you are similar level, whomever gets the first hits in generally won without challenge.\n\nThe PvE aspects of monster killing for exp and items is, unfortunately, a joke.  It's not challenging or interesting, the AI is painfully poor, and even low-level players can take out the most difficult creatures with little risk.  Killing these creatures over and over and over became a grind-fest for experience and materials needed for Base-raiding.\n\nHowever in order to raid a base, you need to kill these creatures for \"Siege Spells\" materials.  From a balance perspective, this means the higher level characters that have been around for a while have huge stockpiles of those materials and can level a base seemingly at-will.  Lower level characters can't even knock out a simple wooden shack.  Those higher level characters who have plenty of materials have no REASON to raid a base in the first place.\n\nThe actual base-building mechanics are well-designed, but the gathering of basic building materials (wood/stone) is so monotonously repetative, for not good reason (the materials are plentiful and numerous).  For this reason the vast majority of custom servers employ increases to gathering and carrying weight in an attempt to make this less of a chore... but doing so messes with rarity balance elsewhere.\n\nThe item crafting system isn't horrible, but it's very repetative with very little variability.  To acquire \"magic\" gear, it's simply a matter of repetatively crafting the same gear over and over until you get it.  The materials are easily obtained for any craft with very little challange... it's more a chore than anything.\n\nUltimately;  if you enjoy base building for the shear creativity aspect of it, and have some friends to play and colaborate with, the game can be enjoyable from a PvE perspective.  PvP however, and serious balance issues coupled with fundamental system design problems, makes the game more frustrating than enjoyable. What this game does well can be found implemented better-still elsewhere.", "timestamp_created": 1508741636, "timestamp_updated": 1508742007, "voted_up": false, "votes_up": 30, "votes_funny": 2, "weighted_vote_score": "0.67307734489440918", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "43958390": {"recommendationid": "43958390", "author": {"steamid": "76561197977854197", "num_games_owned": 0, "num_reviews": 28, "playtime_forever": 2491, "playtime_last_two_weeks": 0, "playtime_at_review": 2491, "last_played": 1533591582}, "language": "english", "review": "It's not a bad game but it's a rather useless one.  \n\nThe devs make it obvious that they have no content for the game. Everything revolves around gathering and those mechanics are pure trash.  \n\nYou go around killing things 1 by 1 and looting them 1 by 1. After 30 mins you have 10 peices of meat and you feed it to your tame and it gets to live another 3 hours. Why? even have this horrible mechanic in the game. What purpose does it serve? it does nothing good for the game.    \n\nBut wait it gets better! Now you've been gathering all this junk and you want to store your stuff. Make some storage chests, but these horrible mechanics don't stop at the taming...The storage containers have 49 slots with a 200 weight limit. Who thought of this dumb mechanic? Doesn't this defeat the purpose of a storage in a gathering game? Enjoy storing a stack or wood or stone or metal in the 50+ chests that will each contain 1 item.  \n\nQuests are a waste of time, you pick them up and they don't tell you where to go. Go kill X Y Z, but where is X Y Z? okay...lets just drop this quest and find one we can actually do!!! NOPE!!! can't drop the quests either...nice questing system.  \n\nSpell crafting, it's about to get good. This system is just a mess, each kind of weapon has it's own perks and you get to craft spells. The problem is you have to craft them so often, in a middle of a fight just go die so you can nagivate your UI to craft another one.  \n\nOn top of that, progressing really never increases your gathering rate. It was good fun staring at rocks for 1+ hours before heading back to base. The crafting and building felt like it had no purpose, the tiers were useless, the new benches served very little purpose etc.\n\nI wanted to like this game but it's just horrible. I got this for $10 and thank goodness I didn't pay another cent. For the price if it's on a sale? is probably worth it to do a 1 time run though on increased rate server. Other than that, this game is plain bad, don't waste money on the full price.", "timestamp_created": 1533526917, "timestamp_updated": 1533528307, "voted_up": false, "votes_up": 34, "votes_funny": 4, "weighted_vote_score": "0.672500491142272949", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "134838874": {"recommendationid": "134838874", "author": {"steamid": "76561199198199032", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 4642, "playtime_last_two_weeks": 0, "playtime_at_review": 3036, "last_played": 1694052767}, "language": "english", "review": "EVERY FUCKING TIME I DON'T LOG ONTO A FUCKING SERVER FOR A WEEK MY FUCKING BASE DISAPPEARS WITH EVERYTHING IN IT WTF I'm fucking done", "timestamp_created": 1679086174, "timestamp_updated": 1679086174, "voted_up": false, "votes_up": 29, "votes_funny": 18, "weighted_vote_score": "0.672190248966217041", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "33954169": {"recommendationid": "33954169", "author": {"steamid": "76561198197179415", "num_games_owned": 133, "num_reviews": 21, "playtime_forever": 2497, "playtime_last_two_weeks": 0, "playtime_at_review": 2462, "last_played": 1528409531}, "language": "english", "review": "This is my first review about a game.\n\nSo to start this game is quite buggy, as expected. This game really never crashes except (for me) when im loading into a world. \n\nThe game contains lots to do, from building to adventuring, and even flying on a broomstick. \nThis game currently has a good amount to do, of course the game did just come out a couple days ago as of writing this review. The game devs have a LOT to work on, especially on bug fixes. The game needs work in a lot of areas. \n\nThe reason im giving this game a Recommended review is because the game has everything i like, you can BUILD in a mmorpg, you can FLY AROUND ON A BROOMSTICK, and you can slay monsters and tame them aswell. Really this game is meant for people who like building and like adventuring killing monsters. This game does not have quests, but thats the fun part, you give yourself quests. all in all i personallly love this game, it may have lots of bugs but for early access thats normal, but i would give this game a 7.5. \n\n- lots of bugs\n+tons of stuff to do\n+can fly around on a broomstick\n\n\n+ oh and you can build\n\n=)\n\n\n\n\nEDIT: for everyone who says this game is bad, remember IT JUST CAME OUT GIVE IT A CHANCE. most reviews say thsi game is garbage because of optimization issues, fps, etc. yeah its going to be unoptimized, IT JUST CAME OUT. i understand if a game is unplayable then leave a bad review but for me i use a gtx 1050 ti and i get a avg fps of 30 to 40. my gpu is a low end pascal card and i run it no problem, the only time i lag is because i dont have enough ram (i have 8gb 1600 mhz ram) and so when the game uses over 8 gbs of ram i lag and game goes to 0 fps. anyway yeah dont leave a bad review is your computer cant handle it, just get a better computer if you ACTUALLY want to play the game.", "timestamp_created": 1501610282, "timestamp_updated": 1501610678, "voted_up": true, "votes_up": 23, "votes_funny": 1, "weighted_vote_score": "0.671489357948303223", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "61793191": {"recommendationid": "61793191", "author": {"steamid": "76561197994454202", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 28057, "playtime_last_two_weeks": 0, "playtime_at_review": 8823, "last_played": 1631798815}, "language": "english", "review": "Its a different take on a survival game and its pretty damn good, enjoying learning how to play a new game. \nI have 10k hours on ark and 3k on conan btw.  \nIve been on official server and this game does have some grind to it but thats what I like.\nYou cant be raided until you pass level 30 which is cool unless you try and raid someone before that.\nThere is no hunger or thirst in this game. Amazing. \nFarming is chill once you know where to get stuff and you can farm with a spell so no wacking stuff over and over. \nThe building is nice can make some pretty cool looking stuff or a box with honeycomb. Would compare the building mechanic to Rust. \nKinda have to grind to lvl 60 to pvp the other 60s like in Conan Exiles. \nYou can put points into health, mana, damage and weight. \nYou can tame stuff like in ARK but its way easier and no breeding but you can level your tames.\nThe AI in the game is prob the best I have ever played very hard to try and cheese stuff when killing nps and what not.\nAlso if you like playing solo its not that bad doing things on your own. \nPlaying with a group makes things easier obviously for mass farming, doing end game dungeons and big raids.\nFun game with alot of potential.", "timestamp_created": 1578918529, "timestamp_updated": 1578918529, "voted_up": true, "votes_up": 16, "votes_funny": 1, "weighted_vote_score": "0.670978248119354248", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "33815225": {"recommendationid": "33815225", "author": {"steamid": "76561198041347286", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 915, "playtime_last_two_weeks": 0, "playtime_at_review": 820, "last_played": 1501770896}, "language": "english", "review": "The game needs optimising, however as a standalone game it's rather enjoyable. You can tame creatures, learn magical spells and build bases. There are tons of servers to play on from PVE to PVP, you can be a gauntlet wielder who uses conjuring spells. You could use a wand, someone who is more precise with spells and single target, or you can use a staff and become an AOE monster who targets multiple enemies at once. It's different in terms of farming materials than other games, you don't use a pickaxe or an axe to farm you instead use a spell called \"Extract\" which allows you to pull the roots from the trees or rip the stone from the ground. Magic is everything in this game, unless of course you're an axe wielding berserk maniac who runs around chopping down foes with one mighty swing. \n\nLong story short, I feel like I could really enjoy this game and have a ton of fun If only it was optimised properly. I've already seen the recommended card, and I know that my card is capable of playing it. (GTX 1070) So I'll just wait until they patch it before playing again, I'm definitely going to keep the game for a while and see what they do with it.\n\nIf you enjoy fantasy, medieval sandbox games with magical combat and flying broomsticks then this is the game for you. Oh, and don't forget to tame a couple dragons and rain down fireballs on your foes to pass the time.", "timestamp_created": 1501094831, "timestamp_updated": 1501094831, "voted_up": true, "votes_up": 53, "votes_funny": 4, "weighted_vote_score": "0.670050263404846191", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "49665470": {"recommendationid": "49665470", "author": {"steamid": "76561198040334420", "num_games_owned": 0, "num_reviews": 37, "playtime_forever": 10217, "playtime_last_two_weeks": 0, "playtime_at_review": 8975, "last_played": 1627457491}, "language": "english", "review": "What an amazing game, I left a while ago when friends left and came back today the game was fun before though a bit buggy now the game has changed for the better its now EPIC with all new researching spells feature and unlike some games the spells don't have durability, also you can fly which is super fun, I'm disapointed to see the negative reviews so to show support for the developers that are doing a stand out job I had to write a positive review.", "timestamp_created": 1553107175, "timestamp_updated": 1553107175, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.668515026569366455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "33943356": {"recommendationid": "33943356", "author": {"steamid": "76561198141716628", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1700, "playtime_last_two_weeks": 0, "playtime_at_review": 1074, "last_played": 1513811762}, "language": "english", "review": "Ok, so this is an early release game.  If you know what that means and are fine with paying for it now you should also be understanding of any issues you run into.  After all this is supposed to be an interactive relationship with the developers on how to make the game better.  I have played for a while on a private server with friends.  I have come across several bugs already mentioned in the discussions.  Those will be addressed in due time. The game has lots of potential and is very playable at this time.  \n\nThings I liked:\nI love that I don't have to scrounge for food and water.\nI like that I don't have to sleep.\nThat kind of busy work can detract for the fun you are supposed to be having.\nI like the crafting and building aspects.\nThe flying is a very unique facet.\n\n\nConstructive comments:\nUpgrading building sections (wood to stone) forces you to desroy the previous section, which is fine execpt if you have a crafting station or anything else on that section.  That item also gets destroyed.  I would prefer that not be the case but I could live with it.\nI think the tech tree is currently too light, but I expect this to grow.\nThere aren't many types of enemies, but see above.\nI would like to see traders/markets for crafted/found loot.\nI would like to see more resource types, especially some in the lakes/rivers to make use of that environment.\nSome sort of major events would make life more interesting, like NPC sieges.\nI would like more slots for trinkets.\nThe taming mechanic is different than I am used to.  Seems more natural to permanently tame something, but I'll wait to see how this plays out.\n\nhttps://www.youtube.com/watch?v=wqG2vVjJH1w\n\n\n\nThe bottom line is, If you jump in now you will have fun, even now at this stage.  If you decide to wait, I would suggest putting this on your wishlist, just to track it.", "timestamp_created": 1501569912, "timestamp_updated": 1501569962, "voted_up": true, "votes_up": 17, "votes_funny": 1, "weighted_vote_score": "0.667323529720306396", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "58309238": {"recommendationid": "58309238", "author": {"steamid": "76561198117960662", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 2113, "playtime_last_two_weeks": 0, "playtime_at_review": 2095, "last_played": 1588429341}, "language": "english", "review": " I think the game can be fun,  it may not be for everyone, but most games are that way. I'm not here to actually review the game it'self, cause like I said,  all games  are a personal taste. I see all over the reviews , \" Great survival game\"  Harry Potter Survival\".. Could someone please explain to me  where and how this is a survival game at all?   There is  not a single aspect of survival at all, period. If  trying not to die is the new survival game criteria, then all RPG's are now survival games.  You dont have to eat or drink, the weather doesnt effect your character at all. Keep in mind, this is not a complaint, I just simply cant find a single survival aspect. With all that said,, I have a dollar value I place on all my games, if I can get 1 hour of entertainment for every dollar I spent, then I feel I got my moneys worth, so I will give the game a thumbs up, its a good game for what it is, but it is not a survival game.", "timestamp_created": 1574893995, "timestamp_updated": 1574893995, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.66624373197555542", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "55229564": {"recommendationid": "55229564", "author": {"steamid": "76561198019132077", "num_games_owned": 35, "num_reviews": 1, "playtime_forever": 9253, "playtime_last_two_weeks": 0, "playtime_at_review": 1393, "last_played": 1570778794}, "language": "english", "review": "I've been playing for about 3 days now and I'm definitely impressed with the game. I come from a gaming history from MMORPGs like Ultima Online, WoW and other sandbox games like ARK, Rust, Conan Exiles. The map is large and lots to explore, although some of the mobs are repetitive as hell, which is to be expected with early access games. There are not a lot of players, but I have encountered players and chatted with them. I've even traded with some players, which for a PVP server is impressive. Overall, gameplay is fun, and keeping me entertained. I would recommend to anyone that enjoys online sandbox games with building and taming and magic/melee combat. It is still Early Access (I believe) so keep that in mind as well; there will be bugs, balancing needing to be done, and a low population. I paid about $15 for the game and purchased for 2 family members so we can all play together, I recommend playing with friends. I will update this review if I have something else to add in the future. Thanks for reading!", "timestamp_created": 1569148578, "timestamp_updated": 1569148578, "voted_up": true, "votes_up": 20, "votes_funny": 1, "weighted_vote_score": "0.665194332599639893", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "33897179": {"recommendationid": "33897179", "author": {"steamid": "76561198166312143", "num_games_owned": 365, "num_reviews": 34, "playtime_forever": 1700, "playtime_last_two_weeks": 0, "playtime_at_review": 1629, "last_played": 1551502638}, "language": "english", "review": "I previously reviewed citadel and whole heartedly recommended it believing that it had a lot of potential just waiting to be expanded upon though now i'm writing this after the release of reignition, it seems the developers have decided to replace new and interesting content with making their original systems more grindy, nothing is harder, it just takes much longer to do, this was a fun game about being a wizard and now it's boring and monotonous because it can take hours to do the first little thing. I hope to god that the developers get their act together because it seems like reignition might just be the extinguishing of a once great promise. I cannot, in good faith, recommend this game no matter how much I want to. It could have been something and whilst I still hope that one day it can be, i'm very doubtful.", "timestamp_created": 1501391258, "timestamp_updated": 1534236233, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.664594411849975586", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "35558359": {"recommendationid": "35558359", "author": {"steamid": "76561198038994109", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 5871, "playtime_last_two_weeks": 0, "playtime_at_review": 5846, "last_played": 1511889826}, "language": "english", "review": "I've never felt the need to leave a riview before, but these devolopers seem lost.  They started out with an absolutely fantastic and fun sandbox game. Over the months sinc launch they have done everthing in their power to ruin it.  Either nerfing all the fun activities or ruining the overall experience.  The game went from being fun to almost unplayable.  It's usually the oposite with games but either these developers don't care or they are listening to the entirely wrong person.", "timestamp_created": 1507421321, "timestamp_updated": 1507421321, "voted_up": false, "votes_up": 36, "votes_funny": 4, "weighted_vote_score": "0.662344574928283691", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "128834568": {"recommendationid": "128834568", "author": {"steamid": "76561198028768429", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 7765, "playtime_last_two_weeks": 0, "playtime_at_review": 7765, "last_played": 1671423766}, "language": "english", "review": "Fun game if you can get it on sale. Servers are dead and content is limited, and it doesn't seem like there's any active development or plans for this game.\n\nMe and 3-5 friends played this together on a private server and had a good time for the sale price point (14.99 I think?).\n\nBeautiful game and a large world to explore. Crafting different weapons and armor, dying pieces of gear, and trying out new spells are all fun. Taming monsters can be challenging but also fun, and you can dye pets too. Building is very intuitive and works well, though isn't perfect.\n\nHowever, the world is largely empty. Creature spawns are very few and far between, even after adjusting server settings (do they even work?). Crafted gear is always better than found gear, so looting the few chests you find is not exciting at all. Some crafting materials are so rare that you're best not learning anything that requires them (looking at you, feathers).\n\nExperimenting with spells is fun the first time you discover a new element, but with only 6 elements and 6 spells per, you've got 36 different spells to last you the entire time you want to play. Many spells or redundant (fire bolt and ice bolt are basically the same) and many more are entirely useless (there's nothing under water so why have a water breathing spell?). You'll end up using the same 5 or 6 spells from start to finish.\n\nFlying enemies are almost impossible to kill and there are so many dragons, birds, phoenixes, etc. as you progress in the game. Flying enemies will never land once they're in the air, so have fun with that.\n\nTaming seems fun but doesn't really add much to the game. Pets move very slowly as mounts and aren't effective in combat. Once they die, they're dead. No way to bring them back.\n\nWorld seems very large but is very empty, with only scattered enemy camps (a group of 2+ enemies) or \"dungeons\" which are sometimes just a single room in a cave. Even the slightly larger caves don't offer much except a few monster spawns and no real reason to revisit them.\n\nEnd game \"raid\" dungeons that require a crafted key to access are kinda fun but definitely built for a group of people. Even those are pretty short and the rewards are very lackluster for all the trouble/difficulty in gaining access and completing them.\n\nThere's a post game area called Umbrus which is also very beautiful, but very empty. You also lose the ability to fly in that area, have no map access, and no quick way to respawn there when you die. And you will, because the stuff there has arbitrary difficulty levels just to extend the life and challenge of the game if you're still interested in playing by that time. Me and my friends beat the \"spirit of flight\" twin phoenixes (each level 100 with 1 million HP) and decided to call it quits after that.\n\nOverall, not a bad game if you get it on sale and have people to play with. Can definitely get a few fun hours out of it, but there isn't any kind of content that will keep you playing after the initial excitement fades.\n\nThis game really could have benefited from mods or further development, but I'm pretty sure what's there is all that's going to be there.", "timestamp_created": 1671426325, "timestamp_updated": 1671426325, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.662258923053741455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "42476643": {"recommendationid": "42476643", "author": {"steamid": "76561197991995076", "num_games_owned": 247, "num_reviews": 3, "playtime_forever": 1599, "playtime_last_two_weeks": 0, "playtime_at_review": 977, "last_played": 1630356343}, "language": "english", "review": "Originally purchased in August 2017, I liked what the game had at the time but it just didn't have enough of it so I figured coming back some time later would be a good plan.  Well, it would have been if they had added anything meaningful in that near 9 month time.  \n\nAll I can see that they've done is fixed some decay bug that took months to do, fixed several graphical problems, added a super simple quest system (I found one quest person that gives one randomized \"Kill X Y\" type thing), and a multiplayer Quidditch knockoff which did nothing for me since I'd been playing solo.\n\nAs best as I could tell they hadn't added a single new creature, they hadn't added anything new to structures, spells, armor (outside of some social things), weapons, and so forth.  The taming system feels far too simple with no real reward. \n\nIt looked to have a lot of promise when it first hit early access but the state of the game hasn't gone anywhere.  Unless they come in and really start updating it I would consider it a waste of money for anyone.", "timestamp_created": 1528053586, "timestamp_updated": 1528053586, "voted_up": false, "votes_up": 29, "votes_funny": 0, "weighted_vote_score": "0.662017643451690674", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "43101145": {"recommendationid": "43101145", "author": {"steamid": "76561198112920446", "num_games_owned": 470, "num_reviews": 51, "playtime_forever": 24, "playtime_last_two_weeks": 0, "last_played": 1530110009}, "language": "english", "review": "The game is an empty and buggy mess, the FPS is capped at 35 and there's nothing to do with no actual missions exept from the fetch and kill quests from no-dialogue npcs.\n\nIn it's Early Access state the game doesn't work and isn't worth playing it for now.", "timestamp_created": 1530110469, "timestamp_updated": 1530110469, "voted_up": false, "votes_up": 38, "votes_funny": 3, "weighted_vote_score": "0.659819841384887695", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "64157528": {"recommendationid": "64157528", "author": {"steamid": "76561197985367078", "num_games_owned": 154, "num_reviews": 18, "playtime_forever": 10484, "playtime_last_two_weeks": 0, "playtime_at_review": 4321, "last_played": 1684675229}, "language": "english", "review": "With 69 hours in I have just \"started\" to play. I started with single player to get the feel of it for around 20 levels, after which I started a lan server to avoid some of the oddities of these types of games in the unreal 4 engine.  First, I would not qualify this as a survival game. There are no diseases, and you will not die if you don't eat or drink and there is only 1 gathering tool, otherwise this plays very close to Ark, Conan, or Dark and Light. Kill, Gather, Build. but do it as Gandolf! What a BLAST. Flying around and killing everything with spells is super fun.  Flying gets you into more trouble then it gets you out of (which rocks). I have not reached level 30 yet and already have gotten my moneys worth. I hope more people find this game it really is a hidden gem.", "timestamp_created": 1582738516, "timestamp_updated": 1582738516, "voted_up": true, "votes_up": 18, "votes_funny": 1, "weighted_vote_score": "0.659287929534912109", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "41968291": {"recommendationid": "41968291", "author": {"steamid": "76561198098084865", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 25004, "playtime_last_two_weeks": 0, "playtime_at_review": 18178, "last_played": 1648326091}, "language": "english", "review": "Do not buy this game unless you realise you are purchasing an abandoned game", "timestamp_created": 1525982559, "timestamp_updated": 1659135584, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.65900343656539917", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "39203769": {"recommendationid": "39203769", "author": {"steamid": "76561198012770553", "num_games_owned": 235, "num_reviews": 80, "playtime_forever": 10521, "playtime_last_two_weeks": 0, "playtime_at_review": 7851, "last_played": 1704075212}, "language": "english", "review": "This game has some of the worst communication from the dev's. Their updates have not really preformed any optimization but instead they are only adding more content thats bugged. The mounts are broken and constantly disappear under the map without being able to retrieve them. The AI is non existent and dungeons are boring and one directional. You honestly dont even need to kill half the monsters half the time and can just loot and run. The magic find for items wont produce any items of rarity over normal in the official servers making the grind useless. I wouldn't recommend this game even though I pushed it on my friends when it was realesed on EA. They're a poorly run company with no real name titles under their belt and the poor reviews give you all the clue as why theyre not a big name in the industry. A company with no experience dreaming so big reminds me of the NO Mans Sky scandal. If they had the experience and money this genre would be amazing to play but in the current state coupled with the community this is a dead game. DO NOT BUY UNLESS ON SALE.\n\n4/5/18~\nGame still runs poorly on all low settings with a 1050ti (under 50 frames) It's funny they're claiming this unreal engine update did anything as I can say from playing before the update to now it is no better. I remember why I was banned from the forums now, they produce garbage and hype the garbage like it's something special. Forget the \"do not buy unless on sale\", it is now DO NOT BUY AT ALL COSTS.", "timestamp_created": 1515491907, "timestamp_updated": 1522978781, "voted_up": false, "votes_up": 34, "votes_funny": 3, "weighted_vote_score": "0.656945884227752686", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}}, "query_summary": {"num_reviews": 7, "review_score": 5, "review_score_desc": "Mixed", "total_positive": 2277, "total_negative": 1219, "total_reviews": 3496}, "cursors": {"AoIIPwLz1HX36ekE": "Mon Apr 22 23:42:12 2024"}}
