{"reviews": {"158371990": {"recommendationid": "158371990", "author": {"steamid": "76561198053263821", "num_games_owned": 283, "num_reviews": 7, "playtime_forever": 862, "playtime_last_two_weeks": 0, "playtime_at_review": 604, "last_played": 1708021953}, "language": "english", "review": "Hurry up and add co-op would be nice and wyld", "timestamp_created": 1708001504, "timestamp_updated": 1708001504, "voted_up": true, "votes_up": 56, "votes_funny": 1, "weighted_vote_score": "0.818538010120391846", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157966150": {"recommendationid": "157966150", "author": {"steamid": "76561199116702294", "num_games_owned": 95, "num_reviews": 19, "playtime_forever": 341, "playtime_last_two_weeks": 0, "playtime_at_review": 208, "last_played": 1707605177}, "language": "english", "review": "I'm not big on zombie survival sims, but I'm not against them, and after seeing that you can actually take a camper for a mobile base in this game, I've decided to give it a try.\n\nThe good:\n1) Drivable vehicles. I don't know why they've all been stripped of parts, though. It's probably a balance thing. A bit annyoing having to hunt for so many parts, then to carry them back to the vehicle you want, but whatever, at least it give you purpose.\n2) You can have a camper for a mobile base! Yes, as I've said, it was the main selling point for me. Now the camper's a bit small, but I've managed to cram a double-bed, several containers and a large shelf inside it, so I'm quite happy. Still, would be nice to have RVs as well.\n3) You can use paint to recolour your vehicle and camper. Finally, I can live my hippie camper dream!\n4) Large map to explore. I've not explored for long, but from what I've gathered there are supposed to be several zones, so having a vehicle is indeed important.\n5) Storage, storage everywhere. Portable storage, vehicle storage, a cart that you can drag around to carry all that storage. It's useful, and it helps to not need to build your own containers, like so many survival sims make you do.\n6) I actually like the fact that you can pick up random props and take them with you. Lets you make your base your own, and the prop placement mechanic is pretty good (my only qualm is that I sometimes pick stuff up instead of \"using\" it, but this can be fixed by changing the key bindings, I think).\n7) Wild, non-zombified animals. I don't actually know of any zombie survival sims that feature non-zombified animals. Here, though, I've come across two bears, just chilling around. The game is supposed to have other animals also, but I've not met any so far.\n8) You can modify your guns. You've got suppressors, sights, grips, stocks, whatever. And the gun-mods actually help, the supressor prevents enemies from getting alerted, for example.\n9) The game has a day\\ night cycle, changing weather, and apparently seasons. Haven't reached winter yet, and I could really use some rain, but whatever, it's still good.\n10) The game can be pretty.\n\nThe bad:\n1) The zombie AI is pretty dumb. The zombies run at you mindlessly, but if you climb on something, or close a door in front of them, they just stand there, helplessly flailing their arms at you. Yet they also have enough intelligence to run for cover when in direct sunlight? That's just weird.\n2) Grammar. Way I understand it, English is not the developer('s') native language, so technically this can be forgiven, especially since you can indeed understand what the game is telling you, but it just irks me when I see some of the weird grammar. Get a proof-reader, please!\n3) The crafting is actually pretty complex, which is pretty good. But most of it requires a workbench, which sucks.\n4) Some resources are way too abundant, but you have little use for them until you have access to a workbench, so they just take up space in your storage. I've gathered up so many rags, so much scrap metal, and so many 'components', yet I can't do anything to them! (again, not until I get to a workbench).\n5) Quivers. You can find bows and arrows in the world, but can't use them, because you didn't find a quiver. As an amateur archer in real life, and a fan of achery in video-games, I find this design choice really frustrating.\n6) Using some of the items is just busywork. So there are two ways you can carry an item: in your inventory (not all items) or in your hands (most items). The problem is that if you want to actually use some of the items, you need first hold them in your hands, because, for whatever reason, the game doesn't acknowledge you having them if they're in your inventory. I understand that it's a realism thing, but using an item straight out of your inventory is just a far better design choice.\n7) Daytime is way too short. At 6 PM it's already pitch black outside, meaning that you have to go to sleep for 12 whole hours, unless you want to run around fighting or dodging zombies. The game supposedly features seasons, but there doesn't seem to be a difference in daylight between summer and winter.\n\nThe ugly:\n1) The game is badly optimized, even if your computer can run it on highest settings, you still need to wait for all the assets to render before you can actually start playing, and even then you might have to deal with props just popping into view as you go. I've seen a playthrough where the player was driving his car pretty fast and crashed into a broken bus that wasn't there just a moment ago, because the game didn't manage to render it in. Was a bit funny, but it's actually a serious problem.\n\nSuggestions:\nAside from what I've written above, I'd like the option to switch off zombies\\ bandits\\ hostile animals when starting a new game. Sometimes you just want to explore the game world, to see how long you can survive without some mob constantly knocking down your door. Green Hell lets you do this, The Long Dark lets you do this, so why not? I get that the game's whole plot revolves around zombies, but options are always a good thing. Project Zomboid lets you toggle zombies off at new game, so why not? \nAnother suggestion is to let us wield weapons lefthanded. I know it's extra work for the devs, but since you're already giving us the option to use the left hand for secondary items, why not make it fully useable?\n\nOverall, I like this game. If the devs fix its standing issues, it might just become a genre staple.", "timestamp_created": 1707532727, "timestamp_updated": 1707533141, "voted_up": true, "votes_up": 33, "votes_funny": 2, "weighted_vote_score": "0.773420214653015137", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157099526": {"recommendationid": "157099526", "author": {"steamid": "76561198131737336", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 11275, "playtime_last_two_weeks": 0, "playtime_at_review": 9197, "last_played": 1709523815}, "language": "english", "review": "Absolutely love this game - even in early access, it remains so fun. Can't wait until we get multi-player :)", "timestamp_created": 1706507364, "timestamp_updated": 1706507364, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.672317147254943848", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157534369": {"recommendationid": "157534369", "author": {"steamid": "76561198306752742", "num_games_owned": 212, "num_reviews": 42, "playtime_forever": 1002, "playtime_last_two_weeks": 0, "playtime_at_review": 1002, "last_played": 1707004461}, "language": "english", "review": "I don't know how an update can break a game so bad. I used to like the game and it was running pretty smoothly, but when I tried it again just now, things were loading much slower and the performance was a lot worse. I tried to change the graphic settings but the buttons and sliders were barely working at all. Like, I wanted to change the mouse sensitivity because I thought it was a little too high, and everytime I clicked on apply and closed the pause menu, the sens would just reset to the default value. Every time. And that's not the only weird thing. I wanted to open a container and to my surprise the pick up interface on the screen showed key \"none\". In fact all interactions showed none. I thought it was some bug that was caused during the loading screen, so I simply exited the game and loaded the same world. And as another surprise; I suddenly just went uncon, and my hunger and thrist showed red. How's that possible? I legit exited the game literally where I spawned in and I hadn't played on that world much at all. And the weirdness sure doesn't end there. As I click on the exit game button (so I could go back to the menu and create a new world) my game just go boom crash and the Unreal Engine crash window appears. Wtf.\n\nSo I restart the game and create a new world, just to find out that all my keybindings have been set to none, and that's why I couldn't interact with anything. Why the hell would they just unbind themselves? I also noticed that my sens was set to the value I wanted to give it earlier, and upon closing the pause menu it tried to reset itself to the default value again and even asked if I wanted to save the settings.\n\nSo I only have one question: what kind of a buggy mess has this game turned into?", "timestamp_created": 1707005456, "timestamp_updated": 1707005456, "voted_up": false, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.630448281764984131", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158993724": {"recommendationid": "158993724", "author": {"steamid": "76561198129702159", "num_games_owned": 176, "num_reviews": 24, "playtime_forever": 1158, "playtime_last_two_weeks": 3, "playtime_at_review": 1059, "last_played": 1713351743}, "language": "english", "review": "This game is quite okay. However, after playing for more than 10 hours, it becomes irritating due to bugs. It has a significant number of bugs, and I mean A LOT.\n\n- You can drive the ATV backwards as fast as you would drive it normally.\n- The ATV gas doesn't run out.\n- While driving, on a random fabric, the ATV just flew into the sky.\n- When in a vehicle, zombies don't attack you.\n- Vehicle movement is very inconvenient.\n- I placed logs into the wood storage, but every time I came back, the logs had disappeared.\n- Zombies can't run upstairs.\n- Sometimes, when in the inventory, pressing on a weapon/gun causes it to randomly shoot.\n- When there is too much weight, it says you can't jump, but you still can; it just displays the message.\n- There was an engine in one car, but when I came back, it was already gone.\n- There were random shelves in the garage. I took them out, even destroyed them, and placed lockers in the same spot. After a while, the shelves randomly appeared again on top of my placed lockers.\n- Zombies always appear at the same spot in houses, etc. For example, when walking into the same house again, you already know there is going to be a zombie or zombies. It makes the game predictable.\n\nThere are more, but I can't remember them all. The game is fun and interesting; however, the bugs make the experience less enjoyable. The map could be bigger, and there could be more NPCs around the map, not only bandits. Also, there are random bunkers in the forest that you can't enter. Initially, it makes you excited that you have found something, but you can't get in. There could also be way more variety of zombies.\n\nOverall, the game is great but needs bugs fixed and more content added. I would rate it 7/10.", "timestamp_created": 1708627150, "timestamp_updated": 1708627187, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.61206895112991333", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161720311": {"recommendationid": "161720311", "author": {"steamid": "76561198168749984", "num_games_owned": 128, "num_reviews": 2, "playtime_forever": 1891, "playtime_last_two_weeks": 0, "playtime_at_review": 1891, "last_played": 1705415198}, "language": "english", "review": "We need a co-op version fast !!!!", "timestamp_created": 1711713901, "timestamp_updated": 1711713901, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.598262012004852295", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157317260": {"recommendationid": "157317260", "author": {"steamid": "76561199214094685", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 1639, "playtime_last_two_weeks": 0, "playtime_at_review": 1639, "last_played": 1706778037}, "language": "english", "review": "I recommend the game but I cant say it's playable right now. I just played for like 4 hours and managed to make a car functional for the first time since getting the game, only for it all to be swept away from me because I climbed a tower and the ladder at the top spit me out over the edge and I fell to my death. I then lost most of the things I brought with me upon reviving (which arent dropped in the world, they are deleted), and on my way to sprint back to my car I fell maybe 5 feet and died on impact while walking down the side of a slope.\n\nTo the dev; I really hope you get this game functional. As of now its rather buggy, the human AI either 1 shot you as soon as they see you or they dont shoot at all just jog at you, the zombie AI either tank a shotgun shell or die in one hit and if they touch you, forget about it. The worry in them isnt the numbers, its 1 of them managing to hit you 4 times because you had to resort to melee combat which either can 2 shot a zombie to the head or feel like you arent hitting them at all. And the one boss zombie I fought could tank 30 shotgun shells. The amount of stuff you lose for dying is insane. It almost makes me want to only use craftable melee weapons but I know if anything sees me at all Im doomed. Resources are abundant but of the things I dont need at all. You'll spend forever finding gears to upgrade your workbench if you survive long enough that is. The list goes on but if you can get the game in working order you have something here that is truly special and the perfect balance of eerie, intriguing and just fun to sit back and play.", "timestamp_created": 1706778312, "timestamp_updated": 1706778745, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.59375", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158263719": {"recommendationid": "158263719", "author": {"steamid": "76561198064936037", "num_games_owned": 271, "num_reviews": 17, "playtime_forever": 873, "playtime_last_two_weeks": 0, "playtime_at_review": 211, "last_played": 1709184961}, "language": "english", "review": "Too many bugs, reloading it messes up a lot. Creating more bugs as they update..", "timestamp_created": 1707865618, "timestamp_updated": 1707865977, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.577989578247070313", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161197161": {"recommendationid": "161197161", "author": {"steamid": "76561198329584475", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 2314, "playtime_last_two_weeks": 159, "playtime_at_review": 1471, "last_played": 1713728188}, "language": "english", "review": "I've played this game for 23 hours so far. 4 hours in i was ready to give up but gave it another chance and now I'm enjoying it quite a lot.\r\n\r\nPros: \r\n- building system in this game gives so much freedom to the player! It's one of the best aspects of this game.\r\n- it requires a bit of brain power to figure things out. Crafting system is good but it doesn't tell you much. \r\n- the map is good size with plenty to explore. I love that it's split into areas like town area, industrial area and hunting specific areas. You HAVE to go exploring if you want to survive. I find that other games have an abundance of resources which make it too easy to stay full and hydrated, and too comfortable in one spot.\r\n- the damage system is fun too. Eating less than fresh food or falling from too high a height will cause injury.\r\n- Graphics are simple but pleasing. \r\n- I LOVE the harvesting system in this game. You can use up the whole animal, guts, fat and all. Harvesting plant foods will give you seeds but you won't find them growing naturally. \r\n- Sounds are quite nice too. Nothing to overwhelming.\r\n- the mist event definitely gives me some chills. Not being able to see my enemies until they come running towards me is frightening but so much fun!\r\n\r\nCons:\r\n- there are a LOT of bugs that need attention. \r\n- sometimes I get stuck somewhere silly and can't get out. \r\n- some objects move about after loading back into a saved game. Some objects respawn but can't be moved,  then disappear again later. \r\n- there are no instructions on how to do things, so for some players that might be a minus. \r\n- some crafting recipes are very expensive, more expensive that they should be. \r\n- screen loading time takes a while. Longer than it should, in my opinion.\r\n- i had to set my controls before i could play the game. Normally it's pre-set by the developer\r\n- in general the game needs a bit more optimization. \r\n- some descriptions have broken English. I think developer's first language isn't English. Doesn't really bother me but should be fixed for final release. \r\n\r\nRegardless of the issues this game has a whole lot of potential and I'm looking forward to seeing what the next update will bring.!", "timestamp_created": 1711145512, "timestamp_updated": 1711145512, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.576271176338195801", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158893128": {"recommendationid": "158893128", "author": {"steamid": "76561197995133113", "num_games_owned": 141, "num_reviews": 13, "playtime_forever": 14799, "playtime_last_two_weeks": 0, "playtime_at_review": 14520, "last_played": 1709195546}, "language": "english", "review": "game has gone back to a shitty mess it will never be finished at this rate.", "timestamp_created": 1708525478, "timestamp_updated": 1708525478, "voted_up": false, "votes_up": 7, "votes_funny": 2, "weighted_vote_score": "0.555240452289581299", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157683085": {"recommendationid": "157683085", "author": {"steamid": "76561198135819165", "num_games_owned": 94, "num_reviews": 4, "playtime_forever": 76086, "playtime_last_two_weeks": 0, "playtime_at_review": 68282, "last_played": 1710257574}, "language": "english", "review": " i think the more updates it gets the worse it get map is to small it was better game yrs ago", "timestamp_created": 1707178559, "timestamp_updated": 1707178559, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.545454561710357666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157678768": {"recommendationid": "157678768", "author": {"steamid": "76561199116408480", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 5189, "playtime_last_two_weeks": 0, "playtime_at_review": 5141, "last_played": 1709409542}, "language": "english", "review": "Every update seems to bring more issues. It's a perpetual loop of disappointment.", "timestamp_created": 1707172203, "timestamp_updated": 1707172203, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.545454561710357666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157309518": {"recommendationid": "157309518", "author": {"steamid": "76561198046001506", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 1677, "playtime_last_two_weeks": 0, "playtime_at_review": 994, "last_played": 1707044711}, "language": "english", "review": "The game does things a little bit different to other survival games, it has a flavour all on its own, in a good way. How many games do you know where you can literally pile any thing you can find on the deck of your pickup truck, and it stays put while you drive? Or how about storing a whole shitload of loot in a cabinet, then simply picking up the cabinet, heave it into your pickup, and cart it into you base to place anywhere, with all the loot still safely inside? - many games wont allow this. Its a hoarders dream this game.  \nIts quite spooky too, genuine shit your pants stuff. I like the progression, its seems realistic and not rushed, although some weapons are completely OP. \nLook, don't listen to the 10 minute game review-bomb guys, its a great game, yes its has bugs, yes you have to quit to menu before loading a save game, etc,  but nothing worth crying over. If you're a fan of the genre, and are after something that has surprising depth, and genuine - \"why can't other games just do it like this?!\" moments, then this is a no brainer, plus its not expensive.", "timestamp_created": 1706767632, "timestamp_updated": 1706767908, "voted_up": true, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.545454561710357666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161563022": {"recommendationid": "161563022", "author": {"steamid": "76561198005884161", "num_games_owned": 31, "num_reviews": 2, "playtime_forever": 1075, "playtime_last_two_weeks": 0, "playtime_at_review": 773, "last_played": 1712066510}, "language": "english", "review": "Compared to the people i see ( on you-tube)..... this game has a lot to be desired. NOT So easy to play.... the inventory and the upgrades options are NOT easy to understand for a Newbie to comprehend.. yes i have played it for 12 hrs but that is many a RESTART for little or  NO GAIN.  Will be putting playing this on HOLD until for game updates a re Forthcoming.....\r\n\r\n", "timestamp_created": 1711520433, "timestamp_updated": 1711520433, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.540542125701904297", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161616680": {"recommendationid": "161616680", "author": {"steamid": "76561199022578448", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 103, "playtime_last_two_weeks": 0, "playtime_at_review": 103, "last_played": 1711581155}, "language": "english", "review": "Bought the game because one of my favorite youtubers did a series on it. Seems like the game either USED to run smoothly or it just ran smoothly for him... tutorial is lacking, mostly a series of tabs to read, keybinds frequently reset to nothing ASSUMING you can actually launch the game or move around without crashing. My pc is overkill for most games that i play and no matter what i changed in the graphics to smooth things out i kept crashing. Game has been out since 2018 and doesn't seem to be very stable. Not to mention the dev lists in title screen a fix for the keybinds reseting rather than fixing it permanently", "timestamp_created": 1711582760, "timestamp_updated": 1711582786, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.540389955043792725", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160957645": {"recommendationid": "160957645", "author": {"steamid": "76561199137108309", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 139, "playtime_last_two_weeks": 0, "playtime_at_review": 62, "last_played": 1711335380}, "language": "english", "review": "game is great i recommend making it co op sooner rather then later just so people can have fun with a friend being alone sucks but co op please add it soon", "timestamp_created": 1710897217, "timestamp_updated": 1710897217, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.53041541576385498", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162906981": {"recommendationid": "162906981", "author": {"steamid": "76561198285927712", "num_games_owned": 172, "num_reviews": 12, "playtime_forever": 1134, "playtime_last_two_weeks": 42, "playtime_at_review": 1134, "last_played": 1713146895}, "language": "english", "review": "First time I played this game like mby 3 years ago. I played it 18 hours straight. loved it every thing was amazing. the building the freedom. now I downloaded it again to try it and see the new updates.\r\n\r\nLittle did I know. the games is much worse now. I loved the game but the game now is just not fun. I spawned in with 4 bears how is it even 4 bears so close to eachother. then they knocked me under the world. \r\n\r\nthen there is the graphics. way is it so worse now. was more smooth and simple before. now it just felt like sandpaper for my eyes. \r\n\r\nalso for some reason zombies just spawn on you now. like legit 1 meter in front off you. even thoe I had viewdistance and all on top. zombies just spawned there. logged out of the world cam, then when I went on again I just fell from the sky. like 2 meters and lost all my HP.\r\n\r\nI dont know what you have done to the game but it feels so much worse.", "timestamp_created": 1713147326, "timestamp_updated": 1713147326, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159239764": {"recommendationid": "159239764", "author": {"steamid": "76561198167570295", "num_games_owned": 42, "num_reviews": 1, "playtime_forever": 1172, "playtime_last_two_weeks": 0, "playtime_at_review": 1169, "last_played": 1708867776}, "language": "english", "review": "Fun and awesome to play.", "timestamp_created": 1708865826, "timestamp_updated": 1708865826, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158165229": {"recommendationid": "158165229", "author": {"steamid": "76561198367123848", "num_games_owned": 411, "num_reviews": 21, "playtime_forever": 32, "playtime_last_two_weeks": 0, "playtime_at_review": 32, "last_played": 1707752272}, "language": "english", "review": "Game is crashing permanently, The load of save does not work at all.", "timestamp_created": 1707752370, "timestamp_updated": 1707752370, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157879246": {"recommendationid": "157879246", "author": {"steamid": "76561198997822586", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 521, "playtime_last_two_weeks": 0, "playtime_at_review": 6, "last_played": 1708146150}, "language": "english", "review": "Everything is either pink or very bright. Ive tried uninstalling and re-installing with no luck. Framerate and everthing else seems ok, just no colours than pink or white.", "timestamp_created": 1707426365, "timestamp_updated": 1707426365, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157909131": {"recommendationid": "157909131", "author": {"steamid": "76561198150972282", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 4034, "playtime_last_two_weeks": 0, "playtime_at_review": 4034, "last_played": 1707464840}, "language": "english", "review": "It's unplayable ! \nToo many glitches and too many bugs. \nGame crashes at starting and loading. \nRendering is worst part of this game, trees appear several minutes after you start game. \nIt is not optimized and even in lowest graphics computer can't handle it.\n\nwaiting until devs fix these issues ...", "timestamp_created": 1707465340, "timestamp_updated": 1707465340, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523622035980224609", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159301738": {"recommendationid": "159301738", "author": {"steamid": "76561199584591090", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 707, "playtime_last_two_weeks": 0, "playtime_at_review": 693, "last_played": 1710844260}, "language": "english", "review": "its a master peice of a game but the only bad thing is the bugs and to me the game is like a mix of 7days to die the last of us and dayz and days gone 10/10 would buy ;]", "timestamp_created": 1708921824, "timestamp_updated": 1708921824, "voted_up": true, "votes_up": 1, "votes_funny": 4, "weighted_vote_score": "0.52173912525177002", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157801218": {"recommendationid": "157801218", "author": {"steamid": "76561198062609832", "num_games_owned": 51, "num_reviews": 4, "playtime_forever": 2622, "playtime_last_two_weeks": 0, "playtime_at_review": 2622, "last_played": 1707333745}, "language": "english", "review": "Was a cool game when it first started.  Not any more.  It has changed so much and looks cheesy comparatively.", "timestamp_created": 1707333864, "timestamp_updated": 1707333864, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.52173912525177002", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "163045107": {"recommendationid": "163045107", "author": {"steamid": "76561198899527748", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 8736, "playtime_last_two_weeks": 2957, "playtime_at_review": 5820, "last_played": 1713799530}, "language": "english", "review": "game worked ive bin away for a while and lost all my game saves and now ive loaded the latest version nothing works and i can move but interact with nothing or use any items", "timestamp_created": 1713361975, "timestamp_updated": 1713361975, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.519230782985687256", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159720629": {"recommendationid": "159720629", "author": {"steamid": "76561197998726402", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 1926, "playtime_last_two_weeks": 0, "playtime_at_review": 1298, "last_played": 1709627361}, "language": "english", "review": "The game bugs for me ruin the experience. Also, I'm left handed and the rebind keys are a problem.  \n\nThe hours I had put into this game amount to the premise and mechanics.\nThe frustration was the only reason I stopped playing the game.\n**I will change my review when the game runs smoother.", "timestamp_created": 1709416395, "timestamp_updated": 1709423883, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.519230782985687256", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158565979": {"recommendationid": "158565979", "author": {"steamid": "76561199589171293", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 719, "playtime_last_two_weeks": 0, "playtime_at_review": 595, "last_played": 1708221660}, "language": "english", "review": "the only thing i dont like about the game in the gun sounds there a little soft", "timestamp_created": 1708205894, "timestamp_updated": 1708205894, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.518915653228759766", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159802582": {"recommendationid": "159802582", "author": {"steamid": "76561198000215688", "num_games_owned": 0, "num_reviews": 131, "playtime_forever": 104, "playtime_last_two_weeks": 0, "playtime_at_review": 104, "last_played": 1535157524}, "language": "english", "review": "Another developer that making an illusion of working process.", "timestamp_created": 1709501178, "timestamp_updated": 1709501178, "voted_up": false, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.515594005584716797", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158598210": {"recommendationid": "158598210", "author": {"steamid": "76561199481704155", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 2638, "playtime_last_two_weeks": 405, "playtime_at_review": 1458, "last_played": 1713221393}, "language": "english", "review": "It is an interesting survival game with a new change to the zombie as well as having different locations and weapons like a flame thrower. Although it has some small bugs I would recommend", "timestamp_created": 1708233653, "timestamp_updated": 1708233653, "voted_up": true, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.514705896377563477", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161803333": {"recommendationid": "161803333", "author": {"steamid": "76561198865408240", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 4662, "playtime_last_two_weeks": 0, "playtime_at_review": 4662, "last_played": 1711802957}, "language": "english", "review": "Just simply don’t. If you want to waste money on a game that doesn’t work anymore, sure, go ahead. It was great when it first launched but now it’s unplayable. Dev says to do that to fix that but a player shouldn’t be fixing anything AFTER 6 YEARS. Honestly, annoying af, I hope the game gets better soon.", "timestamp_created": 1711805353, "timestamp_updated": 1711805353, "voted_up": false, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.513974249362945557", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157212124": {"recommendationid": "157212124", "author": {"steamid": "76561198046492693", "num_games_owned": 35, "num_reviews": 4, "playtime_forever": 200, "playtime_last_two_weeks": 0, "playtime_at_review": 200, "last_played": 1706645383}, "language": "english", "review": "this game is broken. crashes, bugs, you name it. yeah its only $11 but its $11 too much. game doesnt need more content, what it has needs to be fixed. 5 years old already and still an awful experience.", "timestamp_created": 1706645530, "timestamp_updated": 1706645530, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.513605415821075439", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159794533": {"recommendationid": "159794533", "author": {"steamid": "76561198059378013", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 2383, "playtime_last_two_weeks": 0, "playtime_at_review": 2383, "last_played": 1709490066}, "language": "english", "review": "bad", "timestamp_created": 1709493497, "timestamp_updated": 1709493497, "voted_up": false, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.510996103286743164", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157174852": {"recommendationid": "157174852", "author": {"steamid": "76561198023387850", "num_games_owned": 0, "num_reviews": 43, "playtime_forever": 13, "playtime_last_two_weeks": 0, "playtime_at_review": 13, "last_played": 1706605297}, "language": "english", "review": "The FOV is cancer. Also force motion blur & RIP 60 FPS", "timestamp_created": 1706605371, "timestamp_updated": 1706605371, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.507274091243743896", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160818169": {"recommendationid": "160818169", "author": {"steamid": "76561198036071570", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 616, "playtime_last_two_weeks": 0, "playtime_at_review": 616, "last_played": 1703354709}, "language": "english", "review": "was able to play it when it first came out, now, it's just a resource hog and unplayable.\n\ngreat ambition from the developer but sadly you need a super computer to play.", "timestamp_created": 1710731839, "timestamp_updated": 1710731839, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.504649460315704346", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "162636843": {"recommendationid": "162636843", "author": {"steamid": "76561198006354797", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 4404, "playtime_last_two_weeks": 0, "playtime_at_review": 4404, "last_played": 1708364386}, "language": "english", "review": "Best survival game.. from 2018 :)", "timestamp_created": 1712798297, "timestamp_updated": 1712798297, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.504291832447052002", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "159191693": {"recommendationid": "159191693", "author": {"steamid": "76561198233337028", "num_games_owned": 69, "num_reviews": 9, "playtime_forever": 410, "playtime_last_two_weeks": 0, "playtime_at_review": 410, "last_played": 1616965928}, "language": "english", "review": "multiplayer, just add multiplayer.", "timestamp_created": 1708814907, "timestamp_updated": 1708814907, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.504137516021728516", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158130292": {"recommendationid": "158130292", "author": {"steamid": "76561198021603438", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 139, "playtime_last_two_weeks": 0, "playtime_at_review": 139, "last_played": 1707692420}, "language": "english", "review": "Played for 2 hours, had tons of game breaking bugs, I get this is early access, but when you're running along and then fall through the world, its not great.  Stuck in the filling up a petrol can animation with no way of getting out of it. there is promise of a good game here, but at the moment i cannot recommend, even as an early access title as it is simply frustrating.", "timestamp_created": 1707708278, "timestamp_updated": 1707708278, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504132211208343506", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "158107937": {"recommendationid": "158107937", "author": {"steamid": "76561198254054802", "num_games_owned": 176, "num_reviews": 69, "playtime_forever": 16, "playtime_last_two_weeks": 0, "playtime_at_review": 16, "last_played": 1707680164}, "language": "english", "review": "OMG ive seen better in indie games here we have some of the jankiest stuff ive ever played...foliage issues all over the place,watch grass itself anything draw in less than hundred yards away....area i started in there was white seqment line going through ground in straight line from the ground terrain being melded together improperly....the animations are horrible had a bear fight me and wacked it 20 times with a axe did nothing jankiest combat period due to clunky movement\n\nFounds numerous issues in the game user config that engine saves the graphic stuff to...instead of optimizing the game properly dev decided to reduce the resolution quality setting to 0(this will make it look lower resolution when set at even 1080p),the AA quality to 0 other stuff to 2/3 settings which in game u set stuff to epic quality it should be quality setting of 5 not 3 which is only high quality in editor....\n\nGame uses borderless full screen mode which is another problem with fps ...fullscreen has a dedicated window seperate from desktop...i managed to force game to use fullscreen fps went up considerably and smoother motion but i couldnt tolerate the jank generic overall sloppy quality to the game after 15 minutes of play time\n\nsave your money this dev has no idea what there doing and gurrentee the game assets are flips off the marketplace...asked for a REFUND", "timestamp_created": 1707681556, "timestamp_updated": 1707681706, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504132211208343506", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "160590452": {"recommendationid": "160590452", "author": {"steamid": "76561198932011053", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 14980, "playtime_last_two_weeks": 0, "playtime_at_review": 14980, "last_played": 1710514687}, "language": "english", "review": "Could be a very good game, but nowadays can't play it. Every time I'm spawning in, there's no trees, the ground is pixelated, ect. Then the game suddenly crashes. Am I doing something wrong?", "timestamp_created": 1710515011, "timestamp_updated": 1710515011, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.504098355770111084", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "161341411": {"recommendationid": "161341411", "author": {"steamid": "76561198133774923", "num_games_owned": 57, "num_reviews": 16, "playtime_forever": 36, "playtime_last_two_weeks": 0, "playtime_at_review": 36, "last_played": 1711277726}, "language": "english", "review": "I was excited to try this but the game is not playable. It crashed on my first attempt to launch it. Fine, no big deal. Rebooted my computer just to make sure everything was sitting right after install. Tried again and got in. Took a bit to load in all the textures, whatever, my gaming laptop is mid-tier, so I lowered all the graphics options to medium. Looks pretty rough now but that's fine, as long as the gameplay and story are good I don't really care. Next I found out I can't interact with anything. Go in to keybindings and they're all empty. Ok...weird that I have to set all my own keybindings but whatever. Set them all. Exit the menu and still cant interact with anything. Go back to keybindings and they've all been changed to what I'm assuming the defaults were supposed to be. Annoying, but ok, no problem. Except on screen it still just says \"None to pick up bottle\" and \"None to open door\" and I still can't interact with anything. Changing the key bindings doesn't work.  I'm definitely returning the game and will try again when it is released in full. Right now the game is not playable for me at all.", "timestamp_created": 1711278155, "timestamp_updated": 1711278155, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157919199": {"recommendationid": "157919199", "author": {"steamid": "76561198802266620", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 5660, "playtime_last_two_weeks": 0, "playtime_at_review": 5354, "last_played": 1709471015}, "language": "english", "review": "IT WAS A GOOD GAME!... i used to have so much fun!\nis unplayable in its current state. i wouldn't waste my money nowadays.\nam seriously dissapointed with the game breaking glitches i have encountered.\n\nwhat the hell devs?\n", "timestamp_created": 1707480286, "timestamp_updated": 1707480286, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "157665031": {"recommendationid": "157665031", "author": {"steamid": "76561198801089522", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 814, "playtime_last_two_weeks": 0, "playtime_at_review": 595, "last_played": 1707240512}, "language": "english", "review": "To all the people complaining about certain issues and picking apart the entire game, you gotta realise this isn't a huge dev team, alot of the issues you face regards to losing stuff would be fixed by saving more often and truthfully would I recommend this game? Yes 1000% it has major potential and currently it's one of the better survival horror games, but just be aware you may run into some issues but give the game and team  a break atleast it isnt the yandere dev making this and the updates are constantly working to fix all the issues and expanding the game even more i mean this has been cared for  since i believe release in 2018? that's 6 years of working towards getting this game finished and maintained, most small teams would give up after 3 years but these guys are doing an amazing job.", "timestamp_created": 1707157415, "timestamp_updated": 1707157415, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "124991116": {"recommendationid": "124991116", "author": {"steamid": "76561198147839364", "num_games_owned": 125, "num_reviews": 8, "playtime_forever": 59, "playtime_last_two_weeks": 0, "playtime_at_review": 59, "last_played": 1662280378}, "language": "english", "review": "Would you like the dev to add Co-Op/Multiplayer to this game? select your answer below!", "timestamp_created": 1667659073, "timestamp_updated": 1667659073, "voted_up": true, "votes_up": 1742, "votes_funny": 29, "weighted_vote_score": "0.926551997661590576", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "67363950": {"recommendationid": "67363950", "author": {"steamid": "76561198301602538", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 1366, "playtime_last_two_weeks": 0, "playtime_at_review": 324, "last_played": 1668525747}, "language": "english", "review": "Just add at least two-players multiplayer so we can play with our friends and this game will be lit!", "timestamp_created": 1586955105, "timestamp_updated": 1586955105, "voted_up": true, "votes_up": 259, "votes_funny": 3, "weighted_vote_score": "0.926149129867553711", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "45525226": {"recommendationid": "45525226", "author": {"steamid": "76561197977696322", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 3924, "playtime_last_two_weeks": 0, "playtime_at_review": 2227, "last_played": 1563635296}, "language": "english", "review": "Its early afternoon and I spot a wrecked car on the deserted road. I open the hood, and locate the engine. I need the battery and the sparkplug, but its gonna take time to dismantle. Im getting nervous. Putting my face down in the engine for several minutes is dangerous in this world. I look down the road..nothing. I look up the road...all quiet. Ok, lets do this.\nI dig in and start to remove the parts. \n\n15 min later Im done. I look up the road...nothing. I look down the road...mist in the distance! Its creeping closer and closer. Panic is building up! I need to find a shelter...fast! The car is not an option. I see a garage in the distance. Run! Im almost out of breath when I reach the building. Luckily the doors and windows are complete and in order. I shut the door behind me, and take cover beside the window. \n\nThe mist is covering the garage completely, and an eerie silence fills the room. Im fixed at the window, nervously looking for any sign of danger. For several minutes there is nothing but silence. Then a faint humming noise...something is moving in the distace. I press my face against the window, stare into the mist...and my heart suddenly jumps! Out of the fog comes the infected. First one, then several others. They surround the garage and scratch at the walls. \nThey know I am there, but they can not get in. \nIm nervous, but still feel safe. What a great feeling. 10/10", "timestamp_created": 1540932558, "timestamp_updated": 1541019716, "voted_up": true, "votes_up": 244, "votes_funny": 18, "weighted_vote_score": "0.922274529933929443", "comment_count": 10, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "119290015": {"recommendationid": "119290015", "author": {"steamid": "76561198008720705", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 46325, "playtime_last_two_weeks": 0, "playtime_at_review": 35360, "last_played": 1709855020}, "language": "english", "review": "The guys trying. I mean he's *really* trying. To me the dev of this game seems to have a lot of real life issues or problems pertaining to time. And for a game developer who *was* working alone, I think he's working with a small team now, I wouldn't be hard on that. Considering everything, it's a pretty solid game, and the updates do come, they're just obviously very slow. \nIf you like early access games, and you don't mind waiting a long time, and you enjoy The Forest to some degree, I think you'd like this game, and it's worth the money. \nIf you want content more consistant and ready, I would pass on this for now, maybe put it on your wishlist, and come back to it when it's more your speed. \n\nThe game itself is very engaging. The bandits aren't impossible, they can be hard, some are easy. Just a matter of aim, patience and observation. The mist gets you off guard, absolutely. You kind of have to be ready to hide somewhere if you're not ready to run through it or don't have a car yet. \nBears are the spawn of everything unholy, in every friggin' game. This ones no different. I'd be more terrified of bears than the crawlies. \nBuilding is fun. A little limited in selection, but at the same time, use your imagination. lol Definately does need a little more love. \nOverall, it's worth it if you like early access stuff. If you don't, save it, I feel like it'll be worth it to you later on.", "timestamp_created": 1658535456, "timestamp_updated": 1658535456, "voted_up": true, "votes_up": 124, "votes_funny": 2, "weighted_vote_score": "0.914250671863555908", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "66783700": {"recommendationid": "66783700", "author": {"steamid": "76561198331457893", "num_games_owned": 425, "num_reviews": 28, "playtime_forever": 876, "playtime_last_two_weeks": 0, "playtime_at_review": 703, "last_played": 1586690589}, "language": "english", "review": "normally i tend to be the guy that gets frustrated by dying a few times in quick succession but this game just wants you to explore further and try again.\n\ni died 9x in the first 45 minutes,\n\ni got mauled by a bear. 4x slapped by zombies. 2x shot by bandits, 2x fell to my death. its a great enviroment to get lost in and alot of anxiety when you are far from your base on a scavenge hunt and mist starts to appear. To leave you guys with an impression of a situation i was just in please read on:\n\nWanted to take down big bandit camp, got spotted by the sniper, tried to run around to flank but mist came.. I was far as fuck from my base so I needed shelter, stumbled off some rocks and sprained my ankle, from this point on i couldnt run any more. Mist is here now so are the mutants, I find a house where I hold up in the garage. I hear a mutant outside... He comes in... I hug the wall while aiming for the door, don't wanna shoot cause don't wanna attract more mutants, the zombie didn't see me cause I hugged the wall and stumbled along, straight past me while i was aiming for his head. Moved to the bathroom to close to door and waited the fog out with the growling of the mutants in my ear.\n\nNever have i ever clenched my buttcheeks this hard. 10/10.", "timestamp_created": 1586215454, "timestamp_updated": 1586215454, "voted_up": true, "votes_up": 115, "votes_funny": 58, "weighted_vote_score": "0.91013789176940918", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "73451450": {"recommendationid": "73451450", "author": {"steamid": "76561198950632913", "num_games_owned": 42, "num_reviews": 4, "playtime_forever": 121, "playtime_last_two_weeks": 0, "playtime_at_review": 121, "last_played": 1592781589}, "language": "english", "review": "Love it but would love it even more if you made it CO-OP. It really gets boring playing by yourself. Thank you..", "timestamp_created": 1596004197, "timestamp_updated": 1596004197, "voted_up": true, "votes_up": 237, "votes_funny": 5, "weighted_vote_score": "0.906231462955474854", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "124921389": {"recommendationid": "124921389", "author": {"steamid": "76561199389819367", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 40805, "playtime_last_two_weeks": 398, "playtime_at_review": 14350, "last_played": 1713348053}, "language": "english", "review": "\nlook forward to the upgrades.\n\n", "timestamp_created": 1667546910, "timestamp_updated": 1682921427, "voted_up": true, "votes_up": 132, "votes_funny": 3, "weighted_vote_score": "0.905225932598114014", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "156270391": {"recommendationid": "156270391", "author": {"steamid": "76561198127050072", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 20062, "playtime_last_two_weeks": 1309, "playtime_at_review": 18533, "last_played": 1713677541}, "language": "english", "review": "just needs co-op", "timestamp_created": 1705633029, "timestamp_updated": 1705633029, "voted_up": true, "votes_up": 157, "votes_funny": 1, "weighted_vote_score": "0.904667079448699951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "77801094": {"recommendationid": "77801094", "author": {"steamid": "76561198959316344", "num_games_owned": 221, "num_reviews": 4, "playtime_forever": 600, "playtime_last_two_weeks": 0, "playtime_at_review": 351, "last_played": 1696485486}, "language": "english", "review": "This Game needs co-op!", "timestamp_created": 1603095148, "timestamp_updated": 1603095148, "voted_up": true, "votes_up": 143, "votes_funny": 4, "weighted_vote_score": "0.903371274471282959", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44454222": {"recommendationid": "44454222", "author": {"steamid": "76561198043671770", "num_games_owned": 0, "num_reviews": 99, "playtime_forever": 8942, "playtime_last_two_weeks": 0, "playtime_at_review": 576, "last_played": 1709476485}, "language": "english", "review": "Update 3/3/2024: After having not played the game for quite some time, I attempted to load up and play today, just a moment ago.  Other recent reviewers are correct.  The game is currently unplayable.  I have a very high end system  that Ive played Mist on before.  My previous, older system could also run Mist well. When I tried to play Mist today, The screen locked up the moment that any landscape loaded.  In other words, I got through the \"A mysterious thing happened with mysterious fog\" screen without a hitch,  and then had no problem selecting \"new game\" and then another menu type screen(cant remember exactly what it was) but as soon as the game loaded up the character/environment, it froze solid.  Could see the general landscape and mountains in the distance but absolutely no bloom. So, at least for now, and despite the fact that I liked playing Mist, I must change my review to negative.  One cannot consider a game to be positive if the game cannot be played.  Dont waste your money until you know if this issue has been fixed.\n\n\n\n\nMist is a great start on a good Zombie survival/crafting type game.  Its quite similar to 7 days to die but I like the graphics style and over all game atmosphere better so far.  There are no minibikes but you can fix up and drive cars which I also like better.  One thing to know before you buy Mist is that there is pretty much no tutorial to speak of at the moment.  This isnt a huge deal since all I did was start a new game once I had made my mistakes and figured things out better.  I keep seeing other reviewers complain that multiplayer hasnt been instituted in Mist yet.  Well, Im not sure that it ever will be.  Right in the main description for this game it states as clear as day that its a single player game.  Im ok with that too since I prefer to play single player in all my games.  So anyway, for the small price, Mist is a great deal.  Its fun enough as is and if the devs keep on going with it, I cant see how they can go wrong.  Even if you dont like to buy EA games, Id put this one on my watch list.", "timestamp_created": 1535587640, "timestamp_updated": 1709477177, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.887290120124816895", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "73921798": {"recommendationid": "73921798", "author": {"steamid": "76561198027400738", "num_games_owned": 400, "num_reviews": 45, "playtime_forever": 412, "playtime_last_two_weeks": 0, "playtime_at_review": 368, "last_played": 1659931870}, "language": "english", "review": "My biggest problem with games like these is how focused they are on the open world and collecting materials aspects, but how much they restrict the \"open world\" and \"collecting materials\" aspects. \nYou're fighting for survival and you need to craft an item—you need rocks and sticks. Perfect, there are plenty of rocks and sticks around! But they aren't the right rocks and sticks the game wants you to have. They're just static objects to populate the environment, you can't actually pick them up. Need scrap metal or wood and see a huge pile of it? Too bad, it's just a static object. See some cars off in the distance and hope they have some stuff in their trunks to loot? Too bad, they're just static objects. Have a crowbar in hand and can see items in a locked motel room with a HUGE glass window? Too bad, you can't break the window. When you're exploring an \"open world\" and it's so restricted, you notice the things you CANT do more than the things you can. This game has way more things you CANT do compared to things you can.\n\nAlso, if I kill a group of bandits that are loaded to the teeth and are shooting at my with ARs, WHY CAN I NOT LOOT THEIR WEAPONS, AMMO AND ARMOR?? I killed a group of 4 bandits, looted all 4 bodies. What did I get? 1 carrot. 1 CARROT!! WERE THEY SHOOTING ME WITH CARROTS???\n\nI cannot recommend this game in its current state. It has potential, but it's massively unrealized.", "timestamp_created": 1596815636, "timestamp_updated": 1596815636, "voted_up": false, "votes_up": 345, "votes_funny": 98, "weighted_vote_score": "0.882623672485351563", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "127730599": {"recommendationid": "127730599", "author": {"steamid": "76561198096709977", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1628, "playtime_last_two_weeks": 0, "playtime_at_review": 1628, "last_played": 1669947226}, "language": "english", "review": "Update: The developer has decided to reintegrate the previous map into the game which I am really happy about. Plus all the work they've been doing with Co-op is a very welcome site. I'll be honest I haven't had a chance to play the new content coming out but simply that the developer hasn't abandoned this an continues to make regular updates is very nice to see. I believe this game is worth the money and the development team is worth supporting.\n\nI would love to recommend this game, but honestly after the .5 update its just not what it used to be. They had a practically complete map with a good amount to do and were originally working on expanding that original pre .4.1 map which I was really excited about, but with the .5 update they put our a new map that has nowhere near the content or locations of their previous map and I can't for the life of me figure out why they just threw away all of that work and reverted back to what is essentially not even a half finished game. They had a solid foundation to work from before 0.5 but with this new map the game just isn't worth it anymore I will continue to hope they go back to their original map and plan of expanding it, but right now I can't recommend it which is sad because it has great potential and honestly was one of my favorite games to play. If they at least go back to the previous map and add their current work to it then I will update my review. I really hope the developers see this and make that change.", "timestamp_created": 1669948134, "timestamp_updated": 1699743371, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.872924625873565674", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "54516572": {"recommendationid": "54516572", "author": {"steamid": "76561198060401558", "num_games_owned": 0, "num_reviews": 17, "playtime_forever": 4251, "playtime_last_two_weeks": 0, "playtime_at_review": 2715, "last_played": 1706536094}, "language": "english", "review": "Honestly for a one man development team, this guy is really on to something here and I'm sure in time this will eventually be released. i wouldn't also believe the majority of the negative reviews. the dev did NOT abandon this game and by the looks of it he has loads of plans for its future. i thoroughly enjoyed the game before the new update and looking forward to see whats new. please try the game for yourselves its not that expensive, its extremely fun, immersive and just remember its still early access.", "timestamp_created": 1565268184, "timestamp_updated": 1565268184, "voted_up": true, "votes_up": 78, "votes_funny": 1, "weighted_vote_score": "0.863609254360198975", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "75500295": {"recommendationid": "75500295", "author": {"steamid": "76561198094611251", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 1612, "playtime_last_two_weeks": 0, "playtime_at_review": 987, "last_played": 1626816700}, "language": "english", "review": "---{Gameplay}---\n🔳Try not to get addicted\n🔳Very good\n☑️Good\n🔳Nothing special\n🔳Ehh\n🔳Bad\n🔳Just dont\n\n---{Graphics}---\n🔳Masterpiece\n🔳Beautiful\n☑️Good\n🔳Decent\n🔳Will do\n🔳Bad\n🔳Awful\n🔳Paint.exe\n\n---{Audio}---\n🔳Fascinating\n☑️Very good\n🔳Good\n🔳Decent\n🔳Not too bad\n🔳Bad\n🔳Earrape\n\n---{Audience}---\n🔳Kids\n☑️Teens\n☑️Adults\n🔳Everyone\n\n---{Story}---\n🔳Doesn't have\n🔳Something isnt nothing I guess\n🔳Not greatly told\n☑️Average\n🔳Good\n🔳Will make you cry a lot\n\n---{Playstyle}---\n🔳Almost never the same in any two people\n☑️Varies a little bit from person to person\n🔳Weapon AND character classes\n🔳Weapon OR character classes\n🔳Creative AND Survival\n☑️Creative OR Survival\n☑️Melee AND Ranged\n🔳Melee OR Ranged\n\n---{Difficulity}---\n🔳Just press a bunch of buttons\n🔳Easy\n🔳Significant brain usage\n🔳Easy to learn / Hard to master\n☑️Not so easy\n🔳Difficult\n🔳Dark Souls\n\n---{Grind}---\n🔳Nothing\n🔳Only if you care about leaderboards/ranks\n🔳Isnt necessary to progress\n🔳A bit grindy sometimes\n🔳Average grind level\n☑️A bit grindy\n🔳Insanity\n\n---{Game Time}---\n🔳Long enough for a cup of tea\n🔳Short\n🔳Average\n🔳Long\n☑️Depends on you\n🔳Endless\n\n---{Price}---\n🔳Just buy it\n☑️Worth the price\n🔳Wait for sale\n🔳Maybe if you have some spare money left\n🔳Not recommended\n🔳Dont throw money into a rubbish bin\n\n---{Micro-Transactions}---\n🔳EA\n🔳Mobile Game(Necessary if you don’t want to wait 15 weeks to construct a toaster)\n🔳”Premium” Currency AND Normal Currency\n🔳”Premium” Currency OR Normal Currency\n🔳Quick way to advance\n🔳Fortnite(Skins/Emotes/Etc)\n🔳Only to show off big time\n🔳Level DLC\n☑️None\n\n---{Bugs/Glitches}---\n🔳Never had any\n🔳Minor bugs/glitches\n☑️Few bugs/glitches\n🔳Can get annoying\n🔳Ruining the game\n🔳The game itself is a big terrarium for bugs/glitches\n\n---{?/10}---\n🔳1\n🔳2\n🔳3\n🔳4\n🔳5\n🔳6\n🔳7\n☑️8\n🔳9\n🔳10", "timestamp_created": 1599331348, "timestamp_updated": 1599331348, "voted_up": true, "votes_up": 150, "votes_funny": 10, "weighted_vote_score": "0.861214816570281982", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "79362435": {"recommendationid": "79362435", "author": {"steamid": "76561198065812018", "num_games_owned": 374, "num_reviews": 6, "playtime_forever": 614, "playtime_last_two_weeks": 0, "playtime_at_review": 108, "last_played": 1703589204}, "language": "english", "review": "Please make a 2 - 4 player co-op mode , that will rock so hard :)", "timestamp_created": 1605541609, "timestamp_updated": 1605541609, "voted_up": true, "votes_up": 91, "votes_funny": 2, "weighted_vote_score": "0.857627332210540771", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "88368538": {"recommendationid": "88368538", "author": {"steamid": "76561198185841691", "num_games_owned": 76, "num_reviews": 4, "playtime_forever": 94, "playtime_last_two_weeks": 0, "playtime_at_review": 94, "last_played": 1611672024}, "language": "english", "review": "The game is fun and has a great gameplay but it kinda got a bit lonely so i stopped playing. but if you are the kind of person who prefers to play single games, this game is for you. but if you ask me, the developers should really make this a co-op game.", "timestamp_created": 1615650016, "timestamp_updated": 1615650016, "voted_up": true, "votes_up": 115, "votes_funny": 2, "weighted_vote_score": "0.85706937313079834", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44283683": {"recommendationid": "44283683", "author": {"steamid": "76561198339919699", "num_games_owned": 298, "num_reviews": 12, "playtime_forever": 269, "playtime_last_two_weeks": 0, "playtime_at_review": 117, "last_played": 1582668955}, "language": "english", "review": "I just got this game and so far I really like it it's better than a lot of other suvival games out there. There are a lot of aspects to this game which makes it original such as being able to fix and remake cars, Being able to survive in any enviorment, The crafting, etc. The loot is not to hard to find which makes it more enjoyable than othert survival games out there where it takes hours to find a gun or even a knife, In this game you can find that if you played for maybe 30-40 mins, but you do have the danger of dying and losing that gun. On that note I have some suggestions for the developer that would make the game better!\n\n1. radomized spawning - I think if you spawed at a different base everytime you start a new game would make it a little more interesting I know their is random spawning already but for diverse.\n2. more crafting recipes for structures\n\n3. co-op mode might be a good idea for the future\n\n4. rebuilding broken down buildings and living in them such as crafting doors and such.\n\n5. maybe a bigger map in the future\n\nI would like the developer to focus on the big things before he implements harder aspects to the game so maybe co-op can come for the future.\n\nIf the creator is looking at this maybe implementing this would be amazing for the future.\n\nNice job on your game!", "timestamp_created": 1534808741, "timestamp_updated": 1535309384, "voted_up": true, "votes_up": 310, "votes_funny": 7, "weighted_vote_score": "0.855506837368011475", "comment_count": 23, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "64831207": {"recommendationid": "64831207", "author": {"steamid": "76561198135913580", "num_games_owned": 0, "num_reviews": 65, "playtime_forever": 2382, "playtime_last_two_weeks": 0, "playtime_at_review": 1064, "last_played": 1650915962}, "language": "english", "review": "Nice. Hope to see multiplayer option of the game somewhere in the future.", "timestamp_created": 1583875821, "timestamp_updated": 1583875821, "voted_up": true, "votes_up": 93, "votes_funny": 3, "weighted_vote_score": "0.853708028793334961", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "121789218": {"recommendationid": "121789218", "author": {"steamid": "76561199387181798", "num_games_owned": 144, "num_reviews": 3, "playtime_forever": 1539, "playtime_last_two_weeks": 0, "playtime_at_review": 198, "last_played": 1708557715}, "language": "english", "review": "I watched Fooster playing this game and build myself a Rig just to play it really recommend it. Waiting for co-op. 😉", "timestamp_created": 1662389879, "timestamp_updated": 1662389879, "voted_up": true, "votes_up": 122, "votes_funny": 10, "weighted_vote_score": "0.853616535663604736", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "91788158": {"recommendationid": "91788158", "author": {"steamid": "76561198128731755", "num_games_owned": 329, "num_reviews": 8, "playtime_forever": 5496, "playtime_last_two_weeks": 0, "playtime_at_review": 3889, "last_played": 1701924832}, "language": "english", "review": "I love this game. I'm currently 65 hours into it and still having a blast. There are some bugs that you will come across but that's to be expected with an early access game. Let me dive right in and give some thoughts and helpful tips for new players or those thinking of buying the game.\n1. When you first spawn in, look around and loot all you can. Be sure to grab the backpack nearby too and check the little wooden container. You don't want to stay here. There is absolutely 0 protection from anything. Your best bet is to find a cabin or some sort or a white house and start setting up shop even if it's just temporary.\n2. Daytime starts at 5 am (the birds will start singing) and nighttime starts at around 19:30ish, although I've never encountered a zombie before 22:00... yet.\n3. Mist encounters last anywhere from 1 to 4 hours. You can hide up in water towers (zombies can't climb... yet), inside cabins that have no boarded up windows (zombies can break through boarded up windows and come inside to kill you - if the window isn't boarded up, then zombies can't enter through it), inside drivable vehicles if you've restored them, on top of the taller army vehicles, some of the motel rooms are zombie free and safe to hide in, the ranger towers are great, upstairs in the white houses there are bedrooms with doors you can shut and be safe. There are other places, but those are just a few that are easy to come across.\n4. Hitting TAB brings up some basic stats as well as the time.\n5. Read the dang tutorial. It's got some helpful beginning information about your stats and such.\n6. I try to carry at least 1 food, 1 water, 1 bandage and a way to defend myself at all times.\n7. Don't eat uncooked food or drink unsafe water. It tells you if food is raw or not and it says safe/unsafe on water. Colas are common and always safe. Potatoes NEED to be cooked. The other veggies can be eaten without cooking.\n8. The livestock fencing keeps the zombies out. You can place then build them over the boarded up windows and make your building safe to live in. Zombies don't break them at all. I like to live in the white houses, use the livestock fencing to block all the boarded up windows and build a big area out front that holds my blacksmith and other items. Also gives me a place to stab the zombies in the face with a spear without getting hit if I want that extra loot! The zombies will gather at whatever livestock gates you've put along your livestock fence and you can safely stab them and collect loot after the mist or night has ended.\n9. The biggest tip I can give you is to save often. Get a good loot run? Save. Kill a bear? Save. Save. Save. If you die, you have 2 options, respawn and chance a bunch of your stuff being gone or quit to menu and resume from your last save point. If you save often it's never a big loss to quit to menu and come back into the game.\n10. Temperature is currently irrelevant as of right now. There is no winter. There is no pants or jacket in game yet.\n11. There is no map in game (yet?), but you can easily google search for one. \n12. Suitcases, lockers, and some of the small wooden crates can be storage containers. You can pick them up with M and move them to your base.\n13. You can search the cars that don't have tinted windows. Don't forget to check under the hood for gas (if you've got a jerrycan) or spare car parts. There is usually goodies in the trunk and sometimes inside the cars themselves. The vehicles with tinted windows you can destroy with an axe or sledgehammer for metal scraps, components, wood, car parts, etc...\n14. If your fatigue bar reaches 0, your stamina will NOT regenerate. The only way to fix that is to rest or sleep. Sometimes eating/drinking helps if your fatigue/stamina is low since it forces you to rest a bit. So make sure you're sleeping regularly to keep that fatigue bar in good condition.\n15. If you rescue one of the AI's, you can give them a gun. They will help defend your base.\n16. Absolutely under no circumstances log out of the game or save inside of a mine. You will fall through the world and die with no way out except to respawn and lose a bunch of stuff in the process.\n17. Be on the lookout for backpacks to increase your inventory size. They are spread out everywhere. Bandit camps usually have 1, ranger towers, starting locations, etc. Just walk up and hit F on them to expand your inventory.\n18. Once you repair a vehicle, try to keep some spare parts and gas in the trunk or in a storage container if you've got a truck. If something goes wrong,  you will want to have them handy to fix your vehicle so you can get home easily. \n19. You can put storage containers in the bed of the trucks you fix up. Lockers, suitcases, small wooden crates, or you can simply stand on the tailgate and yeet items into the back from your inventory. You can put items like the sawbench, workbench, water containers etc back there too. \n20. When you're searching for loot, be sure to check nightstands, dressers, cupboards, wardrobes, anything with drawers. There is hidden goodies in there sometimes.\n21. Be careful with heights. It doesn't take much to get a sprained ankle at which point you will be stuck walking until it heals 30+ in game minutes (and that's if you're lucky and have painkillers). If you're out in the world that makes you an easy target for zombies, bandits and bears since you can't run away.\n22. If you're having a hard time finding items on the ground like sticks, rocks, feathers, leaves.. you can turn down the foliage in the settings. Sorta cheaty but who am I to judge, I'm blind as a bat and use this trick myself hehe.\nI really hope they add a co-op or multiplayer function to this game. It would absolutely make it 100% better to be able to play with friends. Also the ability to mod it would be fantastic too!\nRemember, save often and have fun!\nThis review has been posted on 5/10/2021 and the game is subject to change which can make some of these tips useless in later releases.", "timestamp_created": 1620681338, "timestamp_updated": 1620681338, "voted_up": true, "votes_up": 78, "votes_funny": 2, "weighted_vote_score": "0.84959942102432251", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "133613902": {"recommendationid": "133613902", "author": {"steamid": "76561198131635246", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 1232, "playtime_last_two_weeks": 0, "playtime_at_review": 945, "last_played": 1702353039}, "language": "english", "review": "I love the game just wish that it would come out with co-op.", "timestamp_created": 1677360717, "timestamp_updated": 1677360717, "voted_up": true, "votes_up": 67, "votes_funny": 0, "weighted_vote_score": "0.846775352954864502", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "45594351": {"recommendationid": "45594351", "author": {"steamid": "76561197970279423", "num_games_owned": 0, "num_reviews": 54, "playtime_forever": 4071, "playtime_last_two_weeks": 0, "playtime_at_review": 3674, "last_played": 1552356742}, "language": "english", "review": "Is it fun, yes.  You feel like you need to struggle to survive, but it wasn't so hard I felt the need to rage quit.  The threat of the bears during the day and zombies in some of the houses, add just the right amount of fear of wandering around during the day.  And sets the stage for heightened fear for going out at night and raw terror if you're caught outside during the mist events that happen periodically.\n\nThe dev is regularly responding to input from the players and has added content on a regular basis.  Between the mele weapons, guns, and bows, you have your choice of ways to hunt and defend yourself.\n\nI haven't even started interacting with the AI Bandits because I'm working on my little home in the woods, but looking forward to it.\n\nIt has progression in terms of building and isn't cheesy on the mechanics.  I've had very few bugs, I think I had one where I did something no one expected, i.e. ran while building to get away from a bear, but even then it didn't mess up what I was working on.\n\nThere's always something to do and I just started messing around with chickens and small animal traps.  \n\nThe graphic detail of the hand crafted map is mind blowing...right down to the muddy sections of the mine.  I never have to try hard to pretend I'm in a post apocalyptic world.\n\ntl;dr  this is a satisfying survival game that has decent AI threats to keep you on your toes.\n\nCons?  I'd like to see more custom building/fixing up houses, but he'll probably do something about that eventually.   There are minor spelling errors i.e. loots instead of loot, but this guy can write in at least 2 languages, I can only read and write in English, so good on him for making a game I can read.", "timestamp_created": 1541215719, "timestamp_updated": 1541215719, "voted_up": true, "votes_up": 53, "votes_funny": 2, "weighted_vote_score": "0.845842957496643066", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "140069596": {"recommendationid": "140069596", "author": {"steamid": "76561198123196723", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 3300, "playtime_last_two_weeks": 0, "playtime_at_review": 3300, "last_played": 1597190677}, "language": "english", "review": "great game, I had many hours of fun but I wish it could be co-op also. i'm sure a lot more people would play with this option.", "timestamp_created": 1686781424, "timestamp_updated": 1686781424, "voted_up": true, "votes_up": 86, "votes_funny": 0, "weighted_vote_score": "0.844740092754364014", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "129808082": {"recommendationid": "129808082", "author": {"steamid": "76561198022665857", "num_games_owned": 314, "num_reviews": 5, "playtime_forever": 1275, "playtime_last_two_weeks": 0, "playtime_at_review": 1275, "last_played": 1637197878}, "language": "english", "review": "Great game, but ABSOLUTELY NEEDS CO-OP.\n\nMy wife has this, I have this, but we can't play it together, so we rarely play IT.  We play OTHER GAMES 6+ nights a week, and every night say, \"I wish MIST Survival was co-op\".  SO WE DON'T PLAY THIS.  \n\n7/10 now, would be 9.75/10 if co-op.\n\n\n\nSMH, edits for clarification.", "timestamp_created": 1672523575, "timestamp_updated": 1676408050, "voted_up": true, "votes_up": 118, "votes_funny": 3, "weighted_vote_score": "0.84309697151184082", "comment_count": 14, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "61501317": {"recommendationid": "61501317", "author": {"steamid": "76561198170860201", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 4917, "playtime_last_two_weeks": 0, "playtime_at_review": 251, "last_played": 1618326082}, "language": "english", "review": "Not usually a big fan of survival, zombie/apocalypse games. But this right here ladies and gents, is a GEM! Crafting, surviving, bulding, whoooey. The only thing that would make this game a national treasure would be to have a Co-op abilities.", "timestamp_created": 1578448609, "timestamp_updated": 1578448609, "voted_up": true, "votes_up": 82, "votes_funny": 3, "weighted_vote_score": "0.839485704898834229", "comment_count": 10, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "63081126": {"recommendationid": "63081126", "author": {"steamid": "76561198024434458", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 1426, "playtime_last_two_weeks": 0, "playtime_at_review": 233, "last_played": 1712098088}, "language": "english", "review": "I have maybe wrote 2 reviews on the 450+ games i own on steam. But this game is the rare few i wanted to say something about after reading others bad reviews.\n\nThis game is awesome, It is worth so much more then the asking price for the fun i have had. Them Z`s attacked my house and i honestly felt scared. I have not had a game actually make me afraid since i was a kid playing Resident evil. This game is SO Great and i will support it in any way i can. Yes there is a few glitches and bugs here and there but that isnt surprising with it being early access. I have had no issue with game play so far besides a few cars have the sun roof floating above the car. Besides that there is nothing bad i can really say about this game. I love it. I Cant wait to find survivors and build my home up. I would highly recommend this game to anyone who likes crafting Survival games. Just remember to watch out for that mist =P.\n\nFrom what i heard there is only one dev working on this game and i think hes doing great. I have read some the negative reviews but crap if someone can really complain about spending a entire $10.99 on this game then they have issues in my opinion. Phone apps want 9.99 for a stupid gun that breaks 9 mins after using it. I have spent 60+ on games ten times crappier then this in early access. I read another review about this being a mix between the forest and 7D2D and that made me laugh. If we want to be honest 90% of the games out there have had another game inspire them to create theirs. I personally like this game alot. But once again everyone prefers diff things. So its all about what you like. but for 10.99 you honestly cant complain. I do hope eventually the Dev adds Multiplayer.", "timestamp_created": 1581038396, "timestamp_updated": 1581039302, "voted_up": true, "votes_up": 65, "votes_funny": 6, "weighted_vote_score": "0.836077749729156494", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "69883463": {"recommendationid": "69883463", "author": {"steamid": "76561197983481828", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 22030, "playtime_last_two_weeks": 0, "playtime_at_review": 7802, "last_played": 1661545826}, "language": "english", "review": "Well, after 140 ingame days and 130hours, l think the game deservest a review!\n\nMist Survival is a Survival game (as in the name stated) with a lot of features and more to be added.\nYou need to manage your stamina, fatigue, thirst and hunger to stay alive, not to mention to avoid zombies\nand bandits while being able to build bases at preset locations OR you anywhere on the map!\nAnd for 9€ that game isn't that bad, has nice eye candy even if it's buggy here and there, and gives you a challange\nuntil you make a stable water and food income.\n\nPros and Cons for the game:\n\nPros:\n+ A lot of things to craft\n+ Base building\n+ Driveable vehicles (Landrover and Dogde Ram)\n+ Farming (Tomato and Corn)\n+ Pets (only chicken for now)\n+ NPC chars (can be used to craft instead of you)\n+ Stealth kills (bandits only)\n+ Canned food lasts for 130+ days (found 1 after 132days and still had 52% freshness on it)\n+ Hunting (bears and deer)\n+ Thinks l may forgot, but other reviews might have!\n\nCons:\n- At white house base the cars tend to flip, so you need a car jack for that\n- Also at white house, dont park in the garage coz car flips there too\n- NPC AI can be bothering (They dont see the chicken fence gate as an object)\n- NPCs can get stuck in doors while you craft\n- Bandit Snipers have see through vision (got spotted from behind 10 trees)\n- Map is big at the beginning, then gets small, since you visit the same places oer and over\n- If you make anything (crafting) and cancel, you lose the items ompletely (like making Sulfur powde out of 24 pieces, you stop after 2 powder and you lost all your pieces)\n- Even though bandits should drop seeds (corn and tomato) they dont, or l'm unlucky. Only ONE dropped so far and killed by now around 200+ bandits\n- Other small bugs\n\n\nAll together the game is still fun and l'm still playing it. \nAnd atm you can still somewhat abuse the Save → Quit to Menu → Continue, since by each start everyting respawns. \nMaking it easy to mine, or farm bandits in he small city.\nLooking forward to the new area and since it's more of a farmland, l hope we get the chance to get new seed type or more seeds (l'm just unlucky with seeds).\n", "timestamp_created": 1590575958, "timestamp_updated": 1590575958, "voted_up": true, "votes_up": 60, "votes_funny": 4, "weighted_vote_score": "0.831813931465148926", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44224796": {"recommendationid": "44224796", "author": {"steamid": "76561198064382510", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 2072, "playtime_last_two_weeks": 0, "playtime_at_review": 1679, "last_played": 1548642432}, "language": "english", "review": "Okay 6 hours in, and loving all of it. Yest there are some balance issues, and some bugs, but for being released literally 3 days ago on EA, holy shit. \n\nONE REQUEST: Please make a discord channel for your community to join and share tips and give suggestions and bug reports for the game.", "timestamp_created": 1534581085, "timestamp_updated": 1534581085, "voted_up": true, "votes_up": 65, "votes_funny": 3, "weighted_vote_score": "0.828921496868133545", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "84983945": {"recommendationid": "84983945", "author": {"steamid": "76561198381853618", "num_games_owned": 73, "num_reviews": 17, "playtime_forever": 1653, "playtime_last_two_weeks": 0, "playtime_at_review": 1644, "last_played": 1611087304}, "language": "english", "review": "Very fun awesome game just wish it was coop", "timestamp_created": 1611072950, "timestamp_updated": 1611072950, "voted_up": true, "votes_up": 60, "votes_funny": 1, "weighted_vote_score": "0.82782667875289917", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "64452112": {"recommendationid": "64452112", "author": {"steamid": "76561197966994370", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 1578, "playtime_last_two_weeks": 0, "playtime_at_review": 659, "last_played": 1586423859}, "language": "english", "review": "For a game made by a single dev, this is amazing. It is checking all the boxes for a single player base-builder during a zombie apocalypse. \n\nFreeform base building - Check. \nCrafting - Check. \nDeadly combat - Check.\nFarming - Check. \nLivestock - Check.\nHunger/Thirst - Check.\nNPCs - Check. \nVehicle System - Check.\n\nAny let downs really are some issues with the UI, lack of a story per se (there are elements that the dev is working in and they really work), the combat is perhaps too deadly (but maybe this adjusts with better grear or I am not being sneaky enough), right now to survive you need to cheese the system a little. \n\nLike the direction it is going and glad I bought it as early access. \n\nSo far I am loving it.", "timestamp_created": 1583238559, "timestamp_updated": 1583413299, "voted_up": true, "votes_up": 50, "votes_funny": 0, "weighted_vote_score": "0.825609743595123291", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44330531": {"recommendationid": "44330531", "author": {"steamid": "76561198058929800", "num_games_owned": 0, "num_reviews": 35, "playtime_forever": 731, "playtime_last_two_weeks": 0, "playtime_at_review": 551, "last_played": 1690988891}, "language": "english", "review": "-Open World\n-Big map\n-Drivable cars\n-Base building\n-Harvesting and Hunting\n-Stealth \n-Crafting\n-Looting\n-Repairing cars\n-NPCs (Hostile and Friendly)\n-Raid NPC bases\n-Breaching and Lockpicking doors\n\nAfter playing the Game for a while now I can assure you, the one reading this review. That this game has its way to be crule  and also kind to the player. As far as I know Bandits wont raid you untill Day 10 to give you time to prepare. On the other side the game doesnt tell you much about it, most of the games featurse you will explore and find out by yourself. The game runs smooth on +60FPS on Ultra settings, its very well optimised and ontop of that there are only a few minor buggs you might incounter, those buggs are usually User Interface related, just remember to hit Tab to get out of a menu.\nDo not hit ESC while carring a deployable (Workbenche,Suitcases,Bags or lockers etc) because that will cause the deployable to freeze in mid air and you wont be able to use it untill you restart your game.\n\nThose bugs/glitches however are not too bad and usually you can get rid of them quick. The game itself is its price worth and ontop of that will bring you a fair amount of ingame Hours of content.\n\n10/10 would recommend!\n", "timestamp_created": 1535026743, "timestamp_updated": 1535026743, "voted_up": true, "votes_up": 76, "votes_funny": 0, "weighted_vote_score": "0.825073897838592529", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "67510600": {"recommendationid": "67510600", "author": {"steamid": "76561198364114371", "num_games_owned": 31, "num_reviews": 7, "playtime_forever": 10699, "playtime_last_two_weeks": 0, "playtime_at_review": 5787, "last_played": 1694925264}, "language": "english", "review": "i love this game but wish they would go muil player so i can play with my friends\n", "timestamp_created": 1587147133, "timestamp_updated": 1587147133, "voted_up": true, "votes_up": 110, "votes_funny": 6, "weighted_vote_score": "0.825046360492706299", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44521463": {"recommendationid": "44521463", "author": {"steamid": "76561198071421923", "num_games_owned": 353, "num_reviews": 23, "playtime_forever": 394, "playtime_last_two_weeks": 0, "playtime_at_review": 394, "last_played": 1535856195}, "language": "english", "review": "At 6 hours into this game, I have completed everything the early access has to offer and I am confident I can give a good review for this game. \n\n [h1] Gameplay\t[/h1]\n\nThis is obviously the number one most important thing (and really the only thing) in most of these types of survival games. So how does Mist do? Well at this point it is abundantly clear that this game is in early access. There are many bugs throughout almost every feature in this game and it really does hinder the experiences at this point of the games development.\n\n   Although this game does manage to still be fun if you can really just come to roll with the punches and get use to reloading all the time. The game also does kind of lose it's immersion probably at hour 2. You will realize that zombies can be killed easily by sprinting and timing your hits, and they never will chase you outside of the houses they spawn in. The mist it's self (while an interesting concept) is not really all that scary because of the ability to abuse the zombie's poor AI.\n\n  Wildlife at this point really only contains bears and chickens. Chickens are pointless and Bears can be killed easily late game with the amount of ammo you have, or avoided outright. \n\n  Cars are pretty easy to repair but I did find myself just running around despite my fixed car more than driving so that whole mechanic can be avoided if you don't mind sprinting everywhere.\n\n  The AI really does have to be the worst part of this game so far. Zombies (as stated above) rarely pose much of a threat to you at all, where as every bandit has been coded to be a top class Navy Seal with the same health as zombies and the laser precise aim of an elite super soldier. You will find yourself save scumming a ton just to find the right way to abuse their AI and wipe out their camps. \n  \n  Lastly the map is very sparse. Many houses have nothing at all in them, some are untextured, almost all are copy and paste versions of each other and the map really just feels like you are in a big rock surrounded bowl with either instant kills walls, or no collision rocks you can walk through.\n\n[h1] Verdict\t[/h1]\n\n  While yes, Mist Survival does have an abundance of issues; the game has a ton of potential. Even at it's broken state I found myself reaching 6 hours of gameplay relatively fast and without much of a grind. If you have some money lying around and want something fun to mess around with, pick this game up. If you are looking to spend your money on a complete and polished game then I would say wait a year or 2 on this title. \n\nGameplay and mechanics: 6/10\nSound: 6/10\nGraphics and design: 7/10", "timestamp_created": 1535858149, "timestamp_updated": 1535858149, "voted_up": true, "votes_up": 78, "votes_funny": 3, "weighted_vote_score": "0.822083115577697754", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "45611468": {"recommendationid": "45611468", "author": {"steamid": "76561198171674489", "num_games_owned": 208, "num_reviews": 72, "playtime_forever": 4698, "playtime_last_two_weeks": 0, "playtime_at_review": 4575, "last_played": 1586296800}, "language": "english", "review": "everything is good about this game but the only thing it needs to add a co-op to make it alot fun then playing by yourself\n\n8/19/21: Still no co-op to this game after 3 years.", "timestamp_created": 1541287262, "timestamp_updated": 1629394089, "voted_up": true, "votes_up": 82, "votes_funny": 3, "weighted_vote_score": "0.816021859645843506", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "62549860": {"recommendationid": "62549860", "author": {"steamid": "76561198309090135", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 288, "playtime_last_two_weeks": 0, "playtime_at_review": 260, "last_played": 1580249345}, "language": "english", "review": "wish it had multiplayer but its not bad", "timestamp_created": 1580188090, "timestamp_updated": 1580188090, "voted_up": true, "votes_up": 72, "votes_funny": 1, "weighted_vote_score": "0.812539875507354736", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "55406337": {"recommendationid": "55406337", "author": {"steamid": "76561198139374490", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 4282, "playtime_last_two_weeks": 0, "playtime_at_review": 1565, "last_played": 1702342668}, "language": "english", "review": "First, the negatives- Smallish map, Bandit snipers that can see through trees, and idiot allies at your base camp THAT WON'T LEAVE THE F****** DOOR SHUT AT NIGHT. The NPC allies seem to be a bit broken, as one of mine, (Scott) won't go and cut wood. You assign him the task to cut down trees, but he just stands there with axe in hand, not doing anything. Assigning crafting tasks does work, however. Also, arming your allies is a waste, because when the infected get into your base either through a window or the aforementioned F****** DOOR THAT THE ALLIES KEEP OPENING AT NIGHT, they just stand there and won't attack the enemies.\n\nPositives- This is not a game that holds your hand. Combat can be tough if you rush right into it. I see this as a positive because if you go up against a bear in real life with just a hand weapon, you probably gonna die. I also love that the vehicles you can repair serve two different purposes- SUV to give you basically more pockets when scavenging, and the pickup truck lets you bring back big movable items like water containers, lockers, and crafting tables. The best part of the game I feel is the sense of fear. Kill a bear and start butchering, and suddenly you see the Mist developing around you during the passage of time feature. Go to sleep, and be woken up by a noise. Either you hear nothing more, or you hear monsters outside your door.\nI'm really enjoying this game. I hope the developer keeps updating, because I'd like to see the military and office buildings you find opened up to be explored and scavenged. This game has a lot of potential, because it has a pretty solid foundation already. It does have its bugs, but is definitely a good experience, just as long as Kate SHUTS THE F****** DOOR AT NIGHT.", "timestamp_created": 1570023696, "timestamp_updated": 1570023696, "voted_up": true, "votes_up": 37, "votes_funny": 50, "weighted_vote_score": "0.809171080589294434", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "121689332": {"recommendationid": "121689332", "author": {"steamid": "76561198042122929", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 1268, "playtime_last_two_weeks": 0, "playtime_at_review": 948, "last_played": 1662308437}, "language": "english", "review": "Best way to describe this game is \"mediocre with potential\".\n\nThe GOOD(ish?)\n- The environments look nice.\n- Looting buildings is fun. (Sadly you run out of buildings to loot too fast and loot doesn't respawn.\n- Exploration is fun up until you run out of things to explore.\n\nThe Bad\n- It is FAR too grindy. Crafting recipes require too much in materials and farming said materials takes too long. Reliable ways of farming materials like say ore require exploits such as saving the game and reloading it to respawn the ore. Its really awful and is a requirement because even 1 node of iron ore only MAYBE gives enough for like 2 ingots. When the recipes call for upwards of 8 or 10 ingots? This feels horrible to play.\n\n- Alot of the crafting recipes are just ridiculous. I mean why do I need leaves and tree bark to make lashing?? I go into houses and barns and see plenty of rope. Why can't I just loot that? Or better yet why can't I use the stupid amount of rags I find to make rope?\n\n- The mist event the game is named after is in the beginning annoying and then afterwards just uneventful. Because combat in this game is a pain in the ass (which I'll get into) and \"sneaking\" is a bit of a joke you are better off just sleeping in a random house if the mist event pops off. Otherwise you are just going to be frustrated with the \"stealth\" in the game and getting bum rushed by zeds. Which there aren't even that many to begin with. I was kinda expecting the mist event to just be a swarm. Zeds spawn close to you too actually. You can see them spawn in. Its immersion breaking and a bit silly.\n\n- The new map is complete trash in comparison to the old one. The new one has ALOT of empty unused space. You spend too much time running from one point to another rather than actually surviving. In my opinion the dev should abandon the idea of the new map and go back to the old one. The game excels when your in a city type environment. Go to the work in progress construction area with the office buildings and you'll understand just how much cooler the game would be if the game took place in a cityscape.\n\n- The combat is frustrating. Zeds attack too quick and do too much damage. Make melee combat a big no no. You can't run while reloading or switching weapons which is something that really needs to be changed. You are just letting zeds get in free hits otherwise. Bandit ai is broken unfun garbage and is actually what has made me put this game down. I tested this to make sure of the behavior they have. If you are spotted by a bandit there is no way to \"unspot\" yourself. You have to legit runaway from the area (despawning the enemies) then go back to reset the aggro. Once spotted, bandits know where you are at all times. They will shoot at you even if theres a stupid amount of terrain between you and them. They can't possibly hit you shooting through a hill but they still keep firing with there seemingly infinite ammo.\n\n- The game suffers the problems alot of survival games have where it tries to go for realism is some aspects but then in others it falls on its face. Take hunting for example. I was attempting to use a compound bow on a deer. I hit the deer but it didn't go down (which isn't the problem) but said deer ran off. Its kinda a pain to keep up with the deer and it wasn't leaving a blood trail so I can only assume the deer isn't going to bleed out either. So basically that ordeal told me that I need to be able to 1 tap a deer otherwise don't bother. Then there was this other situation where a wolf attacked me so I pulled out my 1911 to shoot it. I only had 4 bullets but the wolf didn't die. As someone who owns a 1911 irl let me tell you .45 acp is no joke. That wolf woulda been yelping and running off after being hit ONCE. But nah he takes 4 rounds like a champ. Normally I avoid making these types of comparisons but its hard when the game picks and chooses what it wants to portray as realism. And sadly it picks annoying things to portray.\n\nOverall I'd say to stay away. I'm not super miffed about the game as it was only $10. It definitely has potential but with alot of early access titles lately (atleast for me) development is slow and makes it difficult to want to support a project when said project might not even be ready until 5 years down the road.", "timestamp_created": 1662226828, "timestamp_updated": 1662226828, "voted_up": false, "votes_up": 148, "votes_funny": 7, "weighted_vote_score": "0.808368146419525146", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "55126213": {"recommendationid": "55126213", "author": {"steamid": "76561198350933928", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 2467, "playtime_last_two_weeks": 0, "playtime_at_review": 576, "last_played": 1679415742}, "language": "english", "review": "I love the game so much but can you do a multiplayer ❤\nI want to play with my brother :C", "timestamp_created": 1568560567, "timestamp_updated": 1588056772, "voted_up": true, "votes_up": 105, "votes_funny": 2, "weighted_vote_score": "0.80797123908996582", "comment_count": 3, "steam_purchase": true, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "90165220": {"recommendationid": "90165220", "author": {"steamid": "76561198112162416", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 1555, "playtime_last_two_weeks": 0, "playtime_at_review": 330, "last_played": 1682984673}, "language": "english", "review": "Add CO-OP and its a masterpiece!", "timestamp_created": 1618192148, "timestamp_updated": 1618192148, "voted_up": true, "votes_up": 63, "votes_funny": 3, "weighted_vote_score": "0.803885996341705322", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "63631945": {"recommendationid": "63631945", "author": {"steamid": "76561198022162628", "num_games_owned": 0, "num_reviews": 28, "playtime_forever": 514, "playtime_last_two_weeks": 0, "playtime_at_review": 187, "last_played": 1681117989}, "language": "english", "review": "Nice game but would be 10x better if multiplayer would be possible", "timestamp_created": 1581883245, "timestamp_updated": 1581883245, "voted_up": true, "votes_up": 96, "votes_funny": 3, "weighted_vote_score": "0.800805449485778809", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "131401011": {"recommendationid": "131401011", "author": {"steamid": "76561199281044789", "num_games_owned": 27, "num_reviews": 1, "playtime_forever": 655, "playtime_last_two_weeks": 0, "playtime_at_review": 632, "last_played": 1677114996}, "language": "english", "review": "Very nice Game, But it starts to get boring alone. Absolutely needs Coop.", "timestamp_created": 1674478583, "timestamp_updated": 1674478583, "voted_up": true, "votes_up": 42, "votes_funny": 0, "weighted_vote_score": "0.796795785427093506", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "67049813": {"recommendationid": "67049813", "author": {"steamid": "76561198047171578", "num_games_owned": 167, "num_reviews": 127, "playtime_forever": 504, "playtime_last_two_weeks": 0, "playtime_at_review": 368, "last_played": 1665578319}, "language": "english", "review": "WOW what a good game, it has so much potential. I was surprised by how fun it is. Thanks to Madd Vladd from the Outer Middle Show for playing through this game that prompted me to buy it. It reminds me of 7 Days To Die. Very similar in crafting and survival, its more beautiful but it still has quite a way to go to get to that upper level that 7D2D is famed for. I am excited to see the future. So please support this dev and the game!", "timestamp_created": 1586552155, "timestamp_updated": 1586552155, "voted_up": true, "votes_up": 37, "votes_funny": 1, "weighted_vote_score": "0.794367492198944092", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44367357": {"recommendationid": "44367357", "author": {"steamid": "76561198020867453", "num_games_owned": 44, "num_reviews": 4, "playtime_forever": 167, "playtime_last_two_weeks": 0, "playtime_at_review": 160, "last_played": 1541969188}, "language": "english", "review": "Waiting for CO-OP ;)", "timestamp_created": 1535196075, "timestamp_updated": 1535196075, "voted_up": true, "votes_up": 178, "votes_funny": 9, "weighted_vote_score": "0.793374776840209961", "comment_count": 12, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "78123700": {"recommendationid": "78123700", "author": {"steamid": "76561198275087764", "num_games_owned": 956, "num_reviews": 98, "playtime_forever": 607, "playtime_last_two_weeks": 0, "playtime_at_review": 371, "last_played": 1694924973}, "language": "english", "review": "I'll be real. I bought this for 11.00 us dollars. I expected either to instantly dislike it, find it EH, or like it a little and get bored of it FAST. I cannot tell you just how much fun the past 6-hour climb has been. I won't lie. It is a slow climb. Your luck & patience will determine how well you experience this game. IF you are not a patient person DONT get the game. This is a SURVIVAL GAME and the only way to progress is to invest time & with a little luck, certain \"tasks\" can be achieved faster.\n\n[DIFFICULTY]\nThe enemies without guns are hard as shit. And even WITH guns missing your shots is a HUGE mistake you can't take back & this is doubly so for facing more than one enemy. Bandits can laser the hell out of you, but as long as you are smart and move well, you can take on a group of them. Just don't stand out in the open as this dipshit did. WEAR ARMOR.\n\n[STORY]\nEverything you experience in the game is explained away by said opening explanation. So at least everything makes sense.  Too bad (Honestly speaking) that there is no story. I honestly believe this is ONE example where only having notepads/notes would be better UNLESS if voice acting is added, it is actually good. I think finding notepads as you explore/survive and look for a way out would probably be the best experience. IF the voice acting can be done well, then adding radio chatter through the base radio or a handheld radio as you progress the story/map would be the \"perfect\" way to do this. Honestly, just voice the MC & the other character who is helping them leave and just give the survivors you work with random lines.\n\n\n[BASE BUILDING]\nYou can build your on bases from templates ranging from small to large. You can also claim places from small to large. Claimable places have more variety than buildings you can build from scratch, though this makes sense. The base building also makes sense and is super simple. The things you can build for your bases all make sense. There are more than enough things to build. Supplies needed to build seem fair to me. They CAN be difficult or time-consuming to find. But this IS a survival game & with luck, you can find things faster.\n\n[Hunger/Thirst/Fatigue]\nHonestly. I have no issues with this at all.\n\n[Injuries]\nFucking sucks when you got one but feels perfectly balanced right now.\n\n[Farming]\nNot needed imo. NO this is NOT me saying you need to decrease food/drink loot spawns. Just saying if you dedicate time you CAN survive without farming. Its great that it is there though for those that want to use it.  Keep as is.\n\n[Vehicles]\nThey need to take damage. When the battery hit zero it still worked fine. Controls are fine. Sometimes you spun out but I think this is balanced well.\n\n[Melee]\nMaybe add some melee variants where nails combined with a baseball bat will attach the two and do increased damage and bleed damage. Idk, just a thought.\n\n[Guns]\nAmmo is scarce (Which is intended). Attachments even as simple as just adding sights /scopes for each gun would be great (Excluding pistols IF you don't want to). This part honestly only needs the simplest of additions. Lasers, sights, scopes, done!\n\n[Ambient Sounds & Music]\nThis brings me to the second worst thing for me. The game lacks sound. This makes sense if this was the real world in this situation, but for the game, I really wish either there were a lot more ambient sounds or there was subtle music that played based on the situation.\n\n[Graphics & Animations]\nI'll tell you right now I am a graphics whore. I LOVE 4k ULTRA graphics. Animations can definitely use some work. Weapon reach needs polishing and a personal thing would be showing our hands when driving. I definitely think IF POSSIBLE, that I would LOVE graphics, textures, models, yadda yada to significantly increase lol. But I can settle and probably will, with what I got now. Though they definitely still need some work.\n\n[Conclusion]\nIf you like survival, don't mind decent graphics, and everything I mentioned here, as well as are okay with spending 11.00 US dollars when not on sale. I definitely recommend it. It's no triple A-game. But it's something I think you should play at least once. P.s. open up the closed buildings, let us loot everything that is of the same type, and there are more suggestions that just can't fit here. This has a lot of potential. As it stands. It's worth the current price. But this game can be so much more with graphics being increased even if only a little, and story being implemented. After beating this in the next day or so, I will probably return either after a FULL release is announced, or 3-4 years.", "timestamp_created": 1603621859, "timestamp_updated": 1603674822, "voted_up": true, "votes_up": 31, "votes_funny": 0, "weighted_vote_score": "0.789406538009643555", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44242773": {"recommendationid": "44242773", "author": {"steamid": "76561197994043631", "num_games_owned": 0, "num_reviews": 95, "playtime_forever": 50, "playtime_last_two_weeks": 0, "playtime_at_review": 50, "last_played": 1534620649}, "language": "english", "review": "(Note: this isn't a full review as of yet, but I will be pointing out the Pros and Cons about the game so far) \n\nSo, I had a short while so far with the game, expecting it to be yet another horrible cashgrab Zombie Surivial title, but it ended up surprising me with some of the production value looking better than average for a Early Access game. The game doesn't look like Crysis or anything but it has it's moment. \n\nNow I'll quickly go into the Pros and Cons I've found (So far) in the game:\n\nPros + \n+ Graphically, the game is good for such a smaller budget title. It kind of reminds me of The Forest in a way.\n+ Gameplay is fairly decent, with a good range of options to choose from, especially knowing the game doesn't hold guns back from you like most surivial games do. \n+ The idea of your tools wearing down overtime has been done before, but I think it's done well in this game, even showing a percentage which indicates how depleted the tool is before it breaks. \n+ Car Mechanics such as building a car from a wrecked car is a really good addition as it really gives the player a better chance of exploring the world. \n\nCons - \n- I had found some glitches throughout the game that had to force me to restart the whole game as well as start a new one. \n- Enemies are basically the same with little variation in them. \n- Some of the buildings feel unfinished (but it was expected from an Early Access Title)\n- I feel that some of the blacked out cars should also be accessible as well as camper vans, just  it feels like a waste of oppertunity for a possible base.\n- The fog, though a really interesting part of the story, doesn't really do much other than spawn in more Zombies, which if feel could have been handled better like possibly having Special Zombies only come out during the Fog.\n\nOverall, for the price you get I say it's worth even a look into. \nThe dev really seems to have put their heart into this project with updates and a pretty good idea of how to create a working Menu system. \n\nGive it a shot, maybe you'll be just as surprised as I was.", "timestamp_created": 1534648066, "timestamp_updated": 1534648066, "voted_up": true, "votes_up": 85, "votes_funny": 4, "weighted_vote_score": "0.786744415760040283", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "119980106": {"recommendationid": "119980106", "author": {"steamid": "76561197972398706", "num_games_owned": 0, "num_reviews": 34, "playtime_forever": 8004, "playtime_last_two_weeks": 68, "playtime_at_review": 4480, "last_played": 1713265283}, "language": "english", "review": "This has the potential to be a great survival game and even in it's current state it is very playable and enjoyable with a real challenge in the early stages to find food and water. Be prepared for a few bugs though as it is an EA game in development. \n There has been a big update recently that has changed to game massively from the original version, for the better with a whole map rework, new enemies etc.\nContrary to popular belief, Mist has NOT been abandoned however the dev is really bad at communicating and the updates can be slow (but they do come) which has made people think this.", "timestamp_created": 1659512588, "timestamp_updated": 1659512588, "voted_up": true, "votes_up": 44, "votes_funny": 0, "weighted_vote_score": "0.783824741840362549", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "120233250": {"recommendationid": "120233250", "author": {"steamid": "76561198798313712", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 2067, "playtime_last_two_weeks": 0, "playtime_at_review": 1089, "last_played": 1702103964}, "language": "english", "review": "(Review Update)\nThe combat in this game is definitely it's weakest point, stamina regeneration is almost non existent for combat so if you run out of stamina after swinging you basically just have to take the beating til you're dead because there is no hope you'll get another swing in. Almost a year since my last review and there has been virtually zero progress made on the game.\n\n(Actively updating as I trudge through all the game has to offer.) Honestly, games got solid bones. However, the game has been in early access for over 3 years now and the dev keeps adding more stuff without addressing issues that the game has had for 3 years. First off, the ai in this game both zombies and humans is laughable. Zombies directly run straight at you at a ridiculous speed and then attack at an unreasonable rate. It's just way too robotic it's almost impossible to defend against more than 3 unless you have an insane hoard of ammo. Now to the people ai, they basically have aimbot, that mixed with the inconsistent melee combat makes them almost impossible to beat if you don't have a revolver or rifle. They can also see through trees and bushes and can snipe you before you're even visible. Then there's just a bunch of other small nitpicks. The dev keeps working on new areas now labeled WIP on the map even though 50% of the rest of the areas not labeled WIP are just empty. The parts that arent empty also suffers from the classic issue a lot of indie devs run into. They crowd buildings with useless items. In a survival game especially almost everything inside a building should be useable in some way, but in this game, 99% of the objects you find in buildings are unbreakable, unmoveable, and unusable. For example, there are buckets in the game as an object you use for crafting several items, but there are also like 5 different bucket assets throughout the world that you just can't pick up, they're there, they're buckets, but I guess they're not bucket enough. Overall got good bones but I wouldn't purchase for at least 2 or 3 more years based on the speed at which the dev is addressing the issues in the game. The dev also needs to remove all human enemy AI in the game until he can fix it to be more fair. Enemies will snap and teleport up and down structures, sometimes even across entire camps. Snipers will kill you in one hit before they even render into the game. Right now bandit camps are virtually impossible.", "timestamp_created": 1659895293, "timestamp_updated": 1688926032, "voted_up": false, "votes_up": 57, "votes_funny": 2, "weighted_vote_score": "0.780622720718383789", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "73355928": {"recommendationid": "73355928", "author": {"steamid": "76561198013125196", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 1110, "playtime_last_two_weeks": 0, "playtime_at_review": 1090, "last_played": 1613641730}, "language": "english", "review": "I really loved this game but got bored after time. If there would be co-op option that would be amazing and much more interesting!", "timestamp_created": 1595852453, "timestamp_updated": 1595852453, "voted_up": true, "votes_up": 53, "votes_funny": 1, "weighted_vote_score": "0.779934704303741455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "97716743": {"recommendationid": "97716743", "author": {"steamid": "76561197999084205", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 319, "playtime_last_two_weeks": 0, "playtime_at_review": 311, "last_played": 1630025033}, "language": "english", "review": "love the game but they should ad multiplayer it would be a lot better", "timestamp_created": 1629172855, "timestamp_updated": 1629172855, "voted_up": true, "votes_up": 67, "votes_funny": 0, "weighted_vote_score": "0.778432309627532959", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "106500143": {"recommendationid": "106500143", "author": {"steamid": "76561198105533711", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 3100, "playtime_last_two_weeks": 0, "playtime_at_review": 412, "last_played": 1664845164}, "language": "english", "review": "Solid survival game. Check out Fooster on YouTube to see what its like.", "timestamp_created": 1640445427, "timestamp_updated": 1640445427, "voted_up": true, "votes_up": 41, "votes_funny": 0, "weighted_vote_score": "0.777408778667449951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "45840353": {"recommendationid": "45840353", "author": {"steamid": "76561197987457217", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 1804, "playtime_last_two_weeks": 0, "playtime_at_review": 1202, "last_played": 1543626300}, "language": "english", "review": "As a big fan of Dying Light and desperately waiting for the sequel, I wanted to try Mist Survival and I have to admit that it’s a very addictive game! Gameplay is great, every step needs to be planned. At the start, it feels like danger is everywhere, but after almost 20h of gameplay, I’m settled in and feel much more confident. \n\nAs many of us, I took the white house as my base, 2 floors with a bed and some cabinets. \nThe first days I got ambushed several times during the night by the undead, but after placing a chicken fence IN every window (trick I found on the net), no zombie gets in and I feel much more secure, also after placing some of those fences before my front door. I can jump over, zombies can’t. What bandits concerns, I never saw one yet (edit: while writing this, I cleaned out my first bandit camp). But again, I’m the type who likes to feel completely safe and well equipped before going out on long trips or engaging enemy’s.  \n\nFood and water\n...are vital for surviving. First, roaming the immediate vicinity of your base should be enough to find water, coke cans, canned food and all types of supplies you need to build things. You can find them in abandoned cars and buildings. Some buildings contain zombies (you hear them when approaching), so better leave these alone, for now. \nWhen you decide to expand your range, you can take one of the many cars randomly available, but you need to get them to work first by finding spare parts. But that shouldn’t take much time as there are many available. Fuel can be unloaded, but you need a jerry can to do so. I had found one in a small cabin close to the farm (large fields). But you can also make one (see later). Be aware that these car parts wear out rather quickly (especially when you hit a bear, another car…), so better stock on spare parts, and (hint) put them in the trunk of your car so you have them with you when your car stops driving in the middle of nowhere when the mist comes up :s \n\nWhat to build first. \nIn the meantime, the searching through cars and buildings will have given you probably a saw, axe and hammer. So you can start building! \n\nFirst I fortified my villa to feel more safe, especially at night. Building a chicken fence is easy and doesn’t need many materials. (hint) if you want several of these fences interlocking, place them first without effectively building them. \n\nSecondly, I built a ‘Barrel fire’, not to use as a fire place, but to make wooden planks out of tree trunks that you need to build e.g. the ‘Workbench’. The ‘Workbench’ is a must-have tool. Then I started building a ‘water purifier’ and ‘water barrel’ to solve the thirst issue. You need to find water to put in the purifier. The villa happens to be close to a lake. You need an empty bottle or better a bucket (10l) to transport the ‘unsafe’ water back to your base. I had found a bucket while searching the area, but you can make one yourself with scrap metal you find using the Workbench.    \n\nWeapons\nDuring my travels around my villa, progressively going further and further, I spotted 2 ‘Guard towers’ and yes they gave me a pistol and shotgun! Ammo is scarce I have to admit, I have around a dozen cartridges for each weapon at this time. Ammo can also be found in the white villa’s you come across. In one of these villa’s, I found an M4 rifle. \nMaking a bow (go for the longbow, the first is a waste of time and supplies) is time consuming. You need ‘dried animal guts’.\nDrying? So you need to construct a ‘Drying rack’.\nNo bow without quiver. For a quiver, you need leather, for making leather you need dry animal hide...so you need to build a ‘Tanning rack’. Keeping busy. \nBy the time I decided to make a bow, I had found several arrows during my trips outside. Hunting arrows are a must. You can also make them with wood branches, feathers and arrowheads that you can produce with the ‘Blacksmith place’.\n\nWhere to find animal guts and hide? Bears maybe.\nAnd while doing all this time consuming constructions, you need food so you need to constantly search the area to find food cans. After a while, you like to find a better source of food. Bears maybe? \n\nBears.\nThere happens to be one roaming the area of my base. Thought to give it a try. One shotgun blast to the head killed the animal. I could extract raw meat, guts, fat & hide. (hint) adjust the amount you want to remove as it’s standard “0” so it won’t do anything. \nTaking all that to your base.\nYou can place the hide to the ‘Tanning rack’ to dry (takes lots of time!).\nBefore you can use the animal guts for the bow or eat the meat, you must dry it on the ‘Drying rack’. Before you can put the meat on the drying rack, you need to add ‘salt’ to it. Salt can be found on zombies and obviously in kitchens of some buildings you come across. Keeping busy. But a piece of dried bear meat can feed you for a much longer time than a beef can. So you can keep the canned food for the periods in between the bear killings and drying times. \nEating raw meat (or unsafe water) can give you food poisoning, which again can be helped with antibiotics you may have found. For 2 or 3 times, I had a food poisoning without eating any of that (don’t know if it’s a bug?).\n\nMist events. \nThese occur randomly as far as I know. Once coming up, zombies starts to appear. Initially I quickly ran back to my base. I still try to run or drive to my base if possible, but when too far away, I quickly hide in my car and that seems to keep you safe. Once I thought I would drive back to my base in the mist, but not seeing much I got lost and still had to wait in my car. \nWhen I’m at my base and mist comes up, I try to attract some zombies and while hiding behind my chicken fence wall in front of my door, I try to kill them with the bow. They drop salt, gunpowder...and you can retrieve the arrows, which is a good thing.\n\nWhat else did I build?\nA ‘Blacksmith place’. I did make some ingots of scrap metal, I needed nails and had to build a pickaxe needed in the mines. I made two visits to the mines where I extracted some iron, zinc, copper, sulphur etc (again, you need a pickaxe!). You need a lot of copper ores to make brass ingots which you can use to make cartridge cases. With sulphur and saltpetre you make the gun powder. \nTo effectively combine both to make ammo, you need to build a ‘Reloading bench’.\nWhy there is gold in the mine, I don’t know, maybe something we can use after further updating the game. \n\nI also placed a ‘Chicken coop’, chickens are roaming close to my base. You need to run empty handed and when close use the ‘F’ button to grab them; release them (‘R’) in your ‘Chicken coop’. They do produce eggs, which you can eat but this adds barely something to your food bar. I let the eggs alone, I thought maybe they do hatch? But that didn’t happen, instead they were rotting so I had to throw them away. You can also kill chickens, pick them up and ‘harvest’ them for some meat and feathers.\n\n‘Lock picks’. Easy to craft. Take some with you during your travels as behind these closed doors interesting things can be found: weapons, ammo, ‘backpack upgrades’ (to increase your inventory slots). An alternative is making a ‘crowbar’.  \nYou may find cloths that you can put on, does this mean you were naked all the time before? \n\nI admit I’m a hoarder so I have built 7 extra ‘Security Lockers’ to store and organise all my items.\nI had my first interaction with bandits, but there was sort of bug as 2 of them came very close and kept walking against me, without attacking me. They dropped things that I didn’t encounter before: grenades, gun powder, apple, broccoli and I could pick up their M4 rifles and shotguns. I left the ‘survivor’ in his cage, he didn’t move or said anything, and I don’t see any use of them :D \n\nThe game is in alpha stage and I’m almost 20h far in the game, so I still have things to do, but I wanted to write some ‘tips & tricks’ that may be useful to new players. \n", "timestamp_created": 1542372624, "timestamp_updated": 1542372624, "voted_up": true, "votes_up": 34, "votes_funny": 0, "weighted_vote_score": "0.773158788681030273", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "120077755": {"recommendationid": "120077755", "author": {"steamid": "76561197971210248", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 40815, "playtime_last_two_weeks": 0, "playtime_at_review": 40581, "last_played": 1708794345}, "language": "english", "review": "To the Devs,\nWhat I don’t like;\n\nI have over 676 hours into the game to date. Before the big update everything worked other than a few quirks in game that I’ve lived with. Never the less, since the update, there are some major issues. To name a few….Weight restrictions. Although necessary you have made it much too difficult to carry anything never mind upgrade bags, the way its set now what’s the point of upgrading if you can’t use the slots. Furthermore with my carrying the revolver + ammo, advanced bow with tactical quiver loaded with exploding arrows (also I’ve lost a number of exploding arrows by changing quivers. This is actually one of the quirks before the update), Shotgun + ammo, Hunting rifle + ammo, water jug, one can of food, bandages, and axe. This puts me at +75% in weight, which only allows me to carry “4 to 5 LOGS”! Not good! Food and water decreases way to fast to keep up with hunting and grinding. As for graphics, OOOFF, I have a GForce RTX 2070 Super and have to almost go to bare specs with the game in order to run it efficiently. There is more but I think you get the general idea of what’s going on.\n\nWhat I DO like (Love);\n\nThe ability of the infected now able to destroy the fences as well as climbing the Ranger towers. That one made my heart pump. Nice touch.  The new Weather feature with the realistic thunder and lightning. The added new infected, green mist, and what I’m calling the “Alien Blob” that you have to destroy to further progress, and last but not least, the additions to the map! Absolutely Phenomenal!\n\nAm still going to give a very favorable rating to this game. What you guy’s have done so far is amazing. The best part is where you can go from here. Keep plugging and don’t forget about your fans. Based on what I’ve seen you have a lot of us out there. avb\n\nP.S.\n\nSystem Full Specs;\n\nASRock X570 Steel Legend WiFi AX AM4 AMD X570 SATA 6GB/S ATX AMD Motherboard\n\nEVGA 08G-P4-3173-KR GeForce RTX 2070 Super XC ultra gaming, 8GB GDDR6, \nDual HDB Fans, RGB LED, Metal Backplate\n\nFractal Design Define R6 - Mid Tower Computer Case - ATX - Optimized for High Airflow and Silent Computing with ModuVent Technology - PSU Shroud - Modular Interior - Water-Cooling Ready - Black\n\nSeasonic Focus GM-850, 850W 80+ Gold, Semi-Modular, Fits All ATX Systems, Fan Control in Silent and Cooling Mode,\n\nG.Skill Ripjaws V Series 32GB (2 x 16GB) 288-Pin SDRAM (PC4-28800) DDR4 3600 CL16-19-19-39 1.35V Dual Channel Desktop Memory Model F4-3600C16D-32GVKC\n\nASHATA PC Water Cooling Kit,Universal Water Cooling Radiator,Tubing,Pump,Cylindrical Tank,Dual Fan,Mounting Accessories Computer Water Cooling Liquid Cooler\n\nX2 --- SAMSUNG 970 EVO Plus SSD 1TB, M.2 NVMe Interface Internal Solid State Hard Drive with V-NAND Technology for Gaming, Graphic Design, MZ-V7S1T0B/AM\n\n\n", "timestamp_created": 1659656808, "timestamp_updated": 1660776289, "voted_up": true, "votes_up": 44, "votes_funny": 2, "weighted_vote_score": "0.770529329776763916", "comment_count": 9, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "147678184": {"recommendationid": "147678184", "author": {"steamid": "76561198397041583", "num_games_owned": 50, "num_reviews": 4, "playtime_forever": 2364, "playtime_last_two_weeks": 0, "playtime_at_review": 1058, "last_played": 1702019736}, "language": "english", "review": "it a very fun game but they should add co-op", "timestamp_created": 1696509119, "timestamp_updated": 1696509119, "voted_up": true, "votes_up": 51, "votes_funny": 0, "weighted_vote_score": "0.768578052520751953", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "100307478": {"recommendationid": "100307478", "author": {"steamid": "76561198359499773", "num_games_owned": 52, "num_reviews": 1, "playtime_forever": 766, "playtime_last_two_weeks": 0, "playtime_at_review": 151, "last_played": 1690299598}, "language": "english", "review": "pls add multiplayer", "timestamp_created": 1633101694, "timestamp_updated": 1633101694, "voted_up": true, "votes_up": 91, "votes_funny": 8, "weighted_vote_score": "0.768325150012969971", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "116220244": {"recommendationid": "116220244", "author": {"steamid": "76561198855477121", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 4059, "playtime_last_two_weeks": 0, "playtime_at_review": 3194, "last_played": 1661829418}, "language": "english", "review": "game has been good, is it gonna be multiplayer? it would be pretty fun with a crew\n", "timestamp_created": 1653871132, "timestamp_updated": 1653871132, "voted_up": true, "votes_up": 42, "votes_funny": 1, "weighted_vote_score": "0.767774999141693115", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "112128361": {"recommendationid": "112128361", "author": {"steamid": "76561198075317187", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 793, "playtime_last_two_weeks": 0, "playtime_at_review": 522, "last_played": 1647648427}, "language": "english", "review": "Based on .5 beta.\nI love building survival games. This game sat in my wishlist for 2 years, reviews have always been very positive, so I picked it up. It's ok, for a proof of concept demo that someone threw together in the space of a week or so. It is NOT anywhere near release or even early access. The POIs aren't. (interesting) It's built on Unreal and frankly I can't understand why so many people are so positive about it. After playing it for a few hours and then re-reading the reviews I still don't understand. It's got generic mechanics that are built into the engine itself. it's got a crap ton of empty generic assets that have very little work or thought put into them. In the single \"town\" there is a laundromat with almost nothing in it, and on the very next street, directly across from the original, there is the very same laundromat. with nothing in it. \n\nIt's a beta you say?  Well, the developer released it 6 months ago. Then retracted it. When a weekend's work would've fleshed out some buildings and content, virtually nothing has been done. \n\nThis seems to me like someone had a decent idea, decided to learn Unreal to implement it, got it to a somewhat playable state, and called it good. When he needs a little more money, he spends a couple hours \"improving\" the game and there is a new flurry of excitement, and people spend enough for beer money.\n\nThis looks like at most a few weeks work by someone who knows very little about programming, or game design, and frankly is making very little effort to learn either. From October to March I would've expected more than one update. The update I did see was what looked like about 4-5 hours of concentrated effort.\n\nI'll continue to play and continue to hope, but at this time I'm not very hopeful.", "timestamp_created": 1647196328, "timestamp_updated": 1647196328, "voted_up": false, "votes_up": 85, "votes_funny": 4, "weighted_vote_score": "0.767091155052185059", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "127882791": {"recommendationid": "127882791", "author": {"steamid": "76561198052711187", "num_games_owned": 181, "num_reviews": 23, "playtime_forever": 3432, "playtime_last_two_weeks": 0, "playtime_at_review": 3377, "last_played": 1671361576}, "language": "english", "review": "Well, I had some fun, the begining was chilling, some nice ideas, but there is still lot of work to do. I spent 50+ hours on it and I believe I saw and tried almost everything.\n\n- Fridges (at least the big one) do not seem to work. Food is spoiling at the same rate (I may be mistaken).\n- Survivors are very limited. Some are not doing anything. Some can be used as workers on specifc tasks (sawmill, workbench). I built a base on a lake with wooden foundations, teleported the survivors on it and.... too bad, they are now totally useless, not even moving. Some even spawned under the foundations, holding their breath for ever ! Amazing but useless !\n- When you pimp a car in your garage, do not leave game before the end of the process or it will stop and you will lose all pieces of craft. (red truck can't be pimped).\n- Yeah I used \"loot refresh\". I do not believe you can craft everything without this cheat. Gear parts are soooo rare.\n- Fights are deadly at the begining. And later, you still have to know what you are doing.\n- Found a boss. Hard to kill but worth the price.\n- Many places are not finished or empty.\n- Too bad you can't set any house as your base. There is some nice spots. You can still craft a house on the spot and set it as a base.\n- Too bad you can't clean all garbages. Could be nice to clean a nice spot so you can build a base the way you want. \n- Nice to have a dog, but it is useless. And you can't give him water, only raw meat to feed it. It stays thrirsty but it doesn't seem to be impacted.\n- The red truck, even if you can't pimp it, is the best. You can build storages on it; very usefull when you farm wood logs.\n- Heat or cold is just an information; never got sick because of cold, or fainted being too hot.\n- Bandits are dumb but they can be sharpshooters sometimes.\n- The mist is chilling. Never be outside a safe place when it comes or you will probably die.\n- Munitions are scarce. Thank you, \"loot refresh\" !\n- Tried to grow crops not long ago. Can't say so far if it is worth it. \n- Tried fishing. Failed once and never tried again. Can't say if it is also worth the price and time.\n- No story at all; one Fedex quest given by a survivors. Not sure there is more.\n- You can move a lot of the crafted stuff. Very nice ! Being able to relocate them is a very good idea.\n- I wish foundations and housing part could clip on.\n- Pay attention on the structure crafts list. There are more than you think at first glance.\n\nThanks for this game anyway. Cheap but may never be finished. It entertained me for a while. I'll come back on next update if this is a major one. Don't want to rate it; but I'll give a green thumb for the work done so far by a single dev.", "timestamp_created": 1670120834, "timestamp_updated": 1670183184, "voted_up": true, "votes_up": 26, "votes_funny": 4, "weighted_vote_score": "0.766778171062469482", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "55168913": {"recommendationid": "55168913", "author": {"steamid": "76561198134329882", "num_games_owned": 109, "num_reviews": 10, "playtime_forever": 869, "playtime_last_two_weeks": 0, "playtime_at_review": 869, "last_played": 1543590735}, "language": "english", "review": "Absolutely needs online multiplayer so me and my friends can huddle in fear of the mist!", "timestamp_created": 1568810281, "timestamp_updated": 1568810281, "voted_up": true, "votes_up": 53, "votes_funny": 1, "weighted_vote_score": "0.766004681587219238", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "56581079": {"recommendationid": "56581079", "author": {"steamid": "76561198044123282", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 1930, "playtime_last_two_weeks": 0, "playtime_at_review": 1438, "last_played": 1573271334}, "language": "english", "review": "This game has some potential, but is all around not very good. I have had some fun playing this game but because of the problems I cannot recommend someone to buy this game.\n\nlet's start with the good...the few things that are good\n1. The updates to the game usually add some decent stuff (sometimes, other times they are useless) but they do take quite a while to come.\n2. Graphically, it's not too bad for an early access game, though there are some textures that will make you want to puke, it looks better than fallout 76, meaning it's got that 16x the detail Todd promised.\n3. Movement and controls are pretty fluid and feel nice, it doesn't feel too clunky (most of the time) and it feels pretty well polished\n\nNow let's get to the bad stuff, there is quite a bit of it\n1. The AI, the AI is awful\n-The bandits, the bandits can detect you from a mile away which makes it impossible to sneak up on them and once they spot you, you're practically dead, but at the same time, if you're just to their right or left, they have no clue you are there, also, when they shoot at you, they don't stop, even after you're dead, they keep shooting.\n-The zombies/mutants, they are supposed to remain in the dark during the day, I.e. in a house or building, but if the see you, they'll chase you, even if you're outside, they will leave buildings and chase you for a couple of minutes sometimes, only to turn and run away the next second. They will also detect you through floors and walls, meaning, if you're in a two story building, they'll detect you even if you're on a different floor. At night when they come out, they will sometimes target you, sometimes target the window barriers, even if you walk up next to them, they will continue hitting the barriers. These enemies are also incredibly strong, being able to 3 hit you, meaning melee is completely useless against them, and sometimes (maybe I was just unlucky or it was a bug) these enemies will hit you through walls.\n-The friendly AI, these AI are useless, the walk around and well...that's it, they don't do anything at all, they need work, and a lot of it\n2. The Mist - The mist is an incredibly cool concept, but one of the problems with it is how bluntly it comes, it just appears, it doesn't really fade it, but also, the enemies that come during the mist just appear out of thin air when the mist does come, making it a pain to be in the mist at all.\n3. Bandit camps - Bandit camps are a great idea and can be a lot of fun, but it has a huge problem, if you die at one of the camps, all the AI will disappear meaning it is easier to just let the bandits kill you and then come back to loot the camp as once you die, they will all disappear and you won't have to fight them.\n4. Looting - Looting in this game can be cool, but half of the objects you think would be lootable aren't, and the objects you can loot will most of the time have completely useless items in them. Guns aren't terribly hard to find but the ammo is, ammo can be incredibly scarce which wouldn't be a problem...except guns are the only viable option for combat as any melee approach will surely get you killed.\n5. Combat - Melee combat is completely out of the question as you'll either get shot before you can get close (in the case of bandits) or you'll get swarmed by multiple zombies and get killed that way, even trying to fight a single zombie with melee is hard, as there is no way to dodge their hit, and they can be incredibly strong. The gunplay feels very nice, but as I've stated, ammo can be incredibly scarce, but also, if you're just slightly too far away from an enemy (maybe 30Ft - 45Ft.) your gun won't work and will just alert them. Guns can also be inconsistent, either ending any fight in a matter of seconds, or being useless, as the gun will do very little damage, taking up to 8 pistol shots to kill 1 zombie sometimes.\n6. Health - Healing is incredibly slow, and you take damage quickly, meaning combat can be a pain. Bandages don't actually heal you but stop bleeding (which isn't innately a problem) but there isn't a real way to heal except sleeping or waiting. All enemies do a ton of damage to you until you get armor, but when you don't have armor, gun fights can be hell, or even just fighting zombies can be a pain. You aren't able to heal in combat which means you can easily die if you make even one slip-up or make every fight last way longer than it should. As I said, fights become a bit more forgiving once you have armor, but even then, it's not that much of an advantage, and finding armor can be a real pain, meaning you will go without it for a while.\n7. Navigation - The map is good, and can be very fun to explore, but overall, everything looks the same. Navigating during day can be a pain, but during night, it's nearly impossible as it get's near pitch black. This game also has no map which is a pain as it's a survival game with no map meaning, if you get lost, you're gonna have a hell of a time getting home as much of the map looks the exact same. \n8. Cars and Driving - Driving can be fun, but getting the actual vehicle is a pain. You have to scour the map looking for car parts, then put them on a body only to have them break shortly after and have to do it again. Driving the car is useful, but any minor damage to the car, and all your parts inside go from 100% to 17% in an instant. Driving at night is impossible as your car's headlights are maxed at about 5% brightness, meaning they won't shine on something unless it is 2 feet in front of you.\n9. Stamina - Stamina in this game sucks. Although it goes down pretty slow, which is very nice, it regenerates insanely slowly, taking upwards of 5 minutes to regenerate from empty to full. Any action you do, I.e. melee combat, jumping, sprinting, ect. all drain stamina, all of these put together, or pretty much basic combat, means you'll run out of stamina about half way through the fight leaving you to hide behind the nearest object or climb on top of something to avoid dying.\n10. Gameplay - The idea of the game is to survive (obviously, it's a survival) but there really isn't a ton to do, you can build bases, build items, loot, drive and fight impossible enemies. Practically everything you do gets very boring and feels pointless as most of the time, you're just gonna end up driving from one building to the next looting item you already have.\n\nTLDR: This game has a lot of potential, but in it's current state I can't recommend it to anyone, I would say save the $11 you would use for this game and hold off to buy it until it becomes a bit better, the game has potential and I badly want to see it become better, but in it's current state I simply can't recommend it as it has too many issues, it has too many bugs but it also can be very unfair and downright unplayable at times. It can be very tedious and very repetitive and most of your actions can feel pointless. To put it simply, I had more fun writing this review then playing the game.", "timestamp_created": 1572982200, "timestamp_updated": 1572983406, "voted_up": false, "votes_up": 138, "votes_funny": 13, "weighted_vote_score": "0.76486736536026001", "comment_count": 25, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "119386939": {"recommendationid": "119386939", "author": {"steamid": "76561198872943278", "num_games_owned": 0, "num_reviews": 59, "playtime_forever": 8840, "playtime_last_two_weeks": 0, "playtime_at_review": 557, "last_played": 1706985496}, "language": "english", "review": "Just wait till the early access is over. The developer of the game is working hard on the game and things are getting better in time. Still, there are tons of bugs and bad things to be fixed. Give this game a bit more time. Add the game to your wishlist and keep following the game! One day, this game will be the best survival, but it is not this day!\n\nEDIT: After one year, our dear developer started creating wonders in the game. Even without the Co-op mode in it for now, the game looks way better than it was last year. It is time to get your hands on this game and support the hard working developer. This is one of the best survival crafting games. Despite the little weak points of the game like animations or ai, it is still worth playing and also the game is cheaper than the other scum games.\nEDIT #2: The latest patch came along with more bugs and issues making the game unplayable. Check discussions area to see them. Wait till the game is playable and only buy it afterwards.", "timestamp_created": 1658674141, "timestamp_updated": 1692283179, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.764543235301971436", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "88094120": {"recommendationid": "88094120", "author": {"steamid": "76561199006350858", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 1067, "playtime_last_two_weeks": 0, "playtime_at_review": 910, "last_played": 1694276303}, "language": "english", "review": "it would be better if they added multy player", "timestamp_created": 1615229382, "timestamp_updated": 1615229382, "voted_up": true, "votes_up": 63, "votes_funny": 4, "weighted_vote_score": "0.762258350849151611", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "110337524": {"recommendationid": "110337524", "author": {"steamid": "76561198820798849", "num_games_owned": 216, "num_reviews": 9, "playtime_forever": 491, "playtime_last_two_weeks": 0, "playtime_at_review": 455, "last_played": 1646892354}, "language": "english", "review": "This game is one of the best survival games I have played. I really wish you could play this with a friend or two, because this would just complete the game for me.", "timestamp_created": 1644984945, "timestamp_updated": 1644984945, "voted_up": true, "votes_up": 40, "votes_funny": 3, "weighted_vote_score": "0.761969447135925293", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "65970412": {"recommendationid": "65970412", "author": {"steamid": "76561198060534170", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 569, "playtime_last_two_weeks": 0, "playtime_at_review": 472, "last_played": 1606251650}, "language": "english", "review": "First time, mauled by a bear in day two.\nSecond time, shot by some people, in day two.\nThird time, mauled by zombies in day one.\nFourth time now, day two, patiently sitting in my car and waiting for the fog to pass.\n\nSitting on the edge of my seat, with feelings I haven't felt in YEARS in a game: anxiety, joy, wonder, fear. Outstanding work. Can't recommend enough.\n\n5/5, will get killed again.", "timestamp_created": 1585351500, "timestamp_updated": 1585351500, "voted_up": true, "votes_up": 45, "votes_funny": 25, "weighted_vote_score": "0.761883318424224854", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "68941829": {"recommendationid": "68941829", "author": {"steamid": "76561198190847447", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 896, "playtime_last_two_weeks": 0, "playtime_at_review": 789, "last_played": 1589595574}, "language": "english", "review": "Alright. This game is..... difficult to review. It's only $11 so it's probably worth buying but...\n\nAlright let me try to explain.\n\nIf you're looking for a pure survival game that challenges you mostly via its environment, The Long Dark is the game for you. If you're looking for a tough Zombie survival/builder game, 7 Days to Die OR The Forest is the game for you. \n\nThis game tries to be all those games at once but falls short in every regard. Basically if The Long Dark, 7 Days to Die and The Forest are A level Indie games, this game ranks \"B\" across the board.  The world feels mostly empty, the bandit camps are stunningly easy and disappointing when you watch and learn the move patterns of the NPCs, there's no way to break down furniture to earn materials like in The Long Dark... It's fun for like 20 hours. \n\nAt $11, 20-25 hours of decent fun isn't anything to sneeze at but still... this game has been in alpha for two years and it's mostly empty. Very little in the way of crafting... Bugs around every corner (be VERY careful driving a vehicle), etc. Clearly this game is being developed by like, 2 people. End game content like special blueprints have been placeholders (to-be-implemented-at-some-point) for nearly two years. Development is going at a snail's pace.\n\nIt's worth $11. If it ever goes above $11, do NOT buy. Wait for dev team to actually flesh out the game, add content, improve AI, increase crafting possibilities, and smooth out bugs.", "timestamp_created": 1589179706, "timestamp_updated": 1589212987, "voted_up": false, "votes_up": 167, "votes_funny": 13, "weighted_vote_score": "0.761420249938964844", "comment_count": 16, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "54540475": {"recommendationid": "54540475", "author": {"steamid": "76561198023207010", "num_games_owned": 0, "num_reviews": 69, "playtime_forever": 486, "playtime_last_two_weeks": 0, "playtime_at_review": 116, "last_played": 1596230290}, "language": "english", "review": "EDIT 30.12.2020: This project seems to have been abandoned. Forgive me for saying it might be worth it in the future. This has no future.\n\nOriginal review:\nI will give the developer a thumbs up because this has huge potential and I think soon this will be worth the price but it needs a LOT of work.\n\nWhat I think needs to be updated:\n- all campers are unaccessible assets, just textures, shame\n- some types of cars are also just placeholders, like the above\n- melee is terrible, I mean the worst I've ever seen\n- hitboxes are terrible\n- sounds often misplaced\n- background theme/sounds too short and often restart from the beginning breaking the immersion\n- dead zombies still growl, confusing because the sun kills them and You still think they are alive and stay in hiding (EDIT: apparently this has been fixed in 0.3.4)\n- no useful tutorial apart from some very basic info (where do I find a hammer?/ how do i build a base?)\n- no map? or i cant find one\n- too little loot (couldnt find enough to make a bandage in 2h)\n- zombie AI terrible - they attack corpses and ignore You \n- if a zombie dies on loot, you cant access it, you cant move corpses\n- when I kill a bandit who carries a firearm there is no ammo on the corpse\n- the new sawmill place is so empty and useless (just 1 item and 1 workshop that is rather optional to use)\n- old engine (?) - little interaction with the world - You cant destroy your surroundings, cant brake a window, etc.\n\nNow, what is cool:\n+ the mist is a great idea and it really makes You wanna hide immediately it appears\n+ you can move workshops and containers to wherever you want\n+ you can take fuel from cars if you have a canister\n+ graphics are nice\n+ deadly bears\n+ nice injury and healing system\n+ when You find a new bag, you get +2 inv space, i like that\n+ looks like there are really a lot of assets (camps, gas stations, sawmills, villas, etc)\n+ stealth executions on bandits (this is really nicely done)\n+ gloomy atmosphere\n+ AI companions\n\nI hope this will get some more updates.", "timestamp_created": 1565386770, "timestamp_updated": 1609364580, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.761326432228088379", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44253938": {"recommendationid": "44253938", "author": {"steamid": "76561198065305488", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 953, "playtime_last_two_weeks": 0, "playtime_at_review": 945, "last_played": 1535480346}, "language": "english", "review": "The \"Mist\" arrived while I was raiding a house.  Attempted to crowbar a locked room.  Get jumped by 2 infected and scared the living @!$# out of me.  Game puts you on the edge and you better be careful when planning your moves. Although game is in early access I highly recommend. Dev is communicative and constantly releasing fixes/balancing issues.", "timestamp_created": 1534689056, "timestamp_updated": 1534689056, "voted_up": true, "votes_up": 40, "votes_funny": 13, "weighted_vote_score": "0.760929524898529053", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44772032": {"recommendationid": "44772032", "author": {"steamid": "76561198210947460", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 39641, "playtime_last_two_weeks": 0, "playtime_at_review": 10227, "last_played": 1639075890}, "language": "english", "review": "If you can accept that it is currently in very early access and does not have a huge map yet ( a larger one is in the works for release soon) then this is an excellent choice. It has atmosphere, enemies who can be challenging (at least to me) crafting and much more.\n\nThere are regular updates and the Dev, Rati, engages with the community and actually listens. \n\nI highly reccommend.", "timestamp_created": 1537126743, "timestamp_updated": 1537126743, "voted_up": true, "votes_up": 31, "votes_funny": 2, "weighted_vote_score": "0.759133398532867432", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "134941138": {"recommendationid": "134941138", "author": {"steamid": "76561198141294592", "num_games_owned": 0, "num_reviews": 51, "playtime_forever": 16222, "playtime_last_two_weeks": 0, "playtime_at_review": 12993, "last_played": 1703363455}, "language": "english", "review": "Rati if you're reading this, know that there are plenty of us who both have and still support both you and your amazing work, despite major setbacks and scraps, you continue to work hard on making this far more than another garden variety indie game, and it really shows not to mention continues to pay off beautifully. Keep up the great work and keep us updated!", "timestamp_created": 1679202683, "timestamp_updated": 1679202683, "voted_up": true, "votes_up": 31, "votes_funny": 0, "weighted_vote_score": "0.755892097949981689", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "44362894": {"recommendationid": "44362894", "author": {"steamid": "76561198083531248", "num_games_owned": 0, "num_reviews": 75, "playtime_forever": 709, "playtime_last_two_weeks": 0, "playtime_at_review": 440, "last_played": 1701832553}, "language": "english", "review": "[h1]I didn't have to play this game very long to immediately know that I like it[/h1]\n[list]\n    [*]The UI system is very easy to navigate and understand. The systems operate in a manner where the game wants to teach me how to play it and I want to learn. The crafting is a mix of styles between The Forest, The Long Dark and 7 Days To Die (without all the bullcrap).\n    [*]There is no real leveling system for your character, just an overall health system. You can injure your arm and using your arm can further the injury. This stall progress and forces you to be creative. I love it. It also forces you to be more cautious with your decision making and specifically makes the game more challenging.\n    [*]AI bandits roam and have bases.\n    [*]You can find and craft clothing, weapons. It's very easy to learn how to build tools and structures like a cabin or work bench.\n    [*]Zombies are either in or around houses or structures or they come out when the fog/mist rolls through. This reminds me of the Stephen King story \"The Mist\" where creatures come out as the mist rolls through. Very fun and interesting and you fear what might happen when the mist rolls through.\n    [*]You can kill and harvest animals. I had a bear get his head stuck in a door and I killed him with my axe, then harvested his body. You can use different tools to harvest different parts of their body to get specific items. For example, using a knife allows you to get meat, guts, animal skins, etc.\n    [*]Over time, seasons change which brings cold weather and new challenges! This gives you something to work toward and down the road goals and things to consider when making decisions.\n[/list]\n\nThis game reminds me a lot of \"The Long Dark\" only in a zombie apocalypse environment and the weather is not always freezing cold. Overall I'm excited to see what comes to this game. Multiplayer in any form would be a plus. If I could play this with a few friends like The Forest, I would absolutely love it.\n\nGames like DayZ or Miscreated forces you to basically just roam around, kill players and take their gear. This game forces you to focus on survival first. A massive plus. We need more games like this.", "timestamp_created": 1535174340, "timestamp_updated": 1535174340, "voted_up": true, "votes_up": 29, "votes_funny": 1, "weighted_vote_score": "0.755051612854003906", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "63136531": {"recommendationid": "63136531", "author": {"steamid": "76561198942100347", "num_games_owned": 68, "num_reviews": 2, "playtime_forever": 8251, "playtime_last_two_weeks": 0, "playtime_at_review": 1499, "last_played": 1707936952}, "language": "english", "review": "I have been playing this game for about 25 Hours now or so, and I am loving it to bits!\n\nSurvival games is what I like to play, got some great games in my collection: Rust, SCUM, Hurtworld, 7 Days to Die, Left 4 Dead, but for some reason, this game triggers me more.\n\nThe fact that you need individual items or different workbenches to craft weapons and even have to mine for ores in one of the two mines found on the map, to melt for metals to craft interests me a lot. The recipes for these metals, like crafting brass, for instance, is amazing. So much attention to detail found here. Other games do have ores also, but not so much in detail or the fact that you have to kill some zombies and even a berserker to get to them. Take note that the old mine does not have zombies, but also don't contain all minerals like the one with the zombies. More risk is more rewards here.\n\nA bonus is that you can save your progress of the game at anytime.\n(Great tip to do before you drive a vehicle, since they may flip over.)\n\nI do have, however, one request. A simple multiplayer co-op of say up to 4 players, would be nice, or even a 2 versus 2 team-play, or something like that would be great for the longer term. It does get boring after a bit to do everything yourself and no-one else can join in the fun.\n\nMostly, if you like to play survival, and live life on the edge more, come and join in the fun.", "timestamp_created": 1581134525, "timestamp_updated": 1581787762, "voted_up": true, "votes_up": 29, "votes_funny": 1, "weighted_vote_score": "0.753568410873413086", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "132223582": {"recommendationid": "132223582", "author": {"steamid": "76561198016648972", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 2730, "playtime_last_two_weeks": 0, "playtime_at_review": 2436, "last_played": 1701375432}, "language": "english", "review": "TL;DR version is pros/cons section that's down there a bit. Apparently I had a lot to say.\n\nCan't say I'd recommend the game, though there are redeeming qualities some people might find awesome. The old game/world from when I bought it a couple years ago was simply more immersive and captured the survival feeling... This new map and some of the mechanics simply don't. The survival has gotten ridiculously simple (you're able to have shelter and 100% of needs covered before end of first day, no joke) and this new map is very homogeneous. \n\nThe old world and systems felt satisfying to use, and you could navigate by landmark and experience because everything felt distinct. Additionally, the environments told stories. I remember I would go into something like a motel and look at the rooms, trying to break down what happened. By contrast, I have to navigate this new world using a 3rd party map on an open browser tab because it's literally nothing but hills, roads, water, and scattered outcroppings of buildings. This new world feels utterly sterile. Head into the wrong gully and you can lose your navigational indexing very quickly. Sure, you could argue this would be more \"wilderness-like\" or something, however in a game where you can hoist an adult grizzly over your shoulder and sprint into your home like you're training for the olympics, I'd say sometimes game-ification should take precedent. \n\nLook at The Forest as an example... Basically nothing but trees, yet you often have an idea of where you are due to appropriately diversified landscaping, and every time you find a new landmark, there's environmental cues and storytelling to be had. Without a word of joke, the most environmental storytelling I've seen so far has been finding the 327th random encampment on the map and seeing that there was a fire already lit, so maybe someone was there recently.\n\nOn the bright side of things, while the survival might been ludicrously easy compared to before, I will admit that it is far more balanced. Additionally, there's a distinct lack of detectable bugs which used to be the BIGGEST issue by a landslide. From a technical perspective, the current version of the game is undoubtedly superior (if too easy). I just wish it hadn't come at the expensive of the content of the original game. I genuinely wish I could recommend it because at it's core there's a good game there... It's just now cloaked in a bog-standard, low resolution/stock-asset feeling shell that's devoid of character or intrigue.\n\nHonestly I think I'm just disappointed. When I last played this game is was pretty damned good but basically abandoned. The only reason I stopped was I hit yet another bug, but this one halted all progress that I could make so I lost interest. When I saw the devs had been working on it again I got excited, but returned to a game that feels like a college project or a tech demo or something. It went from being all substance with marginal play-ability to being as polished and devoid of color as a freshly cleaned drinking glass. I've been trying to get into the game but I just can't. It's boring now, even though it works much better. Big sad.\n\n*-*_*-*_*-*PROS/CONS*-*_*-*_*-*\nPROS:\n- Updates have rendered the game comparatively bug-free vs. the games original state.\n- Game runs well\n- The game is VERY noob-friendly. If you don't normally play survival sandboxes, this would be a great starter.\n- Loot mechanics are reasonably balanced.\n- Resources, for better or worse, are plentiful and easy to come across.\n- If you make a mistake and/or run out of a limited resource, you can reset the loot pool. \n\nCONS:\n- If you make a mistake and/or run out of a limited resource, you can reset the loot pool. This is a \"survival\" game with no consequence. You can just hit \"Loots Refresh\" and respawn the world's loot pool.\n- Oh my god does it all look the same. Original game might have been using stock assets too, but this is just a solid MEH for appearance. At least old game was kinda pretty/diverse, felt lived in, all that.\n- The visuals have become dull/drab/boring. Beyond the fact that it all looks the same, it all looks BORINGLY the same.\n- The world is sterile. If you like dusty looking trees and hills boy are you in for a treat, but the only thing that interrupts trees/hills are random camps or the occasional settlement. The old world had a grunge to it, it looked like it had been ripped apart, like something had happened. The only thing in this game that shows ANY wear/tear are the cars. Buildings, trees, roads, everything else is stock-asset pristine.\n- There's no survival crunch. You can get everything you need before sundown on your first day, and the near total lack of reasonable threats means you just pick the first house you see and live there. It's more of a post-apocalypse real estate sim than a survival game.\n- Complete lack of story telling. \"You're alive after the mist turned most people into zombie-things... annnddd go.\" is the extent of the immersion. The devices that DO exist only go so far as to have you identify what a certain building is, i.e. this is a laundromat, that's a house, whatever. Some don't even go that far.\n- DIFFICULT to navigate just by playing. 3rd party map is a must, lest you be turned around momentarily while running down a hill and lose your sense of direction. \n- Worst sin of all... It's just not compelling anymore. By the 2nd day in game, I was already cruising. This wasn't helped by the fact that I think I got a bug, because the zombie-things stopped showing up. I was out-and-about through day/night/sun/rain/MIST EVENT, doesn't matter, no walkers. However even if this hadn't happened, I'd still feel like nothing was drawing me in. \n\nSorry for the novel.", "timestamp_created": 1675554701, "timestamp_updated": 1675554701, "voted_up": false, "votes_up": 42, "votes_funny": 1, "weighted_vote_score": "0.75238490104675293", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "119015790": {"recommendationid": "119015790", "author": {"steamid": "76561198064977526", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 588, "playtime_last_two_weeks": 0, "playtime_at_review": 563, "last_played": 1685315447}, "language": "english", "review": "Call me when the zombies stop spawning inside my completely walled-off base.", "timestamp_created": 1658158197, "timestamp_updated": 1658158197, "voted_up": false, "votes_up": 45, "votes_funny": 15, "weighted_vote_score": "0.752087950706481934", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "121897697": {"recommendationid": "121897697", "author": {"steamid": "76561198207833508", "num_games_owned": 135, "num_reviews": 5, "playtime_forever": 293, "playtime_last_two_weeks": 0, "playtime_at_review": 273, "last_played": 1662584920}, "language": "english", "review": "Very pretty game and a fun zombie/mutant survival.  I like the single player focus too.  I like games like DayZ, but don't like people....at all. So games like this and SCUM give you the experience without having to deal with the dramas of playing with people if you don't want to.  The fact that all this has been accomplished by such a small dev team is incredible. Keep up the good work team Mist!", "timestamp_created": 1662582281, "timestamp_updated": 1662582281, "voted_up": true, "votes_up": 25, "votes_funny": 0, "weighted_vote_score": "0.750917494297027588", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "44416234": {"recommendationid": "44416234", "author": {"steamid": "76561198037113418", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 3496, "playtime_last_two_weeks": 0, "playtime_at_review": 1890, "last_played": 1668437380}, "language": "english", "review": "So far the game is a ton of fun. Crafting is good.  Doesn't feel like a never ending job. I have encountered a few bugs including one that makes a female ai characters top disappear showing her breasts. This has a large amount of potential though.", "timestamp_created": 1535414995, "timestamp_updated": 1535414995, "voted_up": true, "votes_up": 24, "votes_funny": 98, "weighted_vote_score": "0.750204324722290039", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "149824814": {"recommendationid": "149824814", "author": {"steamid": "76561198069215628", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 1391, "playtime_last_two_weeks": 0, "playtime_at_review": 1155, "last_played": 1699575755}, "language": "english", "review": "I'm absolutely disgusted with people who buy an early access game for a fraction of what it would release for, and then trash the game because it's not up to their demanding standards (WHILE BEING DEVELOPED!!!). You must have some level of Narcissism to trash a game in development because it's not finished enough for you. Shameful. \n\nThis game is AWESOME. Survival is my thing and I haven't found a game that really fits the bill, until this one. I've played Subsistence, the Long Dark, Ark, the Forest, 7 Days, etc. This game has a lot of similar elements to these games, but made them even better. It's not perfect, but it has great dynamics, amazing graphics, a pretty damn big map, and really interesting concepts. There's a cart you can construct and then manually drop stuff in and cart it around, instead of just transferring items to another inventory. The rain degrades items. You need food and water and running degrades your stats faster (I think?). I even noticed the street being shiny wet after a rain (though it hasn't rained again for me to be certain, don't blame me if I'm wrong). The dev is actively working on the game and there are updates. This game was worth the $10.99 I paid in the first hour. I can't wait to see how the game develops.", "timestamp_created": 1699552244, "timestamp_updated": 1699554723, "voted_up": true, "votes_up": 88, "votes_funny": 5, "weighted_vote_score": "0.750159084796905518", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "102100004": {"recommendationid": "102100004", "author": {"steamid": "76561197960457050", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 7617, "playtime_last_two_weeks": 0, "playtime_at_review": 4592, "last_played": 1699752259}, "language": "english", "review": "The game is going nowhere. It's sad, I really like the concept, and I want to like the game, however the execution is very poor. It's been 3 years since release in 2018 and from what we currently have, I would have thought the game released in early access just yesterday.\n\nThe AI is dumb and annoying. The survivors you rescue are constantly getting stuck together, or stuck in the floor (or ceiling). The bandits will snipe you through solid objects, or constantly try to shoot you through buildings / trees / cars with their endless magazines.\n\nThe mist creatures aren't much of a threat (jump on top of the nearest car and you're safe), same with the night creatures. They don't destroy structures, nor do they climb small fences. Build a small livestock fence, sit inside it, and you're perfectly safe.\n\nI had hopes for 0.5 fixing a lot of issues and held off on a review until then. However 0.5 is WORSE than previous versions (even so far as that the dev rolled back to 0.4). Aiming with the recurve bow is impossible because the player holds the bow sideways like some sort of gangster robin hood, makes it nearly impossible to figure out where the arrow is going to go. The AI is still the same dumb AI from before that constantly tries to shoot you through solid  objects with the good old fashioned endless supply of ammunition they seemingly have. I fear none of these issues will ever be addressed.\n\nI'm torn, I really want to like the game, it's a good concept, I have enjoyed my ~70ish hours in the game, but there are just too many issues and uncertainties with the game's future to actually recommend it.", "timestamp_created": 1635871584, "timestamp_updated": 1635871584, "voted_up": false, "votes_up": 94, "votes_funny": 4, "weighted_vote_score": "0.746857941150665283", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "150013388": {"recommendationid": "150013388", "author": {"steamid": "76561199021216225", "num_games_owned": 0, "num_reviews": 80, "playtime_forever": 2972, "playtime_last_two_weeks": 0, "playtime_at_review": 2404, "last_played": 1702927136}, "language": "english", "review": "Super ambitious survival game worked on primarily by one person (sometimes he has help). The idea behind the game is super rad, and I love the fact that the enemies aren't just \"Zombies\" but actually something far worse (The inclusion of some alien monsters is also very welcome). If this game ever gets finished it will probably be my favorite survival game... but...\n\nDo not get this game if you are not okay with very long waits between updates. Do not get this game is your idea of early access is a finished product and completely bug free.  Do not get this game if you like to clutch your save files like they are your precious children.\n\nDo get this game if you want to see a pretty unique take on survival games. Do get this game if you want to support a developer that is just trying their darndest to get their vision out to people. Do get this game if you can see past early access flaws, cause you will find a gem buried underneath.", "timestamp_created": 1699807968, "timestamp_updated": 1699807968, "voted_up": true, "votes_up": 25, "votes_funny": 0, "weighted_vote_score": "0.741664528846740723", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "143943754": {"recommendationid": "143943754", "author": {"steamid": "76561198987476195", "num_games_owned": 150, "num_reviews": 6, "playtime_forever": 1112, "playtime_last_two_weeks": 0, "playtime_at_review": 1112, "last_played": 1669759648}, "language": "english", "review": "This beeds co-op bad it would be so much fun", "timestamp_created": 1691802471, "timestamp_updated": 1691802471, "voted_up": true, "votes_up": 39, "votes_funny": 2, "weighted_vote_score": "0.739915430545806885", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "97023448": {"recommendationid": "97023448", "author": {"steamid": "76561198273020498", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 3698, "playtime_last_two_weeks": 0, "playtime_at_review": 1887, "last_played": 1652226304}, "language": "english", "review": "Its very good ..........only wish you could have it a Multiplayer game!! My husband works away so we try and play games we can play together! This is a very good game though!", "timestamp_created": 1628221418, "timestamp_updated": 1628221418, "voted_up": true, "votes_up": 30, "votes_funny": 2, "weighted_vote_score": "0.739351987838745117", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "139785511": {"recommendationid": "139785511", "author": {"steamid": "76561198299265184", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 5359, "playtime_last_two_weeks": 0, "playtime_at_review": 3594, "last_played": 1707586452}, "language": "english", "review": "This game is great, especially for the price. The quality is pretty good compared to other games, and while it is limited, it is understandable, considering that it is ONE developer working on it as a side project. My whole family has the game, and all of us enjoy it as a fairly leisurely game that doesn't overwhelm you with stuff. My father is heavily disabled, and he can't play most games because they go too fast or are too complicated, but he found this, and he has loved it ever since. Absolutely a great game. It has bugs, but that is to be expected. Can't wait for multiplayer to come out!", "timestamp_created": 1686321533, "timestamp_updated": 1686321533, "voted_up": true, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.738145589828491211", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "94804059": {"recommendationid": "94804059", "author": {"steamid": "76561197983169415", "num_games_owned": 891, "num_reviews": 109, "playtime_forever": 1747, "playtime_last_two_weeks": 0, "playtime_at_review": 1694, "last_played": 1685429509}, "language": "english", "review": "It's basically 7 Days to Die but with less features, less bugs, less depth, and most importantly: less grinding. It's an enjoyable experience, but feels slightly empty the whole way. \nConstructive criticism/suggestions: (if the devs happen to read) \n-Give us something actually useful to use with planks.\n-Fix hitbox registration\n-Make ammo more abundant\n-Increase the inventory side of the jeep\n-Give players some sort of reward for killing bosses and raiding camps - it pissed me off to get my ass kicked, dying a few times along the way, and to see that all I've earned for my endeavor was 1x can of food and 2x planks.\n-Increase natural placement/spawns of moveable containers. I don't want to waste my materials on more lockers because they're more useful things that I need to build, but at the same time, this leaves me with a disgusting inventory management scene that really makes me not want to play the game. It's overwhelming, and it's not fun. Probably three quarters of all of the times I've stopped playing was because of inventory management.", "timestamp_created": 1625140638, "timestamp_updated": 1625140638, "voted_up": true, "votes_up": 29, "votes_funny": 0, "weighted_vote_score": "0.737020134925842285", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "152952747": {"recommendationid": "152952747", "author": {"steamid": "76561198095213764", "num_games_owned": 220, "num_reviews": 26, "playtime_forever": 1235, "playtime_last_two_weeks": 0, "playtime_at_review": 1235, "last_played": 1701815200}, "language": "english", "review": "Since moving over to unreal 5 game is unplayable no settings work no keys are bound everything looks fuzzy and grainy. Needs a lot of work,", "timestamp_created": 1701815271, "timestamp_updated": 1701815271, "voted_up": false, "votes_up": 69, "votes_funny": 6, "weighted_vote_score": "0.736729085445404053", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "55148572": {"recommendationid": "55148572", "author": {"steamid": "76561198448033827", "num_games_owned": 66, "num_reviews": 2, "playtime_forever": 1119, "playtime_last_two_weeks": 0, "playtime_at_review": 127, "last_played": 1709181765}, "language": "english", "review": "i LOVE this game but.......i wish there was a bigger map and multiplayer with steam friends\n\n\nThanks dev!!!! keep up the great work ;)", "timestamp_created": 1568689052, "timestamp_updated": 1568689052, "voted_up": true, "votes_up": 38, "votes_funny": 1, "weighted_vote_score": "0.735212326049804688", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "83977356": {"recommendationid": "83977356", "author": {"steamid": "76561198005918717", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 14244, "playtime_last_two_weeks": 225, "playtime_at_review": 2881, "last_played": 1713681348}, "language": "english", "review": "Nice game, needs more to do. Some ideas,Bandit's driving cars around that attack if they see you, NPC,s to trade with, horses to ride and breed, crossbow, bear traps, alligators, boars just some ideas.", "timestamp_created": 1609755572, "timestamp_updated": 1609755572, "voted_up": true, "votes_up": 24, "votes_funny": 2, "weighted_vote_score": "0.73078000545501709", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "48215944": {"recommendationid": "48215944", "author": {"steamid": "76561197962106786", "num_games_owned": 520, "num_reviews": 20, "playtime_forever": 1504, "playtime_last_two_weeks": 0, "playtime_at_review": 859, "last_played": 1650855755}, "language": "english", "review": "First thing to note: this game is a one-man project.  That means development can be a bit slow at times, but it is consistent.  The game has a clear direction and Rati is very involved with his community of players; this is the kind of project and developer that Early Access was made for.  I've sent in bug reports and actually gotten a response every time; Rati seems 100% invested in his project and I don't see him going anywhere any time soon (like so many EA developers do).  Anyway, none of that says anything about the game itself - it's just worth mentioning since this is an Early Access game.\n\nIn my mind there are two kinds of survival games: the brutal ones where you're constantly fighting what seems to be a futile battle and the chill ones where you're just living your life; gathering resources, killing zombos, building a base, etc.  Mist is mostly the latter with touches of the former here and there to keep you on your toes.  The systems that are in the game are very well done.  While there are certainly many bugs, they are typically addressed quickly - if you find a bug, it will usually be fixed within 1 or 2 patches.  Amazing how one guy can get things done faster than most big studios!\n\nHonestly, there's not much to say about the game...it's just another survival game that at this stage in development doesn't really offer anything special, but it's a good one with a developer that actually cares about making it the best it can be.  I think Mist definitely has the potential to become something special, and I think Rati is a developer with the drive and commitment to make it something special...so I'd say it's definitely worth picking up.", "timestamp_created": 1547083143, "timestamp_updated": 1547083143, "voted_up": true, "votes_up": 26, "votes_funny": 1, "weighted_vote_score": "0.730128765106201172", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "102316549": {"recommendationid": "102316549", "author": {"steamid": "76561198451149039", "num_games_owned": 56, "num_reviews": 3, "playtime_forever": 1140, "playtime_last_two_weeks": 0, "playtime_at_review": 460, "last_played": 1675271451}, "language": "english", "review": "It's a good and fun game, but I would like to add multiplayer", "timestamp_created": 1636198731, "timestamp_updated": 1636198731, "voted_up": true, "votes_up": 41, "votes_funny": 1, "weighted_vote_score": "0.729168713092803955", "comment_count": 0, "steam_purchase": true, "received_for_free": true, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "98542182": {"recommendationid": "98542182", "author": {"steamid": "76561199160879551", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 10414, "playtime_last_two_weeks": 0, "playtime_at_review": 1589, "last_played": 1704582641}, "language": "english", "review": " Very beautiful game. i have been playing games since pong. yes, i'm 52..  I love the graphics of these days..  Very well done.. Can't wait for update..", "timestamp_created": 1630379515, "timestamp_updated": 1630379515, "voted_up": true, "votes_up": 27, "votes_funny": 0, "weighted_vote_score": "0.728569209575653076", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "155776617": {"recommendationid": "155776617", "author": {"steamid": "76561198825830475", "num_games_owned": 109, "num_reviews": 27, "playtime_forever": 1392, "playtime_last_two_weeks": 0, "playtime_at_review": 1372, "last_played": 1705028689}, "language": "english", "review": "game is incredibly fun, I only wish that there are season like rain and snow but that’s on the roadmap. hopefully we’ll see that soon!!", "timestamp_created": 1705009955, "timestamp_updated": 1705009955, "voted_up": true, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.726568520069122314", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "65225950": {"recommendationid": "65225950", "author": {"steamid": "76561198060390943", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 2931, "playtime_last_two_weeks": 0, "playtime_at_review": 890, "last_played": 1662143252}, "language": "english", "review": "2022 update:\nSo I came back to this game to see if I can change my negative review into a positive one and unfortunately I can't.\n\nTwo years have passed and to my greatest suprise, the game feels weaker than it was two years ago. \n\nNew pros:\n- More enemy types\n- Bit more fleshed out NPCs\n- More buildings\n- More features\n- Dog!\n\nNew cons:\n\n- The map feels smaller than it was before. Maybe it's just my memory playing tricks on me.\n- Less buildings to take over (I only found a couple of barns and two houses)\n- The bandits are still using hacks\n- I think even more bugs than there were two years ago\n- Not optimized for ultra wide monitors\n- Disappearing stuff\n- Inventory management is a pain\n\nOverall, I feel like if the developer made the game from two years ago, more stable and balanced, it would've been an awesome experience today, but I think more and more features have been added that made the game even more unstable. \n\nMy opinion is that if the game would've just came out as an alpha today, it would be ok, but after more than two years, it should be way more than this. I feel really sorry, because I really thought this will turn out to be one of the best survival games, but at this moment it's still just an alpha version.\n\nI'll check back in two years.\n\n2020:\n\nWhile I think this game is enjoyable and has a LOT of potential, unfortunately there is a major issue with it.\nA big chunk of the game is basically a shooting FPS, but overall the shooting part of it is just unbearably bugged. \n\nPros:\n\n- Great environment, beautiful scenery\n- Awesome survival mechanics. Not too much and not too unrealistic, just right.\n- Free building\n- Cars!\n\nCons:\n- Snipers can spot your through trees and I would even look over this but they also can shoot you through them. \n\n- The enemy NPCs (mostly the bandits) are way overpowered and I really don't mind that one or two shots can take you down, but again they can literally shoot you through stuff.\n\n- While the bandits have unlimited ammo they rarely drop any ammo or weapon parts (or I'm just really unlucky).\n\n- Wherever you go they will definitely know where you are.\n\n- Because enemys can literally sense you, stealth rarely works. \n\nTL/DR:\nSo while I think this is a great start, I can't recommend it at this moment. The building and survival is fun, but as soon as you have to get out and get some late game stuff... it's kind of rage quit inducing. I hope they will keep up the good work and make this game flawless!\n\n", "timestamp_created": 1584473666, "timestamp_updated": 1661166875, "voted_up": false, "votes_up": 58, "votes_funny": 7, "weighted_vote_score": "0.725536644458770752", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "68827139": {"recommendationid": "68827139", "author": {"steamid": "76561198264110187", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 2013, "playtime_last_two_weeks": 0, "playtime_at_review": 118, "last_played": 1703476842}, "language": "english", "review": "I recommend this game for purchase, but i do not want the game to add aliens, in my opinion it is too much. Aliens ruins the whole real feel of a infected outbreak to the game, and i wish this game had a 2 to 4 player co-op. so dev if you end up reading please take my advice i am not speaking for just myself but most of the other reviews i've read as well. I think the game will go a long way if you do so. Thanks.", "timestamp_created": 1588998531, "timestamp_updated": 1588998531, "voted_up": true, "votes_up": 39, "votes_funny": 3, "weighted_vote_score": "0.723875164985656738", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "100735153": {"recommendationid": "100735153", "author": {"steamid": "76561198425126655", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 2058, "playtime_last_two_weeks": 0, "playtime_at_review": 948, "last_played": 1703413924}, "language": "english", "review": "Extremely buggy and unfinished game. However, it is the best survival game concept ever, I suggest you dont buy it right now and wait a couple months until the bugs are fixed. And remember that this game was made by a single developer.", "timestamp_created": 1633710132, "timestamp_updated": 1633710132, "voted_up": true, "votes_up": 30, "votes_funny": 4, "weighted_vote_score": "0.723496556282043457", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "145164905": {"recommendationid": "145164905", "author": {"steamid": "76561198042801037", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 48834, "playtime_last_two_weeks": 0, "playtime_at_review": 48834, "last_played": 1693175651}, "language": "english", "review": "I have well over 800 hours into this game. \nDeveloper has a bad habit of releasing part of this game, in such a bad state, with MASSIVE stability and coding issues. \nDeveloper then, over the next months/years, ignores all the bugs and issues and works on a new map and releases that.\nPeople get excited over the new map; yes, its new, but it has almost all the same bugs the old map had. \nDeveloper then starts work on another new map, instead of fixing the ones they already released. \nStability = 1/10\nBug Fixing = 0/10\nFrustration Level = 10/10\nLoyal Fan Base = 9/10\nPotential For a Great Game = 10/10\nLikelihood This Game Will Ever Be A Full Release = 1/10\nPlayability = 2/10\nStubborn Developer = 10/10\nShould You Purchase It? = It Is Fun, For A While But Eventually You Will Discover What I Am Talking About...Took Me Over Three Years To Figure This Out\nYears In Development Already = 5 Years On Steam (2018) \nClose To Completion = 0/10\nChance Of Eventual Completion = 0.05/10 \nTotal Number of Devs Working On This Game = 1\n", "timestamp_created": 1693177101, "timestamp_updated": 1693177101, "voted_up": false, "votes_up": 100, "votes_funny": 19, "weighted_vote_score": "0.723023355007171631", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "134398947": {"recommendationid": "134398947", "author": {"steamid": "76561199030173074", "num_games_owned": 93, "num_reviews": 5, "playtime_forever": 196, "playtime_last_two_weeks": 0, "playtime_at_review": 85, "last_played": 1698522457}, "language": "english", "review": "make multiplayer please it will be more fun", "timestamp_created": 1678448039, "timestamp_updated": 1678448039, "voted_up": true, "votes_up": 64, "votes_funny": 0, "weighted_vote_score": "0.721395134925842285", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "145239851": {"recommendationid": "145239851", "author": {"steamid": "76561198046231580", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 38668, "playtime_last_two_weeks": 0, "playtime_at_review": 30927, "last_played": 1699778924}, "language": "english", "review": "I'm an older gamer (73) and I have pushed this 'game' to the limit of my skills but there is always more to discover so until a better game comes along, this will have to do.", "timestamp_created": 1693286732, "timestamp_updated": 1693286732, "voted_up": true, "votes_up": 21, "votes_funny": 1, "weighted_vote_score": "0.719619274139404297", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "137809268": {"recommendationid": "137809268", "author": {"steamid": "76561197981451249", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 4537, "playtime_last_two_weeks": 0, "playtime_at_review": 574, "last_played": 1702621361}, "language": "english", "review": "Well, I thought it was pigeon-holed, but now it looks like the Dev has resurrected it.  \nI played this when it new and I thought it had some really good potential. \nNow that its being updated regularly again, I'm very interested to see where it leads.\n\nKeep in Mind: Its still considered an \"Early Release\"\nUnfortunately, some people with no real concept of the work it requires offer their less than helpful, negative reviews.\nTake the negative reviews with a grain of salt. \n\nThis game has some serious appeal; and with some dedication & commitment by the Dev, it can be a true 'Stand Out' among its peers in the genre.\n\nI, for one, have my fingers crossed.", "timestamp_created": 1683255758, "timestamp_updated": 1684170130, "voted_up": true, "votes_up": 27, "votes_funny": 1, "weighted_vote_score": "0.719008326530456543", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": true, "steam_china_location": ""}, "91466079": {"recommendationid": "91466079", "author": {"steamid": "76561198996118733", "num_games_owned": 48, "num_reviews": 1, "playtime_forever": 2258, "playtime_last_two_weeks": 0, "playtime_at_review": 1228, "last_played": 1664028231}, "language": "english", "review": "It is really entertaining, but multiplayer will make it a must play", "timestamp_created": 1620204193, "timestamp_updated": 1620204193, "voted_up": true, "votes_up": 31, "votes_funny": 1, "weighted_vote_score": "0.717603981494903564", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "44352159": {"recommendationid": "44352159", "author": {"steamid": "76561197969096617", "num_games_owned": 0, "num_reviews": 109, "playtime_forever": 1383, "playtime_last_two_weeks": 0, "playtime_at_review": 1230, "last_played": 1565533542}, "language": "english", "review": "The Short:\n\nWhile this game does have potential, I don't do reviews based on what I imagine a game could become. Expect a -lot- of bugs (many of which are game breaking), a very sloppy game setup, and infuriating gameplay. This game is a bit too early in early access.\n\nThe Long:\n\nFor the sake of not making this a mile a long, I'll do bulletins and explanations..\n\nMy biggest issue.. The Infected. They pose almost no threat whatsoever except for the fog events, which are predictable (around mid-day). These can currently be bypassed by simply crafting something to pass the time or sleeping. Since the infected cant go out in the sun, and are very loud, you can just loot freely throughout the day with very little worry. This -killed- the fear and survival aspect of the game.\n\nSemi-fixed, at least not a big issue.. Parts are more common and respawn.[strike]Car durability - Drive a half mile without hitting anything and you lose 10% of the engine durability. Since engines are a finite resource, expect to be walking -a lot- late game. [/strike]\n\nThe horrible English grammar in this game. Being that the only language option available is English, I am confused how it could be so bad. (Dev, if you need someone to properly go through the text and make sure it is correct, there are many people who will do it for free, including myself).\n\nConfusing world resources - Need a tire? oh there's a stack of tires over there.. no wait.. thats just decoration. Is this destructable for resources? maybe.. it could also just be an indestructable decoration. A lot of things that are lootable, are also used as un-usable item decorations so you are always left guessing if you can pick something up. This is a huge no-no in decorating a game. Also.. why is the only cars I'm allowed to drive the only ones with absolutely nothing left in them (literally stripped down to their bare frame, not even a spark plug in them), when there is so many nice-looking cars parked everywhere that are totally unlootable.\n\nNo Randomization - All resources are in the same spot every time, you start in 1 of 2 areas, each are very close to eachother. This gives 0 replayability.\n\nEnd of the world. Reach the end of the map? Thats it, it just cuts off. Most people who have played games know that most game designers add witty ways to end a map, such as an impassable mountain, a giant sea, walls, buildings.. ect.. nope, it just cuts off. This is game design 101.\n\nUnending spawns. Want to add excitement and actually fight some infected in a house? Lol no. Expect them to keep spawning on top of you till you are dead, like a clown car from hell, they will just keep pouring out.\n\n*This has since been fixed* [strike] Forced VR. If you have a VR setup, you will not be able to play this game without turning on Steam VR, despite this game not being a VR compatible game. [/strike]\n\nResolution options are inaccurate and bugged. If you like playing in window mode, you are going to have a terrible time getting this game to get the correct resolution.\n\nPro's and Cons\n\nPros: \n- Rapid development speed so far\n- Despite it's issues, it is fun to play for a short period\n- It does bring new concepts to the genre, hopefully the devs can deliver\n\nCons:\n- Above are most of them\n- This game needs a couple years of work\n\n-Final-\n\nAs stated, I don't recommend games on potential, but I do believe this game is on the right course for something excellent, whether or not the devs can deliver based off of the current state of the game is one thing. The glaring issues in this game are that of beginners, which does not inspire much hope in the future.", "timestamp_created": 1535123606, "timestamp_updated": 1541790166, "voted_up": false, "votes_up": 223, "votes_funny": 30, "weighted_vote_score": "0.715990662574768066", "comment_count": 45, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "45764345": {"recommendationid": "45764345", "author": {"steamid": "76561198007263489", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 3031, "playtime_last_two_weeks": 0, "playtime_at_review": 1570, "last_played": 1597020132}, "language": "english", "review": "First Day:\n- Logged in, grabbed starting items from begining camp  *Chances of survival, optimistic*\n- Find a road and start walking towards a structure in the distance *Chances of survival, still optimistic*\n- Abadoned hotel with lots of goodies *Chances of survival,  pretty optimistic*\n- Go to the 2nd floor of hotel and realize one of the doors is a no go *Chances of survival, back to just optimistic*\n- Discovered a dirt road leading to what looks to be house, potential base *Chances of survival, extremely optimistic*\n- Walking down the path towards said structure when I begin to hear loud thuds in a pattern *Chances of surival, What's that sound?*\n- SHIT BEAR!  *Chances of surival, PANIC!*\n- Dodge in between trees, bear loses interest and shorten distance to future base *Chances of survival, back to optimistic)\n- Claim base and squel as I walk in side to see my new home *Chances of survival, IN YOUR FACE GAME)\n- Find water and knife inside but need supplies but happy to be weaponized *Chances of survival, Game's a Joke!)\n- Exploring becomes addictive, so many goodies, lose track of time *Chances of survival, Feels like I'm raiding WalMart, sooo many goodies*\n- Shut hood to car after grabbing engine to realize that the once beautiful nature sounds have been replaced with something...eerie *Chances of survival, PANIC!*\n- Turn around to look back at my sweet new base, now, not even visible *Chances of survival, Okay, Okay, I might of been a little too cocky*\n- Begin to attempt to make it back to my super sweet base when I realize I am no longer alone *Chances of survival, IT JUST GOT REAL*\n- At same time, the AI realizes they are no longer alone, AI runs like USAIN BOLT on CRACK *Chances of survival, Can't think straight, running for my life, dropping F-bombs all along the way*\n- Attempt same strategy of bear against my new friends, doesn't help, gets me lost *Chances of survival, THIS CAN'T BE THE END*\n- See a shack in the distance, looks like a shelter, I can make it! *Chances of survival, I'M GOING TO MAKE IT! HAHA!*\n- Get inside base, need to catch my breath, what a rush, I can't believe I survi... Windows have boards on them... AI grins *chances of survival, Annndddd I'm dea...*\n\nTLDR: The game is still in Early Access but still offers a lot of fun and can see end game potential!\n\n- Constent updates, a development map, a lot of potential in this game. Of course being EA if you are more into the basebuilding side of the game, do not get attached to your bases during EA. To implement new features you will have to restart. It's expected in EA's to have to start from scratch a bunch so if that's your thing you may want to wait. \n", "timestamp_created": 1541953430, "timestamp_updated": 1541953430, "voted_up": true, "votes_up": 34, "votes_funny": 34, "weighted_vote_score": "0.715465784072875977", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}}, "query_summary": {"num_reviews": 41, "review_score": 6, "review_score_desc": "Mostly Positive", "total_positive": 5178, "total_negative": 1460, "total_reviews": 6638}, "cursors": {"AoIIPwAAAHfwuNkE": "Mon Apr 22 23:48:36 2024"}}
