{"reviews": {"162461782": {"recommendationid": "162461782", "author": {"steamid": "76561199011819584", "num_games_owned": 143, "num_reviews": 36, "playtime_forever": 66, "playtime_last_two_weeks": 0, "playtime_at_review": 66, "last_played": 1686318680}, "language": "english", "review": "So much potential if it wasnt a server based focused multiplayer experience instead of a singleplayer/coop experience. More pve could make this game amazing.", "timestamp_created": 1712553167, "timestamp_updated": 1712553167, "voted_up": false, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.668127894401550293", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "160451483": {"recommendationid": "160451483", "author": {"steamid": "76561198033349217", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1555, "playtime_last_two_weeks": 0, "playtime_at_review": 1555, "last_played": 1710340138}, "language": "english", "review": "It says I've played 25 hours but almost 2 of those hours were erased because my internet got disconnected. It happened yesterday and I lost about 45 minutes of play. It just happened again and when I went back to play I lost almost an entire hour this time. I'm done. I'm playing a single player game and required to be online and then on top of it I lose all unsaved progress because my internet gets disconnected.  I would have never bought this game if I knew it required you to be online to play SINGLE PLAYER. Otherwise it would have been a great game because I was having a lot of fun. Developers need to stop doing this.", "timestamp_created": 1710340493, "timestamp_updated": 1710340493, "voted_up": false, "votes_up": 10, "votes_funny": 2, "weighted_vote_score": "0.649880349636077881", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161611645": {"recommendationid": "161611645", "author": {"steamid": "76561197999258939", "num_games_owned": 0, "num_reviews": 32, "playtime_forever": 254, "playtime_last_two_weeks": 0, "playtime_at_review": 254, "last_played": 1620874776}, "language": "english", "review": "Seems fun until i realized it was realtime decay on items like Ark. This is a full time job i dont have time for or want.", "timestamp_created": 1711576920, "timestamp_updated": 1711576920, "voted_up": false, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.645995795726776123", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161922900": {"recommendationid": "161922900", "author": {"steamid": "76561198021953887", "num_games_owned": 0, "num_reviews": 47, "playtime_forever": 11594, "playtime_last_two_weeks": 0, "playtime_at_review": 11594, "last_played": 1711924807}, "language": "english", "review": "Has potential to become a good game. But at this stage (April 2024), after all these hours of gameplay (190 hrs), I got frustrated by the constant resource farming and the lack of PvE content. \n\nOn PvP rush server I spend half of my game time, there was a setup of extra resources gathered, but it is pvp-stressful experience and the game is not oriented on defensive-base-building that I would like. By the time I had a decent base setup, a group of 3 end-level players would definitely manage to rade it because of equipment and no advanced base-defense game mechanics... Actually, the pvp is diminished into a top-down competitive shooter with resource rush-gathering and tech-tree crafting elements.\n\nOn PvE server, the gameplay was more to my type of preference. You can design an nice-looking village base, BUT there is no need for base protection or defense walls etc, since no Environment Elements (monsters etc) are going to attack it. The exploration and 'points of interest' elements are REALY minimal (especially compared to other craft-survival games), and the only actual goal is to collect the resources to advance the build and technology tree. ... But the farming needed at the official servers settings is TOO much for me. And running around the map just to gather the same thing over and over and over got me fed up... \n\nSo, after hundred of hours I am quitting the game feeling more frustrated than fulfilled/entertained. (Lots of my game-play time was during me sleeping on the keyboard.)\n\nBUT, I recommend the game, since it will offer you a lot of hours of satisfaction at start-to-mid gameplay, and if you are fun of PvE opportunities you could find a nice gem of a game on Cryofall. Just take note that if I was to start playing the game again, I would start a private server with boosted resource gathering and stack-limit parameters.", "timestamp_created": 1711935126, "timestamp_updated": 1711935126, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.580522119998931885", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "157903374": {"recommendationid": "157903374", "author": {"steamid": "76561198431156508", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 5931, "playtime_last_two_weeks": 0, "playtime_at_review": 5931, "last_played": 1707453471}, "language": "english", "review": "There's no significant update for over a year despite the promise from dev to release new update in 1.5 moth basis and the only \"update\" They make is server wipes (wich it is more like a routine rather than update), or maybe just new skins for holidays.\nMy single player game got stutter now and then, which is funny, because all of my game in same genres never get stutter like this, only drop in FPS if there is a lot monsters/objects in screen, which make me wonder, how can that happens in a single player server.", "timestamp_created": 1707456833, "timestamp_updated": 1707456833, "voted_up": false, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.566929101943969727", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "158552625": {"recommendationid": "158552625", "author": {"steamid": "76561198809789053", "num_games_owned": 243, "num_reviews": 33, "playtime_forever": 755, "playtime_last_two_weeks": 0, "playtime_at_review": 197, "last_played": 1709177520}, "language": "english", "review": "i don't hate it, but i would never pay more than maybe 5 bucks for this. it's not a bad game. the graphics, menus, and most of the progression remind me of those early facebook games by zynga like Farmville, but that doesn't make it unenjoyable (the similarities are definitely there in the farming and crafting, and technology tree systems). multiplayer seems to have seen better days (official Russia PvE @ 11/350 players, official global PvP @ 6/400 players as of time of this review). would be cool to see what it was like when lobbies were popular.", "timestamp_created": 1708195715, "timestamp_updated": 1708205101, "voted_up": false, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.536485671997070313", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "157189108": {"recommendationid": "157189108", "author": {"steamid": "76561198064964268", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 850, "playtime_last_two_weeks": 0, "playtime_at_review": 850, "last_played": 1706124165}, "language": "english", "review": "You like moving fuel canisters around buildings with almost 0 reward? here's the simulator for you.\n\nOtherwise, you could craft some ammunition, you just have to get like 100 bottles of water, craft 1 bottle of chemicals, then use that bottle + water to craft another bottle of chemicals, then to craft some powder, to then craft shotgun shells, you get 20 per craft but thats okay, a random lizard only takes about 4-5 shots to die.", "timestamp_created": 1706624161, "timestamp_updated": 1706624161, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.526841700077056885", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "161429724": {"recommendationid": "161429724", "author": {"steamid": "76561199442359850", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 4629, "playtime_last_two_weeks": 0, "playtime_at_review": 1440, "last_played": 1712484780}, "language": "english", "review": "Good game especially multiplayer.", "timestamp_created": 1711371573, "timestamp_updated": 1711371573, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.52173912525177002", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159539417": {"recommendationid": "159539417", "author": {"steamid": "76561198003843067", "num_games_owned": 220, "num_reviews": 15, "playtime_forever": 820, "playtime_last_two_weeks": 0, "playtime_at_review": 820, "last_played": 1706281921}, "language": "english", "review": "This is a really fun game with a deep and diverse crafting system.  It's fun to play alone and the multiplayer is well, just like everything other survival game.  Top tier players will kill you over an over, even when you aren't holding a gun.  And they will do it as if they are TERRIFIED of you, almost as if you had only stayed alive 5 more seconds a gun would have materialized in your hand and god mode would be enabled.  But these guys are ex military navy seals just hanging out after doing war all day and they killed you before that happened using their real life work experience!  100x server recommended because the grid will take you a full month to build the space ship and escape.", "timestamp_created": 1709215252, "timestamp_updated": 1709215252, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.520962119102478027", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "159008099": {"recommendationid": "159008099", "author": {"steamid": "76561199539724559", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 765, "playtime_last_two_weeks": 116, "playtime_at_review": 407, "last_played": 1713130971}, "language": "english", "review": "this game is for you if you enjoy adventure crafting games, there are many items you can craft and different layouts for your base it can also be  a very competitive game with the many players that play.", "timestamp_created": 1708640168, "timestamp_updated": 1708640168, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.503676474094390869", "comment_count": 0, "steam_purchase": true, "received_for_free": true, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "91201967": {"recommendationid": "91201967", "author": {"steamid": "76561198796678451", "num_games_owned": 43, "num_reviews": 3, "playtime_forever": 4685, "playtime_last_two_weeks": 0, "playtime_at_review": 842, "last_played": 1620771794}, "language": "english", "review": "Great game. Has a lot of potential! (To start a private solo game simply right click cryofall in your library, then hover mouse over manage, open browse local files, then double click the file \"cryofall local server\" and then a window will open. Let it load and you will have a private server set up. Plain and simple). Any questions post it in the comments!", "timestamp_created": 1619834331, "timestamp_updated": 1619834331, "voted_up": true, "votes_up": 416, "votes_funny": 13, "weighted_vote_score": "0.943214118480682373", "comment_count": 12, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "73543801": {"recommendationid": "73543801", "author": {"steamid": "76561197972833867", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 1920, "playtime_last_two_weeks": 0, "playtime_at_review": 431, "last_played": 1599164731}, "language": "english", "review": "The game is fun, but it's only recommended if you have a lot of time to play and can regularly play.  It's a bit like an idle game in that things have countdown timers.  A perfect example is farming.  It takes 2-3 hours after planting to be able to harvest.  But if you can only play, say, 1-2 hours every night, by the time the next night rolls around your harvest has rotted because you didn't harvest it fast enough.The timers in the game are such that if you can only play once a day for less than 3 hours per session, the game really isn't for you because you'll constantly be losing things to rot.  Harvest a bunch of food? Well, it'll rot before you can come back the next day.Another good example of decay timers not working well is power.  If you max out the power generator with charcoal and have several things for power storage, it'll last a few days.  But if you miss more than 2-3 days then you lose power and anything you have in storage rots.It's to the point now where I no longer want to play because I've progressed to the point where the game demands too much time and every time I login I just end up re-doing old work and don't really move forward.The decay timers are just not optimized for casual players.  So if you don't have a job and can afford to login multiple times a day or play for 4-5 hour stretches this game might be for you.  But if you are looking for a casual game to play a few hours a day you'll find yourself very frustrated very quickly.", "timestamp_created": 1596166953, "timestamp_updated": 1600283240, "voted_up": false, "votes_up": 149, "votes_funny": 1, "weighted_vote_score": "0.901791691780090332", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "106312285": {"recommendationid": "106312285", "author": {"steamid": "76561198056782913", "num_games_owned": 0, "num_reviews": 23, "playtime_forever": 39706, "playtime_last_two_weeks": 0, "playtime_at_review": 35542, "last_played": 1667235508}, "language": "english", "review": "Cryofall is an excellent game as long as you understand what it *is* compared to what it is not. This game is a season based multiplayer game where you build and construct a base camp with the intent of eventually building a rocket to escape the planet. It is not a game that is designed to be played \"sandbox\" forever like Minecraft, it's not procedural generated like Factorio. It's a persistent map for the season then a wipe comes and you do it again starting from zero.\n\nEach season last 6 weeks since that's about the amount of time a player needs to get to the very end of everything and have nothing left to do. There are 20 different skills that your character learns over the course of the game and as you level them up you become *better* at doing the task the skill is related to.  You use the exp you get (known as Learning Points) in order to advance through the tech tree and branch out into various different subsets of technology. From the ability to construct more technologically advanced crafting stations to being able to create better weapons and armor, to being able to build up your own farm and cook the crops into meals that provide subtle stat bonuses to building vehicles to get around the world faster to finally building Mechs to take down the event bosses that spawn every 5-6 hours.  At first you'll have to pick and choose what you want to branch into but eventually you'll know everything and can do it all.\n\nThere are various events that happen which can be like mini contests even on PvE servers in order to get bonus loot to make your character stronger in spite of not having certain technologies. There are also enemy based events where rare mobs spawn that provide even rarer loot to finally having the event bosses where you'll need to group up with other players in order to bring them down for the rarest of all the items to make the best mech in the game as well as get the ingredients you need to complete your rocket.\n\n\n\nAs a side note I find that people who dislike this game do not understand the origins of the game therefore compare it to games that it has similarities to rather than comparing it to what it actually *is*. This game was originally designed as a season based PvP game. \n\nAnd while they created a separate PvE version of the game but,  they had to add/subtract/adjust  the content of the game as PvE plays entirely different from PvP.  They ended up adding in the event \"bosses\" as a means of end game challenge for those players as well as a the means to build the rocket to provide a \"conclusion\" to the game in spite of the fact that there really wasn't meant to be one. \n\nIn the beginning they only wiped the PvE servers during a major patch update but, as they approached version 1.0 they settled on a 6 week server wipe for that as well as by the time you get that far in the interest in the game drops off exponentially as it becomes a situation where you have a stockpile of resources but no use for them. A game with nothing to do it in it is going to have a massive player drop off so the server wipes are a way of allow the game to maintain a state of 'freshness' to it without getting stale.\n\nFinally, after all of that was complete they decided on creating single player servers where the player can adjust the game how they see fit to play solo even though the game isn't designed around solo game play and is in fact crippled *if* you play it that way. \n\nTL:DR\n\nCryofall is a good multiplayer game that was literally designed with PvP in mind. If you play it in any other way your mileage and enjoyment will vary the further you go away from the original premise of the game.\n", "timestamp_created": 1640207233, "timestamp_updated": 1640207233, "voted_up": true, "votes_up": 152, "votes_funny": 1, "weighted_vote_score": "0.901063799858093262", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "118789463": {"recommendationid": "118789463", "author": {"steamid": "76561198080305553", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 8489, "playtime_last_two_weeks": 0, "playtime_at_review": 4902, "last_played": 1658561434}, "language": "english", "review": "This is not a single player game PvE as is it was built as a multiplayer PvP. The single player mode is boring & mundane with the standard resource gathering & base/character development. It must be said that the single player PvE mode is a way to develop skills to ultimately play the multiplayer PvP. I guess that's what the developers where aiming for, a full-on multiplayer experience. If you are not into multiplayer PvP then this is not for you", "timestamp_created": 1657787823, "timestamp_updated": 1658099261, "voted_up": true, "votes_up": 136, "votes_funny": 2, "weighted_vote_score": "0.891701638698577881", "comment_count": 12, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "59778674": {"recommendationid": "59778674", "author": {"steamid": "76561197994564679", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 1511, "playtime_last_two_weeks": 0, "playtime_at_review": 1511, "last_played": 1576257129}, "language": "english", "review": "If you play PvE this game is a farming sim.\nIf you play PvP you will get destroyed by hoards of Russian and Chinese players.\nThe only hope is to have a bunch of friends to play with, or find a server that's been recently wiped.\nI wanted to enjoy this game.", "timestamp_created": 1576258304, "timestamp_updated": 1576258304, "voted_up": false, "votes_up": 153, "votes_funny": 15, "weighted_vote_score": "0.881290018558502197", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "119971729": {"recommendationid": "119971729", "author": {"steamid": "76561197963496457", "num_games_owned": 543, "num_reviews": 26, "playtime_forever": 8172, "playtime_last_two_weeks": 0, "playtime_at_review": 6118, "last_played": 1661921130}, "language": "english", "review": "A neat concept ruined by the devs' bizzare obsession with PVP. Fun for about a week.", "timestamp_created": 1659495823, "timestamp_updated": 1659495823, "voted_up": false, "votes_up": 131, "votes_funny": 3, "weighted_vote_score": "0.859272658824920654", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "101257899": {"recommendationid": "101257899", "author": {"steamid": "76561198076114432", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 2982, "playtime_last_two_weeks": 0, "playtime_at_review": 2982, "last_played": 1634485721}, "language": "english", "review": "Thanks for making this game single player.", "timestamp_created": 1634578112, "timestamp_updated": 1634578112, "voted_up": true, "votes_up": 90, "votes_funny": 5, "weighted_vote_score": "0.84752047061920166", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "59957966": {"recommendationid": "59957966", "author": {"steamid": "76561198097871714", "num_games_owned": 0, "num_reviews": 49, "playtime_forever": 8912, "playtime_last_two_weeks": 0, "playtime_at_review": 8108, "last_played": 1625046919}, "language": "english", "review": "+ Pragmium War content update review +\n\nIN PVE :\n\nThe DEVELOPER did try to reduce the grind by add in a system similar to achievement system in most of other game that reward LP to the player to reduce the grind to level up their tech. (example :  eat a raw meat once... kill a chicken for the first time... etc...)\n\nBUT the amount of LP rewarded are RIDICULOUSLY little like 5-10LP per achievement. Whats even more funny is the total achievements and LP rewarded are barely enough to RESEARCH a tech in T4 TECH.\n\nALL IN ALL,\n\nTo returning player : you are still require to grind day and night like a fucking no live all over again just to have a taste of the COOL STUFF IN LATE GAME.\n\nTo new pve player : please continue reading my old review at below.\n\nBIG OOF to the player AND BIG F to the developer. it was awfully disappointing.\n\n\n= BELOW ARE OLD REVIEW = dated : DEC 2019\n\nLong story short, this game is a massive grinding mess. \n\nYou will mostly enjoy it for a few hours grinding  until u hit your Tech learning wall (T3 onwards). i spent a total 135 hours no life grinding it and still couldn't finish learning the tech everything is too slow after T2..\n\nTreasure your life and play the demo first and if u think u can spend another 200+ hours to grind for it then buy it and face the time to time server wipe.", "timestamp_created": 1576503192, "timestamp_updated": 1587702842, "voted_up": false, "votes_up": 73, "votes_funny": 3, "weighted_vote_score": "0.845120728015899658", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "132318697": {"recommendationid": "132318697", "author": {"steamid": "76561198000149166", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 5165, "playtime_last_two_weeks": 0, "playtime_at_review": 5165, "last_played": 1675688055}, "language": "english", "review": "I played Cryofall single player and I enjoyed it. The game is design as multiplayer experience, but you can play it single player happily if you increase the resource/harvesting/crafting rates by a lot. Grindiness was the main complaint other reviewers had for a single player experience, with decay rate of equipment and power sources also slowing down progress. However, the devs have added the feature that you can adjust the game settings to customise your experience and after reading reviews I decided to increase all the resource rates for myself.\n\nYou can play it multiplayer MMO like the devs originally designed it, like a difficult survival game like Don't Starve, or a hoarding/base-building game like I enjoy. I ended up with 1.6mil units of leftover metal after I finished the game, because I just enjoy stockpiling a vast caches of all materials.\n\nCommenting on suitable rates to make it similar to a other single player farming/base building games, you probably want to go 5 times the rate for all crafting and resource collection rates. I would also unlock the limits on stack sizes and set 50 times normal stack sizes. Increased stack size also makes crafting/manufacturing/power-supply less tedious. The combat settings are already balanced for the difficulty modes the developers recommends.", "timestamp_created": 1675690601, "timestamp_updated": 1675690601, "voted_up": true, "votes_up": 49, "votes_funny": 1, "weighted_vote_score": "0.843122184276580811", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "122887198": {"recommendationid": "122887198", "author": {"steamid": "76561198110931988", "num_games_owned": 0, "num_reviews": 101, "playtime_forever": 3178, "playtime_last_two_weeks": 0, "playtime_at_review": 3178, "last_played": 1645497088}, "language": "english", "review": "The pvp of this game is just like rust. You have a wooden club and a guy with a spaceship decides to laser you and take all of your things despite the lack of value of your things. I played this game to the mid-high tier and spent most of it farming and building. I love the bases, I love the gameplay but the PVP is awful. When you encounter a player 1 of 2 things happens, you either out tech them or they out tech you. Very very rarely do you encounter people on the same level and when you do they usually flee for good reason, but in the mid tier be prepared to lose your hunting rifles to guys with hover boards and lasers. But the difference in tech is insane. You can spend all day getting up to a your first  weapon then die to some guy with a super mech that you don't even pose a threat to. I understand the premise but its too hard to fight outside your tier and there are too many tiers to quickly traverse. I loved when they mentioned doing more PVE and would like to see them go down that route. \n\nGames like this would be good but the human condition of greed is too strong. People will quite literally kill your wooden base when they have huge clans with fully tech'd out bases. It's just not fun that way but its so close.", "timestamp_created": 1664226680, "timestamp_updated": 1664226811, "voted_up": false, "votes_up": 55, "votes_funny": 5, "weighted_vote_score": "0.821509003639221191", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "156279301": {"recommendationid": "156279301", "author": {"steamid": "76561198128110813", "num_games_owned": 593, "num_reviews": 24, "playtime_forever": 6794, "playtime_last_two_weeks": 0, "playtime_at_review": 6794, "last_played": 1633270881}, "language": "english", "review": "I used to love this game and play it all day long without getting bored.\nThen they added pve server wipes.\nIf I don't have time to enjoy what I build and my progress; which takes a couple weeks, why even bother playing the game?", "timestamp_created": 1705648110, "timestamp_updated": 1705648110, "voted_up": false, "votes_up": 58, "votes_funny": 1, "weighted_vote_score": "0.817822575569152832", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "116305706": {"recommendationid": "116305706", "author": {"steamid": "76561198031017565", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 22380, "playtime_last_two_weeks": 0, "playtime_at_review": 3128, "last_played": 1655609748}, "language": "english", "review": "This is a PvE review, I am not a PvP player and played on an exclusively PvE server. Very fun game if you like gathering, crafting, building, and hunting unearthly mobs. The tech trees are deep and complex, and the logistics of keeping your power grid up and running while finding new sources of fuel, armor and weaponry are very engaging. The battles are hard, the armor seems weak and you will take a lot of damage just by being touched by mobs, so you spend a lot of time just avoiding them. Aggro radius is wide, so there are no stealthy, sneak up and attack tactics, you just engage or run a lot. \n\nMy wife and I have been playing for about 60 hours now and are just getting into Tier IV (out of V tiers) tech, so we have some way to go still for the \"endgame\". I've read complaints about there being nothing to do in PvE, which is certainly not true, there is plenty if you take it as intended and make your way methodically through the tech tree. Some players do it in a day and then complain that there's nothing left to do, but we've taken our time and enjoyed every minute of the progression, so take those complaints with a grain of salt, unless you're a rusher, too.\n\nThe progression is too fast, the Learning Points (LP) you get for virtually any activity come in way too fast, and you wind up investing in technology that you won't use for a long time. I'd rather enjoy unlocking things after some work, rather than wondering where to spend all my points on things I don't even yet understand. They need to slow down LP generation.\n\nOverall, very fun game and we are enjoying it a lot more than Craftopia (which is where we came from most recently). Highly recommended for those who like what I've described above.", "timestamp_created": 1654031222, "timestamp_updated": 1654031222, "voted_up": true, "votes_up": 36, "votes_funny": 0, "weighted_vote_score": "0.808997213840484619", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "91348295": {"recommendationid": "91348295", "author": {"steamid": "76561198072162222", "num_games_owned": 0, "num_reviews": 44, "playtime_forever": 577, "playtime_last_two_weeks": 0, "playtime_at_review": 567, "last_played": 1620229987}, "language": "english", "review": "Almost 10 hours in, and honestly the game is just tedious and boring. Maps way too small for the amount of players crammed into a map, especially official servers. You might have some fun in a 10 cap server for pvp though, but again the game is just literally a running and gathering simulator for resources. Yes, there are world events, much of which again..is boring and left for higher up players....which again requires a HUGE treadmill of boredom with no purpose outside of getting unlock points to yet unlock more boring material harvesting. Good luck.", "timestamp_created": 1620041773, "timestamp_updated": 1620041773, "voted_up": false, "votes_up": 92, "votes_funny": 6, "weighted_vote_score": "0.791659951210021973", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "50163202": {"recommendationid": "50163202", "author": {"steamid": "76561198250198942", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 9671, "playtime_last_two_weeks": 0, "playtime_at_review": 7312, "last_played": 1627781561}, "language": "english", "review": "well after carefully playing the game and constantly being killed over and over again ill have to go ahead and say that's a big no go from me. they said maybe pve servers will be implimented but i haven't seen anything yet. There's no protection whatsoever from the kids that have legit 24/7 to play this game so if u don't have said 24/7 don't bother u cant compete with roaming bands of assholes. 122 hrs in the game teir 4 tech still can't collect wood without being killed for no other reason but ITS A PVP GAME ONLY!!! first and formost so its to late for me to get my money back but u can still prevent urself the trouble stay away the game is fun but the community is F****ing CANCER!", "timestamp_created": 1555437965, "timestamp_updated": 1555437965, "voted_up": false, "votes_up": 146, "votes_funny": 13, "weighted_vote_score": "0.78729248046875", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1555495692, "developer_response": "Good day.\n\nThank you for your concern, especially considering that you really did experience the game to the fullest (as or now having 122 hours in the game).\n\nSo, I wanted to state that we have just finished implementing newbie protection allowing new players to learn the basics and build their first base on a server without the fear of losing any items or LP. This feature will be available in the upcoming patch in a few days.\n\nWe are also working on a new PvE server that will allow for a much more relaxed gameplay for people who want to focus on the more creative side of the game - learning technologies, exploring the world and so on. This large update is scheduled to release in May. I hope you can give the game another chance and change your review.\n\nPlease also feel free to contact us on the forums and we would be happy to address any of your concerns."}, "75113143": {"recommendationid": "75113143", "author": {"steamid": "76561198027881567", "num_games_owned": 127, "num_reviews": 7, "playtime_forever": 59122, "playtime_last_two_weeks": 0, "playtime_at_review": 48622, "last_played": 1709427954}, "language": "english", "review": "Great game, Great devs, they are really trying hard, \n\nBut stick with PvE if you can. The PvP community is toxic af.", "timestamp_created": 1598711394, "timestamp_updated": 1598711394, "voted_up": true, "votes_up": 55, "votes_funny": 2, "weighted_vote_score": "0.77981865406036377", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "148724821": {"recommendationid": "148724821", "author": {"steamid": "76561198061037193", "num_games_owned": 187, "num_reviews": 42, "playtime_forever": 4253, "playtime_last_two_weeks": 0, "playtime_at_review": 1191, "last_played": 1704127574}, "language": "english", "review": "RimWorld. But you control 1 pawn", "timestamp_created": 1698051646, "timestamp_updated": 1698051646, "voted_up": true, "votes_up": 53, "votes_funny": 7, "weighted_vote_score": "0.778127670288085938", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "139576667": {"recommendationid": "139576667", "author": {"steamid": "76561198075095336", "num_games_owned": 302, "num_reviews": 7, "playtime_forever": 2615, "playtime_last_two_weeks": 0, "playtime_at_review": 1138, "last_played": 1686281401}, "language": "english", "review": "The game is kind of a hidden gem for sure, but it feels like an unfinished game, you know?\n\nI will name a few things that seem to be missing.\n\n1: The vehicles only have 2 types of flying board and 2 types of giant robots. In which the robots have a storage system for you to explore and store resources, after all the map is quite large. But where is a slightly larger variety of vehicles? For example, a motorcycle, car, among others that would fit the theme very well.\n\n2: A simple item rotation system. Too bad not being able to simply turn an item, workbench, furnace, anything you want, to some different position for the aesthetics of your construction to be optimal.\n\n3: Lacks a bit of variety in enemies across the map. With such a big map, it could have more diversity. There are about 20 monsters or so and everything else is almost a copy with a slightly different design or a different color. Almost everyone has the same play, they run after you and you shoot them during the run.\n\n4: The defense against projectiles that equipment gives is not as useful in PvE, it seems that it was made almost exclusively for PvP, which is kind of frustrating, since many players only play PvE with few players. It should for example have some humanoid monsters with equipment and weapons and so on.\n\n5: There are no caves, dungeons or anything remotely similar to that. Kinda bland, since any game of the same theme has these aspects.\n\n6: Some systems do not make much sense, such as equipment repair. It could be from another method, like for example to repair a piece of equipment you need to use half the resources you would use to create a new one or something like that.\n\n7: Equipment and items in general break very easily. For example, a specific weapon that every 2 shots loses 1% of durability, that is, with 200 shots the weapon breaks and you need to make a new one completely from scratch. You farm a lot to make a weapon that will be broken in 1 or 2 days hunting something and then you will have to farm again to make the same weapon again.\n\nI could number other things that make it seem like they haven't been inserted yet, making the game seem unfinished, however, when asking in some forum or social network about the game, if it's abandoned and without updates or when things like that will be implemented, the developers rudely say something like \"Why would I need to insert something? I disagree with you, the game is certainly complete and nothing is missing, that's why it was released. We will not make any updates, because it is a finished game \"\n\nTLDR\nThe game is worth the price and will give you a good time of fun, but with the \"problems\" of which I spoke among other problems that will be discovered with time by you, they will make you very frustrated.\nA lot of potential wasted on this great game, due to a company and developers that don't give a shit about the game.", "timestamp_created": 1685942814, "timestamp_updated": 1685942814, "voted_up": false, "votes_up": 63, "votes_funny": 1, "weighted_vote_score": "0.777047693729400635", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "138477800": {"recommendationid": "138477800", "author": {"steamid": "76561198119689228", "num_games_owned": 356, "num_reviews": 106, "playtime_forever": 4254, "playtime_last_two_weeks": 0, "playtime_at_review": 4254, "last_played": 1684401047}, "language": "english", "review": "I recommend the game for the singleplayer experience.\nIt's waaaay too grindy so I recommend you max out all the rates when creating the local game/server and even still you might have to use the console like I did.\nIt's a fun experience and there's an ending. I didn't try multiplayer pvp but I still got 70 hours of fun out of it.", "timestamp_created": 1684401233, "timestamp_updated": 1684401233, "voted_up": true, "votes_up": 32, "votes_funny": 1, "weighted_vote_score": "0.774941921234130859", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "102789444": {"recommendationid": "102789444", "author": {"steamid": "76561198355655195", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 414, "playtime_last_two_weeks": 0, "playtime_at_review": 414, "last_played": 1636667784}, "language": "english", "review": "I have absolutely nothing against grind-heavy games, but this game requires a lot of grinding and then all of the sudden, when you have grinded enough, the server gets wiped and you gotta start from the beginning again.\n\nThis game has the feeling of a mobile game. That is the way I felt about it anyway. I liked the arts and the graphics but the game was generally boring for me.\n\nI expected similar vibes to Rimworld but, unfortunately, it wasn't the case with CryoFall. It was a very generic and mobile-games-like experience which I didn't appreciate to be honest.", "timestamp_created": 1636918666, "timestamp_updated": 1639261255, "voted_up": false, "votes_up": 70, "votes_funny": 2, "weighted_vote_score": "0.773721396923065186", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "91331521": {"recommendationid": "91331521", "author": {"steamid": "76561197961454485", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 112, "playtime_last_two_weeks": 0, "playtime_at_review": 112, "last_played": 1619989660}, "language": "english", "review": "I really want to like Cryofall. Unfortunately when I tried it out for a couple hours, I had several issues:\n\n* The servers have a ton of people for a fairly small map\n* The servers lagged for me\n* Setting up my own server was fine, but then I found out: this game is basically just for PvP - PvE has very little going on\n* After playing for about 10-15min, consistently, my game went to 5fps and got stuck there, requiring restarting it\n\nThe developers are active on their Discord and friendly, and the game has great graphics (Steam screenshots don't do it justice).\n\nThe foundations seem great, but I don't want to play another game where you win by playing the most hours, getting raided by groups of Chinese people.", "timestamp_created": 1620013281, "timestamp_updated": 1620013281, "voted_up": false, "votes_up": 230, "votes_funny": 19, "weighted_vote_score": "0.772488534450531006", "comment_count": 18, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1620212558, "developer_response": "Just wanted to reply and clarify some of the points you raised and hopefully help a bit.\n\n> The servers have a ton of people for a fairly small map\nThe map is actually quite balanced for the usual number of server slots (~200), but since the game just launched there is also a large number of demo players. It will go back to normal when launch hype calms down a bit.\n\n> The servers lagged for me\nWe use absolutely best hardware available in each region and have direct line of communication with the data centers to ensure that not only server performance is top notch, but routing to various destinations as well. So, I'm afraid it might be your connection. For example, if you are using wi-fi it might introduce unnecessary jitter and ping fluctuations. If you'd like - we can help you troubleshoot the connection to be able to tell for a fact where the lag is introduced on the route between you and the server.\n\n> this game is basically just for PvP - PvE has very little going on\nCurrently more than 80% of our playerbase is PvE players. And this number have been growing since the game was released in the Early Access two years ago. So, since people prefer this game mode over PvP we have been focusing mostly on adding content on PvE to benefit the most players. There is a lot of things you can do already and even more is planned.\n\n> After playing for about 10-15min, consistently, my game went to 5fps and got stuck there, requiring restarting it\nYes, this issues was reported by a few other players and as it turned out it was related to incorrect GPU driver settings. It can be easily addressed by changing a few options in the driver menu.\n\nFinally, I would like to say we could actually help you with most of what you mentioned above, so please don't hesitate and get in touch with us - we are always ready to help!"}, "156277727": {"recommendationid": "156277727", "author": {"steamid": "76561198022866997", "num_games_owned": 0, "num_reviews": 217, "playtime_forever": 1308, "playtime_last_two_weeks": 0, "playtime_at_review": 1308, "last_played": 1640298223}, "language": "english", "review": "It IS one of those games where you can spend 20-30 hours on it, but never finish it.  You will mostly enjoy that time, and then the veneer will slowly start to fade as you see shinier, better games to play.\n\nIs it bad - no.\n\nIt it great - again, no.\n\nIs it worth $4 on sale - definitely.", "timestamp_created": 1705645031, "timestamp_updated": 1705645031, "voted_up": true, "votes_up": 25, "votes_funny": 2, "weighted_vote_score": "0.768196940422058105", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "93850047": {"recommendationid": "93850047", "author": {"steamid": "76561197970532175", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 6312, "playtime_last_two_weeks": 0, "playtime_at_review": 4034, "last_played": 1633786229}, "language": "english", "review": "An enjoyable game, but there are some pretty severe balance issues.\n\nRight off, it needs to be stressed that this is a multiplayer game, \"experimental local server\" aside.  I played purely PvE; I have no need to join a server just to spend my leisure time with preteens mispelling racial slurs.  Other reviewers have touched on the toxic PvP playerbase.\n\nThe game is very grindy at the mid-to-end tiers.  You will spend almost every moment farming resources to repair your equipment, which degrades at a phenomenal rate.\n\nBecause the game is aimed at PvP, there's really no \"base-building\" in the way you might think of.  You're limited in scope, because the map is (relatively) small and there needs to be room for other players.  You can build (optional) walls, and set up your resource farming equipment inside, but really that's about it.\n\nThe biggest downside is the \"decay\"... a mechanic put in obviously to free up land for other players.  It makes sense to a degree, but it means that there's no setting down roots.  If you take a week off to play another game your base will be gone when you come back.  So why would you come back?  And that directly leads to:\n\nSmall player base.  The server I'm on is a ghost town.  There are TOO MANY servers, and the players are spread across all of them, PvE and PvP.\n\nThe map needs to be a LOT bigger, and there needs to be fewer servers so that more people can co-exist, hopefully with a lowered decay rate.\n\nI realize this review is fairly critical, but at the same time I don't want to \"not\" recommend the game.  I wish Steam had a \"Meh\" option.  :)\n", "timestamp_created": 1623846581, "timestamp_updated": 1623846581, "voted_up": true, "votes_up": 28, "votes_funny": 2, "weighted_vote_score": "0.763627886772155762", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "91276550": {"recommendationid": "91276550", "author": {"steamid": "76561198250736630", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 1019, "playtime_last_two_weeks": 0, "playtime_at_review": 134, "last_played": 1620544651}, "language": "english", "review": "This review is just for people playing single or play with a friend. I do not have much experience with the broader MMO servers. See tips below for setting up your own private server.\n\nEdit...As the game has progressed, I'm going to amend my review a bit. Have I gotten 15 hours of enjoyment for $13? Yes. Is this a great game though? No.\nOne of the things you'll start to realize is that the lack of automation makes it painful if you're playing by yourself or just with a friend. Unless you cheat in materials you'll find the inordinate amount of time you'll spend just trying to make plastic (dump canisters in, move them to the refinery etc) and especially making bullets and guns becomes a downright chore. There's no easy repair system either (you can kind of tinker two almost broken things together to get a little more life, but it's still a significant chore).\n\nThis game seems to be designed for specialization to an extent (someone makes food, someone farms ore etc) and you buy the other things people are making. That's at least how I can see this game working. Someone is a dedicated plastic man who sells plastic, someone else makes bullets etc. this model doesn't work if you're playing by yourself though.\n\nFor setting up a multiplayer server it takes a few minutes.\nI'm playing on an old i5 4th gen processor and a 1660ti. Even running the server with a friend did not have a meaningful impact on the game performance.\n\nFirst, go here: https://wiki.atomictorch.com/CryoFall/Server/Setup and it has the instructions as well as a link to the standalone server software.\n\nA few extra things you'll need to know ahead of time to self-host:\n1) for windows, you'll need to download .Net 5.0. You can get that here: https://dotnet.microsoft.com/download/dotnet/5.0 and on the right side will be the desktop runtime (don't bother downloading with the SDK)\n2) you'll need to know your external ip address (you can google \"What's my IP address\" and it will tell you). That's the ip address of your modem/router that faces the internet. This is the address that your friend will type in to connect to you.\n3) you'll need to know your computer's internal ip address (the ip address that your computer actually has on your internal network. You can find that out by opening a command prompt and typing ipconfig)\n4) you'll need some familiarity with configuring your router if you have one (the ip address to configure it is usually 192.168.1.1 or 192.168.0.1 type those into your web browser and you'll need to log in and look in the Advanced menu and read about \"port forwarding\". Basically port forwarding is how when someone connects to your outside ip address, your router knows to send it to your computer on the internal network. You'll forward UDP 6000 to your computer's ip address you got from the ipconfig command.\n5) follow the instructions on the website\n6) profit!\n\nYou don't need a computer science degree to set it up but you will have to read a bit to get things going  ¯\\_(ツ)_/¯\n\nSo yeah, you may have to learn about your router, and your two different ip addresses (if you've got a local router which most people likely do). and a little bit of console commands to start a dotnet 5.0 server.", "timestamp_created": 1619941525, "timestamp_updated": 1620547811, "voted_up": true, "votes_up": 32, "votes_funny": 0, "weighted_vote_score": "0.752672910690307617", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "93650411": {"recommendationid": "93650411", "author": {"steamid": "76561198184467346", "num_games_owned": 213, "num_reviews": 2, "playtime_forever": 8240, "playtime_last_two_weeks": 0, "playtime_at_review": 7463, "last_played": 1624050402}, "language": "english", "review": "This may come across toxic but will be the most useful review you will need to read before buying this game. Me and my teammate joined the Cryosmall EU duo server. As of right now we are the number one faction on the server and have sunk 110 hours past two weeks into the game already. (More like under a week) This game requires a stupid amount of time and has so many issues. I hope the developers read this and fix the issues.\n\nFirst issue is the game itself is dead. Player base is low because of how long the game is. The wipe on this server is  a month. New players do not have much choice in what to join or what day the wipe is at. If you do not have a lot of time and a consistent team do not play this game. The game is flawed in a lot of ways from the sheer amount of mats grinding you have to do. We are playing on a 2.5x gather rate server and I cannot imagine it without. The game runs on Tiers 1-5 after a wipe has happened which unlock over a week period. \n\nTier 1 - Pretty Degen but easy enough and simple.\nTier 2 - The best part of the game with not a lot to do but better combat and overall a lot more fun.\nTier 3 - Gets a little more grindy but still is not the worst. You have to start doing a lot more here but it’s fairly competitive after the fact that combat now lasts under 10 seconds if you are against more than 1. \nTier 4 - This is where we are at now. And it is pure cancer. The game makes you do a million things here. Which cost way too many materials and is too long to achieve. \nTier 5 - No clue but probably fucked.\n\nDo not play this game in its current state. It is not newbie friendly and even with 200-man hours into the game this week we are still struggling to do much. Raiding is broken as the cost of making bombs to raiding bunker design bases causes it to be too costly and unraidable. The material crafting needs so much more balancing as all of  a sudden one item becomes obsolete and the next becomes needed in every recipe. In this state no one should purchase or buy this game. It becomes very shit quick and requires you to spend 10/h plus a day to achieve anything. Many game issues including glitches with shields and walls and a lot of unregistering hits on certain objects such as players etc. The game also has the highest mob density out of anything I have ever seen. You will consistently be attacked. \n\nDo not buy this game :)\n\n", "timestamp_created": 1623541174, "timestamp_updated": 1623541174, "voted_up": false, "votes_up": 49, "votes_funny": 3, "weighted_vote_score": "0.749560415744781494", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "66291617": {"recommendationid": "66291617", "author": {"steamid": "76561198126314642", "num_games_owned": 91, "num_reviews": 7, "playtime_forever": 3939, "playtime_last_two_weeks": 0, "playtime_at_review": 3898, "last_played": 1588126689}, "language": "english", "review": "As much as i like this game, and the grind that comes with it. i simply can't recommend it.\n  it is indeed a lot of fun but after weeks of gathering resources and building, those that play it 24/7 simply drop in raid everything and blow you out of the water. either online or offline. raiding can make the grind a little quicker by farming other players if you are smart. but since I've purchased the game its been nothing but grind for weeks and than lose everything in a matter of minutes. Server wipe's happen on each server from time to time, which is a world reset.everyone starts over. in a matter of 12 hours of a server wipe, some players were at a tier 4 tech level. Most people just don't have the time to compete with this, as such it becomes game breaking. Yes the game is in early access and they have done a fine job with this game. For myself in personal opinion, they need some sort of time limit to servers. those of us that only have a few hours a day can enjoy a server that has a 2 hour/day you can play on the server. others that have all day to play can play on a unlimited time on a different server. they have to implement something to separate these different types of players cause other than that it becomes a gamebreaker. \n\n  However this is indeed a fantastic game\n", "timestamp_created": 1585692807, "timestamp_updated": 1585692807, "voted_up": false, "votes_up": 51, "votes_funny": 2, "weighted_vote_score": "0.748263359069824219", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "68466817": {"recommendationid": "68466817", "author": {"steamid": "76561197967203702", "num_games_owned": 0, "num_reviews": 99, "playtime_forever": 1364, "playtime_last_two_weeks": 0, "playtime_at_review": 665, "last_played": 1602430760}, "language": "english", "review": "Well I had got so bored with survival games. Played most of them. Sick of zombies and I am not a big pvp fan.  So this was on free weekend and checked out. I mean it doesn't look anything special I though, quite basic looking. I booted it up and was up till 3am. It is a beautiful game and I am on a pve server. I find the people very helpful. I am used to survival games to have with the excellent tutorial managed totally fine to my 11 hrs so far. I run this on the highest setting on a 27 inch gaming monitor. It looks lovely and so smooth too. I love all the animations and fresh art style. I found there is so much going on here and you can really develop your base and character. You can group up too if you like but I have gone solo for now as I learn better that way. There is cooking , hunting , farming, crafting of all kinds and so much more. I can't praise this little gem enough. Oh and I have even got this running on my old i3 laptop, as it's on steam cloud. So I can hop on if I am cooking or downstairs or even to mobile with it. Handy if I was on holiday.  May even boost my holiday experience  you never know. So all in all a true classic survival game which I have fallen in love with. And highly recommend. I found a more mature player base on the servers I was on which I liked. And the science fiction theme is fantastic. Great job Dev.", "timestamp_created": 1588472334, "timestamp_updated": 1588472334, "voted_up": true, "votes_up": 25, "votes_funny": 0, "weighted_vote_score": "0.748148560523986816", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "137199156": {"recommendationid": "137199156", "author": {"steamid": "76561198159295113", "num_games_owned": 0, "num_reviews": 38, "playtime_forever": 71, "playtime_last_two_weeks": 0, "playtime_at_review": 71, "last_played": 1682285959}, "language": "english", "review": "After 71min of trying to figure out how to play this game with my significant other we came to the conclusion that non of us can play online co-op as stated in the tags unless we play with a group of other 30+ or PAY for a private server that will cost between 4usd to 12usd for a couple of months, to be honest I was looking forward to playing this game but after having to go thru mental gymnastics trying to figure out how to play ONLINE CO-OP I am trully put off the game and honestly think that this game shouldn't really claim to be such if I have to go thru I whole mental torture just to play with one more person. Honetly if whoever is reading this is up to the task go ahead and make a dedicated server or just trying to play on your own then I guess this game is for you. But if you are looking for something less complicated then this game is not for you. Like I said very displeased and honestly annoyed by the waste of time.", "timestamp_created": 1682287958, "timestamp_updated": 1682288436, "voted_up": false, "votes_up": 87, "votes_funny": 9, "weighted_vote_score": "0.746035337448120117", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "102402237": {"recommendationid": "102402237", "author": {"steamid": "76561198020480068", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 1665, "playtime_last_two_weeks": 0, "playtime_at_review": 328, "last_played": 1638020947}, "language": "english", "review": "I tried this game only as single player but it can be summarized as a not fun resource grinding game which is not fun at all, go back and forth from main base to mine iron and copper (which is the main res bottleneck)  mainly and some other secondary resources, endless waiting time to get materials you got smelted and no way to smelt it faster, it got boring pretty fast, no way to automatize basic resource gathering which is fun early game but become really annoying mid-late game,\nI am waiting for a resource gathering improvement for late game because this grinding is not fun at all.", "timestamp_created": 1636313319, "timestamp_updated": 1636313319, "voted_up": false, "votes_up": 71, "votes_funny": 4, "weighted_vote_score": "0.744593918323516846", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "64390867": {"recommendationid": "64390867", "author": {"steamid": "76561197981085812", "num_games_owned": 0, "num_reviews": 29, "playtime_forever": 8, "playtime_last_two_weeks": 0, "playtime_at_review": 8, "last_played": 1583121503}, "language": "english", "review": "As a solo adult player I don't have a reliable schedule to play these types of games on official servers. Fortunately, almost every single one of them provides a feature to host your own game server at the click of a button. \n\nThis game does not. \n\nI'll come back when, if ever, it does. Until then I can only recommend this game to people with time and who are tired of their other multiplayer survival games.", "timestamp_created": 1583122226, "timestamp_updated": 1583122226, "voted_up": false, "votes_up": 81, "votes_funny": 0, "weighted_vote_score": "0.738077044486999512", "comment_count": 15, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1583147484, "developer_response": "Actually you can easily host your own private server. There are also a number of community and modded servers with different game rules which might be just what you are looking for. For example with no buildings decay.\n\nBut if you want to host your own server - you can simply follow this guide:\nhttps://steamcommunity.com/app/829590/discussions/5/1675812484358985235/"}, "50076766": {"recommendationid": "50076766", "author": {"steamid": "76561198030914925", "num_games_owned": 101, "num_reviews": 8, "playtime_forever": 92475, "playtime_last_two_weeks": 0, "playtime_at_review": 3608, "last_played": 1705055236}, "language": "english", "review": "Have you ever fallen for someone or something that you thought initially was totally wrong for you? As a gamer for decades, someone who hates PVP, has never killed another player (well, there was that one time years ago, but it was dark and I swear he stepped out in front of my buggy) and doesn't like 2D games, I bought CryoFall last week out of desperation. I had spent a lot of money recently on games I thought I WOULD like, only to find that I didn't.\nEvery few years a game comes along that can change players perceptions. CryoFall has the potential to bridge that huge divide between the hardcore PVPers and the Carebear PVEers like myself. The mistake some players are making is to expect a PVE experience on the Official servers. That will not happen, at least until the PVE Official servers are launched, but all you need to do is to join a Community Server. Check the rules of the server and see what suits you best. For example, I play on a server where griefing and KoS are not tolerated, and raiding is not permitted. What that means is that an old guy like me can play in peace, not having to look over his shoulder all the time, and not worrying that the next time I log in my base will have been raided. In short, I can enjoy one of the best games I have played for years. It reminds me of  2D Grav, or Empryion. PVPers describe it as \"2D Rust, without the hacking\". I just describe it as something I thoroughly enjoy.\nThe game was conceived, designed and produced as a PVP game. This doesn't mean us PVEers can't enjoy it. It just means that we have to find the right server. Now, I'm getting back to mine...", "timestamp_created": 1554985260, "timestamp_updated": 1555138786, "voted_up": true, "votes_up": 34, "votes_funny": 5, "weighted_vote_score": "0.736339747905731201", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "86406139": {"recommendationid": "86406139", "author": {"steamid": "76561198154951837", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 37094, "playtime_last_two_weeks": 0, "playtime_at_review": 25390, "last_played": 1710294487}, "language": "english", "review": "Tryhards made me quit. \n\nReally enjoyed the game, but my neighbor keeps on focusing on my base (solo server)\nHe looks like a veteran, he just NEVER dies on pvp, deffending or attacking\n (yep, I am using all the buffs like salads, tobacco, heals etc).\n\nHe is even placing a bomb every 10 mins, so I can't lock my base and close the game (lol)\n\nDue to the fact that it is still a small community, players mainly short on vetterans and begginers. When begginers join, they usually got undertaken from the old guys, until they give up and be replaced from another newbies.\n\nwell, that's my story. Otherwise, you should give a go, It's a good game, kinda hard.", "timestamp_created": 1613058816, "timestamp_updated": 1613058816, "voted_up": true, "votes_up": 59, "votes_funny": 4, "weighted_vote_score": "0.728846192359924316", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "55742751": {"recommendationid": "55742751", "author": {"steamid": "76561198071288299", "num_games_owned": 68, "num_reviews": 2, "playtime_forever": 7863, "playtime_last_two_weeks": 0, "playtime_at_review": 7703, "last_played": 1572017078}, "language": "english", "review": "Alright, I nolife'd this game, so you can trust me.\n\nPros:\n\n- All mats are useful, which is great. Grind whatever you want.\n\n- Skill leveling system, while grindy, is the absolute best thing this game has going for it.\n\n- Building feels like you're accomplishing something, but be aware you can't rotate where you place things i.e. chests. Sounds like it won't annoy you, but it will. Trust me.\n\n- Radiation zones are fun, raiding is fun.\n\n- Game has a ton of potential if they make the necessary adjustments.\n\nCons:\n\n- The number one problem with this game is the imbalance in grind for reward. You can grind the worst grind to raid someone (modern bombs), use tons of hours/days/weeks of mats to get into the most well defended base, and get absolutely nothing important out of it because everyone can hide their most important items (gear, weapons, bombs) in their land claim on their property. Even if you use a ton of bombs to blow up this land claim, you don't get the contents. Also, the land claim doesn't even get destroyed immediately, I think it takes like 36 hours or something. Makes raiding absolutely not worth the grind. \n\nI think the developers justify this by saying you can't store crafting mats in your land claim, but that doesn't matter. I'd rather grind the mats myself than pour everything into bombs and not be able to get endgame gear for it. Where is the incentive? This game needs PVP to keep people around, and I think this is what makes most players realize once you're at the very end game..there is no point. Until the land claim system is adjusted, I don't think I can recommend this game.\n\n- EXTREMELY grindy. I don't know if you've noticed how many times i've said grind yet. Luckily for me, i'm used to grinding Korean mmos, but playing this game on a standard server is just not worth it. CryoSmall is probably the saving grace of this game, play on that server for 2x loot/learning points and at least SOME other players/activity (although you will feel alone most of the time).\n\n- Normal official servers have a raid window, which means if you play on degenerate gamer hours (aka, late nights/early mornings), you cannot raid after midnight PST (at least on the official America server). However, you can start it right before the raid window closes and keep it open into the night as long as you smack a wall/the land claim/etc once every 10ish minutes.\n\n- Ping is really annoying to deal with, and considering how few people play this, your best ping server can be absolutely dead with no reason to play.\n\n- Animal/mob AI is lacking and easy to just kite creatures into walls/trees. Things stay in the same place. The game doesn't feel \"alive\" because of this.\n\n- Rocks/trees/plants/etc will eat bullets when trying to shoot things. Mildly annoying when killing animals, absolutely infuriating when trying to kill another player.\n\n- Map is the same every time. If you play on a server that wipes frequently, everyone already knows the best spots to live on and could progress faster than a first time player.", "timestamp_created": 1571915054, "timestamp_updated": 1571915054, "voted_up": false, "votes_up": 65, "votes_funny": 9, "weighted_vote_score": "0.726166009902954102", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "120728291": {"recommendationid": "120728291", "author": {"steamid": "76561197962264417", "num_games_owned": 0, "num_reviews": 90, "playtime_forever": 2057, "playtime_last_two_weeks": 0, "playtime_at_review": 2055, "last_played": 1660776405}, "language": "english", "review": "I tried, I really did, which annoys me as on paper this game should be amazing. This is a game with some excellent systems in place but finding itself heavily wrapped in a failed execution. The game looks good with a nice art style though. Unfortunately this doesn't make up for how boring it is. I'm a fan of grind games when done well, but this is just grind for grinds sake. The PvP server is slightly better in this regard in that it's sped up 5x, which really should be the normal pace to stop so many people quitting so fast.\n\nI'll summarise this game in an easy analogy. This game has fishing. The fishing it has is the same as early 2000's WoW fishing. You click, you stare blankly for 10 seconds, you click. Despite there being a million better fishing systems since then, this is what they went for. I also don't get why the fishing splash is almost inaudible at 100% being just barely able to hear the splash, any notification from the rest of my system wakes my neighbours up 2 doors down and YT can't go any lower and still too loud?! Expand this fishing issue to everything else in the game and you understand what this game is, not good. So much so I don't even think a huge amount of Mods can resolve it. This game IS the fishing.\n\nWeapons are boring. The crafting is the ultra dull type crafting, hold click to gather, click to craft, this covers most of the game. The amount of time you'll spend slowly trudging through the world is ridiculous to start until you get the hoverboard. Getting that pragmium solo will see you die many, many times, and have to corpse run for 20+ minutes each time, I'm sure some people find holding Shift+Direction for that long fun, but sadly that's not me. AI is the worst and doesn't even have path finding, getting stuck on anything in a straight line to you?!\n\nNow, for the good systems in the skills and research, there's a load of rubbish. I eat some tomatoes and become nauseous for 5 mins?! Same with any fruit or veg. Now I need anti nausea meds which are just tedious to gather and craft for when you just want some raw fruit and veg. I don't remember the last time I got ill from a few tomatoes, or anyone for that matter so this just seems broken to me. Also if I'm out hunting and used \"too many\" meds - 4 - barely enough to fill HP back up I get medicine sick leaving me trapped in the middle of a volcano stuck between invisible heat walls for 10 minutes unable to heal hoping that mobs don't respawn as I can't move (I really don't want another corpse run at this point...). Really fun design here. I found night time is so frequent it feels like it's almost always night as it's so annoying to always need batteries or oil for, another thing you need to constantly grind. The craft system is very \"cool\", but actually working inside of it means a ridiculous amount of grinding materials and tiers upon tiers of crafting. Any other game that does this has some type of automation, but not here. Again, all of which is about as boring as watching a wall.\n\nThe ONLY reason you should get this game is if you enjoy pointless grinding that gets frequently wiped. Even then, there are many things you should play before this.", "timestamp_created": 1660656332, "timestamp_updated": 1660758728, "voted_up": false, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.725714504718780518", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "76213116": {"recommendationid": "76213116", "author": {"steamid": "76561198096833079", "num_games_owned": 0, "num_reviews": 32, "playtime_forever": 12753, "playtime_last_two_weeks": 0, "playtime_at_review": 3470, "last_played": 1674428863}, "language": "english", "review": "I honestly love this game. It strikes the perfect balance between PvP/raiding games such as Rust and resource management games like Factorio. \n\nMy biggest gripe with raid/clan based games (*cough* Rust) is the fact that you can log off and when you get back on, everything is almost always gone. Offline raiding is nearly impossible in this game due to the \"S.H.I.E.L.D.\" function, which makes your base unraidable but simultaneously unusable for when you're offline. Raids are forced to occur when at least one member of the defenders is online (or nobody in the defenders has been online in ~2 days), which creates a wonderful raiding experience. You never feel robbed in defeat, because you did the best you could, and weren't simply absent. Your base is still probably usable as it is extremely expensive and pointless to destroy machinery, and most of your direct value comes from said machinery. \n\nThe progression feels solid, and while I believe it could use a little bit of a speed boost on the grind, it is mostly enjoyable. Ammunition is a bit expensive, and I honestly believe you should get about 50% more ammo from the resources it currently takes. I haven't been able to experience too much combat, but from what I've seen it feels fun, and being lower in tech level doesn't necessarily mean you can't win in a fight (although I can't recommend taking on a Behemoth mech with a crossbow...). People are generally not toxic, and asking for advice, even on the cutthroat PvP servers, you'll almost always get an answer.\n\nThe game is being developed very consistently, and the devs appear to be quite open to ideas and suggestions. Many features from the most recent update are ones that make the game significantly more fun and accessible.\n\nWhat I'm basically trying to say is that this game has a surprisingly small playerbase for how good it is, and it's absolutely worth giving a try during the free demo. 8 hours of time is plenty to decide if you want to buy the game, which I did so at around hour 6.", "timestamp_created": 1600505098, "timestamp_updated": 1600505098, "voted_up": true, "votes_up": 22, "votes_funny": 0, "weighted_vote_score": "0.724047601222991943", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "84176713": {"recommendationid": "84176713", "author": {"steamid": "76561198085146539", "num_games_owned": 342, "num_reviews": 11, "playtime_forever": 484, "playtime_last_two_weeks": 0, "playtime_at_review": 285, "last_played": 1626230612}, "language": "english", "review": "Edit: They added single player, thank you.\n\nGreat game, but no solo play / single player built in. You can host your own if you feel like running one off your PC (tedious and should be a built-in feature). Decay timers are set for people who only log out to sleep.\n\nGreat idea, terrible execution.", "timestamp_created": 1609966736, "timestamp_updated": 1634692412, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.723202884197235107", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "78970222": {"recommendationid": "78970222", "author": {"steamid": "76561198016308435", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 1332, "playtime_last_two_weeks": 0, "playtime_at_review": 593, "last_played": 1605134877}, "language": "english", "review": "I really wanted to give this game a good review and the decision was very close to being a 'Yes' but sadly I cannot.  The game is very sterotypically German which means balance comes at the price of fun or \"casual play\" which rightfully should be the target market of any game which isn't labeled as hardcore. Trying to find that middleground without the use of difficulty settings is a relatively popular trap in which these type of games fall into and I fear Cryofall has done just that. Also, like many German games, the storyline is non-existent giving it a score of 0 for creativity. \n\nThe demo and current price of ~£5 make this game a pretty big steal. In the time of 8 hours of demo you are going to experience some really good, albeit slightly grindy, gameplay which will probably make you want to buy the game before the demo time is over. If my review was solely based on that area of gameplay this was a pretty good. After that period though the game really falls off around the area of Tier 3 technologies. \n\nThe tier 3 tech and beyond feels like jumping off a cliff in terms of convoluted design comprising of several \"incorrect\" choices of technologies to research at the very point where your your gain of 'Learning points' (currency required to purchase new tech) goes from too much to too few. Up until this point there was a semi-structured tutorial which led you to explore the map and point you towards techs and making you feel like you should just unlock everything. This is suddenly met with a collosal ramp up in quest difficulty requiring you to get a radiation suit in the Tier 3 tech tree. Problem is techs are getting gradually more expensive as you climb the tech trees and now techs require other techs in order to be researched. \n\nAs a new player I can't help but feel I met this moment with a big sigh as I embarked on what ending up being a further 4 hours of mindless grinding/crafting to get this LP and spend it tech trees I had no immediate interest in to get this single technology to do a quest in what still feels like the tutorial. \n\nRight now there are simply far too many things stopping you from learning the game because if you go down a wrong path of tech you are punished massively for it, as LP takes time to acquire....a LOT of time. I have yet to mention that the servers are wiped with every major patch so your incentive to farm out all of these things right now should or is 0 as every hour you put into farming materials or LP, without learning anything new I might add, will simply be erased.  \n\nLastly it leads me to the decay system. Probably the most obtuse system there is and absolutely should not exist on PvE servers on such a low timer of 16 hours. I simply cannot agree to a system in which I am punished for not logging into the game. It completely removes any chance of the game being casual-friendly which is, and should be the target of any non-purposefully hardcore or elite game. I understand I can make my own server or play on a privately ran server with that option disabled but..really? There's nowhere near enough active players for this to even come into existence. It's purely a remedy to a problem that doesn't exist. The timer should be at the very least 3-5 days or just have a \"delete my base and let me start over\" button.\n\nAll this to say I will still actively play the game but, it falls short of a game I could recommend for play past the 8hr demo.", "timestamp_created": 1604878152, "timestamp_updated": 1604878152, "voted_up": false, "votes_up": 33, "votes_funny": 7, "weighted_vote_score": "0.71617591381072998", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "92251630": {"recommendationid": "92251630", "author": {"steamid": "76561198033148519", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 1000, "playtime_last_two_weeks": 0, "playtime_at_review": 1000, "last_played": 1621423185}, "language": "english", "review": "too grindy for single player", "timestamp_created": 1621424141, "timestamp_updated": 1621424141, "voted_up": false, "votes_up": 36, "votes_funny": 3, "weighted_vote_score": "0.715158343315124512", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "50316361": {"recommendationid": "50316361", "author": {"steamid": "76561197963611058", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 6236, "playtime_last_two_weeks": 0, "playtime_at_review": 6116, "last_played": 1595012763}, "language": "english", "review": "It has great potential but at the current version after unlocking Tier 3 Techs it becomes a massive grind. And as other PVP-Games, when you are not capable of playing several hours a day you won't get very far. I know that there is an PVE-Update in making but pure PVE seems a lot more tedious/boring, because the PVE aspect isn't that great (hacking trees, mining stones, looting radtowns - repeat)\n\nPros:\n- unique 2d pvp game and artstyle\n- the first two levels of tech tier (atm max is tier 4) are rewarding and fine to progess\n- plays fluid and for early access enough content\n\nCons:\n- at tier tech 3 the learning-point system shows it flaws (just stay around your base and farm lp, because on death you will only retain a small portion of the aquired points). So essentially if you need to unlock t3/t4 techs you need 250/500 LP and will only retain 50-100lp on death. So you won't venture far outside because of the fear of loosing hours of lp grind.\n- toxic raid mechanics - if you get raided you will probably loose everything. Some small \"safe\" storage in the claim blocks can't be raided but that barely helps for a player who can't play 24/7. \n- ressource blocking of other people groups and camping essential loot areas (radtowns)\n- less skill needed only the bigger gun, armor or more people \n- many players that come from rust and so the community starting to get toxic fast\n- highlevel groups get bored eventually and will bomb/raid/grief others just 4 fun\n- dummy techs that unlock nothing but a small text that you can advance further into the research tree\n\nIf you have the time and like hours of tedious grinding? Go get it. If you don't like mp Ark, Rust or general \"if you get raided you loose almost everything - stay away from it.", "timestamp_created": 1556200270, "timestamp_updated": 1556200270, "voted_up": false, "votes_up": 28, "votes_funny": 1, "weighted_vote_score": "0.713479697704315186", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1558520551, "developer_response": "Now that the first update is out and the second update is completed and scheduled to be released at the end of May I wanted to address the points you mentioned in the cons section as I believe we were able to fix all of that.\n\n- We have completely changed the balance of technology progression. We increased base value of retained LP (after death) as well as increasing the total value, but more importantly we removed ALL empty technology nodes making progression in the game much faster.\n- Raiding has been completely changed. Basically all of the rules have been rewritten from scratch. There is now raiding window to encourage online raiding, there is less space to store items inside land claims, chests are unlocked by default and bombs damage is restored. On there other hand there is now also newbie protection to make it easier to start on already populated server and build your first base. But the biggest change is separation of PvP and PvE. These are now completely separated and players can choose which type of servers to join.\n- Resource blocking has also been changed. Now there is contesting mechanic to ensure that there is actual competition rather than claiming resources based on pure luck. Plus other ways to gain access to oil and lithium have been rebalanced to make them more viable.\n- Regarding the community in general, I would disagree, but even then - there are also amazing community servers that people can join. Some have regular events and many are heavily moderated to ensure positive atmosphere.\n- End game has also been balanced to encourage advanced players to attack players at their own level or above. There is now simply zero reason to attack new players. Plus even the most advanced players can't get too relaxed or they will immediately lose their dominant position thanks to the new PvP balance.\n- And finally the empty tech nodes - as I mentioned before we were able to completely remove them!\n\nYou can find the list of updates in the \"news\" section of CryoFall here and also, please just wait a little bit until the May update is released too. It should be a complete game changer! There are literally 6 pages of changes and improvements :)\n\nUPD. We've released a new update on May 16th addressing many of the issues and cons you've mentioned. Here is also an official guide explaining the mechanics of PvP such as resources domination. It also explains the between PvP and PvE as we've just introduced PvE servers\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=1741743411\nRegards!"}, "87085128": {"recommendationid": "87085128", "author": {"steamid": "76561198013932078", "num_games_owned": 337, "num_reviews": 18, "playtime_forever": 345, "playtime_last_two_weeks": 0, "playtime_at_review": 146, "last_played": 1614112094}, "language": "english", "review": "I do recommend this game BUT, if Rimworld can let you rotate buildings then surely you should be able to do that here as well, if you need to make 4 versions of the artwork, so be it, it is either that or make all items take up one square. As it is right now you end up having things in your way because they take up two tiles left and right and you cannot rotate it to take up two tiles vertically against a wall.  Take the time to do this as soon as possible and it will be a massive Q.O.L. improvement.", "timestamp_created": 1613816022, "timestamp_updated": 1613816022, "voted_up": true, "votes_up": 32, "votes_funny": 0, "weighted_vote_score": "0.710612893104553223", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "153537838": {"recommendationid": "153537838", "author": {"steamid": "76561198076743617", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 354, "playtime_last_two_weeks": 0, "playtime_at_review": 347, "last_played": 1702509416}, "language": "english", "review": "While the game originally shows a lot of promise, and it immediately introduces you to a lot of interest mechanics, it requires a LOT of grinding and inventory management as of mid-game. It has a lot of recipes, but absolutely provides absolutely NO automation, so a lot of your time is spent going from one structure to the next manually moving items. On top of that, the rate at which a lot of items are mined/extracted is very slow, so you really waste a ton of time waiting to play the game. \nThe mobs are also not very exciting, and exploration really becomes more of a walking simulator.", "timestamp_created": 1702508082, "timestamp_updated": 1702508082, "voted_up": false, "votes_up": 21, "votes_funny": 1, "weighted_vote_score": "0.710405409336090088", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "100866037": {"recommendationid": "100866037", "author": {"steamid": "76561197968602529", "num_games_owned": 448, "num_reviews": 6, "playtime_forever": 23817, "playtime_last_two_weeks": 0, "playtime_at_review": 9851, "last_played": 1692756680}, "language": "english", "review": "This game can be described as what would happen if \"Don't starve together\", \"Rust\", and \"Rim World\" managed to have some sort of weird three way beautiful baby.   As such it is an overhead survival game where you start off on a planet where you can play alone, or with friends.  \n\nMuch like any other survival game you start off with nothing, aside from sticks, and build up from there.  With an end game of either escaping the planet (in the Single Player mode now added), or to progress in terms of technology, and just get to build the cool things (Multiplayer), and to kill one (Multiplayer PvP).\n\nAs referenced, the game itself has three modes currently. Single player, which you can progress through with an ultimate goal of leaving the planet if you wish, and unlocking a NG+ that keeps your stats, and starts you on a different map.   You then have PvE Multiplayer, and PvP Multiplayer.\n\nCrafting entails everything from building a basic base, with chests and so on in the early game.  To building Nuclear Reactors, Solar Panels, Oil/Gas refineries, Mechs, heavy weapons and so on towards the end of the game.  With other features including cooking, first aid, fishing, mining, and so on.\n\nOther than that the game also has bits in place for trading, and an economy by way of providing the ability to mint coins (that can be converted back to resources), and build vending machines for trading if folks want to go down that route.  \n\nAll in all, with this latest update I feel that I can very easily recommend this game.  In many ways due to the dev's reworking of various systems that took the excessive grind out of the crafting system (resource requirements), decay ( originally too fast), and hunger system (again too high) and brought it into line that made the game play more about playing, exploring, socializing, building, and (sometimes) killing.  As opposed to simply maintaining everything you managed to build so far!\n\nIf after all of this you are still on the fence about the game.  I would recommend checking out the Demo.   It's an eight hour thing that lets you try the game in it's entirety.  All without having to commit to making a purchase!", "timestamp_created": 1633902254, "timestamp_updated": 1633902405, "voted_up": true, "votes_up": 24, "votes_funny": 2, "weighted_vote_score": "0.709571182727813721", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "107739457": {"recommendationid": "107739457", "author": {"steamid": "76561198031413418", "num_games_owned": 332, "num_reviews": 11, "playtime_forever": 5131, "playtime_last_two_weeks": 0, "playtime_at_review": 5131, "last_played": 1641773178}, "language": "english", "review": "Is it worth buying Cryofall? In short YES but...\n\nCryofall is a typical example of a potentially great game but poorly developed. The game contains a really great amount of things to do, buildings to build, resources to collect and places to explore, but there is something missing. Being a game with a strong component of base building that involves the construction of generators, refineries, objects increasingly complex, I would have expected a minimum of automation: hoppers for example to insert objects inside the machines or automatic turrets, but there is nothing of this, every single machine must be supplied by hand. In the endgame even reprocessing the materials becomes tedious. \nThere are two things I really hated about this game:\n\n- The timed wipe of the servers, in fact despite the fact that the game requires a really long grind to collect the resources needed for the endgame, the game servers are reset every three weeks, an absolutely inadequate time for the majority of players with a stable job or a family. My advice is to buy it only if you are aware of the fact that having a job or a family means having to play in single player.\n- Two achievements are gated behind two group events that you can't do solo, so if you play single player, the only way to complete the achievements without using cheats is to play online.\n\ntl:dr The game is nice, requires a lot of grind and the servers have timed wipe every three weeks, maybe I'd buy it again just in sale.", "timestamp_created": 1641832519, "timestamp_updated": 1641832519, "voted_up": true, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.70829308032989502", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "50947297": {"recommendationid": "50947297", "author": {"steamid": "76561198080729029", "num_games_owned": 107, "num_reviews": 1, "playtime_forever": 3589, "playtime_last_two_weeks": 0, "playtime_at_review": 3122, "last_played": 1559523291}, "language": "english", "review": "Cryofall is a half Stardew Valley and half Rust. You get all the collecting, farming, and charming art of Stardew Valley, with the base-building and murdering of Rust.\n\nThe good:\n- No cheaters, as the system doesn't make it possible\n- Runs well, even on older machines\n- Crafting system is massive, logical, and mostly balanced (Although, it's still alpha, so it's tweaked for balance often)\n- Bases go up quickly, doors are automatic, and land claims have storage so even if you're raided, you can save a few high-value items\n- Community is worlds ahead of Rust and other multiplayer games. Community is self-policing, and developers care about making it a good community that people want to come back to\n- Modding is accessible and pretty involved for such an early game\n- Developers really care about this game, and they take feedback well\n- Noob protections so you can work the game out without getting killed all the time (the animals will still get you)\n- Few, if any bugs, and in-game systems to deal with issues\n- Regular releases\n- Non-PvP servers for people who just want to play and build without worrying about raiding\n\nThe bad:\n- Servers are not as populated as other games. More resources and space, but it allows for large, unopposed groups (the developers are working on a good solution\n- The crafting system can be a little too vast sometimes, and the many different items can be hard to tell apart in terms of usefulness\n- The LP system is great, but the requirements can be a little onerous, requiring lots of grinding\n", "timestamp_created": 1559172465, "timestamp_updated": 1559172465, "voted_up": true, "votes_up": 27, "votes_funny": 2, "weighted_vote_score": "0.706522643566131592", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "120563462": {"recommendationid": "120563462", "author": {"steamid": "76561197970665333", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 6490, "playtime_last_two_weeks": 0, "playtime_at_review": 6341, "last_played": 1660501132}, "language": "english", "review": "It can get a bit grindy at times, like most of this type of game tend to get, but overall I enjoyed the experience.\n\nThe one thing I would add is that the game is basically uncompletable in single player mode, which is a great pity.", "timestamp_created": 1660405385, "timestamp_updated": 1660405385, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.705605626106262207", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "92693737": {"recommendationid": "92693737", "author": {"steamid": "76561198036912238", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 3310, "playtime_last_two_weeks": 0, "playtime_at_review": 3178, "last_played": 1634995393}, "language": "english", "review": "To put it simply, this game is technically complete but not ready to be a published game.\n\nIn the interest of fairness, I have not played the game as a PvP game, but given the issues the game has, I can only expect that the attraction in playing this game in PvP is the PvP, and not the game.\n\nThe basic elements of the game are sound and a lot of the ideas have good merit- \n\n*spending Learning Points gained by developing your way through the tech tree to advance through the tech tree makes a decent enough loop and its recursiveness helps prevent it becoming too grindy.\n*The base building aspect is well developed and engaging, encouraging players to build and tweak the build how they like for both function and aesthetic.\n*The progression tree is well developed and interacts well with the availability of many of the resources you can gather throughout the game map.\n*The need for resources and their availability is developed well in such a way as to encourage building and managing multiple bases.\n*The farming system works well at its basis for a game that is played daily but not necessarily for very long at a time, and also can work well for a game that is played for multiple hours at a time but less frequently.\n*While I'm not personally a fan of some of the aesthetic elements, particularly the character design, I can see the appeal and the game for the most part provides a cohesive visual experience.\n\nHowever, the game is riddled with issues that should have been ironed out before moving on from early access/open beta.\n\n*The way progression in quests and Learning Points is tied to a wide variety of actions discourages player specialization in skill and technological development, but the sheer number of skills and level of involvement in things like base maintenance encourages players to operate as a group with specialists in the group.  This creates a strong tension or disagreement between the game's mechanics.\n*The combat is overly simple, especially with AI mobs- there are functionally only three kinds of weapon (melee, projectile, projectile explosive), and there are no techniques or methods integrated to the game to make it operate on a more complex level.\n*The Learning Point system provides Learning Points to spend in response to all sorts of actions- mining, fighting, crafting, eating foods, et cetera- but Learning Points are only spent gaining the ability to craft new things.  This means that play doesn't meaningfully change with advancement, particularly combined with the previous point.\n*The skill system only provides progression in the form of percentage efficiency- time spent on actions, quantity of health and stamina, or amount of resources gained from resource nodes- and so doesn't meaningfully change gameplay other than the amount of time it takes to get things done and raw character endurance.\n\n\nMost of all, as the player on our group PvE server who did the most base construction and management, base management is overflowing with busywork and poorly staged.  \n\nFor example, on the initial stage of running a power grid through gasoline rather than harvested coal and wood, you need to provide burnables to oil extractors and refineries to power them, jerrycans to extractors to fill, move jerrycans manually from extractors to refineries to refine the oil, provide jerrycans to the refineries to fill with gasoline and mineral oil, empty some of those jerrycans into barrels to store resources, move jerrycans from refineries to gas power plants so they can have enough gas to keep running, and pull the empty jerrycans from the gas power plants to put them in the oil extractors.\n\nThe lack of a fluid or other resource moving system means that players are constantly personally ferrying resources between buildings, especially since running any sort of resource development through the electrical grid consumes huge amounts of electricity compared to the expectable production of that resource development.\n\n\n\nThis game has a lot of potential to be good, but right now, most of that is just potential.  The systems and construction of this game suggests a promising game with some refinement early in a beta or early access cycle, but it just isn't really finished yet and certainly isn't polished.\n\nWith time and updates, I might eventually recommend this game, but right now, I would recommend against buying it except on significant sale, and even then question how much interest you actually have in playing it.", "timestamp_created": 1622148451, "timestamp_updated": 1622148451, "voted_up": false, "votes_up": 36, "votes_funny": 1, "weighted_vote_score": "0.70522993803024292", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "107346161": {"recommendationid": "107346161", "author": {"steamid": "76561198931208891", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 2925, "playtime_last_two_weeks": 0, "playtime_at_review": 2834, "last_played": 1641524181}, "language": "english", "review": "this game is good but their is too much grinding and most the players are jerks that will kill anything that moves which is what makes it a no for me. Also its too boring on single player", "timestamp_created": 1641349528, "timestamp_updated": 1641349528, "voted_up": false, "votes_up": 22, "votes_funny": 1, "weighted_vote_score": "0.702573955059051514", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "154681109": {"recommendationid": "154681109", "author": {"steamid": "76561197964373272", "num_games_owned": 0, "num_reviews": 71, "playtime_forever": 1048, "playtime_last_two_weeks": 0, "playtime_at_review": 1048, "last_played": 1703789135}, "language": "english", "review": "TLDR: The game has a solid foundation, but what's built on top of that is pretty thin and grindy. PVP dependent. \n\nThe good: Cryofall has a lot of potential. (Famous last words for indie games, right?) There are systems here that IF implemented well, could make for a fantastic game. The progression system is workable, and the point rewards for experiencing things makes it rewarding to explore and try different things. There's a lot to build and craft, and of course, there's multiplayer!\n\nThe bad: The game relies on that multiplayer, and more specifically the threat of PVP raids, to provide any sense of tension. If you're playing solo or coop with friends, the PVE experience is grindy...and that's about it. There's no real threat. Most all the enemies behave the exact same way. They just sit there until you get within their view range, and then they look at you. If you get closer at that point, they will start running towards you. Otherwise enemies just have different skins.  That makes for a pretty boring solo experience.  So yeah, the devs are relying on those PVP raiders to be your antagonists in this. There's also just a crazy amount of.....walking...and grinding. Also, I know they did it for multiplayer pvp again, but the whole \"can only build base buildings while in the area of influence of your control point\" thing really sucks, especially in solo/coop play, and really hampers creativity. Not to mention upgrading the control point only expands your influence by ONE tile in each direction. Doesn't really feel worth the investment.\n\nOverall, if the devs tightened up the tech tree and balanced it out a bit to reward speccing in certain directions, made a big balance check to costs/speed/grindyness of things, and did a COMPLETE overhaul to the way enemies are handled, I think they'd have a winner on their hands.  As it stands, I wish I could put a \"meh\" instead of a thumbs down, but at the end of the day if I have to pick if it's worth the money or not as a non-PVP gamer, I'd say no.", "timestamp_created": 1703818959, "timestamp_updated": 1703818959, "voted_up": false, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.699334323406219482", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "74423626": {"recommendationid": "74423626", "author": {"steamid": "76561197999322380", "num_games_owned": 374, "num_reviews": 192, "playtime_forever": 13912, "playtime_last_two_weeks": 0, "playtime_at_review": 183, "last_played": 1709279982}, "language": "english", "review": "I think this is one of the best craft and explore game ever. The craft system, I think the best one I've ever seen.\nHope developers will do something similar in 3D survival game, with the same perfect crafting system.\n\nAmazing thing is you can setup your own server with docker\nhttps://hub.docker.com/r/atomictorch/cryofall-server\n\nDon't forget to change autosave_interval to 3min in SettingsServer.xml file to be able to terminate container after you play the game", "timestamp_created": 1597611570, "timestamp_updated": 1631858957, "voted_up": true, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.698303043842315674", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "75670244": {"recommendationid": "75670244", "author": {"steamid": "76561198013932889", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 30, "playtime_last_two_weeks": 0, "playtime_at_review": 30, "last_played": 1599601849}, "language": "english", "review": "A nice concept and looks good from the screenshots. You may think it's a survival crafting game like the many others on steam,  however, it's more akin to one of those base building mobile games. It relies heavily on production timers, things spoiling after real world hours and the constant need to log on daily to prevent your whole base from \"decaying\". Add into this the servers being regularly wiped and the time it takes to find an area to settle that hasn't already been colonised by someone else makes for a very farmvillesc gameplay. If you don't do anything during the day and are ready to dedicate a few hours each day you might enjoy this idle game. If you came here for a single player, there is no single player. It's a always online experience, even when you're offline you character persists in a world).\n\nIf you enjoy the kind of games that popup as annoying adverts whenever you use a free app on your phone, you might enjoy this. Otherwise there are plenty of other survival craft games out there, this one won't be for you.", "timestamp_created": 1599604650, "timestamp_updated": 1599604650, "voted_up": false, "votes_up": 123, "votes_funny": 4, "weighted_vote_score": "0.695956170558929443", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1599623791, "developer_response": "I'm afraid you just misunderstood the game in your 0.5 hours of playing.\n\nThis game definitely has no connection to mobile games what so ever. And it definitely has no connection to idle games.\n\nIt is developed as a classical online survival game similar to projects like Rust, Ark, Conan and so on, with its own unique feel and content obviously. If anything, you can think of it as a mixture of RimWorld, Rust and Stardew Valley in terms of content and overall feel :) \n\nYou can read this page to get a basic overview of things that you can expect in the game:\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=1489843089\n\nI hope you can play a bit more and actually experience the game.\n\nIf you have any questions or concerns - don't hesitate to join or discord and talk to us directly. We are always ready to help!"}, "141368809": {"recommendationid": "141368809", "author": {"steamid": "76561198042942924", "num_games_owned": 0, "num_reviews": 47, "playtime_forever": 1820, "playtime_last_two_weeks": 0, "playtime_at_review": 1807, "last_played": 1688562860}, "language": "english", "review": "Cryofall feels like an unfinished game in desperate need of some features. I want to enjoy this game more, but the durability system, the inventory management, and the crafting requirements and limitations hamstrung this game. \n\nI reached a point (Around Tech IV) where everything was made with 5 separate components, with each component made of 5 separate components. I was spending 10 minutes of exploration and discovery after an hour of mind-numbing crafting, making sure I have enough parts to make enough bullets for a rifle that will break after a few days' use. I never got the pragmium heart item, so I'm spending 50% of my health in each teleporter, making base transportation a slog and require healing.\n\nThis game felt like it wanted to be combat-focused... but it plays like a mobile game.\n\nThis game felt like it wanted to be a base-building sim... but it's building mechanics are bare-bones.\n\nThis game felt like it wanted to be a survival sim... but it throws food/water resources at you.\n\nThis game felt like it wanted to be fun... but it hamstrings you with bottleneck resource and time sinks all throughout.", "timestamp_created": 1688562029, "timestamp_updated": 1688562029, "voted_up": false, "votes_up": 18, "votes_funny": 1, "weighted_vote_score": "0.692209720611572266", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "104368787": {"recommendationid": "104368787", "author": {"steamid": "76561197998193372", "num_games_owned": 0, "num_reviews": 72, "playtime_forever": 9832, "playtime_last_two_weeks": 0, "playtime_at_review": 9832, "last_played": 1625844775}, "language": "english", "review": "- DIFFICULTY -\n\n🔲 My 90 year old grandma could play it\n🔲 Easy\n☑️ Normal\n🔲 Hard\n🔲 \"Dark Souls\"\n\n- GRAPHICS -\n\n🔲 \"MS Paint\"\n🔲 Bad\n🔲 Meh\n☑️ Graphics don't matter in this game\n🔲 Good\n🔲 Beautiful\n🔲 Masterpiece\n\n- MUSIC -\n\n🔲 Bad\n☑️ Not special\n🔲 Good\n🔲 Beautiful\n\n- STORY -\n\n🔲 This game has no story\n☑️ Like playing \"Temple Runners\" for the story\n🔲 It's there for the people who want it\n🔲 Umm Good?\n🔲 Well written\n🔲 Epic story\n\n- PRICE -\n\n🔲 Free\n🔲 Underpriced\n🔲 Perfect price\n☑️ Could be cheaper\n🔲 Overpriced\n🔲 Complete waste of money\n\n- REQUIREMENTS -\n\n🔲 You can run it on a microwave\n☑️ Potato\n🔲 Average\n🔲 High end\n🔲 \"NASA\" computer\n\n- LENGTH -\n\n🔲 Very short (0 - 3 hours)\n🔲 Short (3 - 15 hours)\n🔲 Average (15 - 50 hours)\n🔲 Long (50 - 90 hours)\n🔲 Extremely long (90 - 110 hours)\n☑️ More than 1 week (170+)\n🔲 No ending\n\n- FUN -\n\n🔲 I'd rather watch paint dry\n🔲 Hard to enjoy\n☑️ Repetitive\n🔲 Actually pretty amusing\n🔲 Ride of your life\n\n- REPLAYABILITY -\n\n🔲 It's a one - time experience\n🔲 Only for achievements\n🔲 If you wait a few months / years\n☑️ Definitely\n🔲 Infinitely replayable\n\n- WORTH BUYING -\n🔲 It's Free\n🔲 No\n☑️ Wait for sale\n🔲 Yes", "timestamp_created": 1638027179, "timestamp_updated": 1638027179, "voted_up": true, "votes_up": 68, "votes_funny": 5, "weighted_vote_score": "0.691269993782043457", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "131892481": {"recommendationid": "131892481", "author": {"steamid": "76561198123580737", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 3451, "playtime_last_two_weeks": 0, "playtime_at_review": 3389, "last_played": 1675407261}, "language": "english", "review": "I have to say, that after fully completing everything in the game on a PvE server, I don't recommend this game for PvE and I would guess that this recommendation carries over to PvP as well, but I haven't tried it so can't comment on it. There are too many issues with the game, and it feels like the devs dropped the ball a bit on this one, because the potential is definitely there. The only reason I have the hours I do and completed the game is because I made some new friends in a server and logged in to play with them. The game itself wasn't a big draw for me.\n\nFor starters, the character/enemy art is fairly questionable. It's this weird mix of realistic and cartoony that is a bit hard to like. It only works well for the environmental art and item art, that's it. This is actually probably the single thing that actually stopped me from trying the game to begin with, just because it wasn't really hooking me in.\n\nNext, is the actual progression. The progression system is decent overall, but there are some things that don't make a lot of sense. The weapon balancing is a bit weird, and certain endgame weapons feel a lot weaker than they should be. There are also a lot of mid-grade stepping stone type technologies that require too many resources to be worth investing in, making it so that a lot of things get ignored and unbuilt in favor of waiting to unlock the better version of it. There's also a tremendous midgame reliance on lithium, which you can only get in great quantities by building multiple lithium extractors and waiting overnight. There is no real way to meaningfully gather them in game. It feels like an artificial way to slow the pace of progress in the game.\n\nNext, there are the boring environments and enemies. Most of the enemies you find are just reskins of one another, including snakes which are literally just a different color in each biome. This is a game set on an alien world, and they made almost no effort to come up with some interesting enemies to fight. There is barely any reason to visit the other biomes for anything other than to check some first time boxes off.\n\nFinally, there is the lack of content. The first half of the game involves a lot of exploration of the map, but the second half of the game involves doing the same handful of map events over and over, and then repeatedly going to the desert to mine a single late game resource and kill things for LP (which you use to unlock tech). This gets extremely boring and repetitive because there is nothing else to do, and no other ways to progress the late game. There are some ruins you can explore, sure, but you barely get anything useful from them. Most of it is junk. You end up spending more time traveling by ruin hunting that doing anything useful.\n\n[b]So, how can the devs fix this?[/b]\n[olist]\n[*]Settle on cartoony or realistic for the art. Balloon-shaped wolves isn't really working for the game. \n[*]Lower the cost of intermediate tech, or remove them from the game altogether. \n[*]Add multiple new resources that are required for mid game and late game progression similar to pragmium and make them exclusive to each biome in the game except for the meadows. I would also add at least one more biome. \n[*]Add 5-10 new enemies, and spread them to each biome. Each enemy should have movement and attacks that aren't just run in a straight line and melee, and half of them should present a dangerous threat and be limited to the harder biomes. These enemies should also be alien or robotic in origin, rather than random earth animals. \n[*]Ruins need to have some new unique enemies, need to be made much larger, and also need to have unique loot required for progression that you can only find in them. This will make them more interesting and give players more of a reason to make the trek to them.\n[*]Add some mini-bosses to the game to fight with interesting loot drops to make them worth fighting.\n[/olist]", "timestamp_created": 1675112384, "timestamp_updated": 1675112384, "voted_up": false, "votes_up": 24, "votes_funny": 0, "weighted_vote_score": "0.688759684562683105", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "149551475": {"recommendationid": "149551475", "author": {"steamid": "76561197976867030", "num_games_owned": 900, "num_reviews": 93, "playtime_forever": 2123, "playtime_last_two_weeks": 0, "playtime_at_review": 2123, "last_played": 1699140077}, "language": "english", "review": "Disclaimer: I only played PvE.\n\nFirst hours are fun then it's just an endless grind. I think it's the first time I doesn't recommend a game after so much time but it's just a drug, like Cookie Clicker at this point.\n\nEverything has durability, it takes hours to unlock stuff, your armor breaks super quickly if you die, crafting ammo is a pain (later on you'll build batteries that last longer but also breaks after some time and are super annoying to craft).\n\nThe game manage to never be rewarding. Unlocking the hoverboard is a good exemple:\n- You're pretty slow and up to this you do everything on foot\n- You unlock and craft a vehicle bay, craft an hoverboard -> this takes hours\n- Happy ? Wait, you have to put fuel in the hoverboard. So that's another hour to craft the battery. You need salt that can only be found in the desert to do that or extract it from the ground which takes a lot of time.\n- To put the fuel into the fuel cell, you need 20 fuel canisters: This step takes hours and hours as you set up a whole operation to extract oil you then veeeeeery slowly convert into fuel. It takes 33 real minutes to get enough fuel for one cell !!! Your hoverboard can have up to three.\n\nTHIS WILL EAT YOUR SOUL\n\nEverytime you think you've advanced, you realise you've just opened a whole new world of grind.\n\nOnce you get to plastic there is a lot of waiting to the point where you'll have to stop playing and just come back later to get your loot (servers continue running when you're offline so there are points where you won't really progress anymore without waiting a few hours to come back)\n\nWhile you evolve a lot and unlock tons of stuff, the gameplay will not change one bit except once you unlock drones. Even at the end game, you'll still be mining and cutting wood for hours. There is no real endgame (nor middle game), you'll still be fighting the same enemies (not variations, literraly the same: boars, wolves, snakes...) after 30+ hours. There are no dungeons and except for one or two bosses, you won't ever need co-op.\n\nBasically a good fundation for a game but it lacks a ton of content.", "timestamp_created": 1699141734, "timestamp_updated": 1699141734, "voted_up": false, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.688467085361480713", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "62300168": {"recommendationid": "62300168", "author": {"steamid": "76561198074077156", "num_games_owned": 151, "num_reviews": 1, "playtime_forever": 83229, "playtime_last_two_weeks": 0, "playtime_at_review": 26250, "last_played": 1711227679}, "language": "english", "review": "Very fun with groups of people. Large pvp in the best thing about this game, even the solo fights can be intense. Very active devs that take all opinions and even act on most of them.", "timestamp_created": 1579825725, "timestamp_updated": 1579825725, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.686593592166900635", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "49978797": {"recommendationid": "49978797", "author": {"steamid": "76561197994073479", "num_games_owned": 0, "num_reviews": 34, "playtime_forever": 239, "playtime_last_two_weeks": 0, "playtime_at_review": 239, "last_played": 1554491173}, "language": "english", "review": "Perfect game if you like to troll the already small population of players. Mindless PKing that will prob kill the game. Gankers and people with higher tier gear are unrestricted and rewarded for griefing newer players. Killing on sight for no reason 10/10. Refunded.", "timestamp_created": 1554510035, "timestamp_updated": 1554510035, "voted_up": false, "votes_up": 52, "votes_funny": 5, "weighted_vote_score": "0.68494415283203125", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1554513200, "developer_response": "I'm sorry to hear that you had negative experience with multiplayer, however the game was designed to be completely open-ended and without restrictions for PvP.\n\nBut with that said we do understand that there are players who would prefer a more peaceful type of gameplay and we are currently working on a new update that will introduce PvE mode and separate PvE servers specifically for people who don't want to worry about other players attacking them. It should be available within the next 1-2 months along with other additions.\n\nIn addition to that - you can always run a private server (even now, though it takes some effort to configure) or you can join one of many community servers. Some of them enforce strict non-PvP rule and you can relax without worrying about being attacked. So, give it a try as well!\n\nI hope I addressed your main concerns, but if you have any questions - please feel free to get in touch with us and we would be happy to help you!"}, "84276818": {"recommendationid": "84276818", "author": {"steamid": "76561198098453671", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 1980, "playtime_last_two_weeks": 0, "playtime_at_review": 254, "last_played": 1611977855}, "language": "english", "review": "I didn't think I would like this game at first because of the playing angle, but 4 hours later it is 2:49 am and I haven't even started building yet... The map is insanely big and there are a lot of cool creatures. The building and graphics are great too, I honestly do not have anything bad to say about this game.", "timestamp_created": 1610095910, "timestamp_updated": 1610095910, "voted_up": true, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.683098971843719482", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "110863733": {"recommendationid": "110863733", "author": {"steamid": "76561198115597896", "num_games_owned": 0, "num_reviews": 42, "playtime_forever": 2830, "playtime_last_two_weeks": 0, "playtime_at_review": 1300, "last_played": 1680539647}, "language": "english", "review": "This is probably the most Zen survival game I've ever played.  The art style is different and very clear.  I would recommend this to anyone who enjoys playing Minecraft Survival style games, as that's most what it reminds me of, though the sci-fi setting is unique to itself.  It's also very customizable, which I like.\n\nNote: I do not play multiplayer so I can't comment on what it's like on servers with other players.  \n\nI should also mention I have not purchased any of the armor/weapon skins.  They are MUCH too expensive for pixel art, in my opinion, and most aren't particularly spectacular.  I would probably be more likely to buy themed packs of skins, but individually, they cost too much for what you get.  \n\nIf you get it on sale, like I did, I definitely recommend it.  It's both calming and challenging, in turns.  You learn by doing and by researching, when you've earned enough learning points to research something new.  You can build your own base(s).  You can fight enemies large and small, and you can explore an interesting map full of multiple biomes.", "timestamp_created": 1645674525, "timestamp_updated": 1645674525, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.680165767669677734", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "67934760": {"recommendationid": "67934760", "author": {"steamid": "76561198026563907", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 53750, "playtime_last_two_weeks": 63, "playtime_at_review": 13756, "last_played": 1713657761}, "language": "english", "review": "Map wipes are fine, but wiping character experience points in PvE every few months is completely unnecessary and a waste of time. If I want to play a game that throws away all my progress occasionally, I'll just go build a base in Fallout 76.", "timestamp_created": 1587736453, "timestamp_updated": 1587736453, "voted_up": false, "votes_up": 29, "votes_funny": 10, "weighted_vote_score": "0.67925870418548584", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "153375308": {"recommendationid": "153375308", "author": {"steamid": "76561199120744125", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 4525, "playtime_last_two_weeks": 0, "playtime_at_review": 248, "last_played": 1712324551}, "language": "english", "review": "I love this game, my husband and I started it on hardcore mode together and it has been quite the fun little challenge for us! :) I genuinely feel a little fear when I leave the base because the monsters are not easy to contend with. We are constantly searching for a game that combines farm/basebuilding and character modification with good battle/fighting!!", "timestamp_created": 1702303297, "timestamp_updated": 1702303297, "voted_up": true, "votes_up": 17, "votes_funny": 1, "weighted_vote_score": "0.678338050842285156", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "66836614": {"recommendationid": "66836614", "author": {"steamid": "76561198365117748", "num_games_owned": 308, "num_reviews": 4, "playtime_forever": 20077, "playtime_last_two_weeks": 0, "playtime_at_review": 12054, "last_played": 1637930347}, "language": "english", "review": "[h1] Short version [/h1] \nA pretty polished game for an Early Access title. PvP are pretty much a full-fledged game at this point, PvE however still needs some late game contents. Download the demo and try it for 8 hrs and judge it for yourself.\n\n[h1] Long version [/h1] \n[b] GRAPHICS : [/b] I gotta be honest, my first impression of Cryofall is not that great. The character and animation felt kind of \"cheap\", like the type of designs you often sees in Freemium mobile games. There's a variety of avatar faces to choose from, but they all have the same default \"idle\" expression. They're by no means \"ugly\", just a tad bit uninspired. The environmental, structure and creature designs however, looks great. You can tell the artist puts a lot of time and effort into it, plus the character design started to grow on me after a couple of hours of gameplay. So, eh. It's alright.\n\n[b] GAMEPLAY : [/b] An easy way to describe this game is \"2D Rust\". I've never played Rust before, so I can't really draw the comparison. The leveling system in this game however, kind of reminds me more of Age of Empires. You start with sticks and stones, craft tools, make better tools and advance your base, sort of like Age of Empire's progression of Stone Age > Iron Age. The leveling system is a lot deeper than what I expected, with a massive technology tree that branches out and intertwines with each other. The way to actually advance the technology however, is quite grindy once you reach the mid-stage of the game, particularly around Tier-3 (there are 4 tiers in total). The game offers enough to keep you busy, from gathering resources to hunting and foraging and farming and building....but even with all those contents you're still gonna feel the grind, especially when playing solo. My advice : Start with PvE, treat it as a long tutorial and getting use to it, once you reach T3 you're more or less prepared to enter PvP and team up with other players. \n\n[b] CONTENT : [/b] I'm surprised that this is an Early Access game, because in my opinion the game is pretty much ready for launch. If I really have to add what I want to see being add into the game, it's an actual campaign mode with stories and lore that would make me feel attached to the world. Late-game content is also really needed especially for solo players. Maybe some kind of boss fight, or challenging weather systems to keep the game fresh. There is a small area in the map that the developers purposely locked out from players, so I'm sure they're cooking up something for us in the future. \n\n[b] PLAYTIME : [/b] I got this game during early March, and in less than a month I'm already clocking in 200 hours. So I definitely got my moneys worth. Cryofall has a real time clock system, meaning that time still goes on even after you log out. Your crops will either, your food will perish, and everybody else in your server are still playing and progressing when you're not playing it. Plus, your structure will slowly disappear after a few days of inactivity, so you're almost always playing the game daily just so that you don't loose progression. This might be a burden to some players that likes to play whenever they like, but if you're on board with the gameplay loop, it's not really that hard to maintain. \n\n[b] PERFORMANCE : [/b] Works perfectly on my low spec 5 years old computer, little to no loading time. No complains here.\n\n[h1] Conclusion [/h1]  A highly enjoyable game with an addictive gameplay loop (if this is your type of genre), with enough content to keep you playing. Has the potential to be grindy once you reach mid to late game, but by then you've probably played long enough to get your money's worth. Download the demo, try it out yourself (preferably with friends) for 8 hours, then you'll have an idea on weather or not it's your cup of tea.", "timestamp_created": 1586282678, "timestamp_updated": 1586283147, "voted_up": true, "votes_up": 27, "votes_funny": 1, "weighted_vote_score": "0.676932573318481445", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "95681102": {"recommendationid": "95681102", "author": {"steamid": "76561198024311695", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 5689, "playtime_last_two_weeks": 0, "playtime_at_review": 5637, "last_played": 1709002465}, "language": "english", "review": "you spend so much time farming to build your place but if your life gets busy or have an issue you cant log in for a bit everything you did and farmed so many hours is gone.  Horrible experience.  Not worth the farming either because there is nothing to do with all that stuff you earned, no endgame content that is worth it.", "timestamp_created": 1626203764, "timestamp_updated": 1626203764, "voted_up": false, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.676206290721893311", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "110629952": {"recommendationid": "110629952", "author": {"steamid": "76561198063923126", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 1200, "playtime_last_two_weeks": 0, "playtime_at_review": 680, "last_played": 1666793269}, "language": "english", "review": "it feels like a concept display at best, a bad execution at worse.\n\npros: good mechanics for crafting.\n         lots of so called goals to pursue.\n         runs smoothly.\n         good decay system that avoids felling like the old tech that u built is useless.\ncons: mechanics while being good, only extend mechanical complexity to manufacturing.\n         most if not all goals will simply be finding a way to create the next material for upgrade to create the next building and so on and so forth.\n          combat is too basic and weapons have no feel, they simply feel like sprites with effects.\n         and the worst offence, complexity in all the wrong places, about 90% of the things u will research and produce will be individual materials that come together to produce another component that then leads to production of finished products, now while that is great at first glace at first, but then u suddenly realize that its kinds useless, and all this extreme effort that went into making this system, could have been spent on the game, rather than on a crafting system that has pretty much no use.\n         the game is way too grindy, since all u do is farm for stuff to build the next stuff that u can then farm for.", "timestamp_created": 1645362873, "timestamp_updated": 1645362873, "voted_up": false, "votes_up": 24, "votes_funny": 0, "weighted_vote_score": "0.676192820072174072", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "140966019": {"recommendationid": "140966019", "author": {"steamid": "76561198148950479", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 247, "playtime_last_two_weeks": 0, "playtime_at_review": 247, "last_played": 1686238245}, "language": "english", "review": "Looks and plays like a mobile game.\nIf you're thinking of buying this don't expect a Rimworld like experience, it's very heavily focussed on the multiplayer pvp aspect. This is a matter of taste ofcourse but as a solo gamer I can't be bothered after playing for around 4 hours.", "timestamp_created": 1688123627, "timestamp_updated": 1688123627, "voted_up": false, "votes_up": 16, "votes_funny": 1, "weighted_vote_score": "0.67364966869354248", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "65322638": {"recommendationid": "65322638", "author": {"steamid": "76561198012524009", "num_games_owned": 495, "num_reviews": 35, "playtime_forever": 5865, "playtime_last_two_weeks": 0, "playtime_at_review": 1752, "last_played": 1586040853}, "language": "english", "review": "Game is ok and new and fresh, i enjoyed it so far. \n\nBut the longer you play it the longer you will start to feel the grinding is never ending.... sadly....\nI played it for 28 hours so far, and probably spent about 2 of them exploring, the rest i had to keep grinding wood and stone/iron/coal e.t.c nodes because everything just keeps your grinding and grinding. If you spend an hour to grind enough resources to make 200 bullets then the joy is swiftly taken away because of the insame consumption of ammo to just kill 1 animal. And sadly unlocking new tiers and advancing in the game doesnt make the grind any less.... Unlocking new weapons hardly has any effect on the damage you do so youll be constantly grinding for resources the entire game, also the higher up you get youll be starting to grind learning points to unlock new things and the requirements jumps a huge step by each tier... Tier 1 for an example makes you use 10 points each thing you learn, Tier 2 is 20 points but then you hit tier 3 and its 50 points e.t.c. Also you need to use learning points to unlock certain trees. At t2 its 100 each tree, at t3 is 250 each tree, I havnt reached Tier 4 yet but my guess its 500... The game is good and the game is entertaining but sadly it needs better balancing because the grinding is killing the joy of the game and i think its noticeable too because most of the times theres max 10 people on the servers.", "timestamp_created": 1584616425, "timestamp_updated": 1584616425, "voted_up": true, "votes_up": 14, "votes_funny": 1, "weighted_vote_score": "0.672378778457641602", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "102263994": {"recommendationid": "102263994", "author": {"steamid": "76561197966576022", "num_games_owned": 3320, "num_reviews": 141, "playtime_forever": 273, "playtime_last_two_weeks": 0, "playtime_at_review": 273, "last_played": 1633965119}, "language": "english", "review": "Unfortunately, this game isn't fun.\n\nBefore I get into criticising the game, I'd like to applaud the developers for making it possible to play the game the way you want to. Servers that periodically reset will not be something that casual players will be into, so single-player/your own instance that doesn't reset is a nice addition.\n\nI think this game made a fundamental mistake of trying to build for both PvE and PvP.\n\nIt feels like PvP's complexity stems from figuring out how to position oneself in a team fight. This is well and good, but consequently, it feels like PvE suffers for it. I played this game for almost five hours and all encounters with creatures consisted of was either running away completely if the enemy is too strong, kite enemies and fire at them if I can defeat them or run after them if they're fleeing. This does not make for fun gameplay.\n\nThe AI is ridiculously simple, it will walk at you and attack you if in range and in line of sight and stop the moment you're ever so slightly behind a hill. I think I met a single enemy that had ranged attacks. No special moves.\nCombat becomes as engaging as writing numbers some in a spreadsheet and then comparing them. Now, I don't know if the game continues like this, but if this is all I've been offered in 5 hours, I'm out.\n\nMy suggestions would be as follows:\nAdd literally any kind of mechanics to early-game so that players feel at least a little bit engaged in fighting. \nExamples:\n[list]\n[*] Dodge rolls and faster enemies\n[*] Stances for blocking against fast attacks\n[*] Enemies that lunge at you or engage you as a group by attacking with charges from different angles\n[/list]\nWhat I played did not inspire me to play more.", "timestamp_created": 1636122419, "timestamp_updated": 1636122419, "voted_up": false, "votes_up": 21, "votes_funny": 1, "weighted_vote_score": "0.667505264282226563", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "49970831": {"recommendationid": "49970831", "author": {"steamid": "76561198078957722", "num_games_owned": 0, "num_reviews": 53, "playtime_forever": 48, "playtime_last_two_weeks": 0, "playtime_at_review": 48, "last_played": 1554474972}, "language": "english", "review": "Already refunded this game. You cant even learn to play it without players trying to kill you every 2 minutes. You cant run away, they just shoot you. It's probably alright for those that started to play when the game first come out. I think it's a \"survival game\" aimed towards young kids that like doing that sort of thing. I would say give it a try, you might like it... but its definitely not my cup of tea.", "timestamp_created": 1554478412, "timestamp_updated": 1554478412, "voted_up": false, "votes_up": 38, "votes_funny": 4, "weighted_vote_score": "0.662757515907287598", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1554499312, "developer_response": "I'm sorry to hear that you had negative experience with multiplayer, however the game was designed to be completely open-ended and without restrictions for PvP.\n\nBut with that said we do understand that there are players who would prefer a more peaceful type of gameplay and we are currently working on a new update that will introduce PvE mode and separate PvE servers specifically for people who don't want to worry about other players attacking them. It should be available within the next 1-2 months along with other additions.\n\nIn addition to that - you can always run a private server (even now, though it takes some effort to configure) or you can join one of many community servers. Some of them enforce strict non-PvP rule and you can relax without worrying about being attacked. So, give it a try as well!\n\nI hope I addressed your main concerns, but if you have any questions - please feel free to get in touch with us and we would be happy to help you!"}, "64944751": {"recommendationid": "64944751", "author": {"steamid": "76561198125937199", "num_games_owned": 0, "num_reviews": 38, "playtime_forever": 1713, "playtime_last_two_weeks": 0, "playtime_at_review": 1701, "last_played": 1584073781}, "language": "english", "review": "if you don't log in every day your base gets deleted and you lose everything", "timestamp_created": 1584073765, "timestamp_updated": 1584073765, "voted_up": false, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.657461822032928467", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "50239800": {"recommendationid": "50239800", "author": {"steamid": "76561198074982215", "num_games_owned": 0, "num_reviews": 17, "playtime_forever": 4183, "playtime_last_two_weeks": 0, "playtime_at_review": 3851, "last_played": 1555864503}, "language": "english", "review": "Hello everybody. After playing 64 H i highly recommended NOT TO buy/play this game and here are some reasons why ( I've played on europe server, hope other are better):\n- there is no safe spot/time for new players soo from the start you will be killed constantly by high lvl players\n- playing solo or with 1 friend will be very difficult for you, because larger groups will kill you in every encounter\n- this game is a weapon race game, if you dont have time to play all day every day, be prepered to get killed over and over again\n- community is SUPER TOXIC, you will see swastika all over the map, some group of players will decide to destroy your base everyday just because they can, or you just have the audacity to defend yourself\n- later in game you need to collect 500 learning points to progress in crafting, what is almost imposible, because when you die you loose 80% of it\n- 90% of players will kill on sight, soo there is no talking interaction in game other than chat, and most of it it's just toxic\nI have to add that game could be fun to play, but because of toxic community all you will get is frustration.", "timestamp_created": 1555794188, "timestamp_updated": 1555794188, "voted_up": false, "votes_up": 21, "votes_funny": 2, "weighted_vote_score": "0.656716346740722656", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1555914100, "developer_response": "We are currently working on a large update that will include newbie protection which should help new players learn the game easily without worries about losing items or LP.\n\nThis update will also include many balancing changes, including increased LP gain from quests. There are also many requested fixes and improvements. It should really change the feel of the game for all new players. The game has just been release into the early access this month and we are working hard to make all of the necessary changes that were requested by players. I hope you can enjoy the game more after that patch.\n\nThen, in early May we will also release a large content update and more importantly new PvE game mode for players who prefer a more relaxed experience without need for combat between players, with focus on creative development and long term play. Meanwhile, this will enable us to make PvP even more engaging. This will allow players to separate based on their preferences: either brutal PvP or relaxed PvE.\n\nAfter that we plan to introduce a complete overhaul to the entire game with new electricity system. This update will include almost a hundred new technologies for buildings and items which would make it possible for us to reduce the LP grind, since the total amount of content will be much bigger, so progression speed can be increased even further (LP gain to unlock new technologies).\n\nAs for toxic community - I think it really depends on the particular servers. Many servers are extremely friendly with many kind people who would be willing to help new players or explain the game. This is especially true for smaller community servers.\n\nI hope you can still enjoy the game even now or just wait a little bit until we can address all of the important points to make the game even better!"}, "49934891": {"recommendationid": "49934891", "author": {"steamid": "76561198012028297", "num_games_owned": 0, "num_reviews": 40, "playtime_forever": 53, "playtime_last_two_weeks": 0, "playtime_at_review": 53, "last_played": 1554322173}, "language": "english", "review": "for hardcore pvp players only.\nIt's difficult to like a game where u get killed every 2-3 minutes and cannot even start learning how to play and discover what to do.", "timestamp_created": 1554322953, "timestamp_updated": 1554322953, "voted_up": false, "votes_up": 64, "votes_funny": 8, "weighted_vote_score": "0.65652841329574585", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1554334297, "developer_response": "Hello!\nWe're sad to hear you have the bad experience, but you're right - it's part of the design and could be abused by some players.\nAnyway, we're aware that not all players are enjoying PvP games so we're working on a PvE update (separate PvE servers).\nThere are also moderated community game servers ensuring there are no unnecessary PvP fights.\n\nRegards!"}, "68246106": {"recommendationid": "68246106", "author": {"steamid": "76561198005271335", "num_games_owned": 0, "num_reviews": 200, "playtime_forever": 1146, "playtime_last_two_weeks": 0, "playtime_at_review": 1000, "last_played": 1683983256}, "language": "english", "review": "[h1][b]TL;DR:[/b] Terraria meets Rust meets Minecraft.[/h1]\n\nThis summary is about everything I have to say about the game, really. Most of the core gameplay is hard grind. You gather resources and explore the world and gain LP -- points, which you unlock new items with. \n\nThere are PvP and PvE-servers. PvE are bland and are only good to learn the game. The main gameplay is on PvP servers: you gather stuff and raid your neighbors (be that online or an offline raid), which ultimately leads to reducing your grind.\n\nAll in all, if grind's not for you, you will highly unlikely enjoy this game.", "timestamp_created": 1588174693, "timestamp_updated": 1588181012, "voted_up": true, "votes_up": 19, "votes_funny": 3, "weighted_vote_score": "0.65510934591293335", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "86418107": {"recommendationid": "86418107", "author": {"steamid": "76561198001559751", "num_games_owned": 0, "num_reviews": 30, "playtime_forever": 1148, "playtime_last_two_weeks": 0, "playtime_at_review": 1109, "last_played": 1614721495}, "language": "english", "review": "Fairly enjoyable, but be prepared to G-R-I-N-D. Very little information on how to do things/what makes what do what. PvP is a nightmare in all games like this because whoever has the most time to dump into it, wins. Same with Rust, except you can't see inside people's bases in Rust. In this, you can see where everything is and plan your raid accordingly. You can also see the player inside their base and whether or not they're online. I think this is a serious mistake.\n\nThe items you unlock are cool, and it's a rewarding tiered system for adding new technologies, but as I said at the beginning, be prepared to grind like crazy, even in PvE servers. A radiation suit will literally take you 15+ hours to make, AT LEAST, and that's only if you don't have people shooting you and taking your loot (PvP).\n\nI wish there was a \"sort-of recommend\" button, but there isn't, and it's clear the devs have put some serious time and effort into this, so I can't be too negative. If you have a lot of time and patience on your hands, and enjoy survival and crafting games, give this one a go. If you get frustrated easily, don't.", "timestamp_created": 1613072865, "timestamp_updated": 1631055499, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.653180420398712158", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "137276984": {"recommendationid": "137276984", "author": {"steamid": "76561198045557008", "num_games_owned": 521, "num_reviews": 38, "playtime_forever": 4054, "playtime_last_two_weeks": 0, "playtime_at_review": 1385, "last_played": 1690202414}, "language": "english", "review": "This is like 7 days to die but topdown, without zombie humans but aliens. Also graphics are made for mobile phone so no one should have a problem running this. I love the grind, skill system and progression. There are bosses that spawn randomly as a ''world event''. You can play this as single player or with friends, or you could join a public server. These public servers wipe regularly, some people might find this kind of stuff repetitive but if you leveled 50 characters in WoW or Path of Exile, you should not have a problem with this.\n\nI am looking forward to dumping at least 300 hours into this, bought it for 5EUR, money well spent!", "timestamp_created": 1682432317, "timestamp_updated": 1682432317, "voted_up": true, "votes_up": 15, "votes_funny": 1, "weighted_vote_score": "0.652069211006164551", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "59535928": {"recommendationid": "59535928", "author": {"steamid": "76561198032905414", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 1219, "playtime_last_two_weeks": 0, "playtime_at_review": 446, "last_played": 1698198608}, "language": "english", "review": "If you like Rust and you like Rimworld you will like Cryofall. It's a fun survival/base builder game. It has a bit of an RPG feel as well due to the fact you gain skills as you go along. I'd recommend playing with friends if you decide to play on a PVP server because strength in numbers is key. If you decide to go solo then you can play PVE and just get a feel for the game.", "timestamp_created": 1575860346, "timestamp_updated": 1575860346, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.651027977466583252", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "94426283": {"recommendationid": "94426283", "author": {"steamid": "76561198065153092", "num_games_owned": 0, "num_reviews": 30, "playtime_forever": 18140, "playtime_last_two_weeks": 0, "playtime_at_review": 8739, "last_played": 1628402550}, "language": "english", "review": "No, absolutely NOT!!!! Not unless you like the grind to be so bad that your food and fishing bait spoils over night while it's sitting in the freezer of all things! I just can't get ahead... no matter what. This is BS!!!! It's already bad enough that I can't solo any of the bosses to get any of their resources that I need to advance any further. So then, once you've built everything up to a certain point you won't be able to advance any further. You need tons of Pragmium to build the things to get more. The only way to get it is by fishing at the special world fishing events! It takes tons of bait and that bait will spoil in the Fridge/freezer over night IRL so when you log back into the game the next day all you'll have left of your food and bait is shit!!!!!\nI QUIT!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\nWell, I built 3 Solar arrays with 4 panels each for a total of 12 Solar Panels... It's says they're expensive to make but they last \" a long time\"... Well, in Real life you don't have to keep making them and replacing every couple of days! I even tried the repair recipe!! What a joke! I wanted to repair 4 panels and it cost me 3 of the four just to repair one! It's NOT worth it!!!!!\nI spent all day replacing those damned panels and it wiped out all my resources! I don't want to play a game that feels more like work than work itself is.", "timestamp_created": 1624725415, "timestamp_updated": 1624853341, "voted_up": false, "votes_up": 15, "votes_funny": 4, "weighted_vote_score": "0.650057673454284668", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "139884889": {"recommendationid": "139884889", "author": {"steamid": "76561198158101326", "num_games_owned": 1470, "num_reviews": 20, "playtime_forever": 1164, "playtime_last_two_weeks": 0, "playtime_at_review": 461, "last_played": 1686896169}, "language": "english", "review": "Let's cut to the chase~\n\nThis game offers a nice immersive gameplay with friends, or enemies (If you play PVP).\nIt presents a well-crafted survival concept where you're stranded on a Planet with harsh environment full of hostile creatures.\nThe base building is nice, although I still have trouble understanding why I [b]can't rotate stuff[/b], but that's okay since it doesn't really affect gameplay.\nThe weapon/armor crafting is interesting, combat is alright... BUT... the durability of armor depletes superfast when you die. Now I know that it would make sense that if some creature attacked you, it would probably tear the armor and it would stay damaged as a result of the fight.\nBut it is still [u]frustrating[/u] so since this is a review.. you (the reader) will be aware of it.\nOh yeah, I almost forgot... Get ready for mining/farming my friend, there is a lot of resource farming here ~hehe~.\n\nAll in all, the exploration is fun, building is good, crafting is good, combat is ok (if you don't die) - Everything doubled if you play it with friends.\n\n[h1]Final Verdict: 6.5/10 rating - Buy it on sale[/h1]", "timestamp_created": 1686481914, "timestamp_updated": 1686481968, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.648045361042022705", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "129945110": {"recommendationid": "129945110", "author": {"steamid": "76561198041445825", "num_games_owned": 0, "num_reviews": 52, "playtime_forever": 10175, "playtime_last_two_weeks": 0, "playtime_at_review": 2443, "last_played": 1707586626}, "language": "english", "review": "I bought this game during the -75% off sale I tryed it in a public pve server with a friend but the next couple days they wiped it, so then i tryed single player and still playing it on a single player.\nThis game super fun i mean for $4.99 im shocked how much fun this game is and addicting there AAA titles not so fun that cost way more.\n\nSo for the price of $4.99 this game is defintly worth it you can't find a game with content and fun for the price this game is for $4.99 during time of this review.\n\nEven when it goes back to $19.99 i still think it mite be worth it but that will depend on you $4.99 is defintly tho why i bought it to try it and was not expecting to like it so much. =P", "timestamp_created": 1672670178, "timestamp_updated": 1672771984, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.646214127540588379", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "62189900": {"recommendationid": "62189900", "author": {"steamid": "76561198105670610", "num_games_owned": 268, "num_reviews": 64, "playtime_forever": 1911, "playtime_last_two_weeks": 0, "playtime_at_review": 1616, "last_played": 1612387031}, "language": "english", "review": "I do like this game, but my biggest frustration is the super short decay time for the land claim.  If life gets in the way, as it sometimes does...you lose EVERYTHING and have to start over if you land claim disappears.  \n\nEdit:  Sadly, this has happened to me about 5 times already.  I have to see if a community run server has longer decay times (as the Dev suggested)  and if I can redo all my hard work in building up a base again.", "timestamp_created": 1579626051, "timestamp_updated": 1581365770, "voted_up": true, "votes_up": 11, "votes_funny": 2, "weighted_vote_score": "0.645432353019714355", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1581146685, "developer_response": "Base decay depends on the land claim tier and when you upgrade it a few times it is more than two weeks. Also, to reset the decay you simply need to login to your base for a second.\n\nI wish we can remove that mechanic... but then the entire map would be quickly cluttered with abandoned bases, so we have to find a reasonable compromise.\n\nThere are also several community servers with significantly extended decay timer, which might be a good option too. And you can always host your own private server where you completely disable the decay.\n\nI hope the above explanation is helpful :)\n\nIf you have any ideas on how we can improve it - please join our discord server and let's discuss it!"}, "83848235": {"recommendationid": "83848235", "author": {"steamid": "76561198122061225", "num_games_owned": 660, "num_reviews": 43, "playtime_forever": 732, "playtime_last_two_weeks": 0, "playtime_at_review": 732, "last_played": 1577223403}, "language": "english", "review": "Doesn't respect the players time, highly recommend if your unemployed and have 3 months to blow to accomplish simple tasks that you could do faster in real life.", "timestamp_created": 1609621906, "timestamp_updated": 1609621906, "voted_up": false, "votes_up": 38, "votes_funny": 13, "weighted_vote_score": "0.644187092781066895", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "96168249": {"recommendationid": "96168249", "author": {"steamid": "76561197972980374", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 9093, "playtime_last_two_weeks": 0, "playtime_at_review": 5884, "last_played": 1638818226}, "language": "english", "review": "Good Mechanics, great gameplay, good designs.\nLacking Player Options Depth and Activity Immersion = goes stale fast.\n\nDevs Listen here:\n\n1. Add Naval Ports, Airports ( The Port would be overun by Zombies or NPC Hostile Faction to liberate. Inside place a Trader with Additional Quests, The Airport would have Advanced Loot with Advanced Enemies)\n2. Add Traveling Caravans ( Aka Trader on Camels ) on the roads from One Port to the other.\n3. Add Hostile NPC Faction a. Bandits- Roaming Streets,  b. Poachers - Roaming Forests c. Raiders - Advanced Bandits. d.  Bounty Hunters (paid attacks against Faction)\n4. Add Vehicles a. Motorcycle b. Tri Wheeled Motorcycle c. Dune Buggy d. 4x4 \n5. Add Animals: a. Crocodiles Near Lakes and Rhino in Swamp, Lion in Deserts, Comodo Dragons in Swamp, Foxes and Wolverines in Grasslands\n6. Add Snow Biome ( Polar bear, Fox, Grey Wolf, Penguins and Seals\n7.  Expand the Map Double the Size.\n8. Remove Money printing and replace with Permanent Traders at Ports\n9. Add Diamonds Harvesting for advanced weapons\n10. Add Gas Harvesting ( Helium, Argon, etc) to make advanced weapons\n11. Add Gas/ Volcanic Biome\n12. Nerf the Space Debris and Spawn Raiders, Looters and have them drop items instead ( its too easy now)\n13. Finally add more Islands with Advanced Enemies and Factions who spawn there to cut back the mundane.\n14. Progression is too fast ( slow it down by Bulking up Tech Tree and slow down LP gain)\n\n\n", "timestamp_created": 1626928654, "timestamp_updated": 1626929076, "voted_up": true, "votes_up": 21, "votes_funny": 3, "weighted_vote_score": "0.642447352409362793", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "92276458": {"recommendationid": "92276458", "author": {"steamid": "76561198007637556", "num_games_owned": 746, "num_reviews": 79, "playtime_forever": 6747, "playtime_last_two_weeks": 0, "playtime_at_review": 6746, "last_played": 1621747386}, "language": "english", "review": "Great game that just needs a healthy playerbase. \n\nThis game's success and growth is entirely dependent on its community servers (CryoFive, CryoSmall), but the server admins are out of touch and don't understand this concept - waiting 3+ weeks to wipe a server (not even adhering to their own set wipe schedules), splitting the server populations by introducing new servers frequently, and hand-picking community suggestions that they like, while leaving the other suggestions out to dry. \n\nI wish this game's future well, but these server admins are in direct control of its success and they have a lot to learn.\n\nEdit: I just wanted to update this with an \"I told you so\".\n\nWhen I wrote this review, Cryofall was at its peak of 3681 players. Prior to that, it still had a consistent couple-hundred players every month. Right now as I type this, during peak hours, and immediately after a fresh wipe, there are 151 players online. \n\nThe devs could have built off of this success and kept the game's population steady if they took actual charge of the game instead of giving unofficial server owners all the control. I hope you guys enjoyed your 15 minutes in the spotlight. Dead game.", "timestamp_created": 1621459793, "timestamp_updated": 1630172868, "voted_up": true, "votes_up": 14, "votes_funny": 2, "weighted_vote_score": "0.641163766384124756", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "76703608": {"recommendationid": "76703608", "author": {"steamid": "76561197992618444", "num_games_owned": 0, "num_reviews": 17, "playtime_forever": 9730, "playtime_last_two_weeks": 0, "playtime_at_review": 223, "last_played": 1648750635}, "language": "english", "review": "All my time played is on the demo which I upgraded to full version, so all my hours played are not recorded until I reinstalled the game but I got about 60 or so hours in.\n\nI download demo and spawn in to the South east jungle. I figured that being on the edge of the map would be a safe place to learn the game. The first 3-4 people I met were friendly and informed me about hostile bases in the area. I found a nice spot and within 4 hours I had the perfect base, a bunch of weapons and headed to my first event thinking I was ready for anything. I ran into a 4 man squad, turned out 1 of them was in the base south of me. The next 4 hours was me taking shots at my southern neighbor who began killing me on sight, but remember the 3-4 friendlies I met while setting up my base. I started a collation to help me destroy these belligerents. I tried negotiating to no avail. The main guy I teamed up with ended up being one of the biggest bandits in the area, we raided every base in the south east with anything worth taking.\n\nI had made a deal with the devil. Five days had gone by, and we finally had a big enough war chest to destroy my original enemy to the south. We were hard face raiders by this point, my mother would be ashamed, I didnt kill any bambies though, just geared people. We destroyed and raided the enemy castle. I achieved my goal, got my hover board and we began spreading to the dessert. We ended up clashing with the biggest raider gang on the sever, we were not ready but we will be ready next server wipe. This is the most fun I have had in a video game in years. Most people are friendly, wiling to trade or offer advice. Cryofive server is the best. Be ready for pvp during events, try to make friends to explore with, there is safety in number, but I'm more of a loner. Only grouping for raids or to protect my neighborhood from those mech boys in the center. I offer hand me down gear to new people who will value it. We will be top clan next wipe or get wiped out trying, I know a perfect spot for a base.", "timestamp_created": 1601287385, "timestamp_updated": 1601287614, "voted_up": true, "votes_up": 11, "votes_funny": 2, "weighted_vote_score": "0.64079052209854126", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "107221339": {"recommendationid": "107221339", "author": {"steamid": "76561198364026999", "num_games_owned": 289, "num_reviews": 34, "playtime_forever": 4422, "playtime_last_two_weeks": 0, "playtime_at_review": 3156, "last_played": 1642400106}, "language": "english", "review": "Game is overrun by sweaty Chinese players that are online 24/7 and make massive 10 man factions. Leaves practically no chance for other people. Sorry devs, I actually have a life.", "timestamp_created": 1641216900, "timestamp_updated": 1641216900, "voted_up": false, "votes_up": 19, "votes_funny": 2, "weighted_vote_score": "0.640156865119934082", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "155370348": {"recommendationid": "155370348", "author": {"steamid": "76561198088393996", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 17, "playtime_last_two_weeks": 0, "playtime_at_review": 17, "last_played": 1704526324}, "language": "english", "review": "NO STEAM CO-OP \n\nThe game does not support an easy Co-Op experience. to play privately with your friends you MUST either rent a server, run a dedicated server in your computer, or \"use Hamachi\" (yes the devs said this unironically like its 2012).\n\nOnce I am able to create a local game my friends on steam can join in, I'll be happy to review the game again\n\nIf you are a normal human being living in 2024 or later and do not want to install Hamachi or some other BS, you can try setting up your own dedicated server with Port Forwarding so your friends can connect, but I dont wanna deal with all that (and likely some people don't even know how) so I'm surprised we even have this approach at all.", "timestamp_created": 1704526536, "timestamp_updated": 1704528041, "voted_up": false, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.639826834201812744", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "124996182": {"recommendationid": "124996182", "author": {"steamid": "76561198042821598", "num_games_owned": 0, "num_reviews": 44, "playtime_forever": 1682, "playtime_last_two_weeks": 0, "playtime_at_review": 1682, "last_played": 1667664583}, "language": "english", "review": "It comes across as a fairly interesting top down survival game. Seems to advance quickly enough, till you hit lithium. I was playing single player and was, encouraged to read a declaration that the experience would be balanced for playing alone. It is not. All the same I was going to give it a positive review if only because it's honestly not that bad. So why a thumbs down?\nPragmium spires explode. I hope you had a giggle when you designed that. If you demonstrate it to anyone who taught you game design and tell them you sincerely thought it was a good idea, you might even be able to get a refund. Personally I was intrigued when I found one. Got geared up, poured all my resources into the best equipment I could build, the culmination of days of grinding (you know where I'm going with this) Well, one flash of intentional game design and it was all gone. The reward? Nothing, absolutely nothing. The opportunity to rebuild my new armour and power cells from scratch. Losing gear because of a mistake, that's one thing, worn down from good use, that's fine too. Trolled into oblivion? Congratulations, you earnt I think, only my fourth negative review.", "timestamp_created": 1667666189, "timestamp_updated": 1668207018, "voted_up": false, "votes_up": 16, "votes_funny": 4, "weighted_vote_score": "0.638979494571685791", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "150497360": {"recommendationid": "150497360", "author": {"steamid": "76561198035178398", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 340, "playtime_last_two_weeks": 0, "playtime_at_review": 340, "last_played": 1700495896}, "language": "english", "review": "Online is dead", "timestamp_created": 1700495946, "timestamp_updated": 1700495946, "voted_up": false, "votes_up": 14, "votes_funny": 1, "weighted_vote_score": "0.638868093490600586", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "121745936": {"recommendationid": "121745936", "author": {"steamid": "76561198042890515", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 5469, "playtime_last_two_weeks": 0, "playtime_at_review": 3149, "last_played": 1665360639}, "language": "english", "review": "This game is like a sci-fi, crafting-heavy Stardew Valley. I'm finding single player very addictive. Very \"just one more thing.\" I'm almost at the Escape tier, but why would I want to do that when I'm living a dream retirement oscillating between urban exploration treasure hunting and running a baller ass liquor farm?\n\nI admit, I haven't checked out multiplayer yet, so I can't review that aspect. Multi anything is usually too toxic for my delicate sensibilities. Hopefully this is different? idk. Maybe I'll peek at it from the safety of Twitch.\n\nAnyway, 4/5 stars. I'll be playing this off and on for years.", "timestamp_created": 1662312773, "timestamp_updated": 1662312773, "voted_up": true, "votes_up": 9, "votes_funny": 3, "weighted_vote_score": "0.637234508991241455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "91922133": {"recommendationid": "91922133", "author": {"steamid": "76561198071403818", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 4255, "playtime_last_two_weeks": 0, "playtime_at_review": 3928, "last_played": 1622121597}, "language": "english", "review": "In PvP you will get destroyed by hoards of Russian and Chinese players.\nThat it...", "timestamp_created": 1620905195, "timestamp_updated": 1620905195, "voted_up": false, "votes_up": 13, "votes_funny": 1, "weighted_vote_score": "0.63653188943862915", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "50406328": {"recommendationid": "50406328", "author": {"steamid": "76561198053486643", "num_games_owned": 0, "num_reviews": 99, "playtime_forever": 23862, "playtime_last_two_weeks": 0, "playtime_at_review": 14149, "last_played": 1597160388}, "language": "english", "review": "This game can be challenging especially depending on who you have for neighbours. If you join in brand new, start insulting everyone, talk a lot of big talk, and try to KOS everyone you see, then the server will turn against you and you will die repeatedly. \n\nIn short, don't be an asshat. Say 'hi' to your neighbours when you get a chance and if they're asshats then move before you get too established. The map is big (took about four hours for me to walk around the outline of the pangaea though I was collecting stuff and crafting along the way, so not rushing).\n\nTwo weeks playing and I've only died twice (within the same hour by two idiot friends who both pretended to be friendly to shoot me in the back), while playing solo.\n\nThe developers are very active both in Discord and in-game, and working diligently to fix issues, get the optimum servers for their players, and listen to input from players about suggestions for the future of the game. \n\nIt isn't too deep right now for it's content in regards to crafting. But even grinding full time you'll be looking at roughly 3 weeks to complete all tech trees.\n\nCurrently (April 30/19), the bombs are nerfed, so now is the best time to build a bit of a base and try out some things without having to worry too much about getting destroyed (once you have stone + iron doors at least). If you leave for longer than your land claim, don't log back in expecting your base to still be standing. It only takes a second to log in and have your base timer reset, no different than any of these games. If you no-show for days, then someone is going to take your stuff.\n\nI really enjoy having the developer actually come into the game, so you have the ability to mention things that are off currently about balancing, or to suggest things that could help in the future, and get their feedback while you play. Nice to see their commitment to the game, and involvement with the community.\n\nPVE is available on Community servers, it will be brought in on official servers in Mid-May.\n\nSome players complain a bunch about dying repeatedly but they're usually is a good cause for their dying (kosing others, or trying to, staying around highly contested resource areas where they're guaranteed to run into pkers looking for an easy score, or being insulting in chat and so getting what they deserve). The map is big, if you have issue with certain players move somewhere else away from them. Most idiots aren't going to walk an hour just to harass you unless you earned it.\n\nAnd most of all Have Fun!", "timestamp_created": 1556645366, "timestamp_updated": 1556645481, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.635363519191741943", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "112216992": {"recommendationid": "112216992", "author": {"steamid": "76561198007328926", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 55045, "playtime_last_two_weeks": 0, "playtime_at_review": 3994, "last_played": 1695026273}, "language": "english", "review": "There was a very good review by someone who wrote about what this game is and is not. So, I am not repeating what the guy has already said. \n\nI have read that this game was originally designed as a pvp game. I would say that is a very ambitious attempt, actually too ambitious. As a pve game, however, it does have some values. There are a lot of interesting things, say animals, alien species, plants, ... to be explored on the map. The map is fixed for every game (I suppose it is because the game was originally designed fro pvp) which limits its replayability as a pve game. The basic setting of this game is good. So, you just happen to be a survivor on a big island/planet where there are different regions, each with different fauna and flora, some tame and edible, some hostile and poisonous. You know nothing about anything, not even the map of the island. So, you basically start as a hunter-gatherer. As a pve exploration and survival game, it is undoubted interesting. \n\nSome people say it is a farming game. Yes, but you farm for some specific purposes. This game is quest based. Finishing a quest allows you to gain learning points to learn survival and other technologies to finish some new quests. Say, a region have high radio activities, so you need to learn the technology to get there in order to fulfill some quests that may require you to kill some mutated animals in that region. But eventually, you goal is to leave the planet.\n\nI played like 20 hours without finishing the game as a single player, then joined one of the public pvp servers. It was brutal cause the setting was such that you already have some resources and knowledge (up to level 4 knowledge) to begin with and each farming action will give you like 10x (I actually don't know exactly) the amount at the normal setting. The worst part for an inexperienced player is that many of the pvp players are seriously experienced. Given all the pre-loaded resources, they crafted everything, especially weapons and armors, overnight. So, even though you joined a server 1 or 2 days late, you will be doomed cause there is no more farming. You basically just build your base asap and start fighting, killing, and looting. \n\nThe pve game, however, is a lot more fun for inexperienced or less experienced players, cause you can really enjoy planning, designing, exploring, ... while learning how to play this game at your own pace. This makes me wonder why the developer wanted this game to be an online pvp game. All the commerce, decoration, ..., knowledge in the game become totally useless. Who will even attempt to farm outside your own base when you will be killed and looted right after you have finished farming? So, my guess is, you just form the largest clan and you will absolutely dominate this game. \n\nI have played expensive online war games before. Games like Vikings War of Clan do have wars between clans. But eventually most clans in a kingdom must cooperate because they have kvk (kingdom vs kingdom events). The pvp version of this game is just getting your clan done and building your base asap (which skipped more than 10 to 20 days of a normal pve game) and getting ready to kick other people out of this game. Kill-loot is what the pvp game is all about. \n\nSo, my bottom line is if you play this game as a single player, buy it when it is on sale. If you like killing-looting pvp games, it is ok, but not great. There are better games out there.", "timestamp_created": 1647313795, "timestamp_updated": 1647313795, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.633428096771240234", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "64213194": {"recommendationid": "64213194", "author": {"steamid": "76561197961221174", "num_games_owned": 2279, "num_reviews": 161, "playtime_forever": 722, "playtime_last_two_weeks": 0, "playtime_at_review": 722, "last_played": 1582840363}, "language": "english", "review": "As a survival game, Cryofall has a much friendlier learnign curve and interface than most games of the genre. Enemies are not too difficult to kill, resources are generally abundant, and crafting is very easy.  It doesn't take too long to get into the meat of the game. However, once you do, it becomes clear that the entirety of the rest of the time you spend in this game - after the first hour or so - will be tedious grinding to learn enough LP (learning points) to progress in the tech tree, so that you can make anything cool and enjoy the game. \n\nThere are also some asinine design decisions that block having much fun with this game. Once you create a land claim (an expandable space for your base), if  you log out anywhere except that land claim for too long, both your character and all of your items and your entire base get deleted. Ostensibly to \"save space.\" On servers that only support about 200 people. Where there's more than enough room on the map for all of them. On top of that, the game will not stop you from making a second land claim and even makes it appear like you can have more than one active at a time. You can't. \n\nAll advanced tech in the game - anything more than a 1940s level - takes countless hours of grinding for uncommon materials and learning points, too. You're encouraged to explore \"Ruins\" to find it, but actually don't do so until you are many many hours in to the game so that you can build hazmat suits. \n\nPass.", "timestamp_created": 1582840758, "timestamp_updated": 1582840758, "voted_up": false, "votes_up": 19, "votes_funny": 1, "weighted_vote_score": "0.632400691509246826", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "82251065": {"recommendationid": "82251065", "author": {"steamid": "76561197976297095", "num_games_owned": 0, "num_reviews": 28, "playtime_forever": 2980, "playtime_last_two_weeks": 0, "playtime_at_review": 2039, "last_played": 1610261909}, "language": "english", "review": "Can be played solo, however best played co-op with friends.", "timestamp_created": 1607848855, "timestamp_updated": 1607848855, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.631244421005249023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "73022320": {"recommendationid": "73022320", "author": {"steamid": "76561198042110163", "num_games_owned": 978, "num_reviews": 10, "playtime_forever": 4396, "playtime_last_two_weeks": 0, "playtime_at_review": 3562, "last_played": 1675328068}, "language": "english", "review": "The lack of a simple single player really ruins this for me. I have no interest to play this on a PvE server because A) they are super crowded, especially after new content resets B) I don't always have the time to play often enough to refresh my decay timers, I can go weeks without even turning my computer on.\nSearching though the forums, the Devs don't really seem to give a shit about giving us a simple SP option either, they say \"there is too much over-saturation in SP games of this style\" and \"we expect SP mods to come up\" and they have been saying both of these things for 2 years now. I have looked and I cannot find a mod for SP, there are only 3 mods even on Nexus, and no workshop option on steam either.\nIt's a cool game, I assume, I enjoyed the small bit I have got to play, but I cant get much further than that because I don't have enough time to spend at once for the Devs to care what I think.", "timestamp_created": 1595284052, "timestamp_updated": 1595284052, "voted_up": false, "votes_up": 20, "votes_funny": 1, "weighted_vote_score": "0.630933165550231934", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1595398400, "developer_response": "I hope you can understand that CryoFall is a multiplayer game. I'm sorry but demanding singleplayer in a game designed from the ground up as multiplayer experience is not the right approach. It's the same as demanding singleplayer in World of Warcraft.\n\nBut yes, we certainly understand that there are still people who would like to ignore the multiplayer and social aspect of the game and play solo, even if it means missing on a big part of the game mechanics and features. That's perfectly understandable. And for that specific case we offer server executables allowing players to host their own private servers. But it is never intended to be the normal way to play the game, hence why we are not implementing the \"easy way\" to start a private server directly into the game, because that's NOT how the game is meant to be played.\n\nThen you assert that \"the developers have been saying both of these things for 2 years now\", but the game only came out a year ago, way to exaggerate :) But oh, well.\n\nNext about mods, there are actually several dozens of good mods on official forums which is currently the primary way to share mods. You can choose quite a few good client side mods which can be used even on official servers. You should definitely consider using CNEI (basically in-game wiki) as it provides a lot of useful information to new players.\n\nI hope you can still enjoy CryoFall with all of the features it has to offer! And even if you can't play often - there are community servers dedicated to longplay with significantly boosted decay timers (as much as several months) and other servers with different settings. I'm sure you can find something that suits your preferences."}, "78314120": {"recommendationid": "78314120", "author": {"steamid": "76561197970483094", "num_games_owned": 195, "num_reviews": 62, "playtime_forever": 2745, "playtime_last_two_weeks": 0, "playtime_at_review": 355, "last_played": 1605299665}, "language": "english", "review": "Like 7 Days to Die, but get too scared or can't run it on your potato computer?\n\nLike Don't Starve, but don't like having to restart every 15 minutes because the game hates you?\n\nBurned by early access games that promise but don't deliver?\n\nThen this game is for you!  It's cute, it's deep, it's got base building, the choice to PvP, and there's more features still to add.  Really really solid at any price, but especially if you can get it on sale.", "timestamp_created": 1603930196, "timestamp_updated": 1603930196, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.629755079746246338", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}, "63254753": {"recommendationid": "63254753", "author": {"steamid": "76561197990590219", "num_games_owned": 0, "num_reviews": 108, "playtime_forever": 1633, "playtime_last_two_weeks": 0, "playtime_at_review": 633, "last_played": 1669175255}, "language": "english", "review": "I recommend if you are social and cool with people getting way up yer butt, even on a PvE server, i lived FAR up in the north corner and found myself slammed with neighbors, they didn't even try to pick a plot further away, they plopped down a claim block and ruined a bunch of very nice meadows areas in a heartbeat.  The peaceful space was no more, progress halted due to competition for resources, it just isn't worth playing that character anymore.\n\nLUCKILY you can make your own servers here, I was seriously enjoying the game chat and finally being sorta social, but I cannot handle people like this, I just don't have the patience.", "timestamp_created": 1581307912, "timestamp_updated": 1581307997, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.628342688083648682", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": "", "timestamp_dev_responded": 1581329295, "developer_response": "Currently there are just too many new players joining from the humble monthly so there are a lot of people playing. Normally PvE servers have much more relaxed atmosphere :)\n\nPlease give it some time and it should go back to normal. PvE is designed to give you relaxed experience. Advance your character, research new technologies, explore the world and points of interest, build, farm, trade, etc.\n\nAnd if you want brutal competition - PvP is always there :)\n\nAlso, if you have any suggestions or ideas how to improve things - please post them on the forums - we are always listening and are happy to talk about any changes and improvements :)"}, "101026771": {"recommendationid": "101026771", "author": {"steamid": "76561198103503782", "num_games_owned": 0, "num_reviews": 30, "playtime_forever": 8409, "playtime_last_two_weeks": 0, "playtime_at_review": 8409, "last_played": 1634179256}, "language": "english", "review": "I have put in 140 hours with CryoFall, most of which was in Early Access. In Early Access the game was very playable and enjoyable. Once I had reached the top of the tech, I put the game aside to await the release. I recently started playing again to see how the released version compared, and although I did not see any noticeable differences (except the single player mode option), I was also pleased to see it was still very playable and enjoyable. \n\nThe basics first – in the game you can forage, farm, craft, build, research, and fight. Not really revolutionary or original concepts. But I love these kind of games, and am always interested to see how a game can stand out with new innovations to these old concepts. \n\nThe user interface is very easy to pick up – barely any learning curve to the game at all. Yet the game still contains enough depth to keep experienced gamers interested. The only real issue in usability that I hit was when I needed to figure out how to destroy a land claim I no longer wanted – quick search on google and the solution? Craft and use a crowbar. \n\nThere is a fair bit of grinding in the game, but as you research newer technologies, the grinding becomes more automated or easier to accomplish. Almost every technology in the game is to “make life simpler” for the player in one way or another. I found the grinding was sufficient that researching new technologies felt gratifying and rewarding, yet not enough that it felt tedious – a very nice balance many similar games have not achieved. \n\nI found the tech in the research to be innovative and unique to this game, yet intuitive and easy to figure out and enjoy. \n\nOriginally CryoFall was only online which made me cautious to try it. I have disliked many MMOs due to overcrowding, the simple inability to join certain tasks/quests due to a lack of level or experience in the game, or how the skills in many MMOs are gained on a timer instead of any meaningful reason.\n\nAs such I was originally reluctant to try CryoFall. But I was pleasantly surprised. Unlike those MMOs, Cryofall allows you to be a part of the entire game from the moment you start. You may want to get better gear before taking on some tasks, but you are not prevented from trying. In fact, I found the lack of restraints provides a natural mechanism for the forming of comradeship in the game, joining with other players to explore and take on harder tasks. In some ways it reminded me of the natural mechanism of comradeship that the old Ultima Online used (for those as old as me and remember UO).\n\n\nLike any game, there are things that you may want to consider before buying:\n\nThis game is about grinding. If you don’t like grinding games, this game is not for you.\n\nAlthough the research is well balanced, I found that it could have been more extensive. Once you hit the top of the research, there are some bosses to go beat which will entertain you for another hour or two, but really there isn’t much more to do in the game.\n\nThere is no filter on the chat. I was a bit surprised as it’s been ages since I’ve seen a chat in an MMO that didn’t have some kind of filtering mechanism. There is an option to not use the chat, but a great deal of the game is lost without the ability to communicate with the other players. The foul language that popped up on occasion didn’t bother me, but if foul language really annoys you, this isn’t the game for you. \n\nThe servers are reset when a new major update is released. Everything in the world, including your character, will disappear and you’ll have to start again from scratch. The servers are not reset often, but just be aware that it does happen and you’ll lose all your progress.\n\nTo help with overcrowding the world, your bases will start to degrade after a certain period of time. Although I understand the reason behind it, it does make it tough to go on a holiday for month, or to take a break from the game without losing all of your progress.\n\nThere was a recent update which added the ability to play the game in single player mode. I have not tried it, but I think a lot of the fun in the game would be lost without the multiplayer aspect.\n\nOverall, I found CryoFall very enjoyable and playable, and would recommend it as long as you’re ok with the above “issues”.\n", "timestamp_created": 1634193810, "timestamp_updated": 1634193810, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.627947151660919189", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": false, "steam_china_location": ""}, "130378261": {"recommendationid": "130378261", "author": {"steamid": "76561198050656495", "num_games_owned": 862, "num_reviews": 1, "playtime_forever": 4959, "playtime_last_two_weeks": 0, "playtime_at_review": 4959, "last_played": 1672697480}, "language": "english", "review": "77.7 hours of grind, 5 hours of content", "timestamp_created": 1673124192, "timestamp_updated": 1673124192, "voted_up": false, "votes_up": 30, "votes_funny": 3, "weighted_vote_score": "0.627248585224151611", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "hidden_in_steam_china": true, "steam_china_location": ""}, "84836222": {"recommendationid": "84836222", "author": {"steamid": "76561197977790310", "num_games_owned": 1050, "num_reviews": 134, "playtime_forever": 726, "playtime_last_two_weeks": 0, "playtime_at_review": 268, "last_played": 1633765873}, "language": "english", "review": "So since the developers implemented a way to play in Singleplayer with your own rates and no base decay, suddenly the game is fun again. Can't wait till they implement it properly into the ingame menu.\n\nIt's a nice and fun game I can now come back to every now and then without the worry if the base still exists or not. Give it a try!", "timestamp_created": 1610868623, "timestamp_updated": 1620184966, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.625521242618560791", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "hidden_in_steam_china": false, "steam_china_location": ""}}, "query_summary": {"num_reviews": 10, "review_score": 6, "review_score_desc": "Mostly Positive", "total_positive": 1496, "total_negative": 526, "total_reviews": 2022}, "cursors": {"AoIIPwDw6XPWyN4E": "Mon Apr 22 23:48:19 2024"}}
